[{"review_id": "EdP6-YbzKahOhDnExbHW5A", "user_id": "W93Xpp1j2nWHC-adopGeUA", "user_name": "Jessamine A.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "12.29.2018Came here to meet up with family.  A great and fun place for our kids. An hour of climbing and bouldering was perfect to build up an appetite.", "date": "1/22/2019"}, {"review_id": "Kg5MAEJxSsw8ukGgyGpoTQ", "user_id": "EVh1qrmcqaBM0Gb8_qb2HQ", "user_name": "Sylvia S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "If I wrote this review yesterday, I would have given Boulderdash 5 stars. Unfortunately, sometimes it takes a negative experience to make someone actually come on Yelp and write a review. My daughter first climbed at Boulderdash in Westlake when she was in first grade, which was six years ago. She took a class through park and rec and loved it. Her instructors were great; it was a positive experience. Six months ago, my daughter started climbing again, after six years off. She started with a couple classes a week. Three months ago, she became a member. With her membership, she gets unlimited access to the gym and yoga classes. There was an initiation fee, but it felt reasonable to me. The terms of the membership were explained to me well. Her membership included a belay class, which they allowed me to take since she was not quite old enough to belay. Alex, the instructor of the classes she was taking told me about a teen climbing group and invited my daughter to join. She began going to teen climbing a few days a week. She has loved it. She could climb/belay (she took the class after her birthday so she could join the group) for two hours any week day. Alex is so great and really helped my daughter learn her new sport. Sometimes she was the only one to attend and sometimes there were several other kids. Regardless, he spent the time with her, guiding her in the sport. Suddenly today, Alex alerted us that the teen climbing group has been discontinued AND that he is no longer going to be at the gym. I believe canceling the class is a big mistake for the Boulderdash management. This class was a wonderful outlet for my daughter and several other young people. I am so disappointed and so is my daughter. I have not decided exactly what to do yet, but unfortunately, there isn't much option to go anywhere else. There's nothing else in town. I sincerely hope this is not a permanent change. These young climbers and their friends are Boulderdash's potential long-term clientele.", "date": "6/26/2018"}, {"review_id": "rJ0y0NHo74iTXJKad6Ov1Q", "user_id": "3SgArp6Mqu4DGwvxGCdSog", "user_name": "Susan C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The only bouldering/climbing place in Ventura county so you're stuck with this place no matter what. The Westlake gym is small and the bouldering walls are shorter than every other single place I've been to but I don't think there's much they can do given the size of the place and the top rope section. The bouldering section has pads you can drag around for extra fall protection but the ground is semi-squishy and the walls aren't tall enough to do any major damage. The owner (?) with the long hair is sometimes very blunt and can come off as rude but it's nothing too bad. During the weekend afternoons and weekday evenings it is super crowded which is only made worse with the lack of space they have. Weekends are filled with little kids running around and screaming. Also, even though it's a gym, there is no water fountain. Overall, an okay place that you just have to deal with until someone comes and opens a better climbing gym.", "date": "1/17/2019"}, {"review_id": "56Q4oWetvnYtTUW6ePcegw", "user_id": "WUge8nsIXlrxZeqKts7ZWg", "user_name": "Katie R.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The guys that work here are so so nice and always helpful. I like that it's never overcrowded and they are always changing up the grip configurations. I've taken classes here as well as climbed and they were informative and fun. They are pretty easy going here as long as you are safe and you know what you're doing. My son and I have been coming to climb since he was old enough and he now goes to the top of all of the hardest climbs. So much fun and great bonding experience!", "date": "7/21/2018"}, {"review_id": "CpUTxeVH2eJvT8uTwJehow", "user_id": "LM9h8UGeVWTzyClv9jfm6g", "user_name": "Caroline L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "Great place for rock climbing if you live in the Thousand Oaks area. However. The employee Matt (long curly grey hair, older, skinny, grumpy looking guy) has terrible attitude to customers! We were late for a few minutes for a rock climbing class where there were just me, my husband, one other guy, and the coach. As soon as we got in, we felt really bad and apologized, but he started yelling at us saying \"you guys were really late. Don't do this!\" He wasn't even looking at us when he was yelling. Later on, at the end of the class, I tried to talk to him and said I didn't really appreciate his attitude and the way he treated his customers didn't feel right. I asked him if he could please be nicer next time, especially we apologized for being late at the beginning.\" Without feeling bad at all, he still wouldn't make eye contact with us, and then started being extremely defensive. He said \"I didn't give you an attitude. Why are you asking me to be nicer? Was I not clear when I explained myself?\" I think Matt's attitude will continue to cause problems. Either they didn't train him right, or he has some problems himself. Marshall, our trainer was great, though. I highly recommend him and we enjoyed his class!", "date": "5/23/2018"}, {"review_id": "HPqn2HGz5ENcP-UP_dMOyA", "user_id": "LU1rB2POBk_qGAz8EGW5nw", "user_name": "Albert W.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "We signed up for a class and got held up in traffic. We apologized for being late but then Matt hassled us and had to keep talking about how late we were. When we asked him to be nicer in the future, he was defensive and irritable, and he had to yell and keep arguing with my wife about the time instead of just apologizing. He acted like he owned the place and he didn't care about any of the customers' feeling. 630 is not an easy time for everyone to make especially if you have kids and need to commute to work and back. Lighten up Matt! For the owners, Matt is not very good for your business If you want to bring in and keep more customers. On the plus side, though, Marshall is awesome and a great instructor. He kept it fun while still emphasizing how important it is to be safe.", "date": "5/23/2018"}, {"review_id": "ANno5CgLMfwF0eXN9PWkow", "user_id": "SfCFOVko1Cyn1S3vmj0FTA", "user_name": "Kelly F.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 6, "funny": 1, "cool": 2, "text": "This place is awesome! The staff there are friendly, helpful and lots of fun. They make sure that everyone is safe and knowledgeable when it comes to climbing.  The facility is large, clean and really a cool place for climbers of all expertise. I definitely recommend checking it out for yourself. I know i will go back for sure!", "date": "1/22/2017"}, {"review_id": "sUItsDZwaUen-NqPaU3eeg", "user_id": "jjP5h8TKDMyP5f6fDMyzQg", "user_name": "Brett V.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I love this place and need to scream it from the rooftops.Staff is very knowledgable, friendly, and as helpful as can be. As in most of life, when you treat someone with respect and offer understanding, you will generally receive the same in return. A few things to consider based on my experiences:#1, Safety is their number one concern. Lives are on the line.You will be belay tested, both for top-roping, and for sport climbing. If you mess up, you will fail the test -- there is no leniency and rightfully so. It's not a game. It's a sport. And a very dangerous sport. The good news is, the belay test is free. The other good news is that if you do it right, your climbing experience can be very safe.If you're leading, you will likely be watched like a hawk and called out for bad clipping (skipped, z) or general dangerous behavior (foot behind the rope, etc.) Lazy belaying is not allowed -- read as: sitting down, or anything other than standing and paying attention. You need to be able to tie a figure-8 knot if you're over a certain age; 13, maybe? I'm not sure what age it is. I'm significantly over that age, so I had to learn.#2, This is a business. They're here to make money.I was reading a couple of reviews down below that sparked me to post this. Someone was complaining about being late to a scheduled class and having an issue with one of the staff. Hmmm. What about the other people in the class? Are they supposed to sit around and wait for you? What about the instructor? Is he supposed to stay longer to accommodate you because you were late? Do you expect the owners to pay the staff to stay longer to accommodate you? If they let you into the class, are you going to complain that you didn't get the full class because YOU WERE LATE TO A SCHEDULED CLASS?All I can say is that in most of life, if you're going to be late, call and explain the situation; perhaps they can find another way to help. Just spitballing here, but if 6:30 was going to be so tough (and it sounds like you knew you were going to be late based on your comments,  \"630 is not an easy time for everyone to make especially if you have kids and need to commute to work and back,\") perhaps you could hire one of the employees to teach you at a time when you could be there? I don't really know, and neither do you, because you didn't call before your scheduled appointed time.Small life-based rant: I'm sorry if you don't understand that other people's time is valuable, but you probably should learn that. A tough lesson for many to realize is that the world does not stop when you mess up. Question --- If you're in the #2 lane and about to miss your freeway exit with a busy freeway around you, do you A), bully your way across the freeway so you can make the exit, or B), accept that you messed up, and get off at the next exit? I'd wager you both are A). For me, personally, Matt has gone out of his way to help with anything that has been wrong or weird pertaining to my Boulderdash experience. Of course, I always offer respect and understanding, as with all employees, and people, really, and get the same in return. #3, It's nice that they change the routes frequently. #4, EVERYONE is friendly. If you go by yourself, you can almost always find someone there who will trade belays.  #5, While they do not have showers, there is a locker room (with locking door) where you can change.#6, SO BRIGHT! They updated the overhead lights in that place and added some in the boulder area. My hats off to the entire BD team.", "date": "5/24/2018"}, {"review_id": "DNJQW0GPAUEFdvCdgbf9-w", "user_id": "4JuAiPe9FNAku_tB6-ABhw", "user_name": "Joey L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This is a great gym! They have a sister gym in Northridge. That's a great gym also. Looking for their brother gym in Ventura to open. It's going to be great too. If you like climbing, and live west of the 405, having access to these 2(soon to be 3) gyms, is a boon.", "date": "11/4/2018"}, {"review_id": "GXss2QYfngI-CRnQJBPRFw", "user_id": "xf_mgHYdeAq3JTwmR3kgjQ", "user_name": "Ali C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing here for almost 10 years and it's always been great. Extremely friendly staff and fun climbs. The routes change pretty frequently and there is a lot of variation to choose from. Kids love having birthday parties here!", "date": "6/16/2018"}, {"review_id": "_b7MUpGY42e0SteUj78kDg", "user_id": "Z4MNsudgdSZyPOKB-nWfdg", "user_name": "Justin L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Special $14 for students on Friday nights! (entry + climbing shoes) I try to come every Friday, and I absolutely love the workout. I only boulder at the gym, but I want to try top rope and lead climbing soon! They have it all. Employee or not, everyone is very friendly and willing to show you the different routes.The difficulty of the routes range from V0 - V6. See you guys there on Friday nights!", "date": "11/24/2016"}, {"review_id": "AkqDIEhikpyqCN5XgaXj2A", "user_id": "qIotNU-gI6GM6ymFlud8Kg", "user_name": "Sue H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love Boulderdash!  It's great for all ages 2 to 99+ :)  It's the best exercise not only for your body but also for you mind, as it puts you in the present moment and anything that's on your mind just melts away.I've been climbing there for 5 years now and have never run into anyone that wasn't friendly especially the staff.  They are all there to help and assist and even give beta if you want it otherwise they'll just encourage you to get that next move.Have to give a shout out to Matt.  I don't know of anyone who's so positive, helpful and ready to give a funny story to make everyone laugh.  He goes out of his way to assist, give suggestions and will make special time to help anyone that needs additional guidance.  He also sets the most awesome climbing routes when he gets the opportunity.  Well thought our routes with a key to learning a new technique or two.Currently BD has 2 gyms and will be opening a 3rd soon and your membership is good for all of their gyms!  They're constantly changing their routes and bouldering climbs so you never get bored.Thanks for providing a safe and fantastic place to get great exercise and challenge your mind!Love, light and happiness!Sue", "date": "5/24/2018"}, {"review_id": "kuDPoM2aA-CAGi70nEk66Q", "user_id": "wLh4YepDaBzQ1JMrj5fDzQ", "user_name": "Karen C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Was visiting some friends out and on a whim decided to check out Boulderdash. It's a hidden climbing gym in TO! Even with the GPS on it was fun to find, from the road we were on we only saw signage for \"Spirtual Center\" but we had our hunch from how tall the building was from the outside. Make sure you go to Suite A, at first we found Suite B. Which is okay because walking across the courtyard we got to see the huge fountain. I'm diverging a bit here but if you must check it out, it's the size of a large swimming pool with a swan in it! Not going to lie, was slightly disappointed when I first saw the bouldering area.  The bouldering area is condensed and doesn't go up very high. This is good if you're afraid of heights or falling, in a way it encourages climbers to do their top rope sections. The entire floors is spongy, but there are a couple crash pads to drag around to further cushion any falls. The routes were mixed, with many challenging routes though since all the walls have an incline to them. The way the routes are set up stresses the importance of technique and planning moves ahead of time. Since I only bouldered I can't comment on top rope routes. A kid's birthday party was having a blast on the routes though, their exuberance and natural skill really made me old. The instructors seemed really great, they had the kids stretching, doing push-ups and some core work outs before climbing.  Really nice facility over all:Locker room to store your stuff so ins't all over the placeClean restroomsSells drinks to rehydrateLarge windows to provide natural lightingFree weights and medicine ball Gymnast ringsClimbing rope They are opening up a second Boulderdash soon in Chatsworth, so next time I'm on this side of the valley hopefully I can check it out. Fun thing: Their slackline was hidden on the other side of the check-in counter... like two stories up in the air! Now that's exciting.", "date": "3/28/2015"}, {"review_id": "L6WEaCoMFHoiMnfBMHYIVA", "user_id": "DqX-fyAldpC_LyYeT-6E2Q", "user_name": "Chad D.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 8, "funny": 0, "cool": 0, "text": "I enjoyed my time at BoulderDash. The staff was friendly and courteous and the place was well-kept. However there cancellation policy is so 1980. The inability to prorate your cancellation will prevent me from returning. On top of that you can't call in and cancel your membership. It just seems silly that something as progressive as a rock climbing gym has such outdated policies.", "date": "8/31/2017"}, {"review_id": "7tsLEMV0b7dFOLfFurhcAw", "user_id": "lYwDnnnpjS_JYhY6062Lpg", "user_name": "Becky L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Excellent place for a kid's birthday!  My 8-year old twins had a blast with their friends. Reasonable price, great party room, awesome staff.  Easy booking process too. Thanks everyone!", "date": "3/13/2017"}, {"review_id": "biI7Ho9Levbo4sRjlGQEcQ", "user_id": "Z7ArdwxjubwWflxFZDXumw", "user_name": "Kate A.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love Boulderdash!! This specific gym is my first rock climbing gym since I started climbing 7 months ago and I couldn't be happier with my membership. The routes for both bouldering and top rope climbing are always exciting, changing and challenging. I was nervous and shy when I first started because it was a whole new world I wanted to be a part of and the staff and climbers have been so amazing.The staff are all extremely friendly, helpful, welcoming and all about safety. My belay class was great and helped me become confident immediately to be able to test at any gym.The climbers are also welcoming and I love how easy it is to make friends and adapt a climbing community.I go to both locations frequently and I get the same fulfilling experience, even though they are very independent in style and overall atmosphere.Matt, Marshal, Spencer, \"Dre\", Gabe and all the other staff members are knowledgeable and always put the client's safety and experience as top priority.If you're looking for something more than just a climbing gym to learn and have fun at and a community as well, you've found the right place!Added bonus is the price and yoga classes that come with membership!", "date": "5/25/2018"}, {"review_id": "adVOmdHKA0SfOc3rQXqpDQ", "user_id": "K40yQVggLiJSI3l9lMls4g", "user_name": "Mark H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to hang out.  Friendly staff and climbers. If your in need of advice check with Matt.  Super friendly and very knowledgeable.  Always willing to help everyone out.  Everyone that works at BD is super friendly.  The routes change quite often and that keeps it interesting.  Having tall and shorter walls lets you change things up.   Recommend  that you check this place out.   They also have a SFV location.  Great to have 2 gyms to go to and 3 soon.  Been going here 5+ years, 4 times a week. my second home and great friends like Matt.", "date": "5/24/2018"}, {"review_id": "AvV2dQwvPRFckx_2WmymRQ", "user_id": "ysmGZFFmavPKtQiyBKME7g", "user_name": "Youri Y.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 4, "funny": 2, "cool": 4, "text": "First time checking out rock climbing thanks to my job for compensating the intro Up Rope class and me finally giving it a try :)I enrolled in the Thursday night class and there were only 3 of us students. Marshall was an awesome rock climbing instructor making it easy to understand the basic rules and techniques of belaying and climbing. We started in a empty classroom and then applied our knowledge on the climbing walls. Everyone is really easygoing and encouraging. Only good vibes here. I was nervous at first but had a lot of fun climbing. It was challenging because of the colored rock routes that you want to follow are kinda crazy and you don't want to look down while going up lol. The belaying part is actually a workout too because of the constant slack in the rope that you want to remove while the climber is climbing. I would definitely recommend coming here for an intro class or free climb time. I befriended my classmates and might consider getting a punch card membership (just because I don't think I can commit to a monthly membership and TO is a bit of a drive from Oxnard lol). P.S. I love the names of their rock climbing routes. I remember I climbed on the route called \"Mushroom\" and there's another route I saw called \"2 Chainz\" LOL.", "date": "12/25/2013"}, {"review_id": "AA7HbJuHfu5KdpbPo8DMgA", "user_id": "y9OGAQUEX9dJbrWaeHNMDw", "user_name": "Anna K.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Albeit smaller than the SFV location, every single staff member I have encountered at both is extremely helpful, knowledgable, ego-less, and passionate. I am thankful to have gotten a membership at Boulderdash and am so excited to learn and grow in climbing!", "date": "9/11/2017"}, {"review_id": "7OQlxOegdygFoh0a_oIIDQ", "user_id": "tlnPGI6qjLN1Daffq8aw5Q", "user_name": "Ariel B.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "We come here often and enjoy climbing. The routes are pretty good and change somewhat consistently, but the customer service and upkeep is definitely lacking. The other day I ripped my finger on an exposed nail at the top of a climb--which is NOT acceptable. The staff didn't apologize or even immediately fix it. They had a very blase attitude about it, and this carelessness seems to be standard. There are a few exceptions--some of the staff are wonderful.", "date": "6/3/2017"}, {"review_id": "UsA_9DSabB_P4fNA2NUe8A", "user_id": "yhXcH_zexCwccQ4B7FE8Yg", "user_name": "Kirsten L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 7, "funny": 2, "cool": 0, "text": "Owners Christian & Paul made 8 scouts and their parents very unhappy now that they cannot complete the last part of their Climb-On badge because they were told to come back for their \"free belay test\" and then they neglected to mention that they would also need to buy a $15 day pass (for the hour of climbing THEY require) plus shoes. Shoes we could see, but seriously, $54 so they can get belay certified and they didn't want to mention that extra $19 charge? They are way overpriced we found out anyway! Head to Agoura's AHC3 for climbing at 1/2 the cost and guaranteed less frustration!The girls were belittled and treated rudely by the staff (Matt) and they had no money, drove 30 min to get there, had no ride for several hours, and these guys could have cared less. I'm so disappointed in how these owners communicate and run a business. I just thought others should realize the pain and frustration their lack of communication caused.", "date": "5/13/2016"}, {"review_id": "B8hZ_FXyHXzuDHfNvRPumQ", "user_id": "b_HtJqMwiAG2Pj7D8UIeXw", "user_name": "Kayla H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 6, "funny": 0, "cool": 1, "text": "Definitely disappointed, my boyfriend and I purchased a day pass ($17 is super expensive) and went to the back to boulder. The guy who checked us in was great and the bouldering area had some fun routes, but it's pretty small and was crawling with kids so we thought we would get our gear out of the car to top rope. We went to the front desk to get \"belay certified\" and was told we can only do that if we do it right when we walk in the door (???). The guy explaining it to us was nice but we were asking questions since it didn't make much sense to us, and an older guy with Long hair (maybe the owner?) came over and was SO RUDE and totally wrote us off. I was so appalled by the customer service and will not be returning.", "date": "10/28/2017"}, {"review_id": "CxPSYf698peMXj3-g6ToqQ", "user_id": "2FIKWo3hDXOUGkz77fAzsQ", "user_name": "Dalia W.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm so glad my husband and I checked this place out. We did bouldering and the guy at the front desk was so nice and helpful. He walked us around the place, showed us our options and answered any questions we had. If it's your first time, be aware that bouldering is very difficult. There are only so many level 1 options available. But with that said, it was still really fun and I got an amazing upper body work out from it. We will definitely be back and can't wait for the VTA location to open up!", "date": "1/28/2018"}, {"review_id": "4OpeLRvNYe2mkIOMN-NKDA", "user_id": "Xgp4za0VYq1nMNPTt3iYSw", "user_name": "Vanessa T.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Boulderdash in Thousand Oaks is like going down the rabbit hole of adventure. From the outside, it looks like any normal building, a place to get your taxes done or a casual day spa. But as soon as you walk inside you are transported to a place of color, depth, and excitement. Boulderdash is covered in high walls for bouldering and rock climbing with levels for all ages. It's the best place for any adrenaline junky or those who love a good challenge. It's immediately addicting and offers yoga and core classes on the side just in case working your forearms and legs to death wasn't enough of a workout.   The workers are obvious rock climbing yodas and help your first experience transition with ease. If you're looking for a change in pace from your mundane workout, or a good heart racing thrill, come to Boulderdash! Let me know about your experience and if my review helped you! Also, suggest any place not on my page you think I'd enjoy! Spread the love on yelp review at a time! v", "date": "6/11/2017"}, {"review_id": "yVoVctA-Neof4Z9-GyAnvA", "user_id": "mJ8SzKBqpHlm9oq6wh-bpQ", "user_name": "Kayla H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my college class. Very friendly and helpful staff. Will be coming back!", "date": "6/27/2017"}, {"review_id": "MqRWxveYR7MwVHhGj-p_Tw", "user_id": "co1YAdqcBdVRm2DrAMvz8w", "user_name": "ed l.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My little girl just had her 5th birthday party here. We had 25 of her preschool friends (climb) and their parents (watch).  We had many kids and parents tell us this was the best party ever.  Staff were extremely organized, welcoming, and encouraging with the kids.  Most kids were a little hesitant at first, but that didn't last long as climbing is very natural for them (seeing their friends do it helps). Parents were definitely wowed to see their kids climb the different routes and many said they can't wait to come back.  Christian and Alex are great with kids - this really set the tone for the event.  Many thanks to them.  We had a few guest arrive very late toward the end of the climbing session.  I was worried that they would miss out on the climbing and was expecting some tears.  But I was impressed to see that Staff made a point to quickly harnessed up the stragglers and get them on the wall right away. My wife has super high standards for these things (if you know what I mean) and the guys a Boulderdash delivered big time.  Huge thanks to them - WOW.Tips: we had our party sat morning when it was mostly empty. The party room isn't huge but comfortably seated 25 kids at a table with parents standing behind them with room for a couple tables for food/drinks/cake. We put our drinks in their fridge the night before. They are well prepared to handle bday parties. We used D'amores pizza (delivery) and Spinkles cupcakes (pickup) - we are happy with both and they are very close to Boulderdash.", "date": "2/15/2015"}, {"review_id": "7txhEgVt3KUbJpGrNWIwEA", "user_id": "k2iWBerinOfRJw8NuceO2A", "user_name": "Will H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I want to get back into bouldering so I came here after buying climbing shoes late Friday night. When I was ready to buy the 10 punch pass, I realized I forgot my debit card at home, but if I drove home, I wouldn't have time to climb. Paul gave me the student discount(I graduated from the school of Hard Rocks). Plus he pitched in out of his own pocket.I put on my new shoes. But they were two left feet. I switched the shoes in different boxes when trying them on. Paul helped me out again.They have a vast amount of open space and high ceilings, and it was nice and cold. It was clean, had a nice lounge area, and everyone seemed friendly. The music they played was also good, I love Insane Clown Posse(woop woop!). Overall, it was a great Friday night.", "date": "7/8/2016"}, {"review_id": "lAMEiVWOtGViWg4fuXXTDQ", "user_id": "0VyAyKfPfMrBJd3wvYerSA", "user_name": "Nick P.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Nice climbing spot to have around town.  Used to come here often to boulder a bit.  They have a cool selection of runs, helpful staff, and have great hours.  Also a great crew of people that both work and climb here - they are willing to help you with almost everything!", "date": "5/10/2017"}, {"review_id": "HW9fKlGp1hya_Oy5PGfgeg", "user_id": "75NSnjZ1iTaefa1E6W0Ufg", "user_name": "Steph S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Stopped in here last night and Matt was so friendly and helpful! It was my first time bouldering and visiting boulder dash. I was struggling, but Matt came over and guided me through a few steps and it helped so much! Can't wait to visit more and get better at bouldering. \"Trust the wall\"", "date": "1/17/2017"}, {"review_id": "9ra_I2dJiBrxdxA-x3FhvA", "user_id": "Bk9ApvRuNUC3x2hHMRCG6Q", "user_name": "Gus L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "We were looking for something to do that was fun for the kids and came across this place, we're sure glad that we gave it a try. A special thanks to Justin who took the time to show us around, explain the pricing and process, and overall was a great instructor with my girls. Justin was very patient and knowledgeable of climbing. The pricing was very reasonable and a bargain if you ask me. We paid $50 total for both of my girls and that included 30 minutes on the ropes which included our instructor and after the 30 minutes the girls got to do free climbing on the lower levels which was part of a day pass. The girls learned how to climb, they were active, well time spent if you ask me. We will definitely be back.", "date": "1/16/2016"}, {"review_id": "PYtwmeET6g7nLhMjSVQe2Q", "user_id": "oiEYXkji90XlBguJSVlIZA", "user_name": "Sean W.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I'm going to give this 5 stars based on the fact that I have no other indoor climbing experiences to compare it to - that said, my son (12) and I had a blast. We arrived at 11am on Saturday and it wasn't packed. We took the suggested private lesson, rented the gear and our instructor was Mike. We felt entirely safe and can't wait to go back for another shot at this.Everyone we dealt with from the front desk to the instructor was super friendly.", "date": "1/11/2014"}, {"review_id": "e0ii-pJ8butSoLwvQbQwJQ", "user_id": "Sm5B40yKcVLyEhy2gIqH_g", "user_name": "John A.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "It's ok but the bouldering is pretty limited. Toprope is nice.", "date": "10/11/2016"}, {"review_id": "jSnvwU6eqqiy1Hhcj87vAg", "user_id": "SHfBJarmzmdNtBibk1FakA", "user_name": "Bryan F.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Always a great place to be. The staff is awesome. The routes are always changing. I recommend checking out this place!", "date": "1/7/2017"}, {"review_id": "v4Pl6botPfaI3-MsybobRQ", "user_id": "dKHZo6tdqcnlgBO7MHJ1Qg", "user_name": "Nancy C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 8, "funny": 0, "cool": 0, "text": "My bouldering experience at Boulderdash briefly reminded me of when I first arrived as a bright-eyed freshman at my undergrad university, ready to excel as I did back in high school. BRIEFLY.  After conquering V2s at various Touchstone Gyms in the SF Bay Area, I felt confident that I could boulder V2s at Boulderdash.  Falling unceremoniously on my face after unsuccessfully attempting what I thought was an easy V2 (if an easy V2 was missing footholds and the next handhold was placed a foot out of reach), I decided to try the V1s and the V0s. I breezed through some of them through swinging and smearing and realizing that all the technique in the world couldn't help me complete most of them because I simply didn't have the wingspan or body length that would allow me to go from one handhold to the other.  To the setters: Gigantic handholds do not automatically equate to a V0.  Whoever set the bouldering problems didn't think through how to set up the problems for people of different heights and clearly didn't know how to have a variety of problems to practice different techniques.  There is more to bouldering than swinging and smearing your way to the top.I'm going to need a solid week to undo all the lack of technique I used to complete the bouldering problems due to lack of planning on the parts of the setter(s) at Boulderdash.  This is the only rockclimbing gym in the area, but I'm disappointed that they're acting like it and resting on their laurels.At least the day pass is only $15...", "date": "12/27/2012"}, {"review_id": "AEQoiLdw90whn5LKQGlwBQ", "user_id": "LDwUXBnW7haaG_eilPTeaA", "user_name": "Vic A.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time here for a birthday party and we all had a great time. The entire staff was attentive and made sure each child had a great experience. Of special note was one of the staff members, Gabriel, who was so nice and really encouraging of my youngest who was struggling with climbing. I hope to come back soon. It's a great sport and will develop confidence in you and your kids.", "date": "10/15/2016"}, {"review_id": "cUptyC3nFtKvhygvoOR5Kg", "user_id": "DgmvcnJT9G2O0FdxtpEO-w", "user_name": "Cheri N.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is neat!  Our first time visiting was for my 9 and 6 year olds to take the \"Off the Deck\" class.  This is a class for young kids, limited to 5 children with one instructor.  Our instructor was great, he was kind and understanding but disciplined and wasn't afraid to keep the kids in line but flexible enough to allow parents and siblings to hang out on the gym floor to watch, encourage and take pictures of our little climbers.  The kids in class were able to climb many different routes and all of them improved during the 1.5 hour class.  For $25 it is pricey but we will be back again since they had so much fun.  The gym has so many different shaped walls and rocks.  They tell the kids to choose only one color rock so the route is more specific to their needs.  They even had the kids blindfolded at one point and climbing against a wall the leaned in so they were confident to go higher if they were afraid of heights.  It works!  Very happy with our visit and we will be back soon.PS, I used GPS to find this place (IPhone GPS) and followed it exactly as it told me to turn.  I usually make a wrong turn when something is not easy to find but I did not get lost at all.  Just pulled into the space in front of the clearly marked 888 address on the building.  It does make it easier to find if you look for the tallest building in the complex.", "date": "6/19/2015"}, {"review_id": "ya3e71tlZY_ARiL1uAV2Ng", "user_id": "HFo_zYrRgt4gnca7-qB2iw", "user_name": "Courtney N.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's a good gym. Decent routes, and they are open pretty late which is a plus for me.", "date": "12/21/2016"}, {"review_id": "wumTBmD-5JpdBm3G1JMXJA", "user_id": "tU4zbV7myT_sc7L74T9YGA", "user_name": "Bob F.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "My grandchildren are 13 and 14. They are not training to climb El Capitan but have enjoyed climbing walls at Magic Mountain and other venues. When they heard about Boulderdash, they were eager for me to take them so I did. It cost $38 only to find out that they would only be able to use the small climbing area unless I was willing to fork over some additional money to get them private lessons so they could climb on the bigger walls with ropes. Shame on me for not understanding that Boulderdash catered to serious climbers but the kids left after 20 minutes with a look of disappointment on their faces. To make matters worse, as they were retrieving their shoes and returning their rented climbing shoes, the older gentleman who performed that service remarked that they had climbed in \"clown shoes\" that were too big for them. If that was the case, why did the young woman who gave them those shoes not point out to them that climbing shoes should be a smaller size than their regular shoe size? Maybe there should be a warning label on their website that says \"For serious climbers only\".", "date": "10/17/2017"}, {"review_id": "suNQdfpOWB0d1AlROFKw6g", "user_id": "ak0jYenosURg0q1SPC5nLw", "user_name": "Dave A.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 6, "funny": 3, "cool": 5, "text": "IMPRESSIVELY TALL structures to get your climb on!!!  I set up a \"party\" here to celebrate my 5th grade boys basketball season.  Thought it'd be cool to utilize it as  symbolism for our climb to the top.  Whoop, WHOOP!!!  Pretty easy set up over the phone to reserve a spot, which they recommend to do at least 2 weeks in advance.  Parties are held before 4pm on weekdays and all day on weekends.  Gotta make sure THE PARENTS sign the youth waiver, which they can do online.  There aren't any limits to the foods you can bring, which is nice.  D'Amore's Pizza does offer a 20% discount for Boulderdash orders and they do deliver.  I, however, went the monster pizzas from Greco's (no delivery, unfortunately.).  On arrival and first glance, my young ballers were pretty awed by the hugeness of the structures, and the apprehension and/or fear was fairly obvious on most of their faces.  All of them were newbie rock climbers.  But just like Jedi Master Yoda told Luke, \"Do or do not.  There is no try.\" I used that all season, and it still held true today.  Just like everything in life, fight your fears, don't give up, and seize the day!  The staff was totally positive and oh so encouraging.  Graham, Ryan, and Alex, over the course of 1.5 hours, helped every single one of them to touch the top of their climbs, as safe as could be.  No hints of irritation, ever.  All of them interacted with the boys with great enthusiasm and patience.  I loved the looks of determination and success.  I loved how all the lads noticed muscle fatigue and were feeling exhausted in the end.  Added bonus about parties here was I didn't have to clean a thing, yay!  Great experience that I would not hesitate to do again!  Thanks Boulderdash :)Staff recommendation:  Wear thick shorts or long pants, as well as sneakers!", "date": "5/22/2014"}, {"review_id": "Q0E0rrypSTOUBsHegl9iyw", "user_id": "TZrPQWVESYwISWl0-293gw", "user_name": "Evan D.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Boulderdash serves to be an awesome upbeat facility that appeals to anyone at all walks of life. There are easy climbs for beginners along with challenging climbs for those who have experience under their belt. The entire staff is knowledgeable, friendly and empathize safety. I love this facility/ the community of people in it so much that I purchased a year membership for unlimited climbing. If you are interested in rock climbing, I highly recommend coming to Boulderdash.", "date": "7/19/2016"}, {"review_id": "49nDvxta-gzqcs5-veq6EA", "user_id": "qlj-DcHrWWX5DW2XsGK7ZA", "user_name": "Thaminda R.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "After moving to SoCal I was looking for a bouldering gym to get back into climbing - this was quite convenient compared to ARC in Arcadia. One downer is, contrary to the misleading name, the gym does not offer too may bouldering routes - in fact, its mostly top roping. However, this is still a pretty cool gym. I became a member after climbing here a couple of times mostly since it made sense to me. They change their bouldering problems quite frequently - so that certainly helps. Looking at the problems, it appears that the gym does have good setters. For me, this is the perfect spot to get a quick climb before jumping on the freeway to Pasadena :) The crowd is professional and respectful, which is important when the bouldering space is small. No options to top out. I would encourage folks to give it a try.", "date": "2/24/2016"}, {"review_id": "ujo-6N3lWe0x6v-ahu4ICg", "user_id": "79NMlBd7DhLqfqU6bVV60Q", "user_name": "Adam G.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "After working and climbing in gyms all over California and Texas I can honestly say that Boulderdash is one of the best Climbing gyms out there for a number of reasons:1) no tape, routes are set by color of holds and set well!2) tall walls and plenty of room3) the owners work the floor everyday, making Bdash a hands on, good vibe environment . Christiaan and Paul (owners) are awesome dudes that care about their climbers.4) the staff actually climbs, any questions about indoor or outdoor climbing can be answered and demonstrated 5) finding a climbing partner is easy, I've met some of my best friends to this day at Boulderdash  6) members get free classes--like yoga and strength training7) great place for the kids/whole family", "date": "10/14/2014"}, {"review_id": "IA48TfMoj0Y3BP32QLY0gA", "user_id": "_EpAfJS1wope8lRI8Q1T1w", "user_name": "Laura B.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Took my 4yr old daughter here this evening for her first time climbing anything outside the playground. Receptionist was really lovely & sweet to my daughter when putting on the equipment. Alex the instructor was really amazing, patient & really made my daughter feel comfortable. He answered every question that my four year old had. She did amazing & climbed to the very top by the end of the class.This place was really great & I loved seeing my daughter's confidence grow right in front of meGreat job boulderdash!!", "date": "2/29/2016"}, {"review_id": "LpsmwxsB9m9p-wd0MTAZqg", "user_id": "dGQZbY9641rlU4cA65xABg", "user_name": "Cyndie L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "How can this be the closest rock climbing gym to Hollywood??Someone open on in dtla or Hollywood! Luckily -- I live in the South Bay and regularly go to hangar 18. Tried this place, and it looks like a top rope climber's heaven. I've never seen such high top ropes! Unfortunately, when I came to visit they were rebuilding all their paths. But I came to boulder anyways.Their boulder space is... Small in comparison to some of the other gyms and pretty difficult. If you're a beginner, you'll barely get anywhere. The walls were definitely challenging but fun. Prices are pretty typical. Not busy at all -- but weekends are usually slow from what I've experienced at climbing gyms.", "date": "3/6/2014"}, {"review_id": "FKi3PHB9q9paBO1txv8MRw", "user_id": "s1oYAn04eIgBgxnEdovROQ", "user_name": "Kirsty Elizabeth F.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I recently went to boulderdash to explore indoor climbing. I am inexperienced and was hoping this place would be able to show me the ropes (no pun intended). I called beforehand with a few questions, to which all were met with genuinene answers. When my friend and I arrived, the worker at the front (Matt) greeted us. It's always a bit intimidating walking into a new gym or place, but he made it clear that we should not be worried. He gave us a tour, explained the different walls and ropes, and all the safety rules. As my friend and I ventured to the bouldering area, we were given tips by not only employees, but seasoned climbers as well. Going here, you feel a sense of community. Along with the great atmosphere and friendly staff, they also have starter classes and discounts for students! While my hands and upper arms and recovering from the workout at the moment, I will be sure to venture back and climb again.", "date": "11/3/2015"}, {"review_id": "_I-tdXhZFDtpuccpniLKpw", "user_id": "eJ-mT-cK2V2RJQApZjD7Pw", "user_name": "Jaelynn D.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 10, "funny": 3, "cool": 2, "text": "Staff totally rude. No greeting, just plunked 2 waivers which I had already signed and even told them I had one at which they still motioned those waivers. (I'm thinking that they were acting before realizing).Had to retest belay and knot and the guy completely rushed me when I wanted to think about it and take my time. LOOK ASSHOLE, NO ONE WAS FUCKING ROPED UP YET SO IT SHOULDN'T COUNT. After I finally got my knot in place I went to tie a safety knot and he was so douchey that he had to just reiterate that we didn't have to use safety knots. If you were so damned concerned about not letting me take the belay test just because I wanted to think about tying then fucking let me tie the knot, asshole.Since my boyfriend was more advanced. Thank god he's so awesome and easy going so he belayed me, and the guy claims that there were belayers on site--WHICH THERE WASN'T. FUCK YOU, BOULDERDASH. You also used to have a free friend pass and even though it's still there you can't bring repeat friends. I'm staying outdoors. Your routes are too easy anyway.", "date": "7/12/2011"}, {"review_id": "aYW9atPJhw-DJVUV95xbog", "user_id": "2rEsQRLDQ95Jy5W9lKaTmA", "user_name": "A B.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My fiance and I come to Boulder dash about every other day after work and enjoy it every time. great gym, great atmosphere, staff is supportive and friendly.", "date": "3/1/2016"}, {"review_id": "dnd7_7l5ptNLacM2_Li_hA", "user_id": "I92yFsfz6H6LR2p0uyua8A", "user_name": "Katherine S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Many great routes to challenge you and help you improve your climbing skills. Super tall walls to test your endurance. Lead climb clips on many routes so you have many choices. This is only in reference to the rope climbs as I don't boulder. Only downside is that the prices are high but it is Westlake Village so what do you expect. $17/day or from what I hear about $60/month.", "date": "1/17/2016"}, {"review_id": "xAgXPdhpUUf-2mOm68guFw", "user_id": "OWpcdFzlMz4hhkKKGNvpwg", "user_name": "Charles P.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice gym, perfect climbing environment, the employees that are helping with the courses are amazing and very professional. But almost every time I go there I have the same rude and unprofessional employee serving us with the worst attitude. He looks older and has blond hair. The last time we had to wait for a long time because mister was climbing instead of doing his job, and on top of being late he was a total d*** to us.This was the last I went there and I will not return to this establishment.", "date": "11/1/2014"}, {"review_id": "SugozrkzP1jDhWHvhKkaRw", "user_id": "ms3FBoGd0Cb_w_k1SaouoA", "user_name": "S L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "DATE VISITED: 8/15/2015OVERVIEW: Boulderdash Indoor Rock Climbing offers bouldering and top rope/lead wall climbing.WEBSITE:boulderdashclimbing.com/…THINGS TO KNOW:-Top rope/lead walls are between 21 to 45 feet tall.-Lead ropes are provided.-No water fountain, water/sports drinks for sale at the front desk or fill up in the bathroom.-ATC only allowed, no grigris.EXPERIENCE:We arrived around 3:00 pm on a Saturday. There was a birthday party but the kids seemed to be well-behaved and not running under climbers. It's nice to have a variety of shorter and taller top rope walls. The belay test was easy- the staff will have you tie in as a climber, climb up a short wall, take a fall and then belay using an ATC and prove you never take your brake hand off the rope. I think it's ridiculous grigris are not allowed in the gym whatsoever. It seems more dangerous to have the lead ropes on the wall next to the lead climbing area for anyone to use rather than checking them out at the front desk.This gym seems great for children's birthday parties or drop-ins. I would not recommend a membership as there are not too many routes or problems. The bouldering section is very short with approximately 11 ft walls and about 6 inches of padding. Setting seems fine but does not appear to happen often as some routes were dated in May.", "date": "8/16/2015"}, {"review_id": "nlfpULA5TE-G6tDiiB0w6g", "user_id": "T3Gr7JkJskpQZK-GgW6NBg", "user_name": "Olga S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Big fan of this place. Staff is nice, place is clean, routes are incredible and tall. It has been the best training place I have seen so far.  I have visited several other gyms in the area (not to mention any names), but they have not had the challenges and the additional training options I have found here. They are always adding new routs for everyone to try, rate, and changing them around to give everyone some variety. Have brought a lot of friends, always suggesting it to anyone I know and bringing them along. Love this gym, the place is awesome!  I currently do the punch card system, so be forewarned that if you choose to do this they do not replace lost or stolen punch cards!", "date": "2/21/2013"}, {"review_id": "FPnAwkZRKBVEJIO0RhF2GQ", "user_id": "VX8lWJBG5R4Cc6rpvdu1kQ", "user_name": "Michelle S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place.  Customer service is wonderful!!!  I take my family there when they visit me from Arkansas.  They love it!  Very safe!", "date": "8/29/2013"}, {"review_id": "az_WkCa_2qLTztaNWDoPLQ", "user_id": "5i1TWe5idYsD62GvserCtQ", "user_name": "Charlotte S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "It's the closest rock gym to me and if I was a more active climber I'd go more frequently. It's not my favorite though because I can't do they belay when I climb alone and the free bouldering area doesn't have a lot of climbs at my level (V0 is about as high as I do). I'd like this place more if they had more walls for free climbing novices like me. The staff is nice enough and the community is good. Overall a quality gym, just not for me.", "date": "10/1/2015"}, {"review_id": "9-Wc4v5QzYdbTa_JTKW6ow", "user_id": "7QYgHDn2WrhWvq71MGu_bA", "user_name": "Anil M.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Disclaimer: I only Boulder. Don't rope climb. I was a member for 3mos. I didn't find this great for bouldering at all and I think they should change the name because it misleads you into thinking that they're a good bouldering gym.  There are a lot of people that seemed to rope climb so I'm guessing they're good in that area. The traverse is something I tried as well but it is along the same route as the rope climbers so you are constantly interrupted. It is kinda spendy too and they're not willing to cut a deal coz they know that they're the only option between Ventura and Santa Monica.", "date": "4/8/2015"}, {"review_id": "6NCSis7l7IYJOAL0zb3iwg", "user_id": "cgSnFjMOq7a8qojTWlNnpA", "user_name": "J R.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place for indoor rock climbing.  They could use more space for belaying and bouldering, but if you're looking for a place to just boulder around, it's good enough to get some practice in.  They also host kids birthday parties.", "date": "9/28/2015"}, {"review_id": "wS7SEOkFk0oVfZ2-L5y24Q", "user_id": "OEBXsIsAL0F_Kg27-MP-JA", "user_name": "Clay L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 5, "funny": 2, "cool": 3, "text": "Summary:  Good atmosphere, a little crowded at times, and great training.  Perfect for beginners to seemingly upper-level lead-climb trainers.Detail:  Boulderdash is the first climbing gym I've lived close enough to regularly attend and after being there for the first few days and getting to know a few of the regulars and the employees really brought me into the fold.  Just getting started and setting into some bouldering you can just walk in (that's what I did).  After that I spent some time in their belay class and after that ran around from an REI group to some outdoor belaying.  I'm still looking for a regular belay partner but even when I don't have one, the bouldering section has enough routes to last me for probably the rest of my life!  The difficulty scales QUICKLY.  Good luck.  The only downfall might be how crowded it can get from the kids at times.", "date": "8/7/2012"}, {"review_id": "Z775mWEqRcGEtRe91d0kHw", "user_id": "9A58ZhWUObzvb-bybheNkQ", "user_name": "Tom G.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Went for a small group session for the little kids.  My daughter and her girlfriend HAD A BLAST!  Well mannered staff - safe practices and given the crowd on hand I was not surprised!  We're going back again soon - next saturday in fact.  Sigh... go ahead ... give it a try!", "date": "2/27/2015"}, {"review_id": "zEr5-S-G6kASGKeQr9aCkg", "user_id": "GaLpIsLKnSq26WYCv81kIw", "user_name": "Chad C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 5, "funny": 0, "cool": 1, "text": "It's a little hard to find if you're looking for the address.  You actually need to turn down one of the side streets and the entrance is around the back.  I have to say this has gotta be one of the vest indoor rock climbing gyms in the LA area.  They have some nice 45ft. route for leading and top rope, there's a fixed rope that goes to ceiling you can climb as well (belay required), they have some nice 25ft. routes which are pretty common with most indoor gyms, a decent wooden traverse and a fairly large bouldering section with a lot of seated starts.  What I really like about their top rope and lead routes is cant the walls and the overhangs.  They really make a 5.8 route feel like a 5.9 or 5.10 depending on your height and flexibility.The staff is very friendly, and the price is reasonable if you bring your own gear or rent theirs.  I just wish it wasn't so far away for the SFV. I bought a 10 visit punch card, so I'll be back.", "date": "2/24/2012"}, {"review_id": "wueFCXCLSz01xkriM-B_1g", "user_id": "OWrGyswFf5x3ef1_z33Tzg", "user_name": "C P.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 2, "useful": 6, "funny": 0, "cool": 0, "text": "My experience with Boulderdash was tainted by one of the staff members.I don't know his name, but he runs the front desk and may be the most condescending and passive-aggressive people I've ever ran into. He's like a sleazy car-salesman. He speaks to customers like they are all children, cueing his voice to a fake-sincere tone, always jetting for a way to make you feel like he's going to steal your wallet when you aren't looking. And that grin of his, he'll flash it after every sentence, just to put a creep cherry on his shit sundae. A buddy of mine has gone to him with 4 fully trained rock climbers, all of which THIS GUY failed during his wretched and stupid excuse for a belay test. Everywhere else, we've never ran into a problem with an employee like this. The used-car salesman bit goes even further when you realize the reason the guy is failing people is to push for the over-priced training session that he makes commission on.I'm going to avoid this place simply because of this guy. He was so slimy, it was infuriating. The facility itself is damn good, too, which is a shame. Guess I'll keep climbing elsewhere.", "date": "11/26/2013"}, {"review_id": "FKAlw776-99U6PH2RzGFuA", "user_id": "pLuW8KB0cZtraXfvEWf1Tg", "user_name": "Russell G.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 4, "funny": 0, "cool": 3, "text": "It's hard to believe that I have been going to boulderdash for several years now and have not written a review until now. I have been to many climbing gyms and this one by far is the best climbing gym I have been to. Good, tall routes with much variety. Friendly staff who I have become friends with and cool people that are friendly and not beta spraying ego maniacs. There are many reason why people come to a climbing gym - to get a workout, train for the outdoors, and perhaps even have birthday parties for their little sister - this place caters to all.I have heard of some people driving all the way from santa monica to go to boulderdash instead of other gyms and it's for good reason. This place rocks.", "date": "12/10/2011"}, {"review_id": "0wnMFKJuNe64jJDdS6sPAA", "user_id": "Cf-5RYLnr9YWa8GxXob-8g", "user_name": "Kelsey L.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took the Up Rope belay class here and had a fantastic time! The instructor was experienced and informative, overall the class was incredibly fun. The staff is excellent. Everyone is exceptionally friendly and personable and no one will make you feel out of place as a beginner. They have a good variety of routes for all levels. Everyone from us beginners to the advanced climbers had plenty to choose from. I highly recommend Boulderdash to anyone who's interested in climbing!", "date": "3/27/2015"}, {"review_id": "rUGzp6lW_mvImZng1eX1Sg", "user_id": "xy1UjyJEkeY5vD5r_S8KdQ", "user_name": "Katherine D.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place has great top rope climbs. The bouldering climbs are a little difficult even for \"easy\", but it makes me want to work harder, so it's a great place to train. I am not a fan of their ropes. Their ropes are really harsh on my hands compared to other ropes I've used. Their ropes seem a bit worn out. They work, but they are rough. The staff is friendly, and you meet lots of nice people, though. It's overall a decent climbing gym.", "date": "9/21/2012"}, {"review_id": "2wT4sgLbLLIc0_Zp-OcbnQ", "user_id": "0uV-EoAInIlXzK8cjp1wtw", "user_name": "Jenn C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Writing this review after my first-time indoor rock climbing experience. Went this afternoon with a friend who was introducing me to climbing and I had no idea what to expect. I am now hooked and it is partially because of the amazing people who work here. Christian was at the front desk and immediately made me feel welcome with his kindness and fantastic energy. While I was climbing (again, first time so I was a bit of a mess), people who work there would come by on occasion and shout out a word of encouragement. And the climbing was so much fun. Can't wait to come back!", "date": "11/11/2014"}, {"review_id": "uqRlSe49uc3CYu1L1OJwKA", "user_id": "vjh_jVWHEHlHI63qdPiybQ", "user_name": "Alistair C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Extremely friendly and helpful staff. Quite a decent amount of routes on the highwall and boulder gym is re-tiled every week or so, making it really great for consistent members. Overall great place!", "date": "12/18/2014"}, {"review_id": "16ikeRQbh_RQr-3pEKp9wA", "user_id": "-Zh_V48P8qIc5-rAAbGQsg", "user_name": "Nancy P.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "We are celebrating my daughters 10th Birthday at Boulderdash! We have also celebrated her 8th and her 9th there!! Nothing but professional, fun and helpful staff! This is why we are coming back for a third time!! Just got off the phone booking the party and the gentleman I spoke with was friendly and helpful and even said \" your the bomb\" to me which made me smile! The other reviews that are negative are more than likely negative people needing to point a finger..I appreciate safety and strictness in a sport that could be harmful if you dont pay attention to detail. I teach and train horseback riding so I know how sticking to the rules can be. Boulderdash Rocks! no pun intended", "date": "10/31/2011"}, {"review_id": "3JQyBXWyC2vDS6fAHKdvOQ", "user_id": "Fz87dOdTSFUhKJJ94izhcw", "user_name": "Elizabeth S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love Boulderdash! I have been climbing at Boulderdash for over two years now and having been to many climbing gyms in different states, and I have to say this is the best one I have ever seen. The routes are long, challenging and flow really well. You can lead all of the tall routes (45 ft), and there is an awesome overhanging area that is only lead climbing. There is a shorter wall with more bouldery routes that is top-rope only, and there is a fairly large bouldering area. The bouldering has to be my least favorite part about this gym because there are no top outs and some of the routes are really contrived and awkward but I guess that is bouldering for you. All in all this gym gets 5 stars: the routes are awesome, the staff is super friendly and helpful, the owners know what they are doing and talking about, and the membership is affordable ($60/month). I would highly recommend this gym to anyone even if you are just learning how to climb or are a seasoned climber who needs to stay in shape.", "date": "1/4/2012"}, {"review_id": "KJvjcJGDd-9j4WXjUxNDcw", "user_id": "lbtaZQxQCuRTCx5GCgJ0jQ", "user_name": "Burhanuddin S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "THIS PLACE IS TERRIFIC!! The staff there is very helpful and are nice. There are different climbing routes. I mainly come here for bouldering because it really gets my muscles working and it is quite a great workout. Whenever I come here I always bring friends new to climbing and they all instantly fall in love with the place!", "date": "12/14/2014"}, {"review_id": "qPH6x0nl6qs1yaTz09OGjQ", "user_id": "rQyNMxwYLL7wpoYlbC24aA", "user_name": "Clay Z.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 7, "funny": 2, "cool": 1, "text": "Where would I be without Boulderdash? Probably outdoors a lot more. Unfortunately for those who love fresh air and real rock, Boulderdash offers a lot of competition for the real thing. Yes, there are those days where the California sun is shining and the air is cool that I decide to skip out on Stoney Point and head to Boulderdash instead. Why?Density of quality routes.Boulderdash has great variety of bouldering problems and sport climbing routes. The ability to hop off a juggy roof and start climbing a balancey face 30 second later just can't be recreated outdoors (unless you're hanging out in Squamish). I don't toprope there as much as I boulder, so my opinions are likely skewed and in favor of the short walls (though I've seen some quality TR routes there as well.)The route setting is great and frequent. Their setters reset almost all of the routes on one of the three main bouldering areas every few weeks, which gives climbers just enough time to send everything before it's all replaced. Their setting seems to get better every time they put up new routes, with nothing seeming overly contrived or boring. Even their \"easy (V0- to V1) routes are very fun, at times even challenging for the grade.The place is clean every time I go there, with chalk brushes scattered here and there giving evidence of recently cleaned holds. The unisex changing room is a nice touch (Ladies, avert your eyes) and the bathrooms were remodeled just a few weeks ago. Disgusting holds are no bueno. Nothing like scraping your elbow on a hold and going home with a staph infection. That won't happen here.What really sets Boulderdash apart is the incredibly friendly atmosphere. 9 out of 10 times you ask for help with a route someone is more than willing to offer it. Whether its new climbers asking a regular for advice on which routes to try, or strangers working a newly added route together, everyone is just friendly. The clientele is nice, talented, and (mostly) humble. Spray might be a bit of a problem here, but what can I say, I'm guilty of giving some unwanted beta too.The music. Oh, the music. I can ALWAYS count on hearing Jackson 5 and at least 3 or 4 Tool songs every time I go there. Come to think of it, the playlist seems like it hasn't changed much in the three odd years I've been coming here. But hey, a lot of it's good sending music.Prices are a little steep if you plan on coming a lot and don't have a membership - but since when are climbers the financially responsible type? If you plan on coming more than 3-4 times a month, a membership is the way to go. Occasional climbers might want to try their 10-day punch cards (something like 12 bucks a climb.) The staff is very accommodating and encouraging, and some of the younger guys will come climb with you.My only gripe about this place is more of a double edged sword than a complaint. Members are allowed to bring a guest in for free once a month, BUT as of January 1, they have to be a brand new guest, meaning they have never climbed there before. So much for taking my dirt poor climbing partners to the gym with me, but now I've got an excuse to take a dozen people climbing for their first time this year.Boulderdash's clean, friendly environment and quality route setting put it a cut above other indoor rock climbing gyms in the area.Oh, and neophytes - please take the staffs advice and rent shoes. If you're climbing in Reeboks, you're not gonna have a good time.", "date": "2/5/2011"}, {"review_id": "G_DfbkGJAmUag1CB41sWyg", "user_id": "Pe4zrsIFbsp11IRuDHHzJg", "user_name": "Alex G.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "This gym is for the most part a really great gym. I prefer his gym to any other in the LA area, and there is one way closer to my home. there are a few things that could improve this gym ( see cons)Pros-Routs are good and well set. Some the best I have climbed on indoors-Holds are new -Routes changed out often.-Routes are color coded not taped -Ratings are honest -Clean overall-Routs clean and well marked. -Staff for the most part is nice and friendly.-They finally offer yoga :) -Music is good 80% of the time - Routes well spacedcons-No water fountain (WTF it's a GYM)-No other workout equipment... would love to see them  get some cardio and weights. -Bouldering walls too short to have fun problems on or get a proper workout. -should offer belay class on weekends -Sometimes it can be very hot inside keep the AC on more often-no pull up bar- parties of kids on the weekends are very loud and bothersome. - kids running around can feel  unsafe", "date": "5/31/2013"}, {"review_id": "0zlJCkOMYNOp7myqOMV9ng", "user_id": "XfHozo9iD_cA5hoC02RJ8w", "user_name": "Jeremy S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Having climbed in the Army as well as in several indoor gyms, I'm pleasantly surprised by the level of expertise at this gym. The staff are very friendly and offer great in-depth classes at all levels of ability. The prices are very reasonable, but if you're planing on climbing more then a few times a month you're definitely going to want to invest in your own gear. Check out REI in thousand oaks.", "date": "4/18/2012"}, {"review_id": "ghiTwhAo4Fg9ChwXIWDndg", "user_id": "_Zf8G9AzvAoxG0EgIC1ZRg", "user_name": "Evan G.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 3, "cool": 0, "text": "It's great.  I haven't been in while.  Boulderdash opened up a secondary location closer to me.  Free yoga classes, great setting.  Clean.  Please keep it clean by taking your rental shoes off before going to the potty.", "date": "6/2/2013"}, {"review_id": "pHd6SG9nPEKZsdCp27a8tw", "user_id": "z1-bzi_zk-N9WRK2l7sQug", "user_name": "Andrew B.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 3, "funny": 1, "cool": 0, "text": "This climbing gym is pretty sweet. I only recently started getting into climbing- mostly bouldering, so this review will pretty much just be focused on that area, as I didn't do any top rope climbing while there. The gym is very clean, and doesn't smell of sweaty dudes and BO, always a plus. It's a pretty large space with about half dedicated to bouldering and the other to climbing. The prices are cheap, rentals are in good condition, they have a changing room and well maintained bathrooms. Good music makes for a nice atmosphere, thumbs up for that. There are a lot of bouldering problems (routes) so you have a good variety of options. The only reason I didn't give this place 5 stars is because whoever is the setting the routes is either insanely good or just likes torturing people. Again I only recently started bouldering but most of the Easy and Easy+ problems are really difficult. Not a good learning curve for beginners, but I guess that'll either help me get better faster or make me just want to give up. We'll see! Even a few more experienced climbers were having trouble with some of the Easy marked routes. Most of the other climbers their were friendly and willing to help me out when I got stuck. I'm excited to see where this hobby takes me, I known their are a lot of good bouldering spots in the area and I'm looking forward to getting out and exploring! I'll be back at Boulder Dash soon.", "date": "12/21/2010"}, {"review_id": "lVslhmlogev-bEZ037OdlA", "user_id": "lp_WTcxBGQcaSHnl--Y60w", "user_name": "Dan W.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best climbing gym in the Los Angeles area. hands down, no questions.Prices are what you'd expect from a climbing gym. $15/day, memberships are reasonable, as is the 10 visit punch card..in terms of the gym, it's one of the best I've ever been to, and I've seen my fair share of climbing gyms.  There's plenty of top roping and a solid selection of lead climbs on some very tall walls! . The bouldering area is good although I don't do much bouldering these days due to a past injury and there are constantly new routes/problems going up.the staff is super friendly, knowledgeable, and helpful, and it really is a great community of climbers. The gym's a bit far from L.A. but really wort the drive as long as traffic isn't too bad.Seriously, it's a wonderful gym, and if you're looking to climb indoors this is the place to go.", "date": "2/19/2012"}, {"review_id": "s_05nVk11ro4r-QAJRWYBw", "user_id": "R113791qjpthuK4yLWqRgA", "user_name": "Sean G.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Paul and Christiaan are some of the hardest working individuals I have been around.  Their staff take their time with each and every customer.  The team goes above and beyond to meet customer expectations.  Keep up the excellent work Boulderdash.", "date": "9/22/2015"}, {"review_id": "zi6S28kRawWEcAvHH4p0VQ", "user_id": "GnPwRRsEUlJf-OQkYamT0w", "user_name": "Brad F.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place!! I am here at least once a week. The employees are some of the nicest for sure. Everyone is pretty respectful to each other. They change routes relatively often so there are new routes which is nice. The one thing keeping it from 5 stars for me is the bouldering area they never change (or so it seems) I can't think of one route that has changed in the many many times I have been.", "date": "7/21/2013"}, {"review_id": "e13bOheGXTRaBlHwOLSozw", "user_id": "8AQOJu0SnEDOmtmeiWkt6w", "user_name": "April T.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 3, "funny": 0, "cool": 1, "text": "First off, I want to say that this review is based solely on the bouldering section of the gym.  The top-roping stuff looked really good, and had I been able to go on a day when a belay class was being offered, I would have been able to get a lot more out of the gym.  And, contrary to what some previous reviewers said, I found the staff to be very helpful, friendly, and knowledgeable.  The employee who gave me a full tour made me feel very comfortable there.As for the climbing: perhaps I'm spoiled (I spent 4 months at an amazing bouldering-only gym with 14' - 16' walls before moving to the area), but the bouldering section here had short walls (maybe 8' - 10') and the smallest foot-holds I've ever seen (even for V0s), plus the wall was just too densely packed with routes.  I was constantly worried I was going to bash my face on holds, or even just protrusions in the interestingly-shaped wall if I fell.  The walls are short, close together, and mostly angled inward, which made me kind of claustrophobic, and because of the wall height, I didn't get the same level of workout I'm accustomed to.  The rating system also seemed a little wonky.  I finished a V0 and V1 pretty easily, but found a VB very difficult.  And the routes seem best suited to someone at least 6\" taller than I am (I noticed on a few that claimed to be easy that the distance between holds exceeded my full wing span by a few inches, with no viable foot holds in between).  Because of the very dense packing of routes onto the walls, and the low lighting in that area of the gym, it was hard, at times, to figure out which holds were on my route while I was up there.  The best thing I climbed in the few hours I was there was definitely the wood-hold traverse by the counter.  That one was a blast, and if more of the bouldering routes were like that, I'd be in here every chance I had.What's pretty cool is that they offer reasonably-priced belay classes and a \"free climb\" where you get a belayer and your equipment for $20 for a few hours.  Less cool: both of these things are only offered certain days of the week, at inconvenient times for someone who lives and works 45 minutes away.  Unless I cave and pay the $75/hour for private instruction on a day/time that actually works for me, it's not worth my time or money to drive all the way out to Thousand Oaks.", "date": "9/22/2012"}, {"review_id": "oUcssOxoWqSVN6CPEMSOug", "user_id": "y9zvqtJEvn6RNUL-CKeJ9w", "user_name": "John R.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing climbing gym. Being relatively new to climbing, boulderdash has been a great experience. I have fallen in love with climbing. The atmosphere is unmatched, the employees are great, and its an unbelievable workout. The owners had seen me come in on a consistent basis and i finally gave in and got a membership but had no climbing shoes. I come in a few visits later and get presented with some slightly used shoes for free. Couldn't be more grateful for the friendly and helpful nature of the gym and its employees. MUST VISIT", "date": "5/6/2013"}, {"review_id": "_DDOeIuBOQ_krKC-tRrInw", "user_id": "NOyWF5_CHGmroKtluuP7HQ", "user_name": "Wil S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hands down the best rock climbing gym for people who live in the LA area. Whatever you are into you should be pleased, whether it is bouldering, sport climbing or top roping. There are awesome new routes set all the time so you never get tired of the same old, yet there are also classics like the 5.10c \"A Hop, Skip and a Jump\" That is a must try and seems that it will never be taken down.I am a sport climber/boulderer and I can confidently say that Boulderdash has greatly contributed to my success of growing as a climber and having fun every week.If you are looking for a great place to climb plastic you cant go wrong at Boulderdash.", "date": "6/27/2013"}, {"review_id": "gIw9TEgnDTeX8O7CPBZGGQ", "user_id": "Mh7DJyMhiuOV8TTzsRrx7w", "user_name": "marcos d.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym and lots of very nice people at this gym. The owners Christian and Paul are both great and hands on knowledgeable people and their crew are the best. It could get crowded at times, but there is plenty of room for free climbing and bouldering. Overall, a great place to climb indoors.", "date": "4/6/2015"}, {"review_id": "KB6VGWIwqc4OWnK3G__vGg", "user_id": "dQxRYZ8Fdhhe4me5JSjpXA", "user_name": "Abe H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "highest walls and some of the best routes you will find around here. Clean, and plenty of wall space. And... they supply their own ropes for lead. Never seen that anywhere!", "date": "4/12/2012"}, {"review_id": "OUL-WtyHYW-nWRUl3WS1SQ", "user_id": "wAd9hGeWm5NPuLaMRR3k0w", "user_name": "Tom E.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I've been climbing here 3 times a week for over 9 years.  This gym is fantastic.  Starting with the owners, Paul and Christian, it's very friendly and welcoming.  Paul and Christian are both great guys, who make being a member of Boulderdash truly like being a member of a club.  The gym itself is great, with tall walls, lots of routes that are regularly changed by professional setters, plenty to lead, from 5.6 to 5.13, a bouldering area, a locker room for changing, a party room where there are yoga classes and fitness classes, a little mini pro shop that has what you need if you forgot or lost something.  The regulars who climb here are all very nice and very friendly, and there are often climbers here who are very strong.  We've had pros come through, spend some time climbing, help with advice and tips.  I can't say enough about what a wonderful rock climbing gym this is.  I've made some great life time friends from Boulderdash.  Come and climb!", "date": "7/18/2014"}, {"review_id": "54EcCDNoszhYXMHvQOBD7A", "user_id": "TtAWpfG3QOcVzWvB0jwGew", "user_name": "Dave M.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been coming here since they opened. Super cool, nice, helpful people. Simply put, a rock solid (get it?), well run business.", "date": "3/23/2015"}, {"review_id": "bj3ob0FXi7qLp_jMW61tKQ", "user_id": "kghcOfL1WV0Wmp-DxzMokA", "user_name": "M H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 2, "useful": 6, "funny": 0, "cool": 0, "text": "I've been going to Boulderdash for a while now, and have pretty mixed feelings on it:Pros:Tall wallsLots of routes and boulderingClean and well ventilatedTop rope and lead climbing on good ropesCons:Relatively expensive, especially for memberships (initiation fee + 3 mos commitment)Awkward route settingInaccurate sandbagged gradingMixed reviews on staff, some can be doucheyIn conclusion, if there was another gym within 30 minutes, I would go there, but until then, Boulderdash will do for pulling plastic.", "date": "8/3/2011"}, {"review_id": "0xpcmy7JZtsFhWuT7U9mMQ", "user_id": "GE2vdeZ4kgKqFsjN8P7cSQ", "user_name": "Brian S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 11, "funny": 4, "cool": 4, "text": "Best piece of advice: Men don't wear short shorts. You don't want to show your fruit basket to all the ladies while you're climbing. This place is covered with climbing walls and is the real deal with gear for rent and walls for beginners and pros alike. When I suggested we go down to the Pantages (yelp.com/biz/pantages-th…) to see Wicked (yelp.com/biz/wicked-the-…) my wife counter-suggested that we go rock climbing instead. Surprised by her \"off the wall\" idea, I found Boulderdash on the web, gave them a call, and they had room for us in their Friday night class. We took a two hour lesson and by the end we were scampering up with no problem. They teach you how to tie a figure 8 knot that will pretty much be the only thing keeping you from falling to your death if you let go. So you better know how to tie it well! They also teach you how to belay someone and how to do multiple gear checks. Finally, you do a few practice climbs and safety fake falls so you get used to everything. Then you just climb. There's something about climbing that's very basic and clears your mind while filling your body full of adrenaline. You reach the top, look down, satisfied with what you have accomplished, and then slowly float back down. The class was $40 each and they even said we could stay longer to climb if we wanted to. Unfortunately the babysitter was sucking up our money and we had to return to reality. Now that we took the class, if we want to climb anytime it will only cost us $15 each plus $6 to rent the gear. Ideally we would go with our kids so we don't have to pay for a babysitter. While we were there, we saw some 4 and 5 year-olds climbing the walls with no fear at all. The place had a locker room, bathrooms, and a classroom. Everything was very clean and professional. The instructor was a young guy who had been climbing his whole life. He was easy to understand and very patient with us climbing noobs. Next time, I think we'll grab some Thai food at Thai Westlake nearby (yelp.com/biz/thai-westla…) before we climb . It was a lot of fun.", "date": "3/27/2008"}, {"review_id": "XrLy9AeuRjD1hDbkVo3dkQ", "user_id": "op9dze5qkUaPxgNFXa8v_w", "user_name": "Gillian C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very good climbing gym with decent facilities and routes that will challenge you. Friendly staff as well, which made the experience nice.", "date": "12/16/2014"}, {"review_id": "Uttq88aP7kd4CcLYFKmUVA", "user_id": "j7tsPeaPeZJC4N5c5ss0EQ", "user_name": "Adrian M.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "Very rude, would not accept my Groupon Voucher after expiration since I was unable to book an open climbing reservation since they are very booked up...most Groupon deals have accepted expired vouchers when they get booked up so much, take a hint Boulderdash...could have had hooked climbers for life!", "date": "10/30/2011"}, {"review_id": "L5QdMjtW6VOkd4k5HwN2gg", "user_id": "IgksC7LEUmYmxzJ66YHjag", "user_name": "Lyndsie K.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good routs, helpful staff, it was my daughters first rock climbing experience and she keeps asking me to go back!", "date": "6/26/2012"}, {"review_id": "xMcRRPbRpkfbXyTsN9GZaA", "user_id": "b643Vieir377MppTJdTFZA", "user_name": "Andy K.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 5, "funny": 0, "cool": 0, "text": "All I have to say is that this was my first visit to this place and I was shocked to see how rude the service desk employees were. There were 3 guys who were working and  spent  more time rock climbing themselves  then actually  helping the  paying customers. Then it came to the condition of the place. There were power  tools and all types of screws and loose rock wedges all over the floor,and there were children and adults who were climbing and falling and no employee seemed to care. I am shocked that they even allow this type of condition to exist.  There was no one doing any repairs so there should have been no reason why these tools were not  picked up and put away, had only the employees only been doing their job, then this wouldn't have been an issue. Overall no one in this place seems to care about anyone but them selves. They charge $20 for crappy place. Your better off going to another place where people actually care and you are respected as a paying customer.", "date": "5/26/2013"}, {"review_id": "wW91PtAUes7dgKi1QBic5A", "user_id": "UWo8jD2MHlTBF2JfAJXSUg", "user_name": "Mianna A.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 5, "funny": 1, "cool": 1, "text": "Boulderdash was great for our son's 8th birthday party as well.  We had about 8 kids, boys and girls and they got 1.5 hrs of climbing and .30min for food.  They give you a little (too little actually!) room to have the food/cake in.  They offer  you use of a fridge.   They offer you the phone # of a pizza place right in the same complex that gives you a discount.  We were very pleased.  Only negative....some of the little kids have some fears about the climbing....while I understand the staff's encouraging the kids to conquer their fears and not give up....sometimes they were a bit too hardcore on the kids and it was a turn off to the parents. If the child wants down from the wall....let them down!", "date": "9/30/2008"}, {"review_id": "_u3DAZ4PSBos5a0pm8vUHw", "user_id": "wl9oBFgDiizBiJB0ORFZAw", "user_name": "Julien M.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Finding time to climb outdoors when you're at school all day (like me), work, or taking care of the kids can be tough. So.. Why not try indoors? First off, Boulderdash is my second home. I've been to the ARC, Rockreation, Sender One, and countless gyms littered throughout Southern California. I've yet to find a place that can compare to Boulderdash and the diverse routes set here. Whether your looking for some prep for outdoors, a hobby, or something to keep your kids occupied with (by the way, these guys are very patient and take great care to make sure your kids are safe while climbing); Boulderdash is a great place for beginners/novice climbers. It's great to come to an indoor climbing gym and not have to deal with pretentious individuals who work there or are frequent climbers (sadly, this is a rare find within the climbing community). And thank you to Christian (\"cheers\", dude), Paul, and the rest of you guys/gals at Boulderdash. Give this place a shot and become apart of the community. Age, weight, and height are irrelevant when you're on the wall (with the exception of the \"extremes\" of each category). Go climb!", "date": "5/8/2014"}, {"review_id": "yyQO6RmgYhcJ3Cayq1ofKw", "user_id": "vwnoexXzQHKnKX7aDZYm_A", "user_name": "Samuel S.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing place but could use some exercising equipment, compared to many other climbing gyms it is extremely inadequate for how much they charge monthly... They seem to also be transitioning over to more family parties and birthdays rather than catering to the aspiring stone master. This is however, the only plastic climbing option in the immediate area.", "date": "10/11/2014"}, {"review_id": "_OqX3s1cDUSuMlKEok67fg", "user_id": "vWTX93pxa0IPu1iLCcSI-w", "user_name": "Elizabeth C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "Plans for a bachelorette party I was throwing got rained out, so we needed a last minute activity.  I called up Boulderdash looking for lessons, rentals, and gear for 10 people.  The person on the phone was extremely unhelpful and not willing to accommodate us at all.  I was hoping with a large group, he'd be willing to help us out, but apparently that was unheard of.  I was so turned off by his rude manners and lack of customer service, that I'll never go to this gym.  Instead, we went to the Arcadia Rock Climbing gym, where they were more than willing to have us and teach us the ropes (yes, pun intended).", "date": "3/1/2011"}, {"review_id": "1C1ccUwDfgHzAwkHsvUL8g", "user_id": "Ni1jvO9NGJELaJU4UAJOVA", "user_name": "Brandy T.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is awesome!!! The staff are super friendly, knowledgeable and good at making you feel comfortable if you are a beginner. My boyfriend took me here as a surprise because I kept talking about wanting to rock climb but having no idea where to start. So our first night there we took the belay class and our instructor was excellent at his job, he made it fun, easy to learn and in only 2hours which flew by! If your looking for a place to start this is it!! These guys are good at what they do! You can tell they have a passion for the sport and are eager to share it.", "date": "9/8/2013"}, {"review_id": "4EJ0D0vC8Zt_VqZm_vWppg", "user_id": "UsYrkirFWz011nIm1278HQ", "user_name": "Mike N.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice climbing gym.  Staff is extremely strict, but one could argue it's for safety.  Prices are higher than I think they should be, but overall it's fun place to go climbing with high rock walls.", "date": "9/22/2011"}, {"review_id": "KTACacsXhdwy7jAAz-5fXA", "user_id": "-EPd-2L4bb7CrOCJ5FA_8Q", "user_name": "Kali C.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been coming to Boulderdash for several years now and I love it.  I try to get here as often as I can with a few friends and I've brought a number of friends here over the years and they've all had a blast.  The gym is nice and big, with some of the tallest walls around.  There are routes for all skill levels, I've brought a number of people with me and people who have never even touched a rock wall before were able to make it to the top of a route or two.  The routes are well-marked and replaced with enough frequency to always keep you busy on something new.  The staff is extremely friendly and helpful and always seem genuinely happy to be there and helping you.  The gym can get kinda crowded at times, but for good reason--this place is awesome!  Their top rope class is great and  perfect for first-timers.  I love their discount nights, I always try to make it on Monday night for Ladies' Night!  I'm also looking forward to climbing at a cheaper rate on Fridays for College Night once I start grad school.  I can't recommend this place enough!", "date": "3/12/2013"}, {"review_id": "jEvvaqTUobgkzo3_EMp_Kg", "user_id": "PpHLbM0QPHSn83cnduxWOQ", "user_name": "V. V.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The only reason I did not give 5 stars is because I want them to expand to a larger facility.  The people here are very helpful and make you feel empowered about trying this even though you can tell they are all hardcore climbers.  My kids have been bragging all spring about going to the summer camp here and I am so glad I called in advance, most days book up quickly.  The kids are exhausted from all the fun the camp provides and upon pick up, I can see all the kids begging their moms to sign them up again for the next day!  This also looks like a great date place in the evenings as I have seen couples come here after work and have a great time.", "date": "7/18/2013"}, {"review_id": "gSlWghoC54n0hvwAj_dZJg", "user_id": "_IQyReEOGLrlOeTOAKki0Q", "user_name": "Sherry J.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "First off I have worked and managed a climbing wall in Northern CA so you can say I am worth my salt in my reviews of climbing gyms. I love this place I am more than willing to drive 30 miles out of my way to climbing here. The gear was in great shape, there was a lot of different types of top rope and bouldering problems. The staff was easily approachable when you had questions and more than willing to help you with anything. They were so helpful to my friend who was new to climbing understand how to tie in and assisted us in finding routes that she could climb. The staff even got a game of add-on( a game just like follow the leader but with climbing moves) going with us and other people who were climbing. I highly recommend this climbing people.", "date": "7/20/2011"}, {"review_id": "OuZ70akHmjk8N5brkpZDtg", "user_id": "QeNGyDvqwLnSJ0mdWDZb2A", "user_name": "Ken H.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Boulderdash was good fun for our 14-year-old son's small-group party.  We did the \"open climb\" period on a Tuesday afternoon for $20 each for 45 mins and then all the free bouldering they could handle (included shoes and equip).  This is a decent value, but be sure to arrive early to suit up and be ready to go right on time, since 45 mins goes fast with 6 teenagers.  But the staff was great to add on an extra belayer.  Our boys liked the tall heights (up to 40 feet) - which is unusual for an indoor facility.  A clean, relaxed place with kids to super-experts.", "date": "6/15/2010"}, {"review_id": "x6I1ro11wKbp3L0s8gKl4g", "user_id": "EV7Zj6Jyf2tcuFB2Fv1shg", "user_name": "James P.", "business_id": "PDbuxryXvx3usOLVNMOF0Q", "stars": 5, "useful": 6, "funny": 3, "cool": 3, "text": "As an active Yelper and climber I found if funny that I have never said any kind words about Boulderdash (Considering that I am there at least 2 times a week.)  I have been climbing for about 13 years and have been to numerous climbing gyms and areas around the world and Boulderdash holds up well.  The facility is very clean and family friendly and not a chalk dusted dirt bag dwelling like some gyms.  Also there is none of the tude that you get at lets say Rockreation from a bunch of poser \"actors\" that think they pull hard and work lame boulder problems with their shirts off.  Boulderdash has some great lead routes and long routes as well.  The positives truly outweigh the negatives, but there are a couple.  The bouldering is good but rather limited.  Routes are the main attraction here.  Sometimes the routes seem to stay up longer than necessary.  Finally I have to give two of the owners a hard time (Christian and Paul) about their occasional choices in music.  Enough, Rush already!  All in all a great 4 to 5 star experience for newbies or seasoned pros.", "date": "11/30/2008"}]