[{"review_id": "4VKBNDSZ9gTwdGUq40b9Lg", "user_id": "KkiGd_-z0X4xl957qwB2TA", "user_name": "Courtney K.", "business_id": "lmVDhvvk7bwoRf4YwUslVw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "We had an AMAZING experience today. My four year old daughter wanted to rock climb for the first time, and we went to Boulderdash not knowing what to do or expect but wanting to help her to try something she was interested in. The extremely professional staff accommodated us on the fly. My daughter became afraid once it was time to climb. But Cat took time to quickly and gently build a rapport with my daughter, and ever-patiently worked as her belay to help her make it to the top. My daughter left feeling accomplished and more confident thanks to Cat's positivity and encouragement. The facility (including the bathroom) is extremely clean. Plenty of space, great lighting, and a stimulating array of climb options. While we were there, we saw kids and parents, couples, novices, and advanced climbers. Lots of smiles everywhere. Great, positive atmosphere. Whether you've rock climbed before or not, Boulderdash is a must-visit. We're so glad we did, and can't wait to go back.", "date": "2/9/2019"}, {"review_id": "HRLxsPGaz7TzN0EN4Su-eg", "user_id": "rmjMSxj4-3SgD8TuFrXMEA", "user_name": "Olivia D.", "business_id": "lmVDhvvk7bwoRf4YwUslVw", "stars": 2, "useful": 1, "funny": 2, "cool": 1, "text": "Was told I didn't pass my belay test because my feet came off the ground when my partner who weighs 160 lbs took a fall (I'm 100 lbs).It is true I wasn't used to their dynamic rope as SBRG uses semi static but I still didn't think I had done anything unsafe or in a way that would warrant not being allowed to belay.Overall I think the staff is nit-picky and condescending and the routes aren't as good as what you'll find in Santa Barbara or SLO.", "date": "2/17/2019"}, {"review_id": "b-FQ13Zn3J5tkG2DPHDy-A", "user_id": "qm-BSoJroRRaNsy2rMTGZg", "user_name": "Greg B.", "business_id": "lmVDhvvk7bwoRf4YwUslVw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Thank you for opening a killer gym for the Ventura climbing community!   It's been a long wait since you guys announced wanting to open a gym here but was worth the wait!   Pro route setters and a nice top out boulder too!    Lead climbers just remember to bring ur own rope.", "date": "3/6/2019"}]