[{"review_id": "AFiXaMCHh6iS8sL55OYCjw", "user_id": "4yDArYKnJySEJLdDGdKk7A", "user_name": "Katie E.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Check-in is a breeze if you fill out the waiver online beforehand. You can save big if you check Groupon first. Tons of fun routes for a smaller sized gym. Some of the routes were much taller than I am used to.The grading seems to be pretty standard here.", "date": "2/16/2019"}, {"review_id": "W1QpcSZW-utOosAex9S5jw", "user_id": "NndVaIh6xERrhhhTt8aypg", "user_name": "Melanie M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love it. It's close to where I live. I love to go here anytime I can. Seeing all the athletic people, challenging myself, and having fun. It's true, that there's not as many beginner rock walls as there was before. But I love going there for the saunas, the work out, slack line, and with friends. The people who work there are super awesome. You can choose to do harnessed climbing or bouldering.", "date": "5/18/2019"}, {"review_id": "pVXlYkYcvrcD7lOyWbz_yA", "user_id": "FTxzr5lZ3fc6wES74JIedA", "user_name": "Megha T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "One of my favorite hobbies I've developed after living in the Bay Area! I have friends who are avid climbers and had convinced me to come try. As for bouldering gyms go, Bridges is amazing!They reset routes every week, so you never run out of problems to attempt. The problem designations (V1, V2, etc) are pretty on-point as for the difficulty of the sets. As someone who has just graduated to V2 problem sets, I know I will be coming back to Bridges to continue leveling up.The professionals are knowledgeable and helpful and the facilities are well-maintained. There's a weight room and treadmills upstairs, and the bathrooms are always clean and well-stocked (not to mention the sauna!!).Cost-wise, Bridges is pretty typical of climbing gyms and offers discounts for college students and commuters across a bridge. They often have Groupon deals, and if you're new, you can try it for free using a member's bottomless new climber passes! Heads up, it also costs $5 to rent both a chalk bag and shoes.", "date": "6/5/2018"}, {"review_id": "KokROT0a_VgImEi-cTJeBQ", "user_id": "43XMD-lFMjS-hSGc-kFw4A", "user_name": "Victor G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "If you see my profile pic, you'll realize I climb religiously. And it all started at this gym. I've checked out all the gyms in the bay. But none of them make you feel at home...unless your at BridgesThe staff is incredible, really friendly fun group.The showers are always cleanThe towels are soft towelsBest soap and conditioner I've ever used The routs are fun and creative Slack lining is a fantastic pass timeGreat classes for experienced instructors Gym Is small but well put togetherJust like homeIf it's your first time climbing.A:stretch your fingers and warm those puppiesB: when walking around the mats look above you and around you, those holds can slip and people can go flying.C: It's a good practice to spot your friend in the wall, making sure nobody walks under him or herE. If you get stuck on a problem it's ok to ask for help. F. Have fun, meet people, be safe!", "date": "7/30/2018"}, {"review_id": "d68tGAlgxHCIZXXkOZjuAQ", "user_id": "W5L2KJZ6KVVI-SXG88gPqA", "user_name": "Ed W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came around here the other day with a friend because my gf and I decided that we wanted to get into bouldering a bit more, and also because we have a friend who comes to climb regularly. What's pretty cool is that if it's your first time at Bridges, you can go in, free of charge (but I believe you have to have a member take you in), and it doesn't even take up the member's guest pass. Another thing that I found interesting is that once you climb to the top of a wall, you can climb over the wall where they have a platform for you to walk to a \"ladder\" to take you down; this is something I have not seen before at other rock climbing locations. Additionally, there are also some standard gym equipment for you to use, like many other rock climbing gyms I've been to. The gym itself is not huge, but is sizeable enough to not feel crowded with other climbers in the gym.One thing to note is that the shoes for rental are in women's sizes, so if you're a dude, order one size up!Having been at both Ironworks and Bridges now, I think I'm a pretty big fan of Bridges, just because of the sheer amount of wallspace for bouldering. Hopefully, we get into climbing more, so that we can come here more often :)", "date": "4/17/2018"}, {"review_id": "G22UTI89P9kAVLuo5rtxiw", "user_id": "juQb9Gmga_DC6QGCZfEu3g", "user_name": "Hannah H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I joined Bridges during their summer special this past June. I am so happy I joined! The staff is so friendly and I especially love the spin and pilates classes. I'm still working up the courage to try climbing, but I know I'll give it a go sometime soon. I really appreciate how friendly the instructors are and the weight room area!", "date": "9/10/2018"}, {"review_id": "aUD7oZ1no-p8ZmObWzo23Q", "user_id": "O7URsBFp5CG5_ODrHj_aRg", "user_name": "Joe M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This has been my home gym for the past 3 years, and I could not love it more! It may not have all the bells and whistles of a Planet Granite or Touchstone gym, but it makes up for it with a tightly knit but extremely welcoming community (and of course some righteous slacklining).Just to be clear - Bridges is a bouldering gym. They do have some toproping in the back, but this is more for kids' birthday parties than anything.The reason that the routesetting is so awesome here is that they reset at least one wall every Tuesday, so you never run out of new problems! Each wall stays up for about a month so you have ample time to work on any given problem. Plenty of slab, overhangs at varying degrees, and a pretty decent-sized cave considering the size of the gym. They do tend to grade a little easier, but I think they're addressing this issue by allowing climbers to grade a problem themselves during the first week that is up, then putting up the official grade based on consensus. Pretty cool system!This gym is very friendly to beginners. For starters, there's a 3-day pass for ~$30 on Groupon! They also have an introductory class that seems very helpful from what I've overheard during my sessions. Additionally, climbers here are super-helpful if you're struggling with the beta, and not condescending at all. That's what I love about climbing... even though it's an individual sport, there's no sense of competition between climbers; we're all just trying to get up that rock!As far as membership goes, Bridges is the most budget-friendly option. For those of you who commute across a bridge (waddup Vallejo), annual membership is only $360, which is a steal! They also have semester memberships available for students.Their other workout areas are pretty nice. I like that there are always slacklines up. The weightlifting section is much-improved since they added that huge power rack. Plenty of hangboards that you can swap out too! There are several treadmills and rowing machines upstairs for those of you who actually like cardio :PLockers and bathrooms are decent. Sauna room is nice. Towels available at the front desk!Parking is just ok. They have their own lot, but it's small and cramped. The gym is right across from the super-busy 99 Ranch plaza, but I can usually find residential parking within a few blocks.", "date": "2/23/2018"}, {"review_id": "xBRT_yjMkzLKncVubjypGA", "user_id": "lxORIr44WAB2IDMRCjRyrA", "user_name": "Steven B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Just took my seven year-old daughter and her friend for their first climbing lesson. Benny, the instructor, made it so enjoyable: the girls had a blast, learned a lot, and grew more confident and capable over the course of the hour. By the end, they were sending their chosen routes with ease and sporting big, proud grins. Snail fist-bump FTW, Benny, thank you again!", "date": "3/9/2019"}, {"review_id": "CdoQljoMl9U4UgYvpQtfgQ", "user_id": "rLOvJaglozbFJMM2YO7l1Q", "user_name": "Yossi B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A good place to workout. You really have different options to choose from and the staff is great. Highly reccomended.", "date": "1/4/2019"}, {"review_id": "r5yVXXwlVV-mSL2OHWKFTA", "user_id": "o7RevLtmn1d_h_SFUQWcoQ", "user_name": "Rahul R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "Honestly, I'm not sure how to rate a rock gym. I had a great time here with my friends. We climbed rocks, strategized our climbs, forced each other to try hard levels, held up one another as we climbed on the upside-down wall, took fun pictures, and exhausted ourselves through and through.The staff was courteous and helpful. I only wish I knew about the Groupon deal before we each paid over $20 for single-day passes, but I'll be sure to use it next time!", "date": "8/26/2017"}, {"review_id": "FHz-lDShch3rKdebUCW5GQ", "user_id": "bwBTC-rt3NsXCRhaqb1fWA", "user_name": "Sophia L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 6, "funny": 4, "cool": 7, "text": "TL;DR AWESOME ROCK CLIMBING WALLS + SLACK LINE!!PLUSES:+ SLACK LINING!!+ Got hooked by the Groupon ($25 for 3 passes, what a deal!)+ Hours basically all day for a regular functioning human + Affordable membership prices+ Right next to 99 Ranch+ Other classes + equipment in the gym + Friendly & helpful staff+ Shoutout to Andrew and Clara who helped my friend sign up for the SUMMER DEAL $130 for 3 months!DELTAS:- NONE", "date": "6/21/2017"}, {"review_id": "lqa5og9r3LLOHk0Qn6A9pg", "user_id": "HhXdkoeKws3JPMNyeJLnGw", "user_name": "sean a.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "This place used to be an excellent place for beginners and everyone however, they have reduced the number of routes to about 1/3 over what it had been several years ago. So it's far less interesting and challenging.", "date": "10/24/2018"}, {"review_id": "ry2AOtuqro5LbcsvL3oVgw", "user_id": "DmyBMPJPa1svRv_ZHbdp7A", "user_name": "Jacob S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "There are very few independent gyms in metropolitan areas left. This is one of them and it remains competitive in an area with lots of competition. I would highly recommend checking them out! (Also they have my favorite competitions)", "date": "3/21/2018"}, {"review_id": "0o9ho3LEO61mn2nv5pVrtw", "user_id": "nE1cdAll5MQFQhwQq0bTpA", "user_name": "Amy C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Climbing gym geared more towards straight bouldering. It's got a nice set up and all routes are marked. If it had more easy routes, I'd give them 5 stars. Everyone always crowds the easy routes and no one on the hard routes. Big imbalance. I would add 3 more easy routes.It's also got a decent slack line area.Has a Sauna :)Great yoga classes.  The yoga instructors have all been fabulous and it's in a nice quiet space. Yoga gets 5 stars for sure.Overall, a great climbing gym.", "date": "1/8/2018"}, {"review_id": "lotS-uq06Ytn25k2M5HWtg", "user_id": "hKXHZdm2HbHWOBECeccEqw", "user_name": "Raymond G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Having traveled around to visit rock climbing gyms I was excited to come back to Cali and try some of the gyms out here. I love seeing the different styles of the setters and climbing their routes. The walls here are tall!! Definitely takes some getting used to from what I see at my home gyms. Made finishing some problems a little hard because although I rock climb, I am afraid of heights. I think all it takes is a couple good falls from close to the top to improve my confidence a little. On the side of the rocks is an area for slack lining. My home gym only has one slack line. It was very cool seeing slack lines with different lengths, tightness, and hight. Much easy to get into slack lining here and a bit easier to progress as a beginner. Very cool aspect I would love my gym to take on is the peer rating for the routes. After completing a route a person can vote on the difficulty they feel the route is and how much they like the route. Very Cool!!    There is also a good sized weight gym here. So when you're not climbing you can lift weights! This would be huge for me seeing that I currently have a gym membership and a rock climbing gym membership.   The bathroom are big and clean. There are lockers that one can lock if they feel they should.    All in all I loved my experience here and I will come back the next time I'm in the area!", "date": "11/28/2017"}, {"review_id": "zBJUA6jcTJ7MaP3R4LFBzA", "user_id": "neHoI7PqbvbEB-uEwQn7Og", "user_name": "Koko M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 1, "useful": 3, "funny": 6, "cool": 0, "text": "First time experience, I would say don't have extremely high expectations about the greeting process. It's a little corner lot just North of Pacific East Mall. In fact you can go through the parking lot and out the side/back and see the gym from that angle much better.I walked in and you have to walk through a gym area with no representatives to even get to the front desk. At the front desk there were 3-4 guys all in the middle of conversation and so being acknowledged took a bit longer than it should have. I felt like more of a burden then a welcomed new potential longtime client. I was instructed to fill out their waiver form, which is what I arrived early for with a pen ready. No pen required it's all electronic and they are set up pretty high so if you were on the shorter side you might have some problems. They do NOT have paper versions of this waiver. Also once you submit you do not get a copy of the waiver, even if you ask for one. I think that's pretty crappy in this day and age why would you not offer a copy of a legal document to the person completing it if they asked.  Not okay!Needless to say no return visits for me.", "date": "1/11/2016"}, {"review_id": "Gxnkce7fjX0Zqgo2xy7Jrg", "user_id": "3Mb1EuImvuG97gnMNfh-Ig", "user_name": "Brennen D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Dope spot to boulder and gym at. Membership won't completely break the bank like other rock gyms. They recently added a whole bunch of workout equipment making the place even more versatile. Slack lines and a cave is included. You can rent your climbing shoes/ chalk there or bring your own shoes and chalk. They have a small parking lot, but you can also park by the pacific east mall parking lot too. Staff is friendly! Highly recommend checking this place out!", "date": "4/28/2018"}, {"review_id": "lvEFENb8wg1LLkdfxBho1A", "user_id": "90U9Qgse46LfGRP3dGNOgw", "user_name": "Ryan S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Great experience climbing here for the summer. I wish the membership included shoe rental, it was a hassel paying for rental every day that I wished to climb (an extra $5 a day).Nevertheless this is an excellent gym, great for kids and skilled climbers a like. Also, I would suggest that you go super early as few people are climbing, lifting, or running from 6-7.", "date": "10/28/2015"}, {"review_id": "k1XO8hkMBHLuXSkfL8ntmg", "user_id": "9XQVTLej-QUOUoOIyURWOw", "user_name": "Celine K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Went to the gym for the first time after I bought the Groupon online . After reading the Yelp reviews I had a clear expectation of being greeted by stinky shoes.The check in process was pretty seamless and we were given a laminated instructional sheet with all the rules and basics of bouldering. It was a little crowded mid morning but everyone was pretty good about sharing the space.The biggest star of the gym was no doubt Patrick ! He was so chill and awesome! He took the time to show us the right way to \"fall\" and highlighted little tips for beginners . Mid way he came back to ask us how we were doing! He even took the initiative to teach us how to slack line! He was so encouraging and knowledgeable! His presence definitely made the entire experience worth it! We will be coming back here, no questions about it! Whoever's his boss should totally give him a raise !", "date": "3/11/2017"}, {"review_id": "2Tc_sJ7zOwUzHGgZQxzbEQ", "user_id": "QdgPOI2jVGAs4M18bx5ebw", "user_name": "Akash P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "The only place I've ever gone bouldering, so sorry don't have anything to compare it to. My most recent experience was the after hour event on a sunday night. As an organization, we had the whole place to ourselves after hours. It was great because the workers were still there talking to us and helping us out when we needed it. Because the group had a LOT of beginners, it was good because they felt comfortable enough to just go for it and try. Also, for those that were already here, there were some good number of trails that were challenging enough. When people got tired of bouldering, they were able to play and try the slack lines which was great. All in all, great experience and props to the staff!", "date": "1/28/2016"}, {"review_id": "g8OxQDNne2Eim90_z6HNiw", "user_id": "aKcehnoot5pkZt5keAP6Tg", "user_name": "Bryan W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "Went to Bridges Rock Gym for the first time a couple days ago and I was pretty bummed that I never, in my four years at Cal, took the chance to come to Bridges. It's so CLOSE to everything and located RIGHT next to 99 ranch.When you get to the location, try to park on the street or at the plaza where the 99 ranch is. The parking location is pretty small, and so you probably won't be able to find a spot. The hours can vary and so make sure to check when Bridges is open.My friends and our club had a special reservation (yes they have this!) and so we got access to the after hours at Bridges. Apparently, thats when all the workers come out and play and show off their skills. Even if we did pay for everything, passes are cheap and so are equipment.The cool thing about Bridges is that it's a GYM! There are treadmills, weights, and even a locker room. But anyway, the bouldering area is amazing. I never went before, and I definitely had a workout climbing up some of the walls. Note that \"V #\" stands for the difficulty. Apparently it can take 2 months to get to V2 and forever to get to higher levels like V9. The service was probably the best part. It might have been after hours, but the guys who ran the place were super chill. They gave pointers, climbed along with us, and showed us around until we left.Overall, had an amazing time at Bridges. I'll definitely keep coming back to boulder more.Have fun and prosper,", "date": "1/25/2016"}, {"review_id": "jnXGHQ_QDhdMI0o3vYCivA", "user_id": "qS3vXc7nirB28WzYyVvRBQ", "user_name": "Denise J.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "I've been getting out of my comfort zone and mixing it up with new physical activities. I found a Groupon deal for a 1 day pass, which included my shoe rental. I will say that the shoe rentals were smelly, so if you're serious about climbing, invest in a pair of climbing shoes.Since I'm new to climbing they gave me a form to read over which included rules and safety instructions for both climbing and slacklining. I didn't grab the name of the two men working the day I was there, but they were both extremely knowledgeable and helpful. One guy explained the routes to us and went over the proper falling technique.  I personally need to do some more strength training, so I found it to be a bit challenging even on the easy route. We also checked out the slack line section during our visit and had so much fun! I've seen people doing this in parks before, but didn't know what it was called. I love a good challenge and I plan on returning!", "date": "12/17/2015"}, {"review_id": "JBu3c3M_tbBT72kY3wce7w", "user_id": "JzJiwo8QacUEU3WMz6Trng", "user_name": "John P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I was a member here for 5 years and had an overall positive experience and I was very hesitant when I finally ended my membership.My positives are as follows* Very friendly staff who learn your name.* Laid back patrons. Very welcoming environment.*Great classes with cool instructors. I love the review of Doug's spin class. That person is right on.*Always changing their routes. Great levels of difficulty. *Staff is kid friendly. In the summer they have a good summer camp and the routes are good for 5-15 year olds.*Towel service with really good towels.  I think they get them from bed bath and beyond. *Weight area was never too busy. Could crash the \"X-fit room\" when X-fit wasn't there.The only reason I gave them 4 out of 5 and ended up leaving was the cardio equipment. The gym really is a bouldering gym that has classes and a only limited assortment of cardio equipment. Because of this, there was a lot a wear and tear on the equipment (4 treadmills, 4 ellipticals, 3 lifecycles). The treadmills seem to break down at an alarming rate and 1 of the lifecycles seemed to be KOed for a long time. So I often couldn't do the workout I was supposed to because of broken equipment.  Note, this may have changed since they kept saying they would expand the cardio area.", "date": "1/26/2018"}, {"review_id": "Fw7d5RqdMEHFeWalmcnR2w", "user_id": "TS17CO6PhtV-PRM_K5Z8xg", "user_name": "Ellyn B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I almost don't want to write this review and spoil this little gem secret...Been going to spin classes with Doug for quite some time and let me just say he's the best. I am thoroughly exhausted after each class.  He's a really cool and upbeat dude and he really pushes you. I use this as cross training for my marathon and I could not have picked a better choice. I think I'm in the best shape I've ever been and can definitely thank him.The rock climbing facilities are good and I love the fact that towel service is offered. Great view watching the climbers from the treadmill.This place is awesome", "date": "1/23/2017"}, {"review_id": "1PZGWlDGU_XJ-sG9wnMYaw", "user_id": "bkTlml2a9GORLMuW8Nm5Og", "user_name": "Ade P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I recommend this gym for everyone, the staff is always friendly and happy to work there. Fun place to rock Climb, plus all kinds of other classes to take. My favorite was kickboxing with the instructor Vincent and had fun lifting weights !!", "date": "10/5/2017"}, {"review_id": "-PMAaun7gxeRoG7OkXPJdA", "user_id": "YWofbgLMTftDuOXpbYSGFg", "user_name": "Michelle G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "If you like bouldering this is an amazing place to go.  The gym is huge and its all bouldering with the exception of a section for slackline.  So many problems to try and not enough time.  The route setting was unique and challenging.  I definitely left with some in mind that I still wanted to figure out.  We just had one evening there with some friends while we were in town but wish we had more time.  The gym is nice and open with a LOT of problems to try.  Routes are now done with the pieces matching the color which I like, makes the walls look cleaner then having tape everywhere.  If I am in town again I would definitely come back.  If you have never rock climbed this is also a great opportunity to try it out and there are lots of levels of difficulty to try out.", "date": "8/30/2017"}, {"review_id": "2kAUv1KvcizQQ9q1EmBlZw", "user_id": "d7lu_bBZwVE_a-vF3oE8xg", "user_name": "Sandy W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 2, "cool": 1, "text": "First time rock climbing and it was such a fun experience! The front desk was super nice, the guy who helped me was super smiley! Since it was my first time there, I had to sign a waiver on the iPad. As soon as I finished, I was able to get my shoes right away. I used my Groupon deal, which included the shoe rental and chalk. Although it was a bit crowded, everyone was really nice. My only complaint were the shoes. They smelled soooooo bad and they were kind of damp? It was disgusting. I would definitely return. I would bring my own shoes next time :)", "date": "8/20/2016"}, {"review_id": "mfkqM3hqi99KZx8YaaPNUg", "user_id": "PDD4A0M8AFobj6tzfknWYw", "user_name": "Felix H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "If I didn't live in sf, I would switch from touchstone to this gym. Let me get the not so goods out of the way first. No top roping, less bouldering than dogpatch... That's it? Now the goods.. Of which there are many.The bouldering is great here, especially for those who are newer. I brought friends who were first timers and the were able to climb some of the v3, v4 routes since it was more strength focused. However there is still lots of technical paths and a full technique wall for those more serious. Cave is really fun and I could spend hours there. Good range of difficulty so all types can enjoy. Open slack lining and free classes every Saturday! Easy enough perk to take advantage of if you want to try it out. Full gym, yoga classes, sauna. This place really has it all. Even if you were just looking for a gym membership with occasional climbing, this would be a great deal. The staff are very friendly and helpful too! Easy to talk to and there to help whenever you need something. If you're just looking to try out climbing, this is a great place to start. Pick up the groupon for an even better deal!", "date": "8/29/2015"}, {"review_id": "B5njWB6IGDb3RL7U7l2CCw", "user_id": "NjfSkOTtpNzZrQzo8i4Zcg", "user_name": "Gab R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I have been wanting to explore rock climbing for a while and the Intro to Bouldering class with Jesse sealed the deal.  He was very encouraging, enthusiastic, and read us and our ability level really well.  My partner and I signed up under a couple's membership and are enjoying the benefits already.  The slack lines and gym are great for breaks from bouldering.  FYI, this is a bouldering gym.", "date": "10/30/2016"}, {"review_id": "MYy3afwtaRD5lNZCjvnQjg", "user_id": "6Yi-viaZvoA-xyrMmsgrAw", "user_name": "Robin Z.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "They have a cheap Groupon pass $26 for three visits, much cheaper than most rock gyms' single day pass, which is around $25. The downside is that it's usually pretty crowded. But nice thing is that people there are super friendly and staff are very chill too. I hope they can clean their rocks more often so that they're not often smoothened by the extra chalk on them. ;)", "date": "9/10/2017"}, {"review_id": "4jS9Jozev2MJl_Q20jFGnw", "user_id": "YIzKtQUsXMFtPA6YYGyfJA", "user_name": "L. B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Bridges is a great little gym! Given the quality and diversity of their services, and the low cost of membership, they're way more cost-effective than Touchstone. They offer a standard set of gym equipment, a decent weight room, access to a sauna, slacklines, and fitness classes for members at no additional cost. Additionally, Sonja offers awesome sports massages and has made a big difference in my recovery from a back injury.The only annoying things are that it can get very crowded, it tends to attract some obnoxious children and teens who disrupt people's workouts, and they rope off much of the climbing walls for several days surrounding bouldering competitions. Honestly, the price and atmosphere are right, so those issues don't affect my opinion of the gym.", "date": "3/19/2016"}, {"review_id": "2z4Ft3mYDePWN7JWC6sL0g", "user_id": "jm0kgXVEdcQ_tQNzsoNXRw", "user_name": "Chiquita y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 3, "cool": 3, "text": "Went for a massage with Justin, who seems like he might be kind of new at the gym. So here's my review!Setting up the massage, I called in to the number listed on their website, and eventually a massage person called back. She had me go online and fill out their waiver form, then call into the main office to help me redeem my Groupon in time (it was expiring soon). She gave me a convenient time slot for the massage, within a half a week.Arriving at the gym for the massage, I came about 10 minutes early, which was good, because they had me fill out another form (besides the waiver) about my health history, sore muscles, etc. Then I was to bring the form to meet my massage practitioner, Justin. I recalled from another Yelp review that it was kind of a bummer to wait in a rock climbing gym, as opposed to in a day spa...but I didn't have to wait at all, was greeted immediately upon entering the \"massage corner,\" even though I was still a tad early.Justin's massage started with a couple of minutes of touch without any oil--I was reminded of the feeling of rubber, and was wondering if a sports-style massage doesn't use oil. But then, with oil, he massage my back, concentrating on my lower back. I won't lie, it was a little painful, but I decided to go with it. Glad I did, because the massage seems to have opened up some kind of new energy for me. I found myself thinking about a professional problem that's been plaguing me for a few weeks, and I came up with a solution. Do  you think massage brings oxygen to the brain? The rest of the massage felt great--no pain, even around my knees that had been troubling me. I don't know much about what a sports massage would be like--I've mostly gone to day spas out of town while on vacation--but the style of this massage wasn't radically different than the others I've had.The \"massage corner\" was darkly lit, no audible noise from the gym right outside, and In the background played some great piano music (not New Age, thank goodness, more like Jazz/ Classical/ Improv).  Nice paintings!Used the restroom while I was there, it had a sauna and showers. I didn't ask specifically whether massage clients could use them, but it looked like a clever person might easily get away with it :-)", "date": "8/25/2014"}, {"review_id": "D3VyZXqsnPRA1hwg3VciUg", "user_id": "AE8nHSRPFlB4nh7CP8PlGQ", "user_name": "Tiffany Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 12, "funny": 5, "cool": 7, "text": "I have been coming here quite often since they have an amazing Groupon only $41 for 5 day passes!This gym is located next to an Asian plaza, since the parking lot is kind of small you could park in the plaza.  This is a bouldering gym, they have a top roping section but the walls are only 18 ft tall.  This gym has the tallest bouldering wall in America 18.5 feet, it is highly suggested that you do not climb this wall until you can climb the lower walls since falling from the 18.5 ft.. wall is dangerous. There are many different routes here from VB - V10 level. The majority of the routes are more strength - based, but they do have some technique based routes which I personally find a lot funner to do. They also have a cave which is where the more advanced climbers usually climb, unfortunately I do not have the arms of a spider monkey so I cannot climb the cave yet. This gym gets really crowded on friday nights.. there were at least over 100 people which was kind of unsafe since people were jumping every where and not watching where they landed. I love this place because they have many different routes all of different levels! You should come here if you want to get better at bouldering / work on your technique, the day pass is only $10 before 3, and $12 after 3 pm!!!! So even without the groupon it is still worth it to come and try at least once !", "date": "2/12/2014"}, {"review_id": "P8_9yx2rK0ODk0MJrGqwkg", "user_id": "TMb1kJaTlB9nkrIFHfdJMg", "user_name": "Rita L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 4, "funny": 0, "cool": 2, "text": "I was a little hesitant about coming here and trying bouldering for the first time. I just didn't see the appeal! And after my experience, I can't say it's my new favorite activity but this gym is pretty great. First of all, the staff is super nice and really helpful in explaining everything from prices (student night!) to how the heck to get started on those walls. Second, I was pretty intimidated especially because I went on a Friday evening and it was soooo crowded, but I quickly realized people there were friendly and also don't give a sh*t about how poorly I'm climbing. I gave it a good number of tries but I could never get to the very top so I went upstairs and ran a mile on the treadmill to feel better about myself. Then I mastered the purple slack line and it was a good night. Affordable prices with a variety of activities. Come here with friends even if not everyone is into bouldering.", "date": "3/15/2014"}, {"review_id": "_l0spzFFghIBNLxIfDGRHg", "user_id": "t9Bh8B5a5QUS9G_8OPlm2g", "user_name": "Madhuri K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "The place is pretty small and rather crowded. Parking felt impossible. But the perks are that staff is really friendly and we had a ton of fun.", "date": "3/13/2016"}, {"review_id": "oda2VjjilivouVu7Nnjlhg", "user_id": "83lK2Huqq_2jr4YUy8SUJA", "user_name": "Josephine L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "I go bouldering here occasionally. It gets pretty crowded sometimes, but I like that there are a lot of different walls available. They also have tight ropes that you can play around on if you want a break from rock climbing.The staff is always super friendly and helpful. Sometimes if they see you having trouble with a route, they come over and give you tips.The locker room/bathrooms are really clean. I'm kind of OCD, and I really like this place overall. Sometimes gyms smell, but this place does not.", "date": "2/3/2014"}, {"review_id": "KSUQIdqjqLKYxzeJHkQ34A", "user_id": "qSdYgBZy_je29J3lFLdNkw", "user_name": "Lynn C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "I am a total beginner!!! I got a groupon deal for this place and it was WORTH IT!!! It makes me want to get an actual membership! Too bad I live an hour away. This place is VERY busy. A lot of kids come here and they aren't rowdy so it make the experience a whole like more pleasant for a beginner like me. There are also a lot of hardcore people and if you're a beginner as well, don't be intimidated! There are a ton of beginners too!!! I wish there was like a pamphlet of how they do things here. They have color coded tape on rocks and a letter and number to show where to start. I wouldn't have known that if my bf told me. Pretty much if you're a beginner, find a starting point that has a letter, then a \"B.\" After you get the hang of all the \"B\" ones, work way way from 0-7. I'm not sure if there is more than 7. They also have a gym, kickboxing lessons and yoga.The bathroom is SO CLEAN!!! It has lockers, a SAUNA, shower, scale and lotion (for your tired hands). The staff is very friendly and helpful. Everything about this place makes me want to come back, and I most definitely will!!!", "date": "11/2/2013"}, {"review_id": "f6IXSfKiagMOk_fzj8U3Xw", "user_id": "ooMKf2nCbytTor8eLm5U1A", "user_name": "Darian M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "This gym is awesome. So worth the membership... even when I take months off ;) Seriously,1) bouldering: They change routes every week and they range from starter level to pro with some routes set to work on techniques. They also host competitions.2) Yoga: Awesome, talented instructors3) Spin: again awesome, but I'm biased.4) Weight room and other fitness/ dance classes: Love the weight room, haven't been to the dance or fitness classes, but they look fun!4) Kickboxing and Boxing classes: The main reason I go. Such a great work out and the instructors are super nice, not intimidating but very knowledgeable and love teaching. Seriously, Kickboxing and Boxing classes are the bomb-diggity (I know no one says that anymore but I'm bringing it back.)extras: showers, saunas, free towel service, massage therapy, and it isn't part of a corporate group. Front desk staff are helpful and fun.Finally, it's next door to a Asian Mall/Market which gives you some good options for post-workout grub.Check it out.", "date": "9/11/2015"}, {"review_id": "zdAGIfM6rctj1uJp8z7Y2A", "user_id": "MPynfWBGvn-OvOtqQcBhow", "user_name": "Rachel D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Bouldering, top rope, slacklining, and a gym all in one for a really good price? This is it, people. The employees are all nice and friendly, the crash pads are the best, and it doesn't get any better than this for beginner boulderers. I go here mainly for the bouldering wall, which occupies like 75% of the gym. And, I'm afraid of heights, but you get to top out on almost every side of the walls, and they have varying lengths and overhangs, as well as difficulties. Ok, it's by far the best climbing gym I've been to, and I had a terrible ankle sprain from climbing years ago, but Bridges helped me regain some confidence back. :)Bridges is such a chill place for even hang outs, so if you're looking for a great neighborhood gym, this place will meet your needs! Not to mention, they have yoga and other classes, too.", "date": "8/31/2015"}, {"review_id": "lNoXxbB0j-c_-lt4fStpiQ", "user_id": "i8JZ8QtG66o62ltV7VM2rg", "user_name": "Valeria F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is pretty cool!Online waivers, which makes it easy for kids to get parents' approval and come climb. $12.50 for the day of climbing or so, not including shoe rentals (which I imagine aren't strictly necessary if you have converse or sneakers). Good number of different walls, from easier to more challenging, each with appropriate route markings. While we were there there were a couple little girls as well as a good number of teenage/older boys, i.e. pretty varied in age but all still kids or young adults (guess that's the population rock climbing most appeals to ^^).The one downside: basically no harnesses. Which really limits you since you're at risk if you slip, and I imagine you can really hurt yourself if you fall from the top of one of the walls.", "date": "6/20/2014"}, {"review_id": "eXNuLvvG1U-LLaS7aGZNTQ", "user_id": "2AcvaCn0btmAHSDcCKMdZg", "user_name": "Alice H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 5, "funny": 0, "cool": 0, "text": "Tips:$6 for a one day pass for students on Friday evenings.$3 for shoe rental.This is bouldering, no harness needed!------------------------------------------------------------------------------------------This was my very first time experiencing rock climbing in general and I didn't realize that there was a difference between bouldering and rock climbing with a harness. VB and V0 are the easiest level paths and those were the ones that I was tackling. Rock climbing is surprisingly such a good workout! I can't believe that I never experienced it before, but my arms and legs were sore after climbing for so long.Bridges is a great place to experience rock climbing without a harness and for the student price of $6 I'd definitely go again!", "date": "5/10/2013"}, {"review_id": "gYXFbJj0jtn7SlTaK0xX8g", "user_id": "Fsem27qSDbpVACsIKJTaPg", "user_name": "Wendy L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 1, "useful": 4, "funny": 5, "cool": 1, "text": "The first time I went here was with a friend. We came here for rock climbing. They offer a very, very limited space for rock climbing. According to the staff, they weren't licensed in rock climbing. Therefore they had to test us whether is we knew how to belay in order to give us access to rock climbing. In the end, after questions of rock climbing commands and how to strap the harness on properly, the staff refused to allow us access to rock climbing. If we signed waivers that declared that we won't sue them for injuries, why would if matter it we knew the commands at all, especially if we knew how to wear the harness properly and also know how to belay? Very disappointed in this place. I would give it a -1, if possible.", "date": "4/16/2015"}, {"review_id": "f968i0U6owqSw0tkehG2Cg", "user_id": "UPP1RCn3J4rtdmzVEMBoCw", "user_name": "Ryan D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Staff is friendly and accepting to new members. Did their Friday deal for climbing. Everyone is supportive and friendly. Lots of room to try out different levels. Spotless bathrooms. Didn't see a grain of chalk in there.", "date": "12/23/2013"}, {"review_id": "eCnme6Y3x80QkNAVW13iSQ", "user_id": "ulXkPXTu-W8wJcltqeXctg", "user_name": "Estela D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This place was awesome. The staff was nice and helpful. I bought this through a Groupon and it included a shoe rental and all day pass which was really awesome. It is a little intimidating because there aren't any harnesses for most of the climbing. The floor however is thickly padded and people who did fall seemed to jump back up without any trouble.There were a lot of people since I did go around 8PM. Definitely recommend this place!", "date": "8/5/2015"}, {"review_id": "0b-lypAOoTrneFEF0c-8wA", "user_id": "3REdcbO9T5Jh-C2F3KSuGw", "user_name": "P H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very friendly and helpful staff and always have a good time exercising there. Generally other customers are also very chill and fun.", "date": "1/22/2017"}, {"review_id": "0WOMLH-OO71CSOveSXU7uw", "user_id": "hcZqq-a16ZTjaM2p2MljTg", "user_name": "Vicky L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "If you have ever wanted to go bouldering, this is the place to be.  The staff is really knowledgeable and friendly.  The boulders range from easy to very challenging, and there are thick mats everywhere so you don't have to worry that if you fall you'll break your back.Just to clarify, bouldering is the type of rock climbing with no harnesses.  I think I must have been a monkey in my past life because I was scaling those walls like it was what I was born to do. That being said, it's still scary, because you have no harness.  But sometimes, it's the fear of falling to your death that really propels you to keep holding on until you reach the top.  For some reason, I kept thinking about Bruce Wayne in the 3rd Batman movie.", "date": "6/27/2013"}, {"review_id": "48LAJ5ldjpkulAfm2Cc2PA", "user_id": "N48awrThiKgTP8UVcmIJ_A", "user_name": "Brent B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "I've been here with a small group of 3, a medium group of 10, and a large group of 20. Whatever the group size, this place rocks! (Pun intended). I would recommend coming in the afternoon if you're coming with a big group.The problems (routes) are pretty varied and fun. In addition to bouldering, there are ropes and rings off to the side that are a lot of fun, even if you are like me and have no idea what you're doing with those things. I wish the place was a little bigger, and the workout gym could be better (though I have particularly high standards for gyms). Overall, though, there is still plenty to keep me occupied for easily 3 hours every time I come. For comparison, I've also been to Planet Granite in south bay, as well as a few other rock gyms.The staff were chill. They gave tips, but only if you wanted them. And when I just wanted to fool around (i.e. attempt to balance on the ropes, or try to do a flip on the bouncy floor), I never felt judged. In fact, I felt pretty much at ease to just try whatever I wanted, as long as I wouldn't put other people at harm.Most of the time I had a car, but once I took BART and walked to get here, and it wasn't too bad of a walk.Caveat: Bouldering is pretty different than climbing. So if you're expecting to be harnessed up and climbing huge walls, then you will be disappointed. But I personally have done a decent amount of both, and I find bouldering to be much more fun.Protip: If you're new to climbing, expect your hands to turn red and your muscles to be sore!", "date": "3/24/2013"}, {"review_id": "qtojgINO9HSdSO6tMxL2cA", "user_id": "8_QXVI6hlXRTZJQ9MVPKTw", "user_name": "Cindy C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "I was introduced to this place by my boyfriend. I come with him once a month with his membership guest pass. Time goes by so fast when you are having fun burning calories, toning your body, and sweating! We usually go on weekend mornings. Quiet and no judgements! They offer Groupon deals once awhile. Look for them!", "date": "5/3/2013"}, {"review_id": "4wgP3oQOssRWJSFIcqw3_g", "user_id": "BcNJNvVk60cBJiuuNnwz8A", "user_name": "Richard L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My friend got a membership to this place and dragged me out here.  It was the best investment I made in a gym membership.  They have climbing walls for bouldering, some free weights, some exercise machines, and they hold classes such as yoga, zumba and kick boxing.  The change the routes pretty often to keep it interesting.  The Ranch 99 plaza is conveniently located next door for that post workout meal or run to the grocery store.  It is too bad that I am moving down south to LA, otherwise I would continue to come here.", "date": "7/17/2013"}, {"review_id": "6clZNd7guvnWnzn4ZEfTVA", "user_id": "pb-Fw9SjbDULRRO9LOP8gg", "user_name": "Fiona L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 5, "funny": 2, "cool": 3, "text": "Thank goodness for my friend introducing me to this awesome activity. At my first visit, I was blown away by the rock climbing walls as it looked challenging and fun. It was my first time bouldering. The staff were super friendly and did not give off the vibe of \"douche.\" As I went with a pro friend of mine, he taught me the basics and what the colors and numbers meant. Price for an all day is about $30 including shoes and chalk. I'm not sure if it includes the other amenities (gym, yoga, massage). However, buy the groupon deal for you save hella money and it does include amenities. An hour away from me will not stop me from coming here :) I really wish they had one closer to me. In a heart beat, I'll switch my Crunch membership to here.", "date": "9/13/2014"}, {"review_id": "p_ebjrWH5hfGHIxMesWt9w", "user_id": "ru4s5W8wK3zU5GS79hWVag", "user_name": "Michael G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Amazing place, I have been a member for two years, but it would be even more amazing if they would offer a Capoeira class there!!!  I take Capoeira class at Tatami Multi-Arts and it is moving to another location in July 2015, so the clientele from its martial arts classes, especially Capoeria, would be likely to take classes at Bridges, if they were to offer.  My suggestion is to approach the instructor currently teaching Capoeira there about teaching at Bridges, if they decline, perhaps contacting a Capoeira studio in the area would be a great idea.", "date": "5/16/2015"}, {"review_id": "64-HWBsVdlZI676o-PBUtA", "user_id": "BzVbyuMceUf-plTz3z3iYg", "user_name": "Audrey G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 0, "cool": 2, "text": "Came here with a huge group (20 people) on a Saturday afternoon, but they were pretty empty, and we all had room to climb! We had bought the Yelp deals, so our passes included shoe rentals and chalk. I've been here a couple of times, but I've never been rock climbing with a harness before, so I don't know whether there's a big difference between rock climbing and bouldering, but I think it's pretty easy to pick up! It's requires quite a bit of exertion, and you'll probably be sore the next day, but it's lots of fun, and you definitely get a sense of achievement from being able to climb to the top!The staff were all super friendly, and the bathroom/locker room facilities were really nice! Definitely worth coming back!", "date": "10/2/2012"}, {"review_id": "szv3lvxjjjS7_16UehZWAQ", "user_id": "Xiv-cQouKxulhN_iMV2zUA", "user_name": "Jessica L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 6, "funny": 0, "cool": 3, "text": "Granted, this is the first and only rock gym I've ever been to, but I've seen pictures of other rock gyms and they don't seem nearly as good. Bridges was my first introduction to bouldering, something I seriously thought I'd never get really into. But Bridges changed my mind. The price is pretty great ($40 something a month for students and the \"couples\" deal) and the community is fantastic. There is also such a great variety of routes, and a turnover that is, in my opinion, perfect for those who come 2-3 times a week. But let me get back to the community. The regulars that come to Bridges are amazing people - both in bouldering talent and also amiability. Everyone is so open to helping each other out and solving problems together, it's the perfect atmosphere for a hobby you turn to after a long day of work or class. Also the staff here are pretty great, they're very friendly and you can chill with them out on the rocks too.", "date": "5/25/2014"}, {"review_id": "Ggtx9AR5eALnhZhDP0xiuQ", "user_id": "3w576gufhGzFJ3wXUxS6Zw", "user_name": "Tiffany J.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "I've come here a few times with groups of 20 to just 2 and had a pretty good experience every time. It can get pretty crowded on popular times like Friday nights (the Cal climbing team goes here then), but people here are always friendly, helpful, and nice in general in addition to the great staff. The gym is mostly for bouldering although there is a wall with harnesses and there are also some good slacklines on the side as well. There is a good range and good number of easy to challenging routes and they change the walls ever week or so I believe to keep me challenged. There is also a good gym on the side with weights and workout machines, a room for fitness classes, and a good, clean bathroom with a sauna, so it's a great gym in addition to a bouldering gym. If you do rent their shoes, the shoes can be a bit smelly (but they do lysol them down!) so make sure to wear socks! I eventually bought my own pair because not wearing socks allows your foot to grip the rock better.", "date": "1/3/2013"}, {"review_id": "lagbwa-Rj4CogjFDXoDU3g", "user_id": "f7KqeOp5BCdCbPPSGrK5Vg", "user_name": "PaHoua L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "No crowds! I used to live in Sausalito, and Planet Granite was the closest climbing gym. There would always be so many people there, and I constantly felt like I was being watched and judged - which made me even more nervous as I usually boulder outdoors and don't have as much experience bouldering indoors. At Bridges Rocky Gym, I feel completely at ease and confident. Plus I love the slacklines that are always ready! I can take my shoes off and jump onto the slack lines when my arms need a break from bouldering! The bathroom is really nice and clean, as well as the sauna and shower room. Staff is friendly, along with the other folks who visit the gym.", "date": "1/14/2013"}, {"review_id": "FFuBzzzNNS-prWzJym7MWQ", "user_id": "A0hyctwicRZtqCZfovzzaw", "user_name": "Stuart B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Real cool experience! Great workout! A few days of bouldering and you'll be a fit, trim, lean mean dancing machine! Go for it! Have the bucks tho! Used a groupon courtesy of a friend.", "date": "3/28/2015"}, {"review_id": "7XG0E2mCHOf6JiPZYKyi5Q", "user_id": "LT27AG_SfvJZjy1nda4vfw", "user_name": "Barbara C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I got a month membership here when I came to visit for a couple weeks, and I primarily wanted to do yoga and Spinning classes, not rock climbing which seems to be what most people come here for.The group fitness classes are a relatively new addition to the gym's programs, especially Spinning. There were only a handful of people in the Spinning classes (and I actually was the ONLY person taking a Spinning class one morning). The Spinning classes take place in the small group fitness studio, and they drag a few bikes in for each class (and then take them away after class). The only thing that bothered me about this is the fact that the bikes were sitting on the soft mats, which meant the bikes moved slightly each time my weight shifted side to side during pedaling.The yoga classes take place in a tin shed (literally) next to the main building of the gym, but the interior of the shed is actually quite nice. Clean, smooth hardwood floors, nicely painted walls, good insulation (which was essential since I was there during winter), and nice yoga props. Very cozy.I got to do some rock climbing one day while I was there, and it was a lot of fun. Most of the routes are free climbing, but there is one wall where you can belay with buddy. It had been over 10 years since I had last done any rock climbing, so it was an interesting experience trying to climb again, but it was fun! You can rent shoes if needed, and also chalk if you like.There is a weight room with weight machines (if that's your kind of thing), and also a few treadmills upstairs for some cardio.Very nice and very helpful staff. Instructors for the Spinning and yoga classes are great.When I go back to CA to visit, I'm pretty sure I will come back here for my yoga, Spinning, and even try some more climbing, and maybe try some of the other group fitness classes they offer (tai chi, group strength, etc.).", "date": "3/5/2013"}, {"review_id": "LgMI9C3G8YhMVg--hpwpFQ", "user_id": "0m-7A68bctvAHXPhMEazTg", "user_name": "Lorissa W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Michael Hoffman is a great massage therapist.  Too bad the rock climbing center smells like feet and over run by children during their day camp rock climbing activities.  It's not relaxing being surrounded by lots of little kids.  Their waiting area is shabby and not exactly comfortable.  This is a great place for rock climbing but not a great spa experience for a massage.  Again, that is not the fault of the massage therapist.  He's wonderful.", "date": "6/19/2014"}, {"review_id": "MzJRucPax4JhlL7fa8nMgA", "user_id": "utaJvh52C_-WjflPpCUFLg", "user_name": "John M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "To start off my return to the Review World!I'll review one of my favorite to-go pastimes when I'm looking to level up physically and spiritually Rock ClimbingThough this doesn't beat rock climbing on actual mountains, it is a good alternative if you are a college student in the bay area. There is a good variety of different levels which actually separate the clientele very well in the sense that not everyone is advanced, beginner, or intermediate. You will always have a place to climb. The safety is also secure as I have taken some huge multi story bumps and not even got hurtPlus the kicker, It's only 6 dollars on friday if you have a student ID", "date": "5/11/2014"}, {"review_id": "LByHFxFNcnNYdfuPCfZktw", "user_id": "YlP6h98eZQnJ8TjTTVguSw", "user_name": "Lisa N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 3, "cool": 2, "text": "Updating my review because I ended up getting the semester deal! Also writing one because I just had my last climbing sesh at Bridges 3 weeks ago and I really, really miss it.I seriously love this place so much. This was my last semester at Berkeley and this is one of the places I'll miss the most about the East Bay. This gym is so awesome and Bridges got me obsessed with climbing!The routes are changed frequently so you'll never get bored. The staff members are SO friendly and welcoming. I just got a one month membership via Groupon to Planet Granite in the South Bay and it has a completely different vibe than Bridges. It's MUCH bigger and I feel like I'm constantly judged when I'm on the wall, lol. It's always really crowded and it makes me really miss Bridges. Granted, (or should I say Granite, haaahaha) Planet Granite is not just a strictly bouldering gym, but still. I miss my beloved Bridges.Waahh, will I ever find a bouldering gym like Bridges? Who knows. Please come here and get a membership, it's awesome. The price isn't bad at all compared to other climbing gyms and it has such a chill vibe.I already miss it.", "date": "1/5/2014"}, {"review_id": "TYRY_hudMw6E6DQ8tmuSGw", "user_id": "82dCHyU-ANOgdhxUgZsUeg", "user_name": "Marlon T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 3, "funny": 0, "cool": 3, "text": "I got into Bouldering because of this gym.On weekdays, it's $10 for a day pass.People are friendly and it's never too crowded.I hope I have some time to come back here.", "date": "12/20/2011"}, {"review_id": "55gF4lmCD0YkwYmVga2tDg", "user_id": "ozdJhlKzM4zd3UHj15U-Kg", "user_name": "Lisa K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 3, "funny": 1, "cool": 0, "text": "This review is for the Zumba class I took there. 3 stars is a stretch!  But at least I was able to burn off some holiday calories. Only because I stepped it up for myself. The instructor was boring, more like a class for seniors, seriously. Plus she kept her back to us most of the class. The room is tiny. Granted it was the Saturday after Christmas but there were a total of FOUR students, myself, two I invited and one other!  I only went there because the facility were I normaly go was closed for vacation. After class she didn't bother to greet us or encourage us to come back and I won't!  No Zumba love here!", "date": "1/13/2014"}, {"review_id": "Ehyxi0lQLW8X1KMec8m9Ng", "user_id": "iawJtDi3Gkx4O6OmSoEw-g", "user_name": "Melissa T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 4, "funny": 0, "cool": 2, "text": "What a great rock climbing gym! It's truly a hidden gem as it is tucked away in the corner at the end of the cul-de-sac. Parking around here isn't always so easy either, as it's either at their tiny lot or on the street.This gym is better for bouldering than rock climbing, which fits my interests more. There's a large boulder in the middle where you can climb. Also surrounding wall to top over and a small underside rock. The courses will change every once in a while, which helps keep it entertaining! Not to mention a small studio to work out in, some weight machines, slack lining, a few cardio equipment, and a sauna room. Pack all those things into a gym and you got a well rounded place.The people who work here are super nice and friendly. There's even a smoothie bar upstairs for after your workouts. The prices here compared to many other rock gyms is really reasonable. The costs also appeal more to the students as well. So you'll find a lot of Cal kids here as well as other local students.If I only lived closer to this area, I'd make this my main gym! Look out for the Groupon deal to get a punch card of 3x or 5x, which I highly recommend to start off with. It's the best deal I've seen out there. Plus having this deal will waive your initiation fee later if you decide to join.", "date": "11/4/2013"}, {"review_id": "cFvFrFyXOW8J45iSCM5teQ", "user_id": "Ou67o235nzEBWa2ptQgXoQ", "user_name": "Inna V.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Five stars to Vince and Thomas for their ***boxing and kickboxing*** program. The focus is on fighting technique and fighter training through no-contact partner drills and conditioning. Whether you've never worn boxing gloves or you've had years of training, Vince and Thomas are very welcoming and will work with you at your level. I can't recommend them highly enough.(The rest of the bouldering gym is pretty great too.)", "date": "8/30/2014"}, {"review_id": "kmrucviS-BbQElnJvmiqJQ", "user_id": "swqSj4zuamI_HFfPTj63Hg", "user_name": "Ted C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is awesome! I have never really gone bouldering/top roping, but a friend of mine invited me to come out and climb with him. I came on a friday around 8pm for college night and it was packed. I initially had trouble finding spots to climb but people started to leave around 9pm. I am a complete newb when it comes to climbing and half expected to see some snobby ass people looking down on me, but it was the exact opposite. I felt very comfortable climbing and people even gave me pointers/helped me during my climb. I will definitely come by as often as possible.", "date": "2/8/2014"}, {"review_id": "bM2k61zdUWVjCKIAisEXxQ", "user_id": "P006Tkm3ef0DFCf4bnpl7w", "user_name": "Eric W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 17, "funny": 16, "cool": 17, "text": "Before visiting Bridges the other night, I had never previously tried indoor rock climbing. It has always been something I've been interested in, but I just never had the chance. A few months ago, I had a blast in my brief introduction to outdoor climbing (see review of Cragmont Park yelp.com/biz/cragmont-pa…), but from what I've heard, the indoor experience is quite different.So, with yet another SFGate deal in tow, I met up with a friend after work to check out the beginners class at Bridges. From the get go, I could tell that the atmosphere was friendly and welcoming, and even though both of us were absolute n00bs, no one seemed to think any less of us.When we walked in, we were greeted by Chris (who was also the teacher). He was very friendly, and didn't mind answering any of our asinine rookie questions. The gym itself - although not very large - is very clean, and patrons can immediately notice that the ownership takes great pride in maintaining the facilities.I'm not sure how crowded it can get on weekends or on nights when they have special events, but on this Wednesday evening, around 7 pm, it was relatively quiet, then picked up a bit around 8. It never got to the point of overcrowding with people bumping into each other. There was still plenty of room for everyone to enjoy the walls.As mentioned earlier, since I am a rookie to indoor rock climbing, I really no have a basis for comparison with other facilities, but one thing that confused me here is the labeling of the routes. They use a system that starts with B for beginner, continuing upward through a series of numbers to indicate difficulty, all preceded by the letter V. So, VB would be the absolutely easiest, followed by V1, V2, and up.However, sometimes it seemed that the ones deemed the lowest in difficulty were not such a cinch after all, and others with V4 and above were a snap. Perhaps I was doing it wrong, but I'll probably figure it out as I return to use up the remainder of my SFGate passes.As for the comparison to outdoor climbing, other than the obvious disparity in equipment involved, I must say that they aren't so different after all. They both ultimately require the same level of concentration, the same muscle groups, and similar technique. I'm not well versed enough in the \"culture\" of rock climbing to know if there is any rivalry between the two groups (I assume there is), but I enjoy both equally as well.The barrier of entry for indoor climbing is much less imposing, as no equipment is needed, much less instruction is required, and above all, it is much more affordable and accessible. You can pretty much take off and visit the indoor gym whenever it strikes your fancy - much like you would the normal fitness center - but the same certainly cannot be said for outdoor climbing.If you don't feel like climbing walls on certain days, there are also treadmills, slacklines, a dry sauna, and even a soon to be weight room currently in the works! With the all day pass, feel free to come in and out throughout the course of the day.Best of all, Bridges is located conveniently adjacent to Pacific East Mall, which should more than satisfy all of you Asian food aficionados out there. Don't forget to stop by J&S (yelp.com/biz/j-and-s-cof…) for some of the finest milk tea in the Bay!", "date": "7/29/2011"}, {"review_id": "DaO7YPvon_Pi9A5UY8Nzng", "user_id": "_EOiV7AUZY37d_pVEBmlsg", "user_name": "Mary Ann A.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place!!! Had a blast. Friendly people, great environment. Cannot wait to go back!", "date": "5/23/2014"}, {"review_id": "AfHEjKvNL614xAWIQkDIeg", "user_id": "74Rc0u7CDwkFTzC-IvDYWA", "user_name": "Jennifer H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Great all around gym with such a variety of activities.  Not sure if I'll return though... But only because it doesn't suit my specific needs.  If I were looking for a gym to be a member of, then this would probably be it, for sure.  It's super close to my house, it has all the desired activities you wish every gym had included in one low packaged price! Unfortunately, I'm not that type of climber, at least not right now.  I maybe go a half dozen times a year with friends and family for specific occasions.  We prefer rope climbing and rarely explore bouldering areas.  If bouldering is your preference, then this is definitely the place for you because it has a very large variety compared to other spots in the bay area.Be warned that the parking lot is pretty small... I would say around a dozen spots or so?  We started off at 4:30pm on a Friday.  By the time 8pm rolled around, the place was PACKED (which isn't too hard to do since it's not that big of a spot to begin with).  It took a few minutes to find parking (which involved sitting in my car til someone left and pulled out).  The bouldering area itself is not very big so there are people sitting pretty much everywhere which makes it intimidating for beginners who have to find an empty \"segment\" to climb.  It didn't stop my visitors from having a good time but I do believe they would have enjoyed it much more if it were a little more spacious.Bottom line... We would probably go again, but only if we really didn't want to do much rope climbing.", "date": "4/18/2012"}, {"review_id": "FDTmsdr441RLd_2LnvYyqQ", "user_id": "kK0QDyfeSwcZl4gGilnW7w", "user_name": "Amy H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 3, "funny": 2, "cool": 3, "text": "I can tell why people like going here. This place is huge and there are just walls and walls of bouldering possibilities. Some people go free style and there are people like me who have to be linked up with a spotter. I am not much of a climber but the time I went, it was really fun to hang out with friends and just climb. There are tightropes and a small gym at the facility as well. My favorite thing was the zip-lining from the top of the wall to the floor. I am definitely not a fan of heights and it was scary to do the initial drop, but it is so fun and exhilarating! **TIPS**1) I read online that you can get a summer membership deal so I would inquire about that.2) Try zip-lining! It's a baby step for the real thing.3) Enjoy!", "date": "7/7/2013"}, {"review_id": "-qRPXAMsXql186HPTkQbhA", "user_id": "jzqLpVkB1rg9AssLKm7lvw", "user_name": "Wendy H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "The routes here are still great, but I think they're hitting some speed bumps as their business grows. 1. The prices here keep fluctuating. They get you in with a good deal, then don't offer the same prices for renewal, only to say you have to pay an expensive $50 initiation fee or commit to 6-months of membership. No, I'm not annoyed. Well, maybe a little bit. 2. They ran out of locks the last couple of times I was there. 3. Sometimes they have class field trips at the gym. I'm all for supporting the kiddies, but the gym can feel overrun. All this said, I still like climbing here. Just not sure how they will cope with the growing pains. They need to figure out a consistent pricing plan that works with their business soon.", "date": "2/19/2012"}, {"review_id": "03Dg4Z58bKMrWUG6cpYnFQ", "user_id": "9SqO5fHXsQPW4E6yRQEILw", "user_name": "Trevor V.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "First time experience is that staff is friendly, the route setting is quality and there is a sauna.   Enjoyed the layout of the wall for the gym and the problems.  All the other climbers I spoke with in the gym seemed friendly and there was a good vibe in the gym.  Only downside is that is gets pretty busy and the gym isn't that big.", "date": "8/20/2015"}, {"review_id": "EJwed9-EB82xOA44pHAOQg", "user_id": "hJeQYfE7pHnPowxpoBsx1Q", "user_name": "Lauren F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty much an all bouldering gym with some slack lines to balance on.I went on a Friday and got the student discount so I was able to boulder for 4-5 hours for $10. GOOD DEAL. Similar to SLO OP in San Luis Obispo.HIGH lone boulders and top outs. Lots of fun. Mostly college kids there.", "date": "7/10/2012"}, {"review_id": "tgGuuTKvSdwIIWBVMW97Ig", "user_id": "C8c0DRhd9FPO8hzZlNcAIw", "user_name": "Michelle C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 1, "useful": 8, "funny": 1, "cool": 0, "text": "While the offerings were pretty impressive, the execution and lack of professional accountability gives major pause. I signed up for the 1-year membership during their recent NO INITIATION FEE special.  The following 3 times I visited the gym, I was sorely disappointed.  Each time I went to attend a group exercise class.  Each time the instructor did not show up.  The 1st time this happened, the front desk would not or could not articulate what the class cancellation policy was.  The 2nd time it happened, I was offered a free guest pass for my trouble.  The 3rd time it happened, I decided I'd request a refund.  I understand that they are in a transition, but this is unacceptable.   What kind of business are they running here when employees don't show up for their job?  THREE times in a row,  THREE different employees.Thanks, but no thanks.", "date": "4/8/2013"}, {"review_id": "uxDYmwiitfpOsUmiJpVs6w", "user_id": "-wbVnj6P-YgGHKqLbJ-XWg", "user_name": "Jeanette Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 0, "cool": 2, "text": "BOULDERING! I suck at it, but it's still fun nonetheless. I like that bridges keep their gym pretty clean! Stop climbing for a bit and do a little bit of slacklining while giving your fingers a break from blisters of climbing.I bought the groupon deal for 3 visits for $24 that includes rental equipment too! AWESOME deal! Afterwards, you can just trek on over to the Pacific East Mall and grub! PS. Bridges is realllyyyy clean! I like clean climbing gyms that don't smell like feet!PSS. There is no expiration date w/ the groupon deal! AWESOME!", "date": "5/21/2013"}, {"review_id": "_EWuH0q5mFdwwD_YoMI-qA", "user_id": "iAevEfcmtCr2cpd6IRqnTA", "user_name": "Holly C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 6, "funny": 3, "cool": 5, "text": "Nice, mostly bouldering gym.  They have a few, short top rope routes.  The setting is hit or miss - some routes are set pretty hard, others are super easy. You can top out most of the bouldering problems but watch your head.  Some of the top outs are really close to the supports for the building and the walkoffs require you to duck a lot.If you are looking for a climbing gym to have a kid's birthday party, I'd pick this one.  Much cleaner than your regular climbing gym.  They have a nice table upstairs where you have your pizza or cake without being in a cloud of chalk dust.Now that I've encouraged people to have their kid's parties here, I'd like to point out that the kids here can get super annoying for people trying to work out.  The staff tries to keep them in the top rope area, but that usually fails.  The kids are attracted to the top out bouldering like a moth to a flame.  They run around the top out area, making a ton of noise and being super annoying.  On top of that, the staff and parents are constantly yelling at the kids to stop but to no avail.For parents, keep in mind that you are in a gym.  Would you let your child loose in a 24 Hour Fitness to run around and scream and climb all over the gym equipment?  I sure hope not.  Despite the brightly colored holds and fun bouncy gym mats, this is the same thing as any other gym.  People are here to work out.  Plus, the climbers could fall at any moment, crushing your precious baby girl or boy.  So try to keep them on a short leash. Also, the top out bouldering can be super dangerous and I've seen way too many kids up there, precariously close to the edge of the boulder.  If they fall off, birthday party fun is over so keep them under control for everyone's sake.", "date": "12/30/2010"}, {"review_id": "O3Q1X3dpYmhMK1OtbnCvCw", "user_id": "prSxb_h8gFPX2dQYqZPaSw", "user_name": "Sara W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been receiving massage from Sonja Gubalke, regularly, for the last few months and I so appreciate her work. I suffer from muscle tightness along my low back and, also, sore feet. Along my back, I want deep tissue massage, but on my feet , I need a lighter touch or I'll be in pain.  She can do both. She gives a great deep tissue massage, but she listens too, and is responsive to my changing needs. The quality of her work has  always been very consistent, respectful and professional. I highly recommend her.", "date": "12/28/2015"}, {"review_id": "a9BTMAXmoH-493Abd0GKrw", "user_id": "vpm-fMX33otb3v2i8TWBHw", "user_name": "Emanuelle K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place! lots of climbing routs that change frequently, the slacklines are super fun, and there's a sauna to chill at when you're done and all of you body aches...Plus the staff is really nice and the background music is always fun.", "date": "11/16/2014"}, {"review_id": "mfoECeq4eBa2R_DlS3MQqA", "user_id": "Eu-7Dgx86f7nOvFOKRoFHg", "user_name": "Adrienne R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Really nice gym.I bought the groupon which is an amazing deal, $8 per drop in for 5 day passes which include shoe rental and classes. The staff are very friendly. The workout equipment upstairs is nice and kept clean. Love the slacklines.I'm new to climbing and they have a good number of zeros and ones for beginners. It's also fun to be at a gym where you can stand on top of the rock when you get to the top.I do find that the routes are a little less interesting than the routes at iron works. There aren't as many ways to climb a given route as there are fewer holds on each route. Makes it a little less interesting.", "date": "3/2/2014"}, {"review_id": "0UIf7SHclcGajg7Cv8eK_g", "user_id": "6gRsrxSGwlognf6RrfW5mw", "user_name": "Justin F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Really fantastic bouldering gym. There is pretty much no point coming here to top rope, but if you want to try bouldering (climbing w/o harness to a height that is still safe to jump or fall and not hurt yourself) this is the place to go. It's cheap, the staff is friendly, and the routes are changed pretty frequently. Even when it's at the most crowded hours, you shouldn't have to wait too long to get on the wall.There's some machines, kettle bells, and freeweights (dumbbells not barbells) as well as a large slacklining area. They have cardio machines as well. One complaint I've heard from more experienced people is that the types of moves the routesetters favor are all \"bigger moves\" that favor strength over technique, but personally I can't really complain.", "date": "7/12/2013"}, {"review_id": "roymfKBhTpohRCUDDOQYrg", "user_id": "zDS-AbqxvQqoEAlukrte7w", "user_name": "Mango M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here first time for a massage. Had to fill out a liability release form (for the gym), and a typical massage intake form.The massage itself was okay. The massage room is inside the gym. Don't expect a spa like environment.", "date": "7/20/2014"}, {"review_id": "wPHxdAIfudFSECTBSa55fg", "user_id": "hl6oVSJSnxu8Ni6TPxcuyA", "user_name": "Jamie Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I haven't been to many rock climbing gyms besides Planet Granite and this one, but compared to Planet Granite... this one wins HANDS DOWN.I bought a groupon to Bridges Rock Gym - $24 for 3 day passes. The passes include in and outs, all rentals, all gym equipment, the sauna and all classes they offer. How freakin' generous is that??? The staff there are super helpful, personal and approachable. No intimidation here.The bathrooms are nice and clean. People can hold parties on the second floor. It's not as big as Planet Granite but this place definitely has its perks. It's also way more affordable. Student price on Friday is only $6.00!This will probably be my go-to rock climbing gym. My bff comes here very frequently and she loves it.", "date": "12/23/2012"}, {"review_id": "C5Up2aLM0TzYDKmKYNMy0A", "user_id": "yfpMOZOSUK9lQ9_6m0J9iw", "user_name": "Virginia D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "this place gets FIVE STARS for the kid's program, no idea how the other memberships are.my 11 year old is doing the after school climbing program. it is 2 hours, 1 or 2 days a week.  they do ropes, bouldering  & slacklining.  tons of personal attention, very low pressure.  IT'S AWESOME.  some quirky kids, but what are you gonna do, it's the Bay Area.  mad props to the staff that run the program, Austin & Emily. they are GREAT with the kids-- supportive, patient, kind & obviously love their jobs. they have a full report for parents upon pick up.", "date": "10/14/2013"}, {"review_id": "hw321gj34zKj1Y5ZmHrL9w", "user_id": "aVIp7GqkB-xE2oByrsev7Q", "user_name": "Amy L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "I've been here a few times and each time is super fun and such a great place to get a good work out. I usually come here on student fridays but recently they had a Yelp deal and purchased that so I can bring a few friends. I am not a fan of heights, but they have a lot of levels, that even a newbie can learn and have a fun time. The staff is friendly and informative, definitely ask questions and they are more than happy to help. I love bouldering with friends because you can encourage each other and help each other spot specific color rocks. Lockers and bathrooms are clean and they provide you with locks if you need it. Also they have weight machines towards the entrance if you want to get some more work outs in. They also have slack lines which are super fun to try out. I have horrible balance, so its always a funny sight.", "date": "12/25/2012"}, {"review_id": "Bw9u8cnTJMMPyOE0C7hh8Q", "user_id": "NCHxHfSdx52uzrzja_skAA", "user_name": "Lucy C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 2, "cool": 2, "text": "I've never been to a bouldering gym before, so I was really excited!That being said, I definitely didn't expect Bridges to be so goshdarn difficult to climb. I guess it's true- rock climbing gyms are infinitely easier. Who knew I'd end up missing harnesses!What I enjoyed about Bridges was that there was a ton of things to check out. Other than the obvious reason-- bouldering-- Bridges boasts a few slackline areas (try and see how good your balance is!), a weight room, and a ping-pong room furnished with various hula hoops, jump ropes, and, um, some large fans...?My only complaint is that I wish the courses were easier to handle and less tiring! I felt that we didn't spent a significant amount of our afternoon here, so I don't know if I'd be willing to pay full price (we had a CampusCred deal). But then again, I AM a skinny Asian girl, so take my opinion with a grain of salt.", "date": "9/12/2012"}, {"review_id": "GfTWQp5x3f6EJo5_iv_7aA", "user_id": "Bk3nFdYolh6MthG3cd6F0w", "user_name": "Jeff W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This is a great place.  Took my roommates here last night (I usually come once or twice a month with friends) and it was quite a fun time.  I usually will take climbing newbies here since at IronWorks I have to teach them how to belay and that just takes time!Pros:1.  Close to my house/BART2.  Lots of space, even when it's crowded you can find a good route3.  Very friendly atmosphere.  No judging going on here!4.  Affordable day-pass/memberships5.  Routes are well maintained, changed pretty regularly, and of all levels (VB to V10)PROTIP:  After climbing for a few hours, head on over to 99 Rance for some awesome BOBA!Cons:None come to mind...will update if I can think of any!", "date": "11/29/2012"}, {"review_id": "lrkR4GStAVCV6cDKMsOVdw", "user_id": "veO9yx9SZqjBQtpOy3h-6w", "user_name": "Charlie C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff, clean environment, fun for the whole family . We had my sons birthday after hours 6:30~10:00 We had the place to.ourselves after the gym closed to members and the kids Got to climb, slack rope, and sing  karaoke , play Nerf dart tag. They have a Nice area for food set~up, to sit and relax for parents and the 15 kids to eat and rest. I would recommend this place to anyone who wants a rock climbing party . We will be back.", "date": "11/3/2013"}, {"review_id": "tAKekUzPACnXw8WvVfZTFA", "user_id": "1nGAqV_-MWES8iRbGHNTyA", "user_name": "Halona L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I love Bridges for a bouldering gym as well as a regular workout gym. All the employees are friendly and the members are super nice as well. There are just a great variety of boulder problems and super duty foam mats for when the harder problems aren't going your way. It's a nice overall gym because they have a couple of treadmills, stationary bikes, elipticals, free weights and a bunch of weight machines. There's also a few slacklines and even an area for newbs to learn. They have a pretty impressive list of classes they offer that's free with membership (pilates, zumba, yoga, kickboxing, etc.). There's even a sauna in the locker room. There's also an area on the second floor for working and studying that's often filled with kids for their birthday parties during the weekends. Unlike other gyms, I don't find it considerably smelly or filled with chalk. There's a huge wall that they open that helps ventilate the place. Everything's always really clean and I definitely appreciate that.", "date": "7/11/2012"}, {"review_id": "2riSG2gE22MF-nNGqD_7JA", "user_id": "PauNerg-kHRpoqLwB6F5CQ", "user_name": "Bill B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 9, "funny": 1, "cool": 2, "text": "Don't be fooled - this is a bouldering gym. There are only a very small number of roped climbs set up, and at less than 2-stories high, they're marginally satisfying. The availability of several slacklines (tightrope-walking, essentially) is an unusual and cool feature, and the staffer was nice about offering tips. The range of spaces and options make this likely a fun place to rent out for a party. In addition to the extensive bouldering, there's a small weight room, cardio area, M/F locker rooms with saunas, a kitchen(!), and a lounge area complete with DVD and Playstation. They offer yoga and other fitness classes in a separate but adjacent shed.If I needed to do some training for a climb, I might come back again. My final hesitation is their liability waiver. I'm fine to acknowledge that climbing is risky (especially unroped), but I get worried when the management abdicates responsibility even in the case of staff negligence.", "date": "1/22/2012"}, {"review_id": "tGT9xjVo6JVJCz5Ndj63hw", "user_id": "9fwsJI0A3d66H71D-74vkg", "user_name": "Eric S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been going here for a few months now fairly regularly and  I love it. It's one of my favorite places to be right now. The staff are friendly and helpful. The membership is well worth it when you consider all you get out of it:weightsrock climbingfree classesand more that I'm forgetting.I'm taking a free climbing clinic at the moment and it's really helping me on my technique (Sue is awesome!). I've mostly stuck to the lower level of difficulty, but after one class I am able to jump another level or two up.", "date": "11/9/2012"}, {"review_id": "VSLqJQJowooa7A5B0Ut_5w", "user_id": "TxcG6Te8a3oJ5XJNZvQ5cw", "user_name": "Tiffany T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to several rock gyms (through out SoCal and in Europe) and this place was decent. I think it is a great place for locals and especially college students to spend some quality workout time at. The gym is relatively small, but there are many different climbs to check out. There is a gym floor and an upstairs floor with cardio equipment. There are also free classes if you are a member which include yoga, slacking, and many more. The community at this gym seemed very friendly and supportive and the staff at the front desk were friendly as well. I came to redeem a Groupon deal, which made my visit super cheap! I however did not give this gym the highest review because of the size, and the very unpleasant pair of climbing rentals I got. I have been to several gyms and this rental pair was the worst I have smelled. For these reasons I didn't give it the highest review. However I think it would have been a better experience if I came with my own shoes, so I will definitely come back and try it out again (plus update my review).", "date": "2/23/2015"}, {"review_id": "C3LfE2SYJTbbAQiouPoS1Q", "user_id": "sMDuQpouaJVefB9_Q8knbw", "user_name": "Emily W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "This place is absolutely awesome!  I never thought I'd get into bouldering (I was a top roping fan) but this place has convinced me otherwise.  I originally bought a groupon deal to try it out and joined when the summer deal was going on (I later realized that they regularly offer some type of deal).  The staff is awesome and super friendly.  The place is divided into sections and one of the sections is changed every Tuesday so you never get bored with the routes.  Personally I never use the cardio or weight lifting equipment but it looks nice and isn't ever super crowded.  They have a dedicated slack lining area if you ever get bored of climbing.  The bathrooms are so nice (and clean)!!  They provide locks (you have to leave your ID with them while you are borrowing a lock so you don't run off with one).  I love the fact that there is street parking in addition to their parking lot so you aren't driving around forever.  99 Ranch is right next to Bridges so if you get hungry you can walk right over and grab a pastry or something to drink.  I'm planning on moving soon and am already lamenting the fact that there aren't any good bouldering places like Bridges nearby.Bottomline:  Definitely check out Bridges if you are remotely interested in bouldering (it is very affordable!) and if you have any doubts purchase a groupon first.", "date": "1/27/2014"}, {"review_id": "UWwRT8IrJS-5DFZp1bvOKQ", "user_id": "tdfKdI3XJVbR9aawyYVlFQ", "user_name": "Trish A.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "Oh how I love you, Bridges! Since moving to the Bay last summer, it's become my new regular climbing gym. Here's why: 1. It's all bouldering. While I miss top roping sometimes, the short but technical routes are perfect for my work out. I can come whenever I have a free hour on my own and get a quick fix, or go with friends and take turns on working through a problem. Besides, Iron Works and GWPC aren't far off if I need that top rope fix.2. The floors are so squishy! Makes sense since some of the boulder routes are super highball. I've taken many a fall from high up and am happy to say each time I was more surprised than hurt. Who would've thought I couldn't dyno my way up to that sloper?3. Atmosphere is everything, and the staff at Bridges are always chill, helpful, and friendly. The crowd (and occasionally there is a crowd, unfortunately) is almost always pleasant.Not to mention, Bridges offers a lot of options by way of slacklining areas, fitness classes, weights, and ping pong! The routes are changed frequently enough and range from traverses to dynos with everything in between. The terrain is well-varied as well (LOVE the cave, nothin' like spending an afternoon climbing across a ceiling). Bridges rocks!", "date": "2/15/2012"}, {"review_id": "phQVQR6AaF-ix8ZWyvjPFA", "user_id": "c8ViX0HMYV-VDMWhf12pkA", "user_name": "Mario M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "[+] Great, friendly staff[+] Clean bathrooms, lockers, sauna[+] New Cybex weight equipment[+] They make their own juice[-] Fridays are $6 student nights- packs the house- so many UC students I couldnt even get on the wall =/[-] Everytime im there the juice bar/ cafe doesnt seem open", "date": "9/29/2012"}, {"review_id": "uoyLSw8FqKcKbG8moLl--g", "user_id": "GIb82r-SVBVavecUxMFa5g", "user_name": "D L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I've only been to a couple rock climbing places before and I have to say that the staff here are really great and they are the reason for the 5 stars. We are relatively new to rock climbing and a couple of the guys behind the desk were nice enough to show us how to belay and give us some pointers. They also have a slacking area which you don't see everyday and nice little weight room.", "date": "6/13/2014"}, {"review_id": "PG3pfVyNKcjjF99J54DNpg", "user_id": "Vwl5TIq-tiGxx2yu6abGxQ", "user_name": "A T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Not only are the bouldering routes top notch, the staff and other members are very friendly, and make for a fun, social environment to get a work-out in.", "date": "4/23/2015"}, {"review_id": "BAtSgvDjcY2HVGB5tgBEGQ", "user_id": "Dl2JbAfhI0BIFBuuCe-cHQ", "user_name": "Meuy S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 2, "useful": 2, "funny": 4, "cool": 1, "text": "I knew I wasn't going to like this place when I first pulled into the parking lot. Everything is so crowded. If you're into bouldering then yeah, this place is probably for you. For me I was loured into the gym by a Yelp deal and the array of classes that they offered. I showed up Saturday morning for the pilates class held at the Yoga Tin Shed. Seriously, it was outside in a shed that was probably constructed by a free lancing hippie. There was no door knob! And the door wasn't even sealed completely, there was a huge gap at the bottom where a steady breeze would blow in and when there was a slight  gust of wind the door would swing open. Needless to say, I was cold 90% of the time. The class itself was not good. Felt more like a slow yoga class, choppy, lacked direction, little to no adjustments, there wasn't even enough equipment for the class. It probably didn't help that the class was comprised of what looked like a sea of moms. This place isn't for me, I will most likely not be returning.", "date": "1/31/2012"}, {"review_id": "CcE8BBRXfTcQGL6SZucbsw", "user_id": "33h7LVT9XKNOVJgBGolH2Q", "user_name": "Shelley L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 2, "cool": 0, "text": "Great place for a bouldering gym. I would come to this place more if it opened until 11pm  on the weekdays.Avoid coming Friday night because all the college students form Berkeley come here for the cheap admission. It's harder to find nice routes.The facilities are clean and doesn't smell like sweaty feet.The representative at the front desk are really nice and very helpful.A friend of a friend held a birthday party after hours. I didn't go but I'm considering it for my birthday. It would be nice to have a whole gym to yourself and your friends. Great idea for bonding.Parking is a little challenging since they have a small lot made for about 15 cars AT MOST. You either have to park in the street or the nearby plaza. I'm always worried that my car will be towed but it hasn't yet. On a rainy day, it sucks to walk to the gym from around the corner.I have not tried the slack lining but it looks like a lot of fun. Best part, you get to top out. None of the east bay rock gyms in the area allows you top out (Comparing to BIW and GWPC)", "date": "6/7/2012"}, {"review_id": "GrgvSQg9nE3A5AhBdlWXgg", "user_id": "7gNz9c1r6HH65XZDf6O0vQ", "user_name": "C L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing! I was a member for about a year and then I moved to the Peninsula. Now I truly miss Bridges. They shake it up constantly changing the routes to present new challenges. The location has the \"local\" feel with friendly staff and patrons. A great location for beginners and skilled alike. I truly miss the fun challenges Bridges bouldering offered. Hint: Hit Bridges when they open any day (even weekends) and you will find you will have the location almost to yourself).", "date": "6/11/2016"}, {"review_id": "qnUW9P-f8kb94OLFn-sfxA", "user_id": "J2A5xGSDgln4_v9xiC-Qwg", "user_name": "Matan S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I was pretty impressed with this bouldering gym. First thing I noticed was how tall the bouldering walls were and that all the problems topped out, you had to fully get on top of the boulder to finish, just like when you climb outside. The setting is really fun and interesting and they had great quantity and range of climbs, I had a good batch of routes to warm up on and some good ones to work as well.Another enticing aspect of the gym was the dedicated slack line area. When I was there they had 9 lines set up, all different heights and lengths. They even had \"training\" lines. My only complaint here is that they need a long one-inch slack line, the original style of slack line that many climbers still use.Overall, this is a great bouldering gym, and a good place to get some exercise and send some porbs.", "date": "8/12/2012"}, {"review_id": "PlDEAzCbklFj220cEFe3Fw", "user_id": "bj1f2-_N-9T-9jHmlHMWFw", "user_name": "Linda T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "No.  I purchased two Yelp Deals.  TWO!  That's how much I like this place.Rocks to top off.  Slacklines all around and ropes to swing on.  Sauna.  Fluffy crash floors.  An air of everybody can have fun and should. Right next to my weekly grocery store, 99Ranch.  Ample parking. Love. I like this place.  This is where I'd take my little sister, little cousin, or students to have fun and play.  For climbing: While this place isn't IW, Bridges features some decent routes for bouldering.  I must say that the top rope here is dreadfully lacking.  That's probably why they don't seem too concerned about making sure that you know how to belay.For anything but climbing: Bridges makes me feel like a kid again.", "date": "2/13/2012"}, {"review_id": "lf4qEQxd9B5HRyZ9CRab-g", "user_id": "JVKk_NbM6NjTiA9aKs2bUQ", "user_name": "Anne K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "I almost forgot that I bought a Yelp Deal for Bridges Rock Gym last January.  So a couple days ago (less than 10 days before it was set to expire), I headed over to redeem the two vouchers I purchased - $25 for five day passes each (10 total).  Having heard great things about the gym from friends, I have been wanting to try the bouldering, slacklining, and various yoga, Zumba, and kick boxing classes that Bridges offers.   However, I have to admit that I was a bit disappointed and that my initial impression was more like three stars.  It is simply not on the same level as Ironworks.But I am giving Bridges four stars for the following reasons: 1) They are close and filled a previously unmet need for a gym in El Cerrito.  2) I really did have fun the two times I have come so far and the manager made a point to walk over to give me some good slacklining tips (I was crazy enough to try the high one).  3) I was impressed with their range of bouldering routes and have to admit that my skill level can't appreciate them all.  4) I can see how the facility would be a fun place to rent for a low key event given the variety of options they have including a kitchen upstairs.  5) They have saunas in the lockers rooms and on-site massage.  6) They are cheaper than Ironworks and they always seem to have different deals available - on Yelp, Groupon, and even in the Chinook Book.  That means it is pretty easy to find an even better deal.I also appreciate the fact that my vouchers only had to be redeemed by the 26th (my expiration date) but they don't actually expire once in the system.  Therefore I can take my time trying out different elements of the gym although I was prepared to try to go as many days as possible and beg various friends to come along - the nice thing being with the deal I got is that you can share or gift the passes.", "date": "1/20/2012"}, {"review_id": "kQflzXz1_TldXfKjwS_M0g", "user_id": "RelVOqg2KOKrSnT8Yia0dA", "user_name": "Anthony R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great all around!  The atmosphere is very non-competitive, so if you're a beginner you should not feel shy about coming here and checking this place out for the first time.  There is slack lining (with an area of ropes to assist you), traditional rock climbing, and solo rock climbing.  There's even a small workout room and an area to stretch/where they hold classes.  The people at the front desk are very helpful and friendly.  There are a variety of levels for all stages and difficulty of climbing, and I appreciate that the \"courses\" change pretty regularly.  I see all types of people coming here (watching am 9-year-old kid rock the level 10 climbs and slack line like a pro definitely produces an incentive for me to work hard and get as good as him).I always jump on the opportunity to get a Groupon deal for the place when I can.  I've been here more times than I can count and I will continue going until I make it to level 10+!", "date": "3/5/2013"}, {"review_id": "XI7KZm-oUFtjkQhr0VXdMg", "user_id": "1kpMAKRZuAz3OzxBav3XTg", "user_name": "Ligaya T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 32, "funny": 22, "cool": 33, "text": "Gumby arms and a weak ankle, a good boulderer this makes not. Yet upon my recent visit I discovered that the security of a rope builds different strength and technique and that free climbing practiced different skills and strategy. It was also cool to see how challenging short top rope could be. Set up some more good stemming problems, and it'd be solid gold.The owner, Damien, an accomplished slackliner, happened to be around and was super welcoming and down to earth. He gave us insights into his personal interests (deep water free solo) and a behind-the-scenes perspective of the gym. It was in the locker room that I realized how genius he and Jeffie (his lovely wife) really are: immaculate, lots of privacy and a glorious sauna for all! There's really no need to ever leave. Palm some rock and get tired? Hop on the slacklines! Need a break? Check out the climbing vids and surf on the free wi-fi. Hit the wall again and need some extra juice? Grab a meal at the cafe! Want to wind down? Chillax in the sauna. Feeling flexible? Get into position with yoga. You can even bring along the kiddies as there's a toddler play area!I might just live here.", "date": "8/17/2009"}, {"review_id": "AQotsvvMjzIS_qQ8EyNV8A", "user_id": "4LtESZWorl-140GOWQCl6g", "user_name": "Amy D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 4, "funny": 1, "cool": 4, "text": "This place is awesome..I never knew this place existed until I had heard about it from a friend.. and I was so happy to find this place out! Yes, I'm that girl where an idea of a perfect date would be a day of rock climbing ..lol :)The whole place is huge complete with a pretty well equipped gym, zip lining, and they also offer classes like yoga, spinning, and kickboxing. However, I was here for the indoor bouldering and rock climbing. I've been to several rock climbing facilities prior to this, so I was happy to finally be able to find one close to home. The staff here are friendly and extremely helpful. It also wasn't that packed when I came in but im guessing that it was because it was a weekday. They offer different levels of difficulty for rock climbing, and I am nowhere near what you would call 'experienced'  lol.. only because because I mainly do it for just the fun and thrill..but the staff here are completely understanding and supportive. I can't believe people actually climb without a harness though...I, for one, am not that ballsy..haha. But I totally understand that when you get really good at something, you really want to push yourself to the limit. Anyways this place is great, definitely check it out especially if it's close to home. I had a blast here, and I'd surely be back with friends next time and do zip lining since that's next on my bucket list. They also have groupon deals that go on sometimes so keep a look out for those cause they offer really good prices! Now check this place out and go burn some calories!!!", "date": "9/24/2013"}, {"review_id": "tXI7eHbZh7hWQja68MMSkQ", "user_id": "F74HPkBI8B96o9B-FXBDBQ", "user_name": "Martin P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Got the all day deal for bouldering. I only climbed for 45 minutes before getting tired, but still a great deal! They also have some training equipment for strength and grip.", "date": "7/22/2014"}, {"review_id": "S6pTDguu5Ltl_RarOKnQrw", "user_id": "gpWYac9kMlPeVC7YwINbJA", "user_name": "Courtnee C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "I loved it. I was nervous--had never done bouldering before. The people were super helpful and the facility was great. The exercise equipment (treadmills and stuff) was a little small, but I didn't go there for that stuff. So no biggie.", "date": "9/5/2014"}, {"review_id": "cZE__l5Vdix46YAOcV0GNg", "user_id": "SXfvHWScLghzoTSBqb_e6w", "user_name": "Angela L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "freakin' sweet. a good friend of mine mentioned she had been rock climbing here, and I decided to switch up my exercise routine and give it a try. after all, my new years resolution was to do more shit. the yelp deal is fantastic; $25 for a three day pass, or you can bring a friend with you and that counts as one of the three. I guess this place is bouldering, which is different from rock climbing. you're not strapped into a harness or anything, you just climb a wall and if you fall there's a bunch of mats to catch you. the first time is HARD, especially if you're like me and have no upper body strength. your body uses all these muscles it has never worked before, and I only made it over the wall once. The second time, however, I made it several times and moved on to a higher wall. I like that there are different walls and routes set up so the place works for beginners and experts alike. It's very clean and the staff have all been very friendly and helpful. as an added bonus, they have cardio and weight machines, and there's a schedule of classes they offer (the kickboxing class definitely caught my eye). highly recommended!", "date": "2/26/2012"}, {"review_id": "e5bp2jg51MBiRmznvgwBSQ", "user_id": "Zl_DRGW3r_5BbbaEyGiVcQ", "user_name": "Marykate R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is a hidden gem in the neighborhood. For how small/uncrowded it is, it is very affordable and they often have great deals going on. I'm not even a climber and I joined just for the cardio machines and yoga/Pilates classes. All the staff are super friendly and helpful, and overall it's just a really neat place.", "date": "4/1/2014"}, {"review_id": "yNQWfrDg2fgUuipUQ9QpHw", "user_id": "QVHwuhXNmUWDLpr-z65syA", "user_name": "Troy S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I'm a noob when it comes to rock climbing, so take this review with a grain of salt. Bridges is a smaller rock gym than my normal one (Hangar 18 in LA), but it has plenty of challenging routes to try. i came before 3pm, so the day pass of $10 was really reasonable. The place definitely caters to those who prefer bouldering, as there are only six roped climbs, at least two of which are for kids. Speaking of kids, both my nieces, age 10 and 3, really enjoyed themselves...but not because of the climbing. They really enjoyed playing on the slacklines, and I must admit, I thought they were pretty cool too. But I wanted a workout so I stuck to the walls. Both of the main bouldering walls are higher than I'm used to, but the really thick padding on the ground is more than I'm used to also, so it's relatively safe if you fall. There were plenty of climbs to keep me interested, and there just happened to be a few experienced climbers at the gym at the same time and there didn't seem to be any shortage of climbs for them, either. There's also a pretty big cave section for those who like a good challenge. My wife isn't big into climbing, but did enjoy the yoga classes they have there, and any time I can take her with me to one of my activities, the better. So the combination of rock climbing, slack lining (think tight rope walking), yoga/pilates classes, traditional gym equipment (weights, treadmills, bikes, etc.) and an affordable day pass (regular memberships are ~ $45/month) gives Bridges a four-star rating from me.  I'd give it five stars if it were bigger and offered more rope climbs.", "date": "11/30/2011"}, {"review_id": "9dh0aYDW0q_GHKDd6fLcUw", "user_id": "AGToFpJwPad7C_tz2iI6cQ", "user_name": "Yijia W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I do regular exercise here recently, a bit depressing and the stretching pad smells terrible on the 2nd floor. The other stuff are all good and taking different classes everyday is fun.", "date": "10/2/2014"}, {"review_id": "s_f8euO0kJY0GBwLPlhkKA", "user_id": "7Ma166LlK2pwbtA2HSzbfg", "user_name": "Jamie K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great Bouldering Gym. I cannot think of any complaints to be honest. The price is very reasonable and the staff are super cool. All of them climb and you seem them around climbing often.  They have some other nice features like the sauna as well as clean showers.", "date": "4/8/2014"}, {"review_id": "Gns9y2oV__cWWDdJkTJRjQ", "user_id": "Sf0-6V_OnHZOxmN3CD8lQA", "user_name": "Yolanda B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "The staff at Bridges are extremely rude to first timers. The woman that checked us in did not give us any information. The guy who took over for her at the front desk was at first rude but after a while he told us to follow the same color rocks for newbies.  I think the owner needs to train their employees on how to talk to customers particularly if they are new. The guy did recommend a class that sounds interesting but after our experience with the staff I think we will try elsewhere.", "date": "8/21/2015"}, {"review_id": "rr4dsMQAqrQcOeMphHLkDw", "user_id": "7NM-nz8dY2ktdK08k2ze0A", "user_name": "Angel P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I first started going to Bridges around 2009 I think.  It still seemed pretty new and had a good dozen or so regulars that I saw most of the times I was there.  I believe most of them either worked there already, or eventually worked there.  I had never been climbing at all before (and not too fond of heights) and several of them would offer their encouragement to me and ask if I wanted them to help me before suggesting techniques to help me solve a problem.  I had been told that some other climbing gyms were frequented by elitist climbers that were more intense and unforgiving/unfriendly to beginners.  I'm so glad my friend brought me to Bridges instead.  The staff AND the regulars couldn't have been more welcoming, friendly and helpful.  I was a member and went several times a week for most of 2010 and part of 2011.  I loved every minute of it and even made friends with some regulars who often invited me on their trips to boulder outdoors!I just recently started going again and have decided it's completely worth it to travel even from Alameda to get to this gym (I despise traffic on 80 in either direction).  I can make a whole day of it with doing cardio in the mezzanine, then climb for a few hours, and take a nice sauna before I hit the showers!I'm really happy to see they've added a lot since I was last here.  A whole separate room with lots of regular workout machines, kickboxing classes, zumba, etc.  They have a massage room now, acupuncture on certain days, and they always had slacklining and the yoga classes.  I took a few yoga classes when I was member and loved it, although, more difficult than other yoga classes I had taken!  I think the instructor had geared it towards building upper body strength and balance to coincide with bouldering.  As for climbers walking below you or oblivious climbers, when it's busy, I often see employees walking around alerting people to be aware and I've nicely asked a few climbers myself to move in case I fall or so I can comfortably drop from a problem and everyone is always cool about it.  I suggest that if you are bringing someone new to this, you inform them of climbing etiquette.  It's really easy to research if you are unaware yourself.", "date": "2/19/2013"}, {"review_id": "J-Jfoqphf5w5Qvl8Ha8AAw", "user_id": "Dd6ElS2Cng3Qag_h4IQC-Q", "user_name": "Jennifer A.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This gym is pretty awesome.  Obviously the main attraction are the rock climbing walls, however they also have a variety of gym equipment and exercise classes.  They also seem prepared to handle birthday parties and events as well.This was the first time I'd been rock climbing and I always though you'd be in a harness, but I guess these walls aren't as tall as those I see on tv and there are huge mats underneath to catch you if you fall.  After reading some of these reviews I guess there is a difference between rock climbing and bouldering...which apparently a better description of what this gym offers.  It really doesn't look that high when you're standing looking up, however, once you're on the wall, it feels like you're on the edge of a cliff or something!  A great work out (my arms and hands started feeling like jelly after a while) and a great time!The Yelp deal can't be beat, but I think even regular price, it's pretty affordable.", "date": "1/23/2012"}, {"review_id": "kcsZPBupKNXBZOfjDXD3Hg", "user_id": "ROYZs0c4HvdplUK0hgT8Bg", "user_name": "Jack O.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Small but more friendly than other gyms, work out machines are sufficient, really good for bouldering, little crowded (which is good).", "date": "11/15/2012"}, {"review_id": "n-39mscWqBuc5rwX-qe1jg", "user_id": "k6yG3nKy2WOupwMwT_0rTw", "user_name": "Dan P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Bridges is a smaller gym compared to some of the other rock climbing gyms in Berkeley as well as the SF Bay Area; however, the tradeoff is that there's not quite as much foot traffic to this location so you can really hit up any wall you want without much waiting. Pros- Friendly, chill staff.- Great for beginners.- Nice location for North Berkeley / El Cerrito etc.- Not too busy, so you aren't feeling bored waiting for other climbers like at other gyms.- There's a small gym upstairs with treadmills and weights, etc.Cons- Since it's so small, I bet you would get bored quite easily should you get a subscription.- The rental is kinda gross, so buy your own shoes if you're planning on going climbing in the future.For experienced climbers- This place is mostly bouldering so keep that in mind.- I'd suggest going to this one only if the location is ideal for you.", "date": "9/27/2011"}, {"review_id": "I4sGj6IlAEh09cJAbPuS5A", "user_id": "Cduchq1cJaKB8XlPrcM7lA", "user_name": "Cindy N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "With each visit to Bridges, I find myself liking this gym more and more. Friendly staff and a ton of bouldering problems, what more can you ask for? They recently invested in new gym equipment, bought new climbing shoes for customers to rent, the cafe Spread upstairs just opened, and every week I find myself faced with a wall with new problems! Lately they seem to be consistently setting new problems every week which gives me something to look forward to every week. And of course their College Friday deals--climbing for $5 and shoe rental for $3--can't be beat. If you're serious about climbing, you may want to avoid Fridays as that is when new climbers take over and have not learned climbing etiquette yet, but if you can put up with the crowd, Bridges on Friday has an energizing atmosphere that is worth trying!", "date": "4/18/2011"}, {"review_id": "CKg2Ou1RAUtWaDODJitdVA", "user_id": "w3iXYLy7b89aoDxfU96i5g", "user_name": "Connie C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here this past weekend with my friend. She bought the Yelp deal last week, so she wanted to use it, I bought another deal just because I brought in 2 others with me. This was my very first time rock climbing. I've only seen the rock climbing portion at City Beach in Fremont. Bridges has more paths than that. They have a large rock in the center of the gym and another that covers about two walls of the gym. With the four of us, we didn't get to try all of the paths (since a lot of them looked too difficult for beginners), but we spent a good 3 hours there. Their paths were color coded, so if you had no idea what you were doing, you can follow those colored tapes and somehow find yourself at the top. I wish that works as I was climbing. I was scared of heights and could not see anything when I just held myself up close to the wall. Luckily their floors are covered with this thick, fluffy cushioned mat, otherwise, I wouldn't dare to jump. They also have paths with a harness. I actually managed to go to the very top with those. For some reason, those rocks are not so easy to grab alone. For the experienced climbers, they do have a commentary book on the side where you can request for certain paths to be made.Bridges Rock Gym has two fitness rooms: one upstairs, one near the main entrance. There's a room with ping pong. Also a part of the gym is filled with balancing ropes. I glanced at their schedule of activities, they seem to also have yoga and zumba classes. Their staffs are friendly and helpful. Luckily the gym is not overly crowded like your typical 24 Hour Fitness. If you want machines that don't smell like sweat and possibly in mint condition, do come here to work out.The Yelp passes actually pays for your entire day's activities. It also include using their non-rock climbing facilities. And if you want to use it for rock climbing, shoes and chalk fees are included in the pass. Don't quote me on this part, read the fine print yourself. I'm definitely coming back to challenge myself.", "date": "5/7/2012"}, {"review_id": "M0xaN1uTAhChU-CZhoXm5g", "user_id": "j8A2aS-L55gxcX-MaRiF0A", "user_name": "Roxie R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 1, "useful": 15, "funny": 0, "cool": 1, "text": "I've been looking for a good rock gym since moving to SF and after doing many research and going to many gyms, I've decided that Bridges is not for me.It was great at first, I've been using my friends guest passes to climb at Bridges, saving money.  The pricing at this gym is the cheapest I've seen.  It's got a great vibe, the gym members are very friendly and there's a section dedicated to slacklining.  This place is mainly bouldering, no real rope climbing, even though there is a very small rope area that is pretty much useless and taking up space Bridges could've used for more bouldering.  The gym area is so tiny, it made me wonder why they even put it in at all.  Yoga here is good and it's separated from the climbing area but it's a hard to concentrate on the yoga when you can hear everything in the other building.After months of climbing at this gym, I realized that the sets have no flow, no cohesion.  At times, it's just painful and I can foresee an injury happening just by looking at the problems.  The way they rate their problems is inconsistent.  Some things will be incredibly easy even though it's rated hard and then it'll be extremely hard when it's rated easy.The one thing that really turned me off from this place was the behavior of one of their staff members.  I've seen him tell someone that they're doing a problem wrong.  If someone said that to me, that would have turned me off from climbing.  From all of my many years of climbing, there is NEVER a wrong way of doing a problem.  Bridges must've lost a member because after that incident, I never saw that person again.The second thing that same staff member did that really made me want to have nothing to with this place was that he encouraged bullying.  I was told he teaches the teen team.  During one of their sessions, the children started to approach one of the gym members and one by one, the children started to insult him.  I was appalled, he was teaching the kids bullying.  And he just stood there, as if he was letting those kids know that it's okay to do it.  At first, I thought it was a joke but the look on that members face clearly said otherwise.  I tried to approach that person to see if the children was just kidding around but he had left looking disgruntled and upset.  I asked his friend who had also witness the incident if that was the kids playing and he told me no.This staff member's behavior is unprofessional and appalling.  He has no respect for others.  As soon as someone leaves the gym, he would just bad mouthed them from behind the counter.  I lost a friend to bullying and here I see this brat encouraging it.  I hope the management at Bridges do something about this.  Bridges lost a potential member and my friends have decided to cancel their memberships.**UPDATE**8/31/2011I was told by a friend that the Teen Team coach, Dillon, was fired.  I was also messaged by the manager and owner, Damian, to apologize for this ex-staff members behavior and he expresses his concerns about my experiences at Bridges.  I love that owners and managers get involved with their businesses instead of staying on the sidelines.  It tells me that they take criticism, even harsh ones like mines, in a good way.However, for it to take this long, 6 months, to see any kind of action is worrisome.I may be paying Bridges a visit again, maybe.**UPDATE**", "date": "2/5/2011"}, {"review_id": "cTl3y2Z6z1fTxd9p_E5Chg", "user_id": "5EQnJI0p5Jnu0Bjhj4aaQw", "user_name": "Tim W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 6, "funny": 2, "cool": 1, "text": "I've been coming to Bridges for the past 6 months or so and I've been more than happy with my experience so far. I come here mainly for bouldering and I love the plethora of problems that await me on my next visit. They re-set the walls every so often so you can never complain that you've run out of problems to do. The floor padding is cushiony, the facilities are clean, there are showers and a sauna, a cafe upstairs... Top that off with a friendly and awesome staff (yay Jacky!) and community of climbers and you've got yourself a nice gem of a rock gym.Also, Friday nights ($5 only!) are a great night to bring your friends and peers who are new to the climbing scene and have them all try it out. I used to come every Friday night until I got hooked and just bought a membership. For those that are interested, there are is also a small area for top-rope climbing, a dedicated slacklining area (for when your arms are dead from climbing) and a gym area upstairs stocked with some basic machines and free weights.", "date": "1/25/2011"}, {"review_id": "cv_yf-GoZ_bFRrJz9cvnng", "user_id": "uV64vdjCrmrh0hKfjwcNTg", "user_name": "Angela L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Great bouldering gym!My boyfriend knows how much I love the indoor climbing and surprised me with a 10-pass to this gym and to experience my hobby together with me. Now, I'm a loyalist and I've held memberships with other local bay area rock gyms  and I was a little reluctantly to try out Bridges just because I had so much love for the other places.BUT.... after trying this gym out just twice now, I've loved it! The ppl who come here are very chill and everyone i've encountered here has been nice. There are a lot of kids here, but even they haven't gotten on my nerves yet, there are just so many trials I lose my concentration in , the screaming kids kind of \"fade\" into the background. haha. This gym is great for bouldering, and has expanded it's collection of weights, but if you're looking for lot of rope climbing and belaying, this may not be the place for you.  Enjoy!", "date": "9/19/2011"}, {"review_id": "rEAIlrFkyNY1i6kMWJPK9w", "user_id": "UCSwb-cLGVzMFB_cvKV7Gg", "user_name": "Phillip G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I think this place is awesome!  If I lived closer, I would definitely get a membership.  This place has a good amount of workout equipment, a ping pong table, and of course the rock walls.  This was my first time in a rock climbing place, and it was definitely a challenge.  One of my favorite things was the slacklining area.  My first time doing it, and I was hooked.  The staff was very cordial and helpful as well!Anyways, I wanted to keep this review short.  =)", "date": "6/5/2012"}, {"review_id": "2soO0EjU7QN6dPoOS4mheA", "user_id": "kCd_EMmznpy6_Em7c11Tgw", "user_name": "Frank W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been coming to this gym for 2 years now and they just added a massage therapy service. Over the past couple of months, I have used this service a few times and it is amazing how much it has helped with my workouts. The therapist, Heather, does deep tissue massage that just melts my knots away. Now I can run faster and farther as a result and knowing that she can do her magic on my muscles after a long training run.Cost is a bit less than Massage Envy. But of course it is not as quiet since it is in a rock gym.", "date": "10/12/2011"}, {"review_id": "kuHsKCmXTj7LSqptgqwtDg", "user_id": "qXQJ5tZl3nVzuoOFuarCqQ", "user_name": "M D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Started climbing here on a whim as a noob with my husband and fell in love with this place.  It's basically all bouldering (the top rope area is tiny), but there's a cave, some pretty high bouldering walls, and really interesting routes.  There's tons of gym equipment and treadmills, etc (that I never use), a diverse array of classes (I've liked some of the yoga and pilates classes; Tia is great) and a huge slacklining area.  There's a decent sized parking lot, discounts for college students on Friday nights, saunas in the bathrooms, free towels and locks, ping-pong events, and the price is unbeatable for a gym.   Tuesday and Friday night climbs are super busy, but the weekend mornings are chill.The best part is the people.  All the climbers and staff are incredible friendly and helpful.  People are constantly helping strangers and cheering them on.  It feels like friends!", "date": "4/5/2012"}, {"review_id": "9uBULA9aZyFoH5ytkDQiDQ", "user_id": "G-1uSi0c5ZdvZBZJBZVCiA", "user_name": "Patrick T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "this is THE place to boulder. it is SCARY to climb hard problems on the big rock in the middle of the floor. that rock goes higher than their pretty wimpy lead climb wall. but don't come here to lead climb anyway.great staff. just watch out for the crazy little kids running around in their camp during summertime.", "date": "10/24/2013"}, {"review_id": "kK9QQs7dURA-LfG6dvDTWg", "user_id": "Jo8wU2ikAT0LbnHqCExd5g", "user_name": "Age C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here two separate times. Most recently a day after a week of roped rock climbing. I didn't have as much fun as I did the first time, but that was because I was not as willing to take the same risks that I would when attached to a rope. Both are definitely different, both are definitely fun. You can make up for this risk aversion by trying the slacklining. Challenging! I noticed on my second visit that they added a rope that you can hang on to with your hand as you walk across the slackline. I think this is a mistake, as it will hinder your progress in the long run, though in the short term it will get you across the slackline. I've only seen one girl working the front desk, she is very nice and is happy to give you tips and advice, all you have to do is ask.", "date": "1/9/2014"}, {"review_id": "ouUtKson1_0ZKqo1HXDLWQ", "user_id": "KxrTQnzr83z0HZnrAkkeGQ", "user_name": "Michelle P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 2, "funny": 1, "cool": 1, "text": "While visitng the Bay on business I dropped into Bridges on the recommendation of a friend.  It was $10 before 3p on weekdays, quite the bargain.  They had a January special going for $45 a month gym membership no initiation fee, which I would happily pay if I lived in the area and had very limited access to local climbing. The staff is quite friendly and the gym is farirly new.  The locker room even has a sauna.My main gripe is that the ratings here are highly variable depending on who set the routes.  I am not a V3 climber and could do some of the V3s without much groveling.  I was told this was partly due to less experienced route setters and route setters that 'didn't climb outside'.  If you want routes more reflective of outdoor ratings in areas such as the Tablelands (a.k.a. Happy/Sad Boulders) of Bishop look for stuff put up by Chris B, Rowan and most of Michelle G's routes.  If you want an ego boost stick to the other routes.", "date": "1/31/2011"}, {"review_id": "OpP1iXm8aCExHiwQEP5qnQ", "user_id": "uU_rtKF9eQItAmgzWKI_hA", "user_name": "Kevin F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Not much for kids, especially under 10. I brought my 5 year-old son and his 8 year-old cousin. Under 14 are not allowed on the free-standing boulders, which is about half the gym. We were also not allowed to do any roped climbs, as they \"have no process in place\" for checking out (my) belaying skills. (The roped area is miniscule, but would be good for kids.) For my five year old, even the \"VB\" problems - of which there are 3 or 4 - proved too difficult. We made the best of it but I wouldn't come back with kids. I should have trusted my instinct and gone elsewhere once I walked into the place, but the kids didn't want to get back in the car. FWIW, I've been climbing for 25 years. There was a summer camp going on while I was there and there seemed to be a lot of showmanship going on on the part of the instructors, especially on the slack lines. I joined Yelp just to post this review.", "date": "6/30/2015"}, {"review_id": "FjZNFd8BpnFV1aUFpuI7VA", "user_id": "HTAly9_AdStORywNWLiSRA", "user_name": "Jon Y K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We took 5 9-year olds to Bridges Rock Gym for our son's birthday party. The boys had a terrific time on the climbing walls and on the slack lines. The fee was very reasonable and, more importantly, the support couldn't have been better or more friendly. \"Alec\" supervised, instructed and belayed our kids and did a really good job of it. He was encouraging to the boys, including one who was a bit frightened and reticent, while, at the same time, maintaining control and keeping them from doing anything endangering to themselves or others. He was wonderfully patient and understanding...and trustworthy. The birthday package we purchased entitled our little group to an hour of supervised climbing and then an hour at their indoor picnic tables to share food. You're allowed to bring in your own. However, we didn't want to do the food thing as we were taking the boys to the Parkway theater for movie and lunch after climbing, so we arranged for our kids to be able to climb on the non-belayed  climbing walls. We were told that if we wanted supervision for that hour there'd be an extra charge. We decided to supervise ourselves, but Alec came over even though he didn't have to and he stayed with us for the second hour on both the climbing walls and the slack lines, as well. In the meantime, the manager, whose name I didn't get, was all over us seeing to it that everything was going well for our kids. I was struck by how gracious and attentive he was, particularly considering that the place was quite busy and he had a lot more to do than to take care of us.Our sons have climbed at a number of rock gyms. Mission Cliffs in SF is more impressive than Bridges as its climbing walls are probably 2-3X higher than at Bridges and there are far more of them, but, on balance, we'll be going back to Bridges in part because it's really quite nice and in part because the people there made it a very positive experience. At Mission Cliffs and some of the other places, they seemed to get lost in the crowd. At Bridges, that didn't happen to them, nor, as far as we could tell, to anyone else.We highly recommend this place for kids; great place for birthday parties.", "date": "12/14/2015"}, {"review_id": "_YCrSP_ERHYnbvhm7bI5sg", "user_id": "opdbggrufvUGH8gP9wHL8w", "user_name": "Brian S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "While Bridges tries really hard to compete in the fierce climbing gym market of the Bay Area, it really falls short.  It has some major pluses; the staff is incredibly friendly, there is the option to \"top-out\" (finish your climb on top of the wall and then walk back to the floor), and the location is very convenient for anyone living in El Cerrito, Albany, and North Berkeley. However, even though this place is only a five-minute walk from my house and GWPC is a minimum of a twenty-minute drive, there's just not enough here to make me switch from Touchstone. The gym is almost all bouldering, with only a couple top-rope options. The fitness equipment is sorely lacking; there are mostly machines with a huge lack of free weights.  And, the classes are pretty sparse.  This is a nice place to spend an afternoon or evening bouldering, but there are better options in the East Bay if you are looking to join a climbing gym.", "date": "4/20/2013"}, {"review_id": "seUZ9A7iyjLL-MJZPmD9bQ", "user_id": "SFi0ZogbzaYvMPVJJJqBIw", "user_name": "Grace S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "I just wanted to add to all the love everyone has for this place.I've been coming here for at least a year now and I can't think of anything bad to say about this place. It's a large bouldering space- and the wall problems change around every 2 weeks. They have a slacklining area, workout classes, and fitness equipment. Their facilities are really nice and they constantly upgrade the space- whether it's hanging artwork on the walls, providing new rental shoes or having cubicles for visitors to put belongings. The staff is always friendly and attentive and I don't think I'll ever find a better gym at a more affordable price!", "date": "9/8/2012"}, {"review_id": "jOlC1mI7uMsOky6QQRrPrA", "user_id": "BiWYDNIf7gBBNRtP6YVwIA", "user_name": "Karen M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Likes: Fun.  You can boulder, rock climb, balance rope, etc downstairs, or gym it upstairs, or use the sauna included in the ladies locker room.  I had fun bouldering since I'm a beginner.  $3 shoe rental is pretty reasonable to me.Dislikes: There's a locker room but I didn't have a locker so I had to leave my nice stuff in a corner like some other people did, and I didn't feel too comfortable about that", "date": "3/28/2011"}, {"review_id": "hMt41FYIwcHev7rMkYk7kg", "user_id": "wmXc4PwvEd-HYDHnKbuMBg", "user_name": "Kantima C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 3, "cool": 2, "text": "only 4 stars because i've only been taking yoga classes here =)First i've gotta say that I am not a yoga guru or anything, just an amateur. All the classes are for all levels, so really no pressure on how low you could bend! eiei..    The main yoga instructor, Molly, is the best. She's got a soothing voice, a qualification that all yoga instructors should have. It really makes a difference! The transition between the poses moves rather smoothly..  But the rest of the instructors are also pretty good and now they actually hired more instructors, and each one has different approach to yoga which can actually help you from getting bored of the same routine. Their facilities are nice and clean. The only thing I wish they have is wall mirror in the yoga studio. so we can check out our poses or our behinds sometimes?? huhuhu...", "date": "9/27/2010"}, {"review_id": "KcPbEHukVWeGgANdV0TYrQ", "user_id": "_wXDCJIAbCkP4Y8otK6mTQ", "user_name": "Gregory I.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Never crowded, staff is always friendly, and the climbs are very thoughtful. They have fresh courses every week. Definitely a repeat visitor.", "date": "9/18/2012"}, {"review_id": "MV3KbdR_mslvVXIFw0v1oQ", "user_id": "lYNUBmXI1okw2bRXV-EDsg", "user_name": "A S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Had a great time here.  Good if you want to do free climbing (no harness), not so much if you want a place to workout.  The floors are just big squishy mats and they have all the different levels of climbs routed with colored tape.There is also a wall where you can belay if you are into that.  Also, a couple tight wires.Reasonable prices and worth checking out.", "date": "10/21/2010"}, {"review_id": "c77sOLjaVjEQh3_KVf0dDQ", "user_id": "fkLmKUTtu9LQ8bIDh1pVeQ", "user_name": "Derrek C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "What's there to not like about Bridges?The staff and other climbers here are very friendly.  The problems are fun, challenging, well-rated, and the option of topping out is a huge plus!  It really adds an extra dimension to every problem.  Also, the holds aren't greasy (they're very well kept, actually), and the 4 dedicated slacklines give you something to do when you need to take a break from the walls.  I haven't used the gym equipment upstairs, but they appear to be well kept too, and I never hear any complaints about them.  Just beware of Friday nights here--although it is discounted to $5, all the UC Berkeley clubs, along with other rabid groups of college students come and swarm the walls, creating long waits and potential hazards.  They do step aside if you ask them to, and they usually climb themselves out after an hour or so.Also, after climbing at some rock gyms in other states and countries, I'd have to say that Bridges has spoiled me rotten.  It's truly one of the best.", "date": "9/16/2010"}, {"review_id": "eSLkmkAflXP8dccAWfG_Og", "user_id": "6KstATrjTJQZXbW8XZB6ow", "user_name": "Erika J.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE THIS GYM everyone is so friendly and helpful. They offer so many classes, and way more things like slack lining and rock climbing OBVIOUSLY lol. But definitely check this gym out.", "date": "9/19/2013"}, {"review_id": "2iICAEHcyyEbR2ZR2mnWpw", "user_id": "HNms1vShPaqUceZ-2xPJnw", "user_name": "Zak G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I like this place but some people that come in are down right oblivious to people climbing around (and sometimes above) them. When I'm climbing in the overhang area, I end up above people. It's a safety issue and really annoying.", "date": "2/15/2013"}, {"review_id": "x8rczCnjs-rXYGg5eX_iDg", "user_id": "l1ZLbjK0REFjn1S4HQ83Mw", "user_name": "Oliver R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "EDIT:  Since I posted this review, Bridges has completely fixed the problems that I had with the gym.  Children are now given proper instruction before coming in, and they've set up specific areas for the kids to climb in.  They also stitched the pads where I sprained my ankle, so I'm satisfied.  I put these comments in the comment box here and they tried really hard to fix the problems.  Thank you.ORIGINAL REVIEW:This place is fantastic.  When I first started coming It was a lot quieter and better kept.  I just have a few complaints.  I sprained my ankle here really badly because there is a tear on one of the seams that they haven't fixed.  Foot went right through the pad and slammed against the concrete floor.  The guy there told me that I should have checked the pads before I climbed... Isn't it their job to maintain the place and make sure it's safe for the climbers?I have also noticed that the kids there can get really dangerous.  They're always running underneath me or climbing into me while I'm on the wall.  They should give them a list of rules before they allow them inside.Besides these two little gripes, I've had a great time there.  I go about four to five times a week, and have for quite a while.  I plan to continue going there for years to come.  It's much quieter than iron works, and it's a lot more comfortable atmosphere.  They frequently put up new problems, and I think they're getting much more interesting than when I first started coming.", "date": "1/19/2011"}, {"review_id": "9bbTHz9wAZd_zc6btiwFHw", "user_id": "icGEmAPhj2pIyXe8maV6WQ", "user_name": "Jason S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "It took me one visit to sign up for monthly membership here.  They charge ~35 bucks a month for unlimited access to the bouldering facilities, gym, and yoga facilities.  They specialize in bouldering and slack-lining, but their gym amenities are decent (complete set of free weights, benches, and various cardio equipment).  I haven't taken a yoga class with them, so I'm not too sure how their studios are.  One thing that is incredibly obvious, is that their facilities are CLEAN.  Their restrooms are WHITE and SHINY.  Their water-fountain doesn't have any nasty gunk from extensive use.  Not a single one of their free-weights are rusty.  I'd say that's as good as it gets when it comes to gym provisions.  It's literally located in the back yard of Pacific Mall (Ranch 99 Market) in (technically) Richmond*.  I usually go every week and do some bouldering, just prior to grabbing some groceries at Ranch 99.  Makes for an efficient and convenient stop right off the I-80.  As with most gyms, the standard \"if you die, you may not sue us, and you indemnify us from any fault/liability relating to your death\" waiver  applies.  Fortunately, everybody who frequent Bridges Rock are very mindful, courteous, and respectful of the other gym users.  It's definitely a great place to frequent.  *The entire block of land that Pacific Mall is built on was purchased from the City of El Cerrito by the City of Richmond.  The block of land is now referred to as the \"Richmond Annex.\"  Though it is geographically smack dab in the middle of El Cerrito, it is technically part of the City of Richmond.", "date": "3/28/2010"}, {"review_id": "RI7sCYWR5VGrgxlS2RxeCw", "user_id": "Ay4ki4c3LplmI2cF6Wwcog", "user_name": "Brian Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "NOTE- this review is based on using a yelp coupon.  A little on the small side, but overall it was a fun time.  Reminds me of how out of shape I am, and how in shape this place could get you.  Went with the fiancee and our other married friends.  Seemed like everyone had a fun time.  Make sure you're in shape or you will be tired quick!", "date": "9/24/2012"}, {"review_id": "jX6CggrEGraogdO1gIzOpA", "user_id": "4IjzfbO7XKFNWWVufHNhww", "user_name": "Natalie N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I am a complete beginner at rock climbing so when Groupon came up with 3 passes to Bridges I thought it was the perfect way to try a new sport. I came here on a Sunday at about 2pm and it was pretty packed with people. For a beginner it can be a little intimidating cause it is bouldering (or climbing without ropes). The front desk was nice and pretty much told us go have fun and explained the markings on the rocks (which I didn't get at first but then it began to make sense how the routes are labeled). I never realized how much strength it takes to climb and some of the girls out there were amazing. It looked like they had been climbing forever. I actually liked the tight rope more than climbing! It was really fun and so were the rings that you can hang off of. The gym as a whole was set up well and the bathrooms were kept clean. Sunday afternoon was a little busy for a beginner so I might try a different night next time. It would have helped a little being shown the set up of the wall but I am sure if I asked they would have been more than accommodating. They also had a special to add on classes which was great!", "date": "7/26/2010"}, {"review_id": "jhaEEb-1H9t-GmP7rTQ-6w", "user_id": "0vGG4M5ZiVvwnY3GdctoKQ", "user_name": "Dana J.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "LOVE this place...I was ready to join for the year after about 4 Yoga sessions with various instructors. I'm also doing CrossFit, so really wanted to add the Yoga for the stretching, balance and focus. They have a room full of machines...but since I CrossFit,  I haven't checked this out yet. They offer climbing classes, massage (you pay extra for this), and a sauna and showers (which is included). The bathroom, showers and sauna are always clean. Big brownie points from me on this...and the staff at the counter are always friendly and helpful. :)", "date": "10/10/2012"}, {"review_id": "203fSohLYAfXJ7r_loXiCw", "user_id": "iB9nlEnEMPewKBqOieDpyw", "user_name": "Cindy H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I bought a 5/$25 bundle from Yelp's deals and couldn't be happier. Friendly staff and lots of different obstacles from beginner to advance. This guy I talked to while being scared shitless at the top of the rock said that one of the good things about this rock gym is that you can \"top out\", as in you can climb over the rock like in a real life situation.  I look forward to coming back.Cons: hyper kids running around and stinky rental shoes.", "date": "7/3/2011"}, {"review_id": "OtVoym9GN-eFmlHLC24qwA", "user_id": "Y5PSY9yQCZx5sY4H7c1aqg", "user_name": "Katie C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I absolutely love this place.  The staff is very nice and its clear they love what they do and are happy to be there.   The classes are always small so you get tons of one on one attention. The weights and machines are always available.  The best part about this gym, is after a long workout you can sit in the sauna.  Love this place!", "date": "1/4/2013"}, {"review_id": "wOKEBZ_GugXf1ZqJHR8QZg", "user_id": "iwaC2ZAw7lQgwA5_tCS6sQ", "user_name": "Iris K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of those places that I keep meaning to review, but have never gotten around to. I've been coming here, on and off, since 2011. Finally joined up in 2012.The basics: it's primarily a bouldering gym, with a half wall devoted to top roping/belaying. There's an area for slack lining and they've slowly added on additional things over the years. There's now a weight room, a cardio and free-weight area, a place to lounge, and a separate yoga studio. There are full locker rooms (and you can borrow locks at the front desk for free) with showers that are always kept clean. There's also saunas and a massage room on hand, for those of you interested additional perks.Gym membership (for which there are always good deals happening) gets you into EVERYTHING, including a slew of classes, from yoga to kickboxing. You also get a free guest pass once a month, the better to lure your friends with.The intangibles: what sets Bridges apart from most other gyms is the excellent job they do at fostering the feel of community. They've got a great Halloween party, host climbing events. The guys and girls at the desk are always friendly, know your name, and willing to give advice on problem routes or even who to take the steps as a beginner to being a better climber. The attitude seems to carry over to members. People are always willing to help out, point out next steps, cheer you on.  Parking is a little sparse, but you can always park at the Ranch 99 lot.Overall, 4.5 stars with the parking situation and lack of a full cafe being a minor, but important, issues.Join up, start climbing. Your arms will simultaneously hate you and thank you for it.", "date": "6/6/2013"}, {"review_id": "5KDfvsu-YGSH5KyC8m6_JQ", "user_id": "MKOiq2FFNut6Nq5e36-TkQ", "user_name": "David S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great bouldering gym altogether. The route difficulty levels are sometimes inconsistent, but there a lot of options. Great place to go on Fridays! 4.5/5", "date": "7/21/2013"}, {"review_id": "NhOCuG7saHdLV7sc07Y_6w", "user_id": "S92ah1qzoxFUawG73lfR_g", "user_name": "John S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I come here mostly for bouldering, typically on Fridays when their day passes are $5, and the equipment rental's $3.  They have bouldering, indoor-climbing, slack-lining, rings, and this weird pvc container that has water in it (which you try to lift and hold above your head for as long as you can.  My personal best was 2:13).  They change the climbing routes typically every week or so, and it's always a great place to go with friends.  The staff here are also all very knowledgeable and friendly!", "date": "3/2/2011"}, {"review_id": "n6utZD76LImh9l1ZPHNLpg", "user_id": "_kN-YGPzrh94XT_PvQPE4A", "user_name": "Lin C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is sooo personal and friendly! My kids love it here.. A place where the whole family can workout and have fun at. Too bad I've moved out of the area or I would be a regular.", "date": "5/14/2013"}, {"review_id": "F_aWXYqS4umdbZatA0F4SQ", "user_id": "sWB6PdxsMERWY2OVyDGLRw", "user_name": "Michelle B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Had I not fallen off the top of a wall without a spotter, which is my own fault, I would return.Minus my trauma, there's a lot to do here. Bouldering, rock climbing, slacklining... They have cardio machines upstairs, massages, and yoga and fitness classes! So whatever your mode of fitness, it looks like it's here!", "date": "2/1/2013"}, {"review_id": "FVrRW55X0-cYmpucFWus2A", "user_id": "oCLJnBEx9EoTfSBgMYDr6Q", "user_name": "Katie K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I make it a point of going to climbing gyms whenever I'm traveling to check out the ambiance and local scene. I'd have to say that the feeling at Bridges is much more chill than at the Touchstone gyms in the Bay area, what a welcome change! The people here were very friendly and didn't seem to have something to prove like people in some climbing gyms. I expected a bouldering gym to be filled with macho types, but that was not the case. The only downfall of this place is that very few routes had a good flow to them. I was climbing VB-V1 so perhaps the routesetters take more care in the higher ratings. I'd go back here next time I'm in the area for sure.", "date": "5/15/2013"}, {"review_id": "FbQNJXuhgeayi9oNbMhqhg", "user_id": "G8BTVgv6BeOP1_CUAL_Aig", "user_name": "Joe C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place is awesome! Today was my very first visit! I came with 3 other friends. We had the Groupon and it was a great price and includes shoes and chalk so that's a plus! At first it looked so intimidating and I fell on my behind and back a few times before getting a hang of it. It also helps that it was labelled and two of my friends are regulars so they knew what was hard and easy. It's hard work but it was super fun and I'd love to come back again!", "date": "8/3/2014"}, {"review_id": "wpqIu-LuuFdO7PAB4K_PDg", "user_id": "5KgNCswViSMz238RNEuzag", "user_name": "Tiffany P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I have never climbed before but I had to do it for a project. My first time there went well. It was nice because they open 7 days a week. The staff there are friends and the bathroom is very clean and well kept. Overall it is very fun and I had such a good deal on Yelp!", "date": "5/1/2012"}, {"review_id": "oL01dgqnmNNARYe4B_Cznw", "user_id": "XedjzqGIFrH-2u9rB89GdQ", "user_name": "Steven Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've recently started coming here regularly to boulder. It's pretty crowded on Fridays because of their $6 deal, but it's less crowded earlier in the week and in the mornings. The problems are fun, fair and challenging and the cushion they provide makes bouldering here very safe. I've fallen from at least 15 feet and haven't gotten hurt. The staff here is friendly and they provide decent workout space & gym equipment. Overall, this is a great place to start bouldering- and they have a large range of problems for the advanced climbers as well.", "date": "9/8/2012"}, {"review_id": "qnL8eLvPBeTHl2O4u10gAQ", "user_id": "7AfogNkApCWDt7rZ4D59QA", "user_name": "Christopher M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "After moving from southern California in August, my first order of business was finding a quality climbing gym.  However, I was not expecting the ridiculous prices (70$ per month with 100$ initiation fee...really??).  I had been paying about 30$ a month down in LA and was NOT going to pay almost triple that. I began climbing exclusively outdoors for the next few months before hearing from a climbing partner about a Groupon special Bridges was having.I checked it out and have been hooked since.  Not only is the price affordable (45$ per month) but they also regularly have Groupon specials (I bought a ten pass card for 45$!!).  A huuuuge plus is that there is also slacklining and saunas in the locker rooms!  Before I had hardly been in a sauna; I am now an addict.The only real downside is that the roped climbs are pretty much worthless but that is something I can live with until Touchstone and other companies decide to get off their high horses and stop charging prices only rich kids' parents and the bay area elite can afford.", "date": "2/20/2011"}, {"review_id": "fNYSMcSPmhW7KF5VwddlMA", "user_id": "aoA-2p3N-kG8TpvXR-aDXg", "user_name": "brian k.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "a great place to unwind, blow off some steam, rediscover how out of shape i am. i climb some and then play around on the slack lines, take a few falls and head out for lunch. i'm pretty much recreational climber? but they've had enough yelp/groupon/living social deals that i don't need to pay for a membership, which is nice. i appreciate that. i also like that they're situated next to 99 ranch where i can stop off and get a boba or something after a climb. i have not tried their classes, massage, but i do like how they've expanded their offerings with some more gym equipment and the cafe. bridges is definitely a nice place to go and get some exercise with some friends. their staff is friendly, knowledgeable, and can offer useful advice when solicited.  makes me think i should take a couple of their classes though, huh?anyhow, i kinda wish their membership was a bit cheaper, but i guess it's geared toward the frequent climbers. i'll survive on my yelp deals for now and hope they keep offering them up every year.", "date": "4/4/2013"}, {"review_id": "hwWm2XMZxELhSt36y1BXdw", "user_id": "VU-RhCQa7CCX94fvkyoSlg", "user_name": "Stephen G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is super fun. I really like the slacklining parts and the owner is pretty great.  They also have some awesome bouldering, I'm told, but I don't boulder.The classes are varied and fun, and I wish I'd taken more of them when I was in that area.  Great gym at a great price owned by a small local owner.  Give em some love! Woot! Bridges", "date": "6/25/2013"}, {"review_id": "pxjSlJk6-ywyzWVJ7xhEdQ", "user_id": "Da_ZO8lKwIacljqKUJbAlw", "user_name": "Jill k.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "wow, this gym has a little bit of everything!  yes, its a rock gym, and that takes up the majority of space and energy, but there is also gym equipment, treadmills, classes (zumba, yoga, pilates, and bouldering, to name a few) and massage!  the people here were very nice, the facility was clean, and altogether, it was a fun (and challenging) way to exercise with friends!note: this place is a a TOTAL bargain, but you can just check out the website for that info: bridgesrockgym.com/?q=pr…", "date": "12/21/2011"}, {"review_id": "hp3Z5FFGRQr1RP7usjGhAA", "user_id": "PiCaauHnFjpa9t7RcOeW8A", "user_name": "Charles P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "LOVE this place. I walked in brand new to rock climbing and was welcomed by a super friendly, relaxed staff. It definitely has a community feel to it--I've walked into some of the bigger Touchstone gyms around the Bay and felt a bit overwhelmed by the crowds and size of them all. I can hang out and climb at Bridges for hours at a time and make a few friends along the way. The problems, showers, yoga classes, and other amenities are all quality. Check it out!", "date": "9/8/2012"}, {"review_id": "26ujrWxmKnxc651N4tFMhg", "user_id": "QoUfhz_F1KK5C6c5FS5AcA", "user_name": "Marie C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been a member of a couple climbing gyms in the Bay area and I hate to say it, but people who belong to climbing gyms seem to be really elitist jerks!  And if they aren't jerks, cause they all aren't, then there's just too many of us in one place!I really like Bridges because it's small and cozy and seems more mellow and family oriented.  I hate writing this review because I'm scared it will become popular and crowded...Oh well...I like the yoga classes too, that little room is so 'state of the art'; everything is clean and new.  The people who work here are so nice, as well.The owner checked me in one day and I had no idea until I was introduced to him later.  Feels like a 'small family business' and those are the kind I like!", "date": "4/24/2011"}, {"review_id": "aZ4_UZ-B3CjYBKq8Wk9RJQ", "user_id": "0cxjw7T32OWr8SBhFYYWaw", "user_name": "Jeff H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place. un real for all the rock climbing fans. if the had a little bit bigger weight room i would have given it 5 stars.", "date": "12/11/2012"}, {"review_id": "jzLZyZi3W-Ne3XJJkbxi5w", "user_id": "-qGY8wOtc9ZdYUSVkSm8Dw", "user_name": "Chris M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "excellent gym and great customer service. manager took great pains to resolve a billing issue for me.", "date": "4/14/2015"}, {"review_id": "s6my0aB8J5O0eLsxXG3j2g", "user_id": "6sVawZyUotK8tccSO5gOzA", "user_name": "Bibby L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I thought everyone who worked at this gym was great and the walls had tons of intricate bouldering problems. When I climb that high, I like top-roping better (only because I'm scared! haha), but if you're a big boulder fan, this place is perfect. I enjoyed the slacklines a lot and some of the other people using them, as well as employees, showed me and my friend how to use them. It's a little bit confusing to find the place - it's tucked away in the corner of a strip mall area - but once you do, it's easy to get back to later.", "date": "9/11/2012"}, {"review_id": "_3fncf_VROmgeV_hrwYekg", "user_id": "LNzV91TA4csV5oCfQke6IQ", "user_name": "Claire H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here twice so far. The staff is very nice and friendly, as well as the members that I talked to. The space is great too!", "date": "9/13/2012"}, {"review_id": "s9HX1YGKSlGesy0_16Ro9g", "user_id": "ESm8gfbgt9P7XKRlmsr9bQ", "user_name": "David M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been to a lot of climbing gyms when I travel for work and this one is the best I've been to away from home. Cool thoughtful routes that call for a variety of different techniques (I'm an intermediate climber, V3-V5 if that means anything to you), friendly members and staff (which is so nice when you need some help with a route), and the gym is small but well-rounded. I feel like it would be a terrific place to start out as a climber, and I think bouldering is SUCH a better way to start climbing than using the ropes - no fussing with 1000 things, no waiting on your flaky friend to meet you, just the (fake) rock and you. Try this place out and I bet you'll be hooked.", "date": "3/3/2015"}, {"review_id": "lbEZqOYuYILnf3wJWf9c8g", "user_id": "BZ37u0nH6P6WYOrA_waAxw", "user_name": "Kimma R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I came here with two ppl. Joe was super super nice ! All the stars are for him .They don't have harnesses here . Though I don't think I'll be returning bc the white loud lightweight flamboy dude rubbed my friends the wrong. They said he was being kind of a bitch about me attempting my third time over a slight tilt wall. I didn't really hear anything he was saying bc my adrenaline was going due to the fact that I WAS really really high and I was about to drop. So we prob won't be back since he was kind of a dick. We'll go back to diablos rock gym", "date": "9/9/2014"}, {"review_id": "CttKvF7gk7DjhHQqrSE2aQ", "user_id": "jBlRERVgWAghCB5kX87P3w", "user_name": "Shintau L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My friend bought me 3 day passes to this gym for my birthday!  Let me tell you, it's AWESOME!!!  They have bouldering, rock climbing, slacklining, yoga, and a gym area with cardio and weights.Bouldering: The gym is mostly bouldering, which I was nervous about but after a couple of days of bouldering I'd say I prefer it over climbing!  The mats on the floor are super cushion-y so it's very safe to fall.  They also have a lot of \"over-the-top\" bouldering where you climb over the top edge.  They also change the courses pretty frequently.Climbing: Not as many courses but still a good amount.  Most people are bouldering so when you do climb you pretty much have the whole rock to yourself!Slacklining:  They usually have 3 lines set-up of 3 different heights and lengths!  I tried slacklining for the first time here!  It's really fun!  You have to try it if you haven't yet!Haven't used the gym area or yoga classes yet.Staff here is very nice and helpful.  And since the gym is fairly new, there isn't that many people which is nice.  But I'd imagine that it will get more popular soon and probably more crowded.", "date": "2/21/2010"}, {"review_id": "BUpgKVqi-Yad2L5d7w2tpA", "user_id": "DrQIGtj6sdWRgnrK_DezMw", "user_name": "Peter F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The gym IS pretty cool with Yoga, rock wall and some machines and classes. I Originally gave it a low rating because of problems with charges. Since they have taken care of it after reading my YELP review. I kicked it back up.", "date": "2/11/2015"}, {"review_id": "FhMn8lu_-N6DNxC5BOEUvg", "user_id": "hDT75YnEGuSsav5gqRBsGw", "user_name": "Eugene K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I suspect all the other reviewers refer to the wonderful lady sitting behind the counter as \"Damian's wife\" because of her unusual name: JEFFIE!Everyone who works here is super-friendly, and the gym is spotless.  You also don't have to worry about dragging crash pads around with you when working on problems because there's thick wall-to-wall padding.Another tidbit of information that hasn't been mentioned yet: Bridges is located right by a causal carpool location so you can be chauffeured into the city in the mornings after climbing and showering!  Check it out here: ridenow.org/carpool", "date": "7/11/2009"}, {"review_id": "FqHdq-YBe_wWi11XekS7_Q", "user_id": "7a0ZHoFfaIafUC7mnVHw1w", "user_name": "Will T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 1, "cool": 3, "text": "Amazing.This place is just incredible. Kudos to Damien, his wife, and their partners for getting such a fun place built and being such nice people*.The classes they offer are great and really informative. Take one and you're sure to improve in climbing / slacklining / pastry eating (this one is self-taught in the cafe).The more you explore, the more fun things you find. On the surface, this place is a bouldering gym (large rock structures where you \"top out\" over the top of the rock) which some vertical rock-climbing roped walls. If you look around, you'll find some lines strapped in at knee level, which turn out to be for slacklining - one of the funniest activities i've ever done.Upstairs, they have a loft which has a couch and flat-screen TV to watch DVDs. There's also Anne's Cafe where delicious smoothies are served. Sometimes they even have free samples, baked fresh in their ovens! There are also rowing machines, free weights, treadmills, and Precor machines. Explore some more and you'll discover that they have yoga 7 days a week, in the brown Yoga shed next door. Finally, you'll find some gymnasts rings that have been put up in the corner. Great for doing inverted pull ups / push ups and general ring work... I look forward to doing the Iron Cross one day.The other people who climb here are also really cool and friendly people. It really feels great when you get a random person encouraging you to finish the trail that you're climbing. This place could easily feel  like a \"home\".I saw the owners putting on a Birthday party one day and they were super nice and friendly to the partiers. Fun Fact: Damien is actually in one of the slacklining posters that hang up on the wall.*I am not connected with / employed by / related to in any way to this business.Oh yea, there's also a day-care / play area, sauna, showers, men's / women's locker room, and they have fresh towels available.", "date": "5/5/2009"}, {"review_id": "HExw1pFeLdHdCW0bE7_rIw", "user_id": "pqYbadKZVuYX5seYKrUrcg", "user_name": "Gestalted G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "i love the bouldering possibility! The people who climb here and the staff are friendly and gave me tips on how to slackline as well.", "date": "9/13/2012"}, {"review_id": "rSwJrclH0AXNPlpxppH4qQ", "user_id": "GM7lDobQ39WD2CJrsvC6vw", "user_name": "Geraldine A.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Got a yelp deal, woot woot! How about a 5passes for $25 yelp deal at Bridges??? Woot da woot da woooot woooooot!!!!I opted to invite my 2 sisters and 2 more sistahhhs/friends to go with me and redeem this yelp deal  to share the thrill and exhilaration of my first indoor bouldering experience; as my birthday celebration, no less: and partly to be okay with the embarrassing falls and not-quite climb attempts I was fearing I'd have...and yes I had them.  We were all first timers and Joe, the staff there at that time, was very encouraging and helpful in getting us geared right (and by that I mean, sized and matched with this black leather, sweat-smelling climbing shoes) and also get started with the walls. One sister was really a natural, she was up there in no time like a spider monkey. And so was another friend. The beauty of this place is that there are other friendly patrons that gave us the space and time we needed to conquer that first wall as warm up. Then as a team, we opted to step up the challenge a notch and tried the opposing wall which had a room for us all to be up the boulder, so to speak, and enjoy the would be view (if there were any, say, sky and mountain ridges whathaveyou: but in there it was fluorescent lights and the ceilings, which was a okay) Still, Joe was checking up on us and was encouraging. We had so many questions about the markings on the walls and the difficulty level of each color in the indoor rock wall. We had time goofing off on our attempts to conquer the beginner pegs to the intermediate ones. We got so carried away, we were helping my sister  map out expert tracks 18 feet up on the hardest wall with the steep angle...she made it...or so we thought, her arms gave her away on her last reach up top. Needless to say my spider monkey sister freefell from 18 feet up and landed thankfully, on both feet! Thank goodness, with no injury. You don't get a harness when you do most walls; that's why its more bouldering, really than it is rock climbing.  But there is one section where you could try climbing with the harness and belaying; but very limited spots and it wasn't quite inviting as the bouldering walls.We tried the slacklines as well and that was loads and loads of fun and laughter as we each tried to shake less and cross the lines with little help from ropes and we struggled with cool, calm and collected steps to cross the lines.If you've tried bikram yoga before you'd be used to the sweaty smell of the shoes...but other than that, it was awesome.", "date": "10/20/2011"}, {"review_id": "oCnAZRX0XneDZ10YLnuQ3g", "user_id": "hfKrvgheyM2K6ZzJeFjvEQ", "user_name": "Allen Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Things I like about this place:It's not that crowdedThey specialize in bouldering and it's awesome The slackliningThe gym at the top of the stairsCan buy half off coupon in bulk onlineLocationNot sure if I like these things so much:The topping outNo top ropingBit pricey", "date": "3/27/2010"}, {"review_id": "4wAgTCImcI7Ozx0iW_dcdA", "user_id": "rmnAz9F3yc5OL-66IbwTmw", "user_name": "Joshua S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Friendly workers and a great variety of routes.", "date": "8/15/2012"}, {"review_id": "8l3LMjMXT1Q1x0GVAIi2-A", "user_id": "onx_uHOJeUTPZ2giopGdmg", "user_name": "Jonathan T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great bouldering gym.  The ratings seem pretty consistent within the gym and there's a wide range of terrain and difficulty to choose from.   Even though already have a climbing gym that is closer, I'd visit this gym whenever I need a change of scenery.", "date": "8/10/2012"}, {"review_id": "ib8xTNPaNSg0TkE-72leaw", "user_id": "iMZKemFeBsI7uFKKKEhJDQ", "user_name": "David N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Been coming for a little over a year. Great place to boulder and slackline. I don't really use their weights or cardio equipment, but it is a good option to have. I have been to a few of their classes and they are pretty good. All in all, a chill, comfortable environment to climb.", "date": "12/2/2011"}, {"review_id": "MDGOx9xSkKOJO0ORKwGmxA", "user_id": "FUAaKOkf5Xs1DtuIoQzAIw", "user_name": "Es N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Don't think I need to say much about this place because it seems the general consensus is that it's great.  Love that it's all bouldering, love that they cater to locals (families) even though I'm not one for kids myself, love that they lowered their prices when the economy went bust, even love the photo exhibit they have up.  Love that it's super close to my house and that membership includes yoga, running club, and free intro to slacklining - which I still have to take.  They've also got an impeccable ladies' room complete with sauna.I like that they have a cafe upstairs though I've never hung out there.  The workout space is a little tiny, but I don't really use it so it's not a big deal to me.Most importantly, everyone who works here and climbs here is super friendly and just generally seem like good people.  It's a good sized space and intimate at the same time -- you can always count on someone to give you beta or encouragement when you need it.", "date": "3/26/2010"}, {"review_id": "MLruBPkPS7KAOYiGUXLGrg", "user_id": "mkxCw6GsMZDu-44_aCQTHw", "user_name": "Vanessa W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This is a review for their YOGA studioI didn't catch the instructor's name, which is unfortunate because she was wonderful.  She's a beautiful black lady -- dunno if that helps anyone :)Anyways, I'll break this down into 3 parts, the instructor, the class, and the space.The instructor is wonderful, she really sets a wonderful atmosphere for the class.  It is light but focused.  She cracks a lot of hilarious jokes and has great taste in music.  She makes it a point that she will go around to help adjust people but she won't be offended if you say \"no thank you\" or \"play dead\" if you don't want help.  I got only one adjustment but it was a helpful one!The class, the actual class didn't feel challenging, but seeing as how my shoulders are a bit sore today I might be lying.  It was one of the least crowded yoga classes I've been to, based on size and number of people and personal space.The space, man so this is a big studio -- it's a converted shed and in March it was still really cold.  It had no insulation and the heat escaped really quickly.  Someone mentioned that this was warm compared to in January -- I was kind of miserable.  Yoga should be practiced in a warm room (ideally) and it is much better for your muscles.  It has some fake wood flooring on cement (HARD and COLD) so keep that in mind.  The ceilings are an eyesore but not a big deal.  The main thing was how cold it was.The other part that was distracting, was during savasana you could hear people in the gym clearly and loudly.  Not very relaxing and mind freeing.  They also had music playing in the gym really loudly (it was a good song at least) but again, it kind of lost the point of savasana I think.So yea, I probably wouldn't come back.  I lucked out with parking but there isn't much space to park nearby.  There is the bonus of being close to Ranch 99 though =)", "date": "3/5/2010"}, {"review_id": "TFoANzA8-rJaFXRRMwygXg", "user_id": "64YhRXG2V-0f4g4a2Flrzw", "user_name": "Holly R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 4, "funny": 0, "cool": 1, "text": "If you are thinking of joining this gym in order to take yoga or pilates, think again. The classes are held in an unheated outbuilding (tin shed) that is not heated. The floor is good, and the instructors are good, but the room is frequently in the 50-degree range. I was one of the earliest members of the gym when it opened, and I was very excited at first. But after *years* of being told the heat situation would be resolved, I have become very frustrated. It's to the point that the instructors ask the class participants to ask the gym owners for heat. I still go to the gym, because it is convenient for me, the rates are very reasonable, and like the facility in general. But if I want to take a class, I wear lots of layers, and bought special yoga socks that grip the mat because with no socks the room is cold enough my toes go numb.  And it's not just me -- you have never seen such an array of creative attempts to keep feet from freezing while doing yoga. The owners did buy a couple of space heaters for the shed, but the heaters take a long time to warm the room, and the owners do not turn them on in advance of classes. They will tell you that they do turn them on in advance, but I am telling you from first-hand experience that they do not.  On Wednesday of this week, I arrived for an evening class, the heaters were off, and the room was 59 degrees. Yesterday, I arrived for a 10 AM class, same situation.  Be warned, they will tell you that the situation has been resolved -- I have been told this a minimum of 5 times -- but, the room is still very cold.", "date": "2/3/2013"}, {"review_id": "SSOrlvxQwRdrSRiYWN-yYw", "user_id": "Wjo4Sk8Vy9vZLhnqkCSleA", "user_name": "Xiao-Yen W.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is smaller than others, but very well maintained and nicely run. The people who worked there are really nice and helpful.", "date": "10/4/2014"}, {"review_id": "Cv7I6AJhMWNb8ZcD8abGEA", "user_id": "t9VLhfIHU9CcUdTNGRji8A", "user_name": "Dahlia U.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm not a climber, but I still love this gym. I use it for the classes and the weight room. This is not one of those gyms where you'll see rows of people sweating away on ellipticals praying to be skinnier. Nor will you see men loitering about the weight room trying to catch sneaky glimpses of their ripped arms. This is a friendly gym with the sound of kids voices as they encourage each other on at the slackline, a gym with good music, and with enough classes and equipment to keep those of us non-climbers plenty happy.", "date": "11/17/2013"}, {"review_id": "X_t6fRfE8YkcyE5Ja0-qPg", "user_id": "XkQqyWf9Q2r4hyrr6kV-Gg", "user_name": "Tina M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place rocks! Went there for the first time a few days ago. So much fun for a good price and for pretty much as long as you want. They have a gym, a section to walk tight ropes, and best of all, rock climbing. Definitely plan to go back a million times.", "date": "4/2/2012"}, {"review_id": "YIY7898aRM0zcfLxTdmnVg", "user_id": "XSE7XBAqcEuCpnWlC3dJ2Q", "user_name": "robert b.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is all about bouldering and it was fun. I've been wall climbing pretty often, but never spent time bouldering. It is fun, but calls for caution than I was used to. Being more aware of where your next step and reach will be with no harness! This was way harder than what I was used to. If a big guy like me can do this...anyone can if they just try. A great work out and most definitely a fun group activity. We will definitely try bouldering again. This spot is great because the employees are extremely well versed in what they do and are very friendly.", "date": "2/28/2010"}, {"review_id": "PBPbhEuguVltLsLhPuGtvQ", "user_id": "hK8c_NXRvP1g_WiRKG02qQ", "user_name": "Eddie T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Loved the new workout. I can't believe this place is just down the street from me! An El Cerrito fitness hidden treasure. The amenities are great and the line and climbing make this a great place to add an extra workout to your routine. I hit muscles on my body that I didn't know I had - and I workout 4 days a week - while having fun. I recommend this place.  It is a little pricey, but if you have the money to invest, I highly recommend doing so.  You will have fun and meet great folks that are climbers.  Everyone roots each other on as we try to master the myriad climbing paths.  Have fun!!", "date": "3/21/2012"}, {"review_id": "Oo_lq_YEKYfTSIO-1fnQvg", "user_id": "yWfkhnJG4LF4VziChTW7ZA", "user_name": "Jessica T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great bouldering gym! Clean, friendly, very chill. No poseurs in sight.", "date": "9/4/2012"}, {"review_id": "Y17dWnprncxCKao3QLmTSw", "user_id": "Fc1c6DWrROqBmRzZjirAgQ", "user_name": "Michael S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came to Bridges with a small group of inexperienced climbers as part of their $6 Student Night on Friday. Toss in a $3 shoe rental and it came to $9 altogether for a great afternoon experience.When I got there around 5pm, it wasn't too crowded and there was plenty of space for us to climb. As a new climber though, it was a little confusing at first to figure out how everything worked from the difficulty rating system to how to get down after climbing up. Luckily there were plenty of helpful climbers around that were willing to answer my questions and give bits of advice. Bouldered and slacklined until my arms got tired.When we were leaving around 7:30-8pm, another large group of inexperienced people came in and took up a lot of the space. Unless you're a cheap college student, I would avoid Friday nights.Bridges also had cardio equipment and weight machines for a complete workout, in addition to a space for workout classes (Zumba, kickboxing, etc.).I'm a person that likes to workout, but not just stand around and lift weights, so I figure I'll be back before graduating.", "date": "7/16/2012"}, {"review_id": "4shrCJn4owHg6gs1wAp3Cw", "user_id": "s2dKZXS_-Cmr4YAQoTR7sw", "user_name": "Ruth S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Update: I still suck at bouldering but I genuinely enjoyed myself this visit! There was a good mix of levels of ability, the staff very sweet and I LOVE LOVE LOVE the Sauna! Just my luck that I try this place (which is around the corner from me) fall in love, and now I'm moving....damn!", "date": "6/19/2009"}, {"review_id": "6ppLBoAnkIsFrNyGaZiR8g", "user_id": "kkQ_jPfnPvsDUsV4e2Uayw", "user_name": "Chris Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great bouldering gym.  I generally come in the middle of the day when it's relatively mellow.  The staff is very friendly and helpful and there's always lots of interesting and difficult problems (the routes at a given grade seem harder than other gyms I've climbed at).  The walls are pretty high and the top outs make the problems more difficult but more realistic to outside boudlering.  The are also much cheaper than other gyms in the area (i.e. touchstone) for memberships.  I do the slacklines occasionally between boulder problems.  Its a fun way to improve balance.  I don't use the exercise equipment much but there is a fair amount of that as well.", "date": "9/1/2012"}, {"review_id": "fKeojB2KFrp3L4QKaNhifw", "user_id": "IneO-505NNQOuablHCDLpA", "user_name": "James F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Bridges recently after not climbing/bouldering for several months. The bouldering here is really top notch. I have never been to a better bouldering gym (ok, I have only been to 4 other places..). I went late in the evening, when I expect they see the largest crowds. There was still ample room and the gym did note feel too crowded. They have a wide variety of interesting problems. The padded floor is great, and is really quite necessary given that most of their problems top out quite high. The locker rooms are nice enough. The staff is more than pleasant. Do note go here if you are looking to lead or top-rope. There are a few ropes, but there is a reason no one was using them (all beginner routes, and quite short by roped standards). I don't slak-line, but it looks like a good place for that. The rest of the gym equipment seems fine (nothing special). They claim to have yoga classes, etc., but I don't know about those.", "date": "8/29/2012"}, {"review_id": "KqMxyoZgriY55iM-Q9NVqg", "user_id": "vv7P1hrMPuCOAGssJkgdaQ", "user_name": "Ashleigh F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My partner and I *love* this gym. And that's saying a lot, considering I hate gyms and wasn't really a climber before we joined.  The facilities are immaculate.  The owners/staff are super friendly and always greet us by name.  Membership entitles you to all the free classes you want: yoga, core strengthening, climbing, slacklining, etc. The core class kicks my abs!I'd been gym climbing a few times before, and always with a belayer.  I've found that it's so nice to be able to just climb anything and not have to worry about that.", "date": "10/1/2009"}, {"review_id": "gW_DXbBypqmylFYN0tg7kQ", "user_id": "1vAMM-myaf5TdgUfPs5-MQ", "user_name": "Tracy H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had an excellent massage by Christina! I felt like i wasn't just being 'rubbed', this lady is a miracle worker/therapist! She was able to pinpoint areas on my back that i had forgotten i had injured 15 years ago. She worked them out and gave me helpful tips on how to keep these areas safe and healthy. I felt wonderful afterwards! Thank you and i will be back for more massages.", "date": "5/16/2012"}, {"review_id": "-cOJ4Mg7o9EdrUXEDsLy-Q", "user_id": "nnnhX-O0-7GruE204ZiHNA", "user_name": "Ekaterina N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went with as a group of five inexperienced climbers and had a great time.The staff was very helpful in giving us tips on both the bouldering wall and on the slack line. There were also plenty of easy routes, so everyone had a good place to start.", "date": "7/22/2012"}, {"review_id": "smXhEC5Aretzbx4W4hDlsw", "user_id": "0WCkLb4J-mKMKjR8oWZVRQ", "user_name": "Ashwin S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I haven't been working out for a while now and wanted to get back into shape so searched for some \"decent\" gyms in the area and the first one on my list was Bridges Rock.  The minute i walked in i knew this gym was awesome.  The staff is super friendly and welcomes everyone with a great smile.  Damien and his wife are totally cool.  They treat you like you're family.  He gave me a tour of the entire place.  I knew right away that i wanted to be a member.  So i joined.  Yesterday was my frist day there and it was incredible.  The tidyness and cleanliness of the gym is astonishing.  I've been to several gyms and this definately stands out.  They have free weights, treadmills, and some other machines you could use if you didn't want to rockclimb or slackline.  They have an incredible variety of classes from yoga, ab core workout to pilates spreadout over different times and days.  I tried rockclimbing for the very frist time and Damien was there to show me some basic steps and guide me.  He's been an incredible help.  I won't lie and say it was easy and fun, it was HARD and definately fun but i am seriously going back for more.  He said \"it's like a language, you'll eventually get better with practice.\"  The gym isn't too crowded.  You can get in, get your workout and leave.  It's definately NOT a meatmarket or a social ground.  People come to work out and have fun while doing so.  It's in a great location and the staff and members are friendly and welcoming.  Try it if you haven't.", "date": "6/4/2009"}, {"review_id": "4rQzDVVwzG4T_zAb2cPtGw", "user_id": "KQbs9H3gz8A1DF-9_oWB3w", "user_name": "Lyka C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "It is a bit small, but the coupon they offer is worth it to go.  I am not sure if the other indoor rock climbing gyms that they are affiliated with are the same size.  My daughter, niece, my friend and her son enjoyed it. There are many other things to utilize while you are at the facility.", "date": "4/16/2012"}, {"review_id": "fIuPUY70EHaJFv4fKO5WYA", "user_id": "oMem-_dyqT4LxlmRilaBug", "user_name": "Thao L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 2, "cool": 1, "text": "Went here for a free event, let's just say rock climbing isn't for me. But it was clean, fun (while it lasted), and a great rock climbing gym.", "date": "3/1/2011"}, {"review_id": "eptn-OCv-g4-9ddDEkTdmA", "user_id": "NCNR0M5evdswD5y39-jVNw", "user_name": "Pattie A.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went yesterday for a massage - Justin (I believe) was great - he hit every spot that needed to be worked on - wish I would of purchased a longer massage- I have been before and Kristina was fabulous also. I will be back ;)", "date": "4/30/2014"}, {"review_id": "g8KDaATv0_T8TfIfYr0QfQ", "user_id": "qxxphmDgKkmjQ8AxX80yQA", "user_name": "Jee S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've only visited one other rockclimbing gym in the area (Ironworks), and I have to say that this place is so much more inviting.  It's not as popular I imagine because of the location and the concentration on bouldering, but that suits me just fine.  No lines, no crowds, you can just take everything at your own pace.  Love it.The pricing's really good too.  You can spend a small fortune dropping in at Ironworks, but at Bridges everything's pretty reasonable.Little side benefit: once you're done climbing, you can grab some food or boba tea at 99 Ranch next door!", "date": "6/13/2011"}, {"review_id": "Yye-lcWJMlgrjtp4vIATfQ", "user_id": "_aKkgmlAS_kvlz8U2ORVKA", "user_name": "Sean L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "an indoor bouldering gym.got there almost right after opening so the entire facility was my clam.i feel bad that i forgot the lone worker's name cause he was real laid back and helpful.bouldering is a different experience than rock climbing; i was worn out after an hour.this review is weird.", "date": "8/23/2011"}, {"review_id": "zgQ6q7ZpIRUnVfjwiYLbUw", "user_id": "jBk367l4ovw_AQ7DxhgoYQ", "user_name": "Berks H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Really nice place for bouldering, much better than Ironworks for this purpose. Great atmosphere, and also cheaper. It would be nice if the opening hours would be extended, 7pm on weekends is a bit too early, though I appreciate the workers also need the rest...", "date": "2/25/2012"}, {"review_id": "eueVok_mtIuqcRfM3384lQ", "user_id": "4tvAhMoIKiq6bsJfVqNtwQ", "user_name": "J H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "Lately, the past few sets aren't fun but weird.Padding was pretty awesome when it was new and fresh but it has become a nuisance.  No one likes to trip everywhere they walk or twist their ankle by having their feet sink in a torn pad.  Fix it or replace it.No air circulation, gets way too hot and stuffy.It feels like there isn't any maintenance here.This place was awesome, now it's just eh.Also, I know many of the parents who bring their kids have complained about this but the front desk has obviously ignored them: Don't blast obscene gangster rap during children's birthday parties.", "date": "9/24/2010"}, {"review_id": "JrjaUQ8RWInKaoQCY2gSDQ", "user_id": "WNF7fKIypxmR6zZ5KI5AaA", "user_name": "Carmella M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here a while ago when there was a Yelp/Groupon deal. I think it was $15 for 3 visits? This included free shoe rentals. I liked how you could use one of the 3 visits to bring a friend.  This place was so much fun! People are so helpful and I enjoyed attempting to be agile and fit. Lol it's a lot harder than it looks and requires more upper body strength than I thought. It's a great physical and mental (it's kind of like a puzzle) workout. This place also offers treadmills, some free weights, tight lining, and yoga. If I had more time, I'd pick up bouldering as a hobby and become a member at Bridges.", "date": "11/7/2013"}, {"review_id": "CGpyFOfs34ocAj-IHaP_0Q", "user_id": "645HykrJrYnLqUd_UHGH8g", "user_name": "Sydney M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE this gym! Not only is the staff amazingly friendly and chill, but they ALL are extremely knowledgeable about bouldering and slack-lining (what the gym specializes in), and the whole staff actually DOES the bouldering and slack-lining! Which I know at a lot of gyms, the staff knows how to sell the gym but it's not always the case to find that they actually work out at the facility. Although they specialize in bouldering and slack-lining, they offer a wide variety of classes to take from yoga to zumba, and they also have a full gym with tons of brand new weight machines, free weights, physio balls, foam rollers...basically everything you need! The locker rooms have showers, a sauna, and are always spotlessly clean and well maintained. It's nice that during the week they are open until 10 PM, and they are open until 7 PM on the weekends I believe. Another great thing is that they offer student discounts on memberships and everything, and they have a minimum 4 month contract which is a great thing to offer in comparison to a year or 2 year contract. My favorite thing of all is that they do have good business for being a little hidden, but it's not crowded at all and I don't feel overwhelmed there like I do at most gyms.If you are looking to try a new approach to working out, or want to try something new and fun, you have to check out Bridges!! You won't be dissappointed. It truely is a hidden find!! :)", "date": "9/22/2011"}, {"review_id": "uf5C3aAv1nwhdEuZzWalQw", "user_id": "yQDln5pGs8TJgqfymL5Xtg", "user_name": "Dave C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The very idea of Bridges is exciting and new to the concept of indoor rock climbing gym model. Bridges is unique b/c as far as I know, it's the only gym of it's kind to exist. They have extensive slackline setups from short, beginner lines, long loose lines, to high lines above the boulder problems. This is great b/c rarely do indoor climbing gyms even have a slackline, if they do it's set up inconveniently and die-hard lead climbing jocks always complain if it's in their way. At Bridges the slack lining has equal importance as do climbing.The layout is utilized well. You have a cafe upstairs, and at the ground level there's bouldering problems, and slacklines galore.The bouldering is unique to where you can actually top out and then walk down to the ground.Overall I think this is such a new and fun idea/twist to the indoor climbing gyms that it's bound to pick up and become popular for everyone!", "date": "10/9/2009"}, {"review_id": "CQfSUehTlPYjqgemSshkSw", "user_id": "gRzyjARreVClhRPa_9FcsA", "user_name": "Jeremy Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "If you're into bouldering, this is THE gym for you.  No matter your style... vertical & crimpy? check. slabby & technical? check. highball topouts? how does rolling over 18+ feet off the ground sound to you? how about their huge 30 foot cave?  one word, SICK!  I've climbed at most of the gyms in the bay area, and have been a member of Touchstone for about 2 years... and mean no offense to any of them when I say that this place is an experience unlike no other in the bay area.Based on my first day there, the difficulty of the problems seem to be firm but fair, with a very nice variety for all styles and levels of climbing.  A very nice alternative to the Touchstone & PG mega-gyms, Bridges will have me coming back on a very regular basis.I didn't check out the fitness equipment or the cafe upstairs, as I was overwhelmed by the climbing options.  Location is easy go get to, right behind the Ranch 99 complex in El Cerrito.  Welcome to the neighborhood Bridges, I wish you much success.", "date": "3/30/2009"}, {"review_id": "r9JvpQ-UdqOxfXOql32T2Q", "user_id": "rZev6lzeZZy1YyhBPCjzUQ", "user_name": "Ian L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best & cheapest climbing gym for bouldering / slacklining in the Bay Area. Amazing rates, great membership deals seasonally. Holds are beautiful, clean. Routes are well-marked, of varying difficulty for all levels. Great atmosphere. Wish they had one in SF!Friday night is college night, and it's packed during the school year. Go or avoid at your preference.", "date": "4/2/2012"}, {"review_id": "87GCk9E5S12sjv78Tjt6sQ", "user_id": "ZZtWyxy3Y7SoOMIcY-IJtg", "user_name": "Monique B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Bridges rocks my world. First off, the bouldering problems and atmosphere is by far superior to Ironworks. I'm a boulderer at heart, so if no-ropes is not your thing, than this is not your place. You can top-out on all problems and the range of problems is staggering, considering the relatively small size of the place (again, compared to Ironworks). Prices are decent, especially before the afternoon rate kicks in, and when my brother and I go around 8 a.m., we are very often alone, or climbing among a few, sleepy-eyed, mellow fellows. The slacklining area is great and is a great way to rest your hands and arms between big climbs, while continuing to engage your core and balancing ability. I've never had to wait to get on a machine (elliptical/bike, etc), and enjoy the sauna after every climb. AND the staff is always super friendly, even at 8 on a winter's morning.Highly recommend.", "date": "12/21/2011"}, {"review_id": "Xi5BkaiCbw3Qp-IDDhZ_8w", "user_id": "DPPAIQ8TLkvqRRVOt_pdZA", "user_name": "Heather T.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Thank you Bridges for being my awesome, affordable, local gym.  The owner and staff are all lovely.  It's kind of a sweet, all ages establishment.  And while I'm not a climber, I can use the eliptical trainer to my heart's content (boring, but effective!), I'm slooowly learning how to slackline, and I have access to a regular schedule of great yoga classes all for the very reasonable monthly membership fee.  Yay.  Thank you Bridges!!!  I'm a fan!", "date": "1/25/2011"}, {"review_id": "g2B517EoHb9Q12IHySGkaA", "user_id": "spHc2bqMNSGENTgN242mGA", "user_name": "J L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love the selection of classes---from all kinds of yoga to Zumba.  The yoga studio is in a separate building from the gym, so it's not very loud in there.  The staff is super low-key and friendly.  I love that there's permanent slacklining, and the lines periodically change in height and width.  The bouldering space is pretty big and doesn't feel crowded like other gyms in the area....reminds me a lot of my old bouldering gym in Portland- The Circuit!", "date": "3/12/2012"}, {"review_id": "NP7P8yp_8gd9or8CjScW2Q", "user_id": "nYQz-c8GClKC08ixFmDU-g", "user_name": "Matt L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is AWESOME!  If I lived nearby, I would totally get a membership here, whatever it cost.The rock climbing is fun, there's lots of space and different levels of difficulty, including a spot which is basically hanging upside down (no thanks!).  I had a lot of fun climbing the rocks, and I love how it's so open so you can just go on your own and have fun.  They have a big open climbing area, another area off to the side with ropes if you want to be harnessed in, a smaller place for young children to climb, and they have slack-lines set up so you can work on your balance, too.What is awesome about this place is that upstairs they also have treadmills, elliptical machines, and exercise bikes!  Downstairs, they have a whole room full of lifting machines!  So you really can go here for everyday workouts, cardio, weight training, along with some really fun rock climbing.They also have really good hours, and the staff is very helpful if you need them, and out of your face if you don't.Oh, yea, I almost forgot!  The bathroom has showers and a SAUNA!  Just awesome.I've never seen a place with so much stuff in one location like this.  Definitely check it out!", "date": "1/10/2012"}, {"review_id": "EvOcYVOGGM8T3boME5a2fw", "user_id": "dkP6C1FfbNjrTCt3jPYbqQ", "user_name": "Maryam R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Wow..I want to give this 5 but I cant...cause of the ropes from when I did the harnessed rockclimbing. The guy gave us a great run through, but they kept getting stuck..and it really freaked me out. This place has an AMAZING bathroom, sauna, cafe, everything...i love this place...but the fact that the rope kept getting stuck.", "date": "3/26/2011"}, {"review_id": "eVQHGb9-u-wF_wVlwhmzTg", "user_id": "BkgyJd3Pimou3f6Xn7yq5g", "user_name": "DJ G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Bouldering-oriented gym like the one I grew up in. They always seem to have new problems (bouldering routes) set up.", "date": "3/14/2011"}, {"review_id": "ski-SYhHuHjZlNzE3XJNBQ", "user_id": "ybWX3Dx_iKSa75MOzA4Qhw", "user_name": "Shawn R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place.  Tons of intermediate level walls to get better quick on.", "date": "11/25/2013"}, {"review_id": "2sa80Vfk7RWubf1vsTVyhA", "user_id": "gk5BjGoT--YRci9ZJ_WElQ", "user_name": "Eileen L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "This isn't really a rock climbing gym ... this is more like a bouldering gym . There's only about 6-7 paths for rock climbing with the ropes and all the . The rest of the place is filled with bouldering which is basically the same thing but without ropes . Bouldering isn't as easy as it looks . Bouldering is actually kind of hard . My hands got tired and gave out very quickly . I can't really compare bouldering to rock climbing because I've never done rock climbing before . It's really cool how you can exit from the top for the bouldering paths . Just be careful of your head and be sure to duck down a bit when you get to the top because the ceilings are kinda low . If you don't duck down , you will hit your head on the ceiling . The exit route is narrow so be careful and don't get in people's way . There is a mini path on the sides where you can climb down from and exit . In addition to rock climbing and bouldering , they also have slacklining which is basically walking across tight nylon ropes tied against something . It's actually pretty hard to walk across the tight nylon ropes while maintaining your balance and not shaking . It's cool how they have ropes hanging from the ceiling for you to hold onto and guide you across the nylon ropes . They have three kinds of nylon ropes . There's one that's thinner and one that's thicker . There's also one that's very high . It was kinda cool watching one of the staff members jumping and doing tricks on the high slackline . There's workout machines at this gym as well . There's weight machines near the entrance and cardio machines and free weights upstairs . There's also sofas , chairs , tables , and board games upstairs . There's a massage place but I haven't checked it out yet . I heard there is a locker room and sauna too but I haven't checked it out as well . The front of the gym is kind of weird ... it looks like this gym was previously a garage or warehouse that's been converted into a gym . The parking lot is very small and only has a few parking spaces . This gym offers classes like yoga and other stuff which is pretty cool . I will be back for bouldering and to check out some of their classes . This gym is located behind Ranch 99 . I've been to Ranch 99 a million times but I never noticed this gym until I looked up \" rock climbing \" on Yelp . This is one of the reasons why I love Yelp . I discover all these places I wouldn't otherwise notice or know about . This is a decent gym if you're in the area but otherwise , I wouldn't recommend going out of your way to come here unless you love bouldering . If you plan on visiting , check out the deal on Yelp ... it's pretty good . You get 3 day passes to the gym for $25 and if you decide to get a membership at the gym , you can get your activation fee waived . Btw , their shoes might feel very small and cramped . It might feel weird but that's how it's supposed to be ... your toes are supposed to curl a bit . It doesn't feel weird at all when you're bouldering .", "date": "7/30/2012"}, {"review_id": "B6LsBdSXr0aEsyDzM-QqvQ", "user_id": "AHYuzyBCAPYqqVAgZdK_iw", "user_name": "Bob S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "No toprope, but toprope is for sissies anyway.  Cheap, and right next to ranch 99 so you can go get your groceries after.", "date": "12/29/2012"}, {"review_id": "OyUvJT4bf0oKBAqoV8gMVA", "user_id": "upmvpx1-gu8q7l9XpWdY5g", "user_name": "micah f.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Bridges is awesome. The bouldering is really cool - we aren't outside climbers (or real climbers, one might say) so we can't really evaluate the awesomeness. When I scramble up and over a V0, when I've conquered that mental game of courage and shaking forearms, it pure euphoria. That's all icing for me though. Really I go there for a monthly rate on decent yoga. The only thing is, the yoga isn't merely decent anymore. The instructors love working with good classes and although they started off really good, they've only gotten better. They bring their interesting personalities and incorporate bits of their own practices, which is what all the best instructors anywhere do. On the flip side though, every single class is beginner appropriate, and they'll help you ease into yoga. Yoga's dangerous for newbies! You can psyche yourself into thinking that you should be able to do that crazy feet-in-the-air crow pose with back arched without crashing into the ground. You can over exert yourself into weeping into the couch for two weeks. The teachers at Bridges are smart and caring, and can quickly find and help the beginners to learn how to self modify and care for themselves. Bridges is awesome. The wee workout center upstairs seems small, but it's never been overcrowded. If you know how to lift weights, then it has everything you need except for good options for doing pull ups. That's what the huge amount of bouldering and rock climbing walls are for. Climb a wall or eight, and your back is strong. Then head upstairs to do some curls and sit-ups, etc. and you have a pretty amazing workout.\\ Never too crowded, best clientele you could ever ask for at a gym, totally clean and cozy, cheap, Bridges is everything you could want.", "date": "2/23/2011"}, {"review_id": "waGEExd6AFaKFadtU6XuoQ", "user_id": "-r3hHtcz2QzhLMtk3u3Sow", "user_name": "Albert V V.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "awesome bouldering. nice employees. technique classes. yoga included in the membership.has some cardio machines, weights, bands, kettlebells, foamrollers for the traditional work out. often have deals on memberships and initiation fees.", "date": "2/19/2011"}, {"review_id": "IxzJ0YzOI6J7jF1mO3zzRw", "user_id": "IA1YgrSQineFvShYjyZ2wQ", "user_name": "Emily R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Why would anyone get a regular gym membership? Bridges has all you need from a gym (weights, exercise machines, classes), but that is tremendously dull. This gym is all about the boulders. Scary huge top out boulders, steep overhanging roof climbs, and a bunch of really fun problems. They set regularly and the staff is friendly and helpful. Ropes are lame; climb at Bridges!", "date": "4/25/2013"}, {"review_id": "Fv1kc224co6rQ89lglxyqw", "user_id": "eA0yoFJPCI_FZDV-dou1Eg", "user_name": "S H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "pros:- tons of bouldering- nice open space- clean locker rooms and sauna- friendly staff- friendly patrons- good music- constant new routescons: - too far from where i live after moving away from el cerrito", "date": "11/8/2012"}, {"review_id": "0pt5iDq6JcLxtpjEfU_n-w", "user_id": "24xfXj4ZbTd0hNQ8rBL5Ug", "user_name": "Colleen P.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Man I LOVE this place!!! I had never done bouldering or rock climbing & they made me feel so comfortable & showed me exactly how to do what. We had a phenomenal instructor named Wendy who was so passionate about climbing and explained all the details and techniques in such an awesome way that inspired me to climb everything the other people who had previous experience did. And when you fall there is so much padding that you can't feel a thing. I highly recommend this place for first timers or even experienced climbers, very clean, staff was so friendly and the lessons are very reasonably priced.", "date": "5/24/2010"}, {"review_id": "7cNgb4jczEJEKJAM3wfTMw", "user_id": "ZObHXI05ILUFpDo_m7DjzQ", "user_name": "Andrew D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I love bridges! I dislocated my ankle attempting a huge dyno there, and still I return for more!Located about a 10 min walk, and 2 min bike ride from El Cerrito plaza Bart station, bridges boasts the largest bouldering walls, and over hang space in the bay. The extent of the climbing problems presented is unmatched. If you want to get good at climbing you climb here. The allowance of topping out adds a satisfactory bonus to conquering your desired route. 3 slack line set ups from beginner to advanced are a great way to improve body equilibrium, also an upstairs weight set and treadmills are available for core workout needs. Saunas are available in locker rooms.The cafe and lounge area is great for winding down after working out, with free Wi-fi, and organic food. The always more than helpful staff is available for any inquiry, or if you just want to chop it up while smearing face. They offer drop in climbing lessons as well as drop in yoga. Child care is available. Parking is very limited; however the mall parking lot is not too far away.", "date": "12/3/2009"}, {"review_id": "PPlAffFm0DBn5f5PmMGKlQ", "user_id": "tEMO_UtXRo-n-JixaF7_tQ", "user_name": "Sam M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Brightest, friendliest bouldering in the Bay. Would (and do) strongly recommend it all of my friends, regardless of their previous climbing experience.", "date": "6/28/2013"}, {"review_id": "-UXl_P_oYejs-eZOff6ykQ", "user_id": "9Toje0DXjrOqJDOWrgsXwQ", "user_name": "Francesca S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've only come here for bouldering, but I plan on joining up and trying out a few classes. For bouldering, it's a great, low-key space. The $6 for students on Friday is a good deal, but be forewarned -- it's packed nearly all the way until closing time! Crowd is friendly, non-competitive, and folks are willing to throw out some handy tips when you're stuck, or strike up a friendly conversation.", "date": "3/19/2013"}, {"review_id": "F3yl37uBp6LgCLEzmU7q8w", "user_id": "jveoEMu4zEGmfUdcoFfjPQ", "user_name": "Edward C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Been here a couple of times. Facility is decent. Climbers here are cool.", "date": "12/28/2010"}, {"review_id": "4ilJsmuVujP5A5oVDDvXMw", "user_id": "CKhsBKUlIAMQh2GVE_wK9g", "user_name": "Craig M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 4, "funny": 0, "cool": 3, "text": "If you enjoy bouldering, Bridges will be utter heaven for you.  This is the nicest bouldering gym I've ever seen.The facilities are incredible.  The walls are about 18' tall, which is about 5' higher than the walls at the Touchstone family of gyms -- Mission Cliffs, Ironworks, Western Power Company, etc.  Climbers are supposed to \"top out\" on each of the climbs.  So, rather than having to jump down 18' when you finish a problem, you are supposed to pull yourself up and over the wall to a small walkway that you follow back down to the floor.  It's much more like climbing outside.  It makes the climbs a little harder, but it also reduces the risk of injury from jumping down.The floors are comprised of nearly 3' thick padding everywhere, so you don't have to drag mats around when you want to get on a challenging problem.  The gym is spacious as well.  So if you want to sit in front of a problem for a while and think about it, nobody is going to land on you while you're spaced out.One of the route setters I spoke to said they had 140 climbs up.  And the climbs are *fun*.  They tend to be set a little harder than the bouldering problems at the Touchstone gyms, but they are probably closer to the difficulty level of outdoor problems.  The staff said they plan to swap out climbs about every five weeks, which is more frequent than the Touchstone gyms seem to change their problems (closer to six or eight weeks).  There have been times where I've done pretty much every climb that I can do at my level at all three Bay Area Touchstone gyms and I still had to wait a couple weeks before new problems appeared.There will be a vegetarian cafe opening up in the gym shortly.  They have three slack lines for folks that are into that.  They have a small section of climbs for belaying, but they seem more targeted to kids.  The locker rooms are nice and have saunas. They don't have any weight lifting equipment, but they do have some treadmills and elipticals.  The *only* negative about the place is that it would be tougher to climb there alone.  An 18' fall without a spotter is kind of dangerous, even with the ample padding.  Climbers tend to be pretty supportive of each other, so I doubt that will be much of an issue once attendance ramps up a bit.All of the staff members I've talked to were super cool.  If bouldering is your thing and you're already a Touchstone member, I'd be surprised if you don't find yourself with another climbing gym membership.  I wish I could give this place six stars.", "date": "3/3/2009"}, {"review_id": "3ScbDLrihn5oIfNZ_JXjtQ", "user_id": "65mWqMNvjUSjgrcasOdPMw", "user_name": "Shoshana B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place to take kids!  This is one of my daughter's favorite places to go.  She's 9.  The staff was super helpful getting her set-up and giving her a few pointers, as well as giving me tips in how to best support her.  There is such a huge range that she was quickly able to find places on the climbing wall where she could feel successful.  When she gets tired of climbing, she heads to the tightrope.  We also LOVE the cafe upstairs.  Super delicious, organic,  homemade-style cooking.", "date": "3/24/2010"}, {"review_id": "0x5U9MXx9iVoxqJ8gopOHQ", "user_id": "Ei2-uftLLP-DZcdjc1Sw7w", "user_name": "Angus M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great value when your coming in before 3pm. Nice staff and atmosphere. Definitely the place to go if you want to start bouldering.", "date": "7/25/2010"}, {"review_id": "xLSgyeUvvNrDOcNBYor7TA", "user_id": "TVZcK1OhnmMmYbyD8no6PQ", "user_name": "Meaty M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "$100 for the whole summer (3 months) and they even waved the initiation fee. Not sure if they are still offering this deal. This gym rocks! One price for almost EVERYTHING including yoga and something called Qigong. Check out their website for more detailed info. Excellent locker room facilities. Hot yoga instructor by the way. Bonus. I think they have a different instructor on different days though. I can't remember which day I went. I usually just do the bouldering. It's hardly ever crowded when I go in the evenings. Yoga fills up fast so you might want to get there a few minutes early to get a spot on the floor.", "date": "7/15/2010"}, {"review_id": "VrCFm1Wqx9Xakjok1QfZ1g", "user_id": "i_is4plaIQhO5zddLvgsfg", "user_name": "Tito Y.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 3, "funny": 1, "cool": 2, "text": "Dropped in .. amazing location, unexpected actually.   I always have been an avid rock climber.  From top roping, lead climbing, self belay, ice climbing, technical climbing, speed climbing, safety belay, bouldering and even free climbing, I actually own lots of the coolest gear.  My experience in rock climbing goes back long before rock climbing gyms, so it is nice for me to see this turn into a extreme sport.  Rockclimbing is a lot like playing chess, with more than just trying to ascend to the top, you get points on style, difficulty, prior knowledge of how one positions themself.  Bridges Rock Gym is a safe, new environment specific to \"bouldering\".   Like several natural locations throughout the bay area, Cragmont, Indian Rock, Mickey Beach, Turtle Rock... parts or portions of a difficult solution to rockclimbing is rarely higher than 10 or so feet off the ground. Granted one could hurt themselves if falling wrong, generally the hopes is you would crash on a provided softened pad first. Bouldering can be a lot harder than roped routes as Bridges Rock Gym will prove to you.  Certainly drop over..  Cost is $58 monthly and/or $15 day pass which includes Yoga for free.  There is a nice cafe, showers, sauna and free wi-fi.", "date": "4/11/2009"}, {"review_id": "yTRArFs5jmxpgRknSIBGnw", "user_id": "gpH8L5N8WqdNEzUNNd68Fg", "user_name": "Daisy F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is kind of unorganized but the pilates classes with Emily are great!  I've taken a lot of pilates classes and she is by far the best instructor.  She's very easy to understand, comes around and corrects and/or makes modifications to your position, despite the class size being too large sometimes, and she's always cheerful.  I highly recommend her class, though now it might be more even more full.", "date": "4/9/2012"}, {"review_id": "3S2f1r6Kt7AorjD7JYHk_g", "user_id": "XxDPzTC-w1UucRUSoxW-bg", "user_name": "April D.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my cousins and we had a good time. I didn't really know what I was getting myself into, and even though I could have worked on more walls, I still had a lot of fun. It's not a place for harness climbing, as this place is really small. But boulder climbing is a really good workout and a way to get your adrenaline going a little bit. I would really like to get into this, because I think it's a great way to stay in shape, get over a fear of heights, and build confidence. And how convenient that it is near Ranch 99.", "date": "3/31/2010"}, {"review_id": "SiCChQ6KgshrBKfBD7almg", "user_id": "Iah4SaGFY4qFcSNw20RYbw", "user_name": "Ryan S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "There's plenty to do for the beginner and the expert! Great value when you buy the Yelp deal!", "date": "9/17/2012"}, {"review_id": "bHQ2iIgRuo62XbLxbFW46A", "user_id": "CAkHAf-busgW4RJ9VSyXYw", "user_name": "Zechariah C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best bouldering gym I've been to by far. Tons of different routes for any degree of difficulty and for a great price!", "date": "8/26/2012"}, {"review_id": "3VNAeNEUHesC5rpHEGoIOQ", "user_id": "N9Ea0mdUgVoKBxFYyf-vpQ", "user_name": "Alotta F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I am very new to rock climbing as a sport. I've always loved scrambling on rocks and climbing trees as a kid (and sometimes as an adult) and it's good to see that it never left my system. I came here on opening weekend and was instantly hooked. It's easy enough for a n00b like me, yet still be a challenge as I gain strength and experience. The facilities are clean and well kept. They are adding fitness machines up stairs and I intend to take advantage of the yoga classes this week, so I can't yet offer a review on them yet. My hands and nails are shot and I accumulate scrapes and bruises but I don't care. It's worth it. I feel like a big kid on a playground again blissfully unaware that I am actually getting a great workout.", "date": "4/19/2009"}, {"review_id": "wPnvqghibGe4tmr5HxAWAg", "user_id": "VV92J-aNHm0BVXTtLM31Fg", "user_name": "Brittany B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My favorite Gym! I love taking Zumba here.", "date": "10/5/2012"}, {"review_id": "Cb0f6DhCCNYdrhbCbjAXDQ", "user_id": "5m-p2ddJBi4nIXWSglVGEQ", "user_name": "Clara L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've known of this little climbing gym pretty much since it opened as it is right next to the Ranch 99 mall.  Though no longer a resident of the East Bay, I had never gotten a chance to check it out.  I recently was in Richmond for a week and purchased a groupon for a 3 day pass.  The parking lot needs some work (I hate driving on gravely parking lots, I'm always scared one of my tires will get popped).  Also, parking is rather limited.  The bouldering section of the gym is great.  So many problems to try.  I'm a weakling and try to stick to V0 and V1 routes.  There were LOTS to try.  The locker rooms arealso  really nice and the staff was very friendly and helpful.  However the regular gym section was not the best.  (I know I know, it's not the priority of the gym, i get it).  I liked that it has a nice view of people bouldering from the treadmills.  The weights were pretty limited though.  I definitely ended up improvising quite a bit to try and keep up with my usual workout routine.  But overall, this is a nice little bouldering gym.", "date": "2/14/2012"}, {"review_id": "fYbwgJnGAP3tnOc7EQH08w", "user_id": "JUff96eqCbv3XCTRN0_rcg", "user_name": "megan h.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Friendly, easily accessible rock gym. Doesn't have bells and whistles, but who cares..it has what you need and the people are cool. Lots of classes and no very crowded climbing, except weekends. love it here.", "date": "4/18/2012"}, {"review_id": "yUn7uYIlqsqM4-D8fdZbiA", "user_id": "OLdQOo_uOyK1abhbHasW0w", "user_name": "jane l.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I decided to try this gym because is very close to my work, and wanted to try pilates before staring my work day.  The class was all right.  It is great for stretching, but not for cardio.  The showers in the bathroom have no doors, and they are not clean.  The drain in the shower is a bit slow.  I did try rock climbing here for the first time.  That was challenging, and I still need to work on my nerves when I get to the top. :P", "date": "4/12/2012"}, {"review_id": "kcya0GZgctSsyeMm6RQVDg", "user_id": "B9JJnhHeVHI8_Ym4iufxpw", "user_name": "Brian A.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We had a great time at bridges the staff was extremely nice and helpful  the yelp deal is totally worth it , I'm excited to try one of many classes they have for yoga,bouldering,ect. Also one thing that made it awesome was the music they played , I could boulder to Hendrix and Marley all day ! Thanks Bridges , you rock! Haha", "date": "8/14/2012"}, {"review_id": "ccfrupJfSkM7lt0mxmf2bw", "user_id": "FHBJVspRL2o21FAEOE7ivg", "user_name": "Cy C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I went here last Sunday with my friend who has been rock-climbing for awhile now. My friend got this bring-a-guest free for once a month and he dragged me along.Upon entering the premises, I was like whoa this place looks pretty cool. I heard that this place had just opened at the beginning of the year, (2009).As I'm a complete newbie in rock-climbing, this place is pretty awesome for me. The place still has that \"newly constructed\" smell so that was a plus for me since I like new stuffs.  The biggest plus was the locker room. Holy crap, this is way better than most gyms I've been to, especially compared to City Beach in Fremont.  The locker room is not exactly huge but it is really clean and well maintained.  There's a separate sauna room, shower stalls, mix of small and large lockers, urinals and toilets. Each has its own area and yet blends all together I think that's a clever area design. The upstairs portion houses the cafe area, which I regretfully did not try, but I managed to use the treadmills right beside that area. My friend and I just used it to warm ourselves up before doing any sort of climbing. It was kind of chilly when we got inside at first but was gone just a few minutes of threadmill jog.As for the boulders, I believe are all 20 feet high or so so there are no required harness to climb the walls. However, once ya get to the top, it's still quite scary (for me) and there still risk of attaining injury if you fall down from the top. I fell down once when I missed a handhold and I landed completely on my feet straight down on the mats. My knees did not like that at all. Since I'm not familiar on the climbing grading, I rather not critic that area.During my stay there, a group of kids came in together with a couple of the staffs. Man, some of the kids are being bratty but I applaud the staffs' well-meanings in teaching the kids, and their patience. At the end of our stay, I came out feeling sore on the hands but beaming from the fun. The girl, forgive me I forgot her name, behind the counter was really helpful, answering my friend's questions. Price-wise, I can only stipulate that it's competitively-priced from the other gyms.  But one of the pluses that they offered is a 10-visit punch card. No expiration and you can come whenever.Overall, a very satisfying experience. If only they weren't so far from my house, I would go 3 times a week.", "date": "5/25/2009"}, {"review_id": "ZKA5NGqdkTtM7qLpbakPaA", "user_id": "hlWm6AYmTjLpxtTbU3sADw", "user_name": "Jonathan G.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 2, "funny": 1, "cool": 1, "text": "Updated 4: 11/2014: Happy to report that they are finally paying more attention to many of the issues noted below, though I often have to be the one to let them know it needs to be fixed.  The folks who work here are very nice, and I'm very glad that I can improve my rating in accordance with the improved service. That said, the gym is quite crowded now - congrats on rising membership, but maybe time to find  a less crowded facility...Updated 3 (7/2013): After nearly three years here, my conclusion is that this is a climbing gym with a lot of potential that is not particularly well managed.  The staff, while generally nice (though one new staff member has much to learn about customer service) is not very motivated to respond to customer complaints (again, with a couple of exceptions).  For example:1. The soap dispensers in the showers are still almost always empty.  I can mention it days if not weeks in a row and NOTHING changes.  If you come here and need to leave clean (e.g., if you are going to work or a meeting after you work out), bring your own soap.  2. The Pilates balls are almost always under inflated.  After mentioning it for about a month, maybe they will get inflated. Sometimes it takes 2-3 months.3. The fan near the elliptical machines is invariably so caked with dust it might as well be called a \"dust mite dispenser\" -- it is truly gross.  When somebody accidentally knocks it over, it emits a dust cloud that spreads for a good 20 feet in all directions.  I always make sure to turn it AWAY from me when I am working out.4. The sauna is broken in some way about half the time, which would not be the case if they posted the sign with the language that I recommended 2 years ago to tell members not to douse the coals with water, which fries the coils.5.  They also need some kind of protocol for what kind of behavior is acceptable versus nauseating in the sauna. For example, there is the guy who stands there naked with sweat dripping from his, um you know, creating a big disgusting puddle of genital sweat on the wooden bench.  There are others who leave the sauna soaked with sweat and water and the coils shorted out, so you have to reset the unit.  Some seriously strange behavior...6.  The toilet stalls are frequently out of toilet paper7.  I tried their massage program, but after two cancellations in a row (one of which I wasn't told about until I arrived), I moved on. 7/13/2013: my wife's massage was just cancelled last minute b/c therapist was \"sick\" (right...we are guessing \"hung over\" is more accurate). Unbelievable - again?! Really?!In conclusion, the ownership needs to hire somebody as a manager who holds staff accountable for taking care of the facilities and maintaining the equipment.  If they did, Bridges could quickly rise to 4 or even 5 stars. But given some recent bad experiences, it is back down to 2.Update 2: the owner has finally fixed the squeaking elliptical machine and the soap dispensers in the shower have not been empty at all this week (for the first time in ages).  As I noted, he's a very nice guy and as promised, I've updated my rating again to reflect the improvements.  Thanks!Update: just a day after posting the below review, the gym finally added more pilates balls (including a large one) and finally inflated the third one.  For that, I'll add another star.  Original review This gym has a ton of potential -- if you're a rock climber it gets a better rating.If you want a place to use exercise equipment like I do, it gets only two stars because they don't take care of their equipment and the staff is non-responsive to requests to take care of problems with it.  There doesn't seem to be a sense of \"I'm taking care of this gym so our customers are happy\" type responsibility among the staff.For example:- their showers are almost always out of soap.  Very annoying after a workout.  I've told them probably 20 times, and still almost every time I use the showers, the soap is empty in at least 2 of their 3 shower stalls.  The attendant on duty could perhaps check the soap every hour or two so this doesn't happen.  Instead when I look down from the elliptical machine, the attendant is typically surfing the web. - they have not inflated their pilates ball since I joined in September, and I've requested it no less than five times. Come on.- the owner (a very nice guy) told me he was going to get some larger pilates balls.  I told him that I had a doctor's order to use a larger one as part of my rehab exercises, and he said he'd get one.  That was three months ago. What happened??- the elliptical machine I use squeaks annoyingly I hope they can get it together and start paying more attention to their equipment and customers, as the gym has a ton of potential!  And the staff are MUCH nicer than many of the staff at Iron Works.  But right now, it's definitely not a place I'm excitedly telling my local friends about.", "date": "1/29/2011"}, {"review_id": "cIfJaP5AZt6I1kMhqFhxkg", "user_id": "sLQGmt_DfJqXPCggsGu7CQ", "user_name": "Daisy C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is awesome!  I am not a rock climber but I found it to be way more fun to work out there verses a regular gym.  The slack lines are super fun and there is a nice sauna in the ladies room.  The staff are friendly and approachable.  They also have the best prices around for yoga ($10 a class).", "date": "7/17/2009"}, {"review_id": "y2x-QuSoOH-x16LxbqgJDQ", "user_id": "n5WLMNBl3e6kOXPOd42MpQ", "user_name": "Bryce N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is a basically A Clean Well-Lighted Place For Bouldering.  The owner/founders are super friendly, and this is a family affair among two sisters and a husband.  You'll find wall-to-wall heavy padding under rather high bouldering problems.  A sauna, a few machines, yoga space, and a kiddie care room.  They do birthday parties well.  You can walk from El Cerrito Plaza BART.  Everything to like.  Note: the place is bouldering and slacklining focused, no mini-El Capitan's here, and very limited top-roping.", "date": "4/2/2009"}, {"review_id": "IBZ_Wg8-knlpuOH_rBaL8w", "user_id": "5ZrQsjSuNy_OXVghbRxVlg", "user_name": "Bebe B.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "i don't top rope, i only boulder, so i was really excited when i heard about this place. i went a few times but i couldn't get down with the culture of this gym. maybe it's that the climbers seem a bit on the younger side and so they aren't thinking about the possibility of getting injured or are just generally more oblivious. all the times i've gone here i had to be really extra vigilant about people wandering around directly below me while i'm on the wall, constantly afraid that if i fell i would hurt them and/or myself. i haven't had this concern at the touchstone gyms, where my experience has been that people hang back until it seems like it's their turn to approach the wall or just ask. also, i described that i was having a problem with the gym equipment and the people working at the desk didn't offer to help me figure it out, which i thought was rude.", "date": "10/8/2012"}, {"review_id": "nA1Ing50uz1AMAby0DwO5g", "user_id": "bnbUeeQ8sbq5aiQxZZ_7ng", "user_name": "Ingrid H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I love this place.  I use it not for rock climbing but as a gym and for yoga classes.  Want to give a special recommendation for Yoga teachers Vlad (tues and thurs 4:30 to 5:30)  and Tosha (fri 12 to 1).", "date": "4/20/2011"}, {"review_id": "Zd4r4PnfoVEsdettReDd_g", "user_id": "x1BhloIsRWTbU4FiU1gEcg", "user_name": "Sarah M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So I called Bridges with an issue I had concerning some vouchers that I wanted to redeem. They were SUPER accommodating and helpful without any hesitation. It was amazing. Excellent service. Far above and beyond what I had expected or even hoped for (I had never been there before so I didn't know what to expect). I cannot thank them enough!", "date": "12/16/2011"}, {"review_id": "1g8tZIn7HF2Wl6d9e7RpDw", "user_id": "YzQkt5iaaUK-XHItRfhyyQ", "user_name": "Jay K.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Pleasant community feeling. I come for the Pilates classes. Some of the teachers are better than others, but all are basically solid.  Staffed by nice, conscientious kids. Fairly clean locker room, showers and sauna.", "date": "8/28/2011"}, {"review_id": "LbRlZplXyIhXZV4OO3Aerw", "user_id": "jhyM474kpoAZwxnH-7AZtw", "user_name": "Terry M.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I held my 9 yo son's b-day party here.  He was ambivalent about it beforehand, but after its success, he announced, \"That was my coolest birthday party ever!\"  That's saying quite a lot.  Damien's wife was very pleasant, helpful and made sure all the kids had a good time, inc. my self-conscious 11 yo daughter.  They have a cafe/party area upstairs which is clean and inviting.  Bridges Rock Gym is a great example why we should support local, small businesses.", "date": "6/23/2009"}, {"review_id": "035ti6roy_f_EOvtGUd3iA", "user_id": "4rioaYJNSRD14DmeRcA6DQ", "user_name": "Marie R.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fun! I started by doing yoga here.  They have lots of classes at different levels.  Then I started to use their gym.  Its a small area but you get to work out and watch people climb, pretty cool!  Staff was always very pleasant.", "date": "1/6/2011"}, {"review_id": "5bgM2igL_lqysgQJAHL-wQ", "user_id": "tTcfV9A-lyh70BuvFUudjQ", "user_name": "Megan N.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff- they go out of your way to make you feel comfortable and to give you advice. We had so much fun here, and will definitely be back!", "date": "5/9/2011"}, {"review_id": "hEXv1cQe-kgDiRKV3aN_Dg", "user_id": "ggczhgImo5iuSYvl16H9Ww", "user_name": "Farhad F.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "awesome bouldering routes, friendly staff, plenty of space, adequate gym, and a space for yoga/workouts (that i never had a chance to try). and of course, slack lining! it's a great deal for an all around workout space.", "date": "11/4/2012"}, {"review_id": "QLWpKQtxodvCFcT8zyB7sw", "user_id": "lSlk4FDzo3pJwN-GCZa5ig", "user_name": "Gillian L.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Facility clean, staff friendly, yoga instructors GREAT, especially Lynn, her class is very challenging. Pilates instructor GREAT! They are a relatively new gym so I see them continuing to improve themselves (like adding insulation to the yoga shed, etc..). The great monthly fee is what attracted me and they have preformed as well as a high priced gym. I love this place and highly recommend it!", "date": "3/8/2010"}, {"review_id": "avRrF-83FFejPZNzmRv3PQ", "user_id": "-jJdIMPZBNsb6T8V_UfNtA", "user_name": "Eleni H.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "awesome gym with tons of good bouldering routes that you can top out on, weight and cardio equipment, frequent good-quality cardio and yoga sessions, and even slacklines!", "date": "7/18/2012"}, {"review_id": "voWs5iNqvGL40qFIJ0Z5YA", "user_id": "pnrFtKmItq727dG_FE0AFg", "user_name": "Priscilla C.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym!  I've always enjoyed bouldering more than rock climbing and this is everything I want and more.   All you need are some climbing shoes, chalk and chalk bag and you're good to go.  You don't need to find a climbing partner, put a harness on or rope yourself in... etc.  Plus, the gym is very well padded so you don't have to drag some dinky crash pad underneath your climbing all.  They also have classes such as yoga, pilates and abs, if you want a change of pace.", "date": "12/24/2009"}, {"review_id": "MjKlnpgWE4Sr2PeoEeTbjA", "user_id": "Enf1hX9I38xLjBRYnPwaVw", "user_name": "M S.", "business_id": "p6L53V8l3R2PmESjULYyzA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "great overall gym, offers a variety of workouts", "date": "1/6/2011"}]