[{"review_id": "ZXxfjgOEJw_pR3REfsQ_Ow", "user_id": "CigrKB6oWCcy3Jj5tE4tYw", "user_name": "Lisa M.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love Cliffs of Id.They offer bouldering and rope climbing as well as a gym and a yoga studio and the place is huge!  There are lots of routes to choose from and they regularly change their routes to keep it interesting.Customer service is always great, the place is always clean and they offer some really good package deals during certain times of the year (I got a great one around New Year's).", "date": "5/22/2019"}, {"review_id": "Fxp7_bqA-3Lv5thi0PFfrg", "user_id": "gTXcb95cvt7ja1PgYi8yTQ", "user_name": "Eddie K.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This is a huge, beautiful gym with basically every kind of climbing and facility you need. I joined at the start of Feb. after climbing for a year at (the much smaller, but also cheaper) Hangar 18, and I'm impressed. It is worth the $80/month membership.The bouldering walls have awesome variation in size and angle -- and ditto the routes, too. I'm progressing in strength and climbing grade largely because of the diversity of climbing offered. I don't use the toprope/lead walls, but they're as good as I've seen in LA County.The people are chill -- I've had fun just meeting and climbing with someone for a single session, several times. And even during peak busy hours, it feels like there's plenty of room to roam. I've read about people who have issues with the parking. I've come in the morning, midday, evening and late-night, on weekdays and weekends -- no doubt, the lot is often packed. But I've never spent more than 5 minutes looking for parking on the blocks surrounding Cliffs, either. Even when you have to pay for street parking, it's a crazy 50 cents for 2 hours. I don't really consider it a downside of climbing here, tbh. Plus there are lockers, showers, sauna, a system training room, yoga classes, weight room with squat rack and bench press... Easy to go to the gym all the time when it's this nice.", "date": "2/27/2019"}, {"review_id": "5KJcA1mwyHCNFkFFqzMZCA", "user_id": "7103VMy5luZA3BpkBEtCog", "user_name": "Rachel N.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is HUGE! What an amazing experience for anyone who loves to boulder or rope climb. Cliffs of Id offers so many routes that you'll be hard pressed to find yourself without something to do. The difficulty ranges significantly as well, so even more advanced climbers can give themselves a nice warmup before moving on to more challenging problems. The size of the gym means that there are lots of members there at once, so beware tandem parking in the lot they share. They have their own parking lot a bit further down, where the entrance is, but those spots can fill up quickly on the weekend when everyone is eager to get their climb on. The price for monthly membership just went up, and make no mistake, this gym is not a cheap one to go to month-by-month, but the sheer size and accessibility of it is definitely worth it.", "date": "1/4/2019"}, {"review_id": "0aeWYeL6L34l7NUTGPDQaw", "user_id": "rlgdk9mhKwmbuXbSvg4Zbg", "user_name": "Ellie P.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "A Sanctuary for beginners and advanced climbers. Cliffs of Id has become a home to me. The staff are thoughtful, kind, compassionate, extremely helpful and knowledgeable. I feel safe here, and I continue to make progress with climbing, alongside this, I gain wise insight from fellow climbers as I proceed to grow and make friends with others, learning new techniques and ways to break through obstacles.It is a community. And it's awesome!!The amenities at this location are far and wide! With body conditioning rooms, to a studio with yoga mats, trampoline, weights... in which classes take place daily in, to a gym next door with a window overlooking the climbs. The restrooms are clean, with lockers, showers, and a sauna! For the ladies (they even have a box of tampons in case Mother Nature hits and you forgot to bring your own).I highly Recommend Cliffs Of ID to any age group, level, and personality. It will grow on you, and so will the people.5 star!!", "date": "11/27/2018"}, {"review_id": "C5bAloPB4x4vZp8jBA-zXw", "user_id": "UQFE3BT1rsIYrcDvu_XVow", "user_name": "Mike V.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I would be here every day if I lived in LA...although we kind of climb every day here in SF... but still, well worth it. Amazing diversity of routes, slightly  lighter ratings than some other gyms along the coast in the Bay Area, but no where near as challenging or accurate as places closer to the mountains (e.g. Reno). Great layout and amazing light. The non-climbing gym options are a little limited but the funny signs help (\"every time you drop a weight a jug turns into a sloper\" might be my favorite).The staff are incredibly personable and run a tight ship (which is hugely appreciated since this isn't safetythird/burning man).", "date": "12/13/2018"}, {"review_id": "35ESwxfYv14ppIziCAlZyA", "user_id": "RcvHyQ_0rIWGlnDvXebe8w", "user_name": "Eilana G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "What a cool experience! I have never been rock climbing before. Needless to say, I was extremely intimidated. When I first walked in I was ready to walk about, but I'm happy I stayed. This was so fun!I came with a friend who had been there before. He gave me a brief intro of what to expect. Honestly the staff was so nice that even if I hadn't gone with someone who had been there I would be okay. They have different levels. So you can go more advanced or pursue the basics like me. As long as you ask for help with the rope area you'll be fine. Ladies, I recommend not getting your nails done before coming here. You'll need a mani once you're down. Also, this was a great workout. I felt a little sore for a few days. Would highly suggest this place! I can't wait to come back!", "date": "11/13/2018"}, {"review_id": "H7W2ZDl7DawvAZxqbA-wRA", "user_id": "HxT1y16bVeAPZXw2sAa1fw", "user_name": "Rachel M.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "This is an awesome climbing gym! I came here and used a day pass which is a little on the pricey side ($25). They have extensive bouldering and top rope routes with a little bit of lead climbing. At first I was intimated by the top rope because all the route rankings were pretty high (almost all 5.10 and above) but they rank pretty soft so I was able to climb many of the routes. The bathrooms have a large locker room showers, which is always a plus. Definitely get a membership if you plan to come here more than a few times since it is so expensive for the day pass, but you can also use a guest pass if you know someone who is a member and is willing to share!", "date": "10/2/2018"}, {"review_id": "5JQuWWSv7a89y-0tbgzWAQ", "user_id": "TNYM6vmcp1Nxibt7vsbx3g", "user_name": "Lisa W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 25, "funny": 15, "cool": 25, "text": "Awesome indoor rock climbing gym right in Culver City!This place is huge with a 40 foot lead wall and many bouldering routes that change regularly so it never gets old.  They have a great variety of routes that range from beginner to advanced and offer climbing classes and private lessons for beginners or those looking to hone their skills. I love that they also have a weight room replete with kettle bells, dumbbells, barbells with squat racks and cardio machines including treadmills and rowers.  It's great to get some climbing in, burn out your arms and shoulders, and then balance it out with some lower body exercises upstairs.A day pass is $25 and if you come before 3pm on a weekday it's only $20.  Shoes are available to rent for $4.  For those not familiar with rock climbing, they run small and are meant to feel super tight.Weekday mornings are the best time to come because the gym is less crowded and parking in their back lot is plentiful--in the after work crowd, not so much.", "date": "1/31/2018"}, {"review_id": "IwPCSMdKCebEdHO12RGnNA", "user_id": "jfPwUbT9Zywp0wQa412YCA", "user_name": "Jacquelyn T.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! $30 for a day pass. The gym is equipped with a small gym upstairs, a variety of walls to climb, and bouldering walls!", "date": "4/22/2019"}, {"review_id": "sgfgfpLzQjpKzzQmhqI3ew", "user_id": "5WNpVilRzHWPky9uZNsQtw", "user_name": "Coleen J.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I don't live near Culver City so whenever I make the trek out to Cliffs of Id it's always a special treat. I've been a touchstone member for about four months now and have really fallen in love with all the LA Touchstone gyms. My boyfriend and I recently got our belay certification with Touchstone and everything about the process was awesome! We were able to take a belay class without any kind of reservation and it's free of charge for members! ($35 for non-members). Our teacher, Sarah, was so helpful and made all the steps and check-points so easy to understand. A few days later we went back to Cliffs to take the belay test and we were given a temporary pass. One week later, we took the belay test again and got the permanent card! Cliffs is awesome because there is such good balance between the top rope/lead section and the bouldering section. I'm more of a novice climber and I am still able to find so many great problems to work on both with top rope and bouldering! Like all the other gyms, I really appreciate how often the route setters come in and update the problems! It happens often enough that I never have time to get bored! Aside from climbing, Cliffs really has amazing additional amenities. I use the very clean showers every time I go to the gym and I know it's random, but I love the smell of the soap they provide! I haven't taken the time to try it yet, but it's also great that there is a sauna to use after a hard day of climbing. Not to mention the different classes you can take, the cardio and weight machines and even a hidden bouldering wall just for practice! The amazing thing about this gym is the fact that it's so much more than just a climbing gym. There's something for everyone so come check it out! Oh, and the employees are all amazing as always!", "date": "1/16/2018"}, {"review_id": "MngINUyKtfnJ1-PmJPnUHQ", "user_id": "4yDArYKnJySEJLdDGdKk7A", "user_name": "Katie E.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym I've been to. It's certainly intimidating for new climbers but the gym is so bright and airy it will keep you coming back. This gym feels and looks much cleaner than Rockreation. I love that they have large rolling windows so it never feels musty. The routes at this gym are more \"fun\" than the ones at Touchstone's Hollywood Boulders location. The grading also seems to be a bit lighter at this gym.", "date": "1/16/2019"}, {"review_id": "-T8oMcPrtvF3YV7MnPCAOg", "user_id": "v1Nhc4qGVabTd7DrDaeydA", "user_name": "Trei C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Our family is touchstone members up in NorCal. We decided to check out this spot out while we were down in LA area for spring break and we loved it. Lots of bouldering and top rope climbs for all levels. The staff was amazing, we were helped by Katie who was great on the phone and in person. They made us feel right at home. Thanks for the great climbs and experience!", "date": "4/2/2019"}, {"review_id": "lld2xdeP79x4e2IvnWI5eA", "user_id": "cT1XJNpbxZk_A60_gdX8dQ", "user_name": "Nick A.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 3, "useful": 6, "funny": 8, "cool": 8, "text": "I went there with a group. The parking lot is pretty big, but it was full, even on a weekday. There's street parking, but it's all metered. When you enter, you need to check in on the iPads they have in front. It's not too bad. Basically, you're signing in saying you can't sue 'em if you get hurt. Fair enough, since you could possibly get hurt falling, but they do teach you how to fall properly, so you probably won't get hurt if you follow their instructions. We were given a group rate which was $5 off the normal rate. Pretty cool. They give you rock climbing shoes and a bag o' chalk when you pay up. Once we donned our super tight fitting rock climbing shoes (they're supposed to be super tight) we were given a really quick lesson on how to fall properly. We all had to prove we could fall properly. Unfortunately, those are the only tips we got. We were completely on our own with no tips on how to climb properly. A HUGE star off for that.Some of the kids had been there before and were given some very helpful climbing tips that are essential. The walls are high and there are no super easy climbs. Even the simplest climbs are challenging. The walls are high. If you fall from near the top you could really hurt yourself bumping your body against the \"rocks\" on your way down to the hard mat. Five more minutes of tips and helping the novices get started would have made a big difference.Also, it turns out when you pay you have access to other parts of the complex such as the gym, finger exercise machines, etc. We were told none of that. Another big fat star off for that. How hard is it to simply explain what's available to everyone?Some of the kids who were there before had someone who cared enough to give them a tour of the complex so they knew what else you could do besides climbing the walls. I had no idea I had access to other parts of the complex until we'd already left. Here's a tip from a novice. I don't recommend wearing shorts. My knees got a little skinned up climbing the walls.I did manage to make it to the top of one of the walls. The trick is to keep your body as close to the wall as you can...at least that's what someone who was given a lesson told me.", "date": "7/9/2017"}, {"review_id": "q25ItIoAjuSBSJY0rF7n9g", "user_id": "WOnRRJUMkqUMYjDdbT-QcQ", "user_name": "Arie K.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Cliffs is an intersection of all things hip and trendy; perfect for LA.  For your physique: climbing, weight/cardio rooms, sauna, yoga & fitness classes. For your thirst: bottled kombucha, cold brew, water, etc. that you can just \"add to your card/account\" if you're a member with recurring payments. For your hunger: rotating food trucks boasting the latest gluten-free, vegan, GMO-free foods (lol) For your work: a long wooden table with ample seating and built-in outlets for charging your devices. The best time would be early and mid-afternoon on a weekday. No waiting to solve a problem and no feeling bad because someone else is waiting for you to finish the problem! The types of people Cliffs of Id attracts is interesting as well-- people come from all vocational backgrounds and have a variety of other hobbies that you can connect over mid-break. Definitely worth a try at $25/day (reduced to $20/day if you come before 3pm on a weekday)! Private parking lot accommodates 40 cars w/o tandem parking, a rarity for a smaller gym in Culver City.", "date": "2/13/2018"}, {"review_id": "Tg7OEk8xBA7FCvnRbzZh9Q", "user_id": "n-KG3RDYFlEtl04KBWwaYA", "user_name": "David Lee F.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best around, hands down. They have top notch climbing walls, a full gym, and free classes. On top of that the locker rooms are really nice and have killer saunas. The staff is always on point. Friendly and helpful and always available. They all seem to love working here and they curate a community vibe that feels very welcoming. This place is a ton of fun and a great value. Highly recommended.", "date": "8/13/2018"}, {"review_id": "ry7WRaeGePfzxRkr1yeOWg", "user_id": "IBVcDuf0ffAXl6-WPw_16g", "user_name": "Allison D.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "Best gym for bouldering... ever. Hands down. There are SO MANY WALLS TO CLIMB!!! It's Disneyland for a climber and there are lots of walls for beginners like me. The front desk was super friendly and everything was clean and tidy (including the walls). Too bad that it's a bit expensive or else I'd get a monthly membership. Had to pay $20 for a day pass as a student, which was worth doing, but I'm not sure if I'll be able to go often to make it worth for a monthly membership.", "date": "5/9/2018"}, {"review_id": "SEJH_NMBG5X2IeBcAnry_Q", "user_id": "Eg2oBq_eryMZQZbwMNI4hQ", "user_name": "Charlie V.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "+Price: $20 for the daily pass for adults. +Location/Parking: Has its own parking lot with tandem parking. Can be a deathmatch trying to get a spot, especially during peak hours. If you park in one of the tandem parking spaces, make sure you let the front desk know, and sign the tandem parking sheet. +Service: Friendly and fast customer service+Climbing: Lots of great problems ranging from V0-V12. Uses Walltopia walls. Holds are also newer and still have good texture. Wide range of styles from slab, overhung, dihedral, etc. I went during peak hours and it was packed, but there was plenty of open space and enough routes for everyone to climb comfortably. +Amenities: Showers, lockers, hairdryers, and complimentary lotion.", "date": "6/21/2018"}, {"review_id": "Db0n6xWgOKBO6C8qlFEiIw", "user_id": "kcyhcFQW1n9HhGU8MAgskw", "user_name": "Christian L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is easily one of my favorite gyms, highly recommend for beginner climbers. Out of the three Touchstone Gyms in the LA area it has the most to offer for sure. Great bouldering for climbers of all levels. Solid top roping and lead climbing, not as many challenges for beginner climber though. Locker rooms are very nice with showers and sauna. Parking is limited and the gym is located on some busy streets, I often park along the street across from the gym.More: I took the intro to climbing class when I first started coming here and the staff were very friendly and helpful. The class is also pretty casual which is nice for those who might be intimidated by climbing. The gym also has a decent sized weight room with treadmills upstairs as well as an open room for yoga and two rooms with with equipment for strengthening exercises specifically for climbing. There is a little shop if you want to pick up some gear. There's also often a food truck that parks in the parking lot which is really nice. I have a membership here and you get guest passes and access to all of the gym perks which is a huge bonus. Before I moved here I climbed at Planet Granite in NorCal, and this gym is on par if not better. I've also gone to Hanger 18 (which is also nice) and Boulder Dash, and easily like this gym more.", "date": "6/19/2018"}, {"review_id": "7Dg9LoEmSCv62c9Bg8Tw_w", "user_id": "RXg_Vtf39aeQREn5dAdA2g", "user_name": "Harrison T.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "This place is huuuuge and the only touchstone gym in Southern California so far that has top rope/lead as well as bouldering. For the seasoned vets there's an abundance of walls with all sorts of problems both bouldering and roped. For those looking for a workout there's a standard gym setup as well as rental shoes and chalk bags if you want to try out bouldering. The day pass for the gym is ridiculously overpriced in my opinion but it is comparable to other climbing gyms in the area. Hitting up the gym one day without a membership will set you back $30 with rentals. For those really fresh to climbing, they offer intro classes to both bouldering and roped climbing at certain times of the day. They also have some assorted snacks and drinks for sale for the little pre-climb pick me up which is nice. I always try to get out to cliffs at least once or twice a month to hit up the lead walls!", "date": "4/8/2018"}, {"review_id": "Y9B93-gbBw8uvP--x8Rp8g", "user_id": "opdbggrufvUGH8gP9wHL8w", "user_name": "Brian S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Updated review time! Since writing my previous review, Cliffs has updated their weight room and made it much more user friendly. Most of the issues with the old weight room were resolved (although there is still very little space in the way of cubbies for personal equipment). I'll briefly recap a few things that didn't change from my last review first:\"The weight room at \"Cliffs of Id\" might be small, but it's actually pretty good if you are into crossfit, powerlifting, or just general strength and conditioning. There is a squat rack and bench. There are all sorts of dumbells, as well as kettlebells up to 60lbs. There is one cable machine if you like doing auxiliary work on those. There are also treadmills and rowers.  The staff is friendly and gym clean. There are lots of yummy snacks, and unlike other gyms, I find most of them things I would actually enjoy (they have locally-made cold brew, among other things). There are tables with power outlets if you want to take a break. The bathrooms are spotless and have showers and saunas. Lockers are plentiful. Parking is hard to come by at night, but ok all day.\"Now, for the changes! Since writing my last review, the gym has added:-One plyometric box, which is great for box jumps or weighted box step ups. It can be set up as either 20\" or 24\".-Many, many new bumper plates, and one more barbell. There are now enough weights for three people to be deadlifing/squatting/benching at the same time with light to moderate weights, or two people at the same time with heavy-ish weights. That said, today, there were two of us deadlifting over 300lbs each, and there were not enough bumper plates to make that work unless we added in the smaller, plastic weights too. But that was really more of an anomaly; I think the weight situation is fine as it is.-A pull-up rack with enough space for 3 people to be comfortably doing pull-ups at the same time. Say goodbye to everyone using the squat rack for pull-ups!I would still like to see more cubbies to store personal stuff in the weight room (stuff that you are intending to use in your workout like belts, knee sleeves, and water bottles), but really, besides that, the upgraded room is pretty great. It's still moderately crowded in the evenings, but as long as everyone is respectful, things work out ok.", "date": "4/3/2017"}, {"review_id": "1d1uyBWCilR1Lyw8UHUdbQ", "user_id": "9QmAPRbJNsAeK2cue45RMQ", "user_name": "Jordan M.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing climbing gym with super friendly staff. Tara at the front desk was so helpful and nice. Can't wait to go back!", "date": "12/28/2018"}, {"review_id": "qifQ5Bg85ddH0VqrGZVw2w", "user_id": "PxsPsDgkXvSWFRvn_upaHA", "user_name": "William H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had a friend invite me along recently, it was a great spot with tons of different climbs and bouldering. A nice gym and locker rooms. The staff was very friendly, I had Kayla take care of me and she was awesome! I will def keep coming back!", "date": "7/12/2018"}, {"review_id": "51Fs26PLrpFa-OKT3jYi8Q", "user_id": "Uki-1q5A2p7pC19KpXsGag", "user_name": "Cherry W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This is such a fun place for physical fitness. Even if you're not an avid rock climber, Cliffs of Id is a fun gym for lifting weights or taking a yoga class.", "date": "3/27/2018"}, {"review_id": "RH2_EQCBE4Ujtvoq5Yc4Eg", "user_id": "VQq3tsEjiYvvbn1YJwyoaw", "user_name": "Los Angelin O.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 1, "funny": 4, "cool": 0, "text": "When it's 45 degrees out and the windows are wide open and everyone is climbing in their $200 Patagonia ultra light microbrew organic gluten free down jackets, AND somehow you still feel the need to strut around with your shirt off with your arms and abs in a state of perpetual flex--congrats, you are the biggest douche in the room. Sadly, there are more of those dudes here than probably any other gym combined. You know who you are. Those aside, this place is alright. Good problems, albeit ridiculously easy that the newbies feel awesome being able to say they just flashed a V6 in their 2nd week of climbing. Keeps them coming back that's for sure.", "date": "2/26/2018"}, {"review_id": "_L7CQmFh6sfraYch6zaleQ", "user_id": "Shm57q3cLP_5JtqAqV68dg", "user_name": "Jennifer G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My little brother and I decided to start climbing again! Amongst the different gym options this one was our favorite! The staff is very professional, knowledgable and friendly. Definitely our new favorite spot in LA!", "date": "12/17/2018"}, {"review_id": "IQNTX18qRSYY0PEExvYqKQ", "user_id": "WWnhqRnWWjutMqh-2SzEuQ", "user_name": "Steph C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 9, "funny": 24, "cool": 6, "text": "I am an exceptionally weak and sedentary person, but every once in a while, I get disgusted with myself and try to incorporate exercise into my lifestyle of writing Yelp reviews and cuddling basset hounds on my couch (how I spend 90% of my waking hours). One of my best friends, Melissa K., is a fitness monster who works out, by my estimate, about fifteen times a week. I told her I was starting to exercise again, and she immediately invited me to her climbing gym, an invitation I'd laughed off several times over the last year. I joined her two nights ago at the Cliffs of Id, and am pleasantly surprised that my forearms are recovered enough to let me type this review.The plan was to go to a 7:15 yoga class and do some bouldering afterward (I count this as two workouts, and Mel informed me that she'd also had a very hard workout that morning--so fifteen a week is a conservative estimate). Since it was my first time in, I had to fill out a waiver on an iPad, but the process was easy enough, and Mel signed me in as her guest (I guess members get some guest passes). The people at the front desk, who also rented me climbing shoes ($4), were responsive and friendly.The gym was huge, with most of the space dedicated to climbing walls, with rooms upstairs for exercise classes and more classic gym equipment, machines and weights and all that. This upstairs area may not be the main point of the place, but must be a huge plus. If you don't have a gym membership, Cliffs of Id seems to offer the usual gym basics on top of the climbing walls. The place was pretty busy, full of twenty- and thirty-somethings getting their workouts after work. (I commented that it had to stay open late for all the type-A professionals, and Mel said there were tons of freelancers, too. I am a sort of freelancer, and I can tell you that freelancers prefer to work out during the day, when even exercise seems more appealing than writing another scrap of a slow-going novel.)We started with yoga, a vinyasa flow class taught by a woman whose honeyed, languid voice has been stuck in my head since Wednesday night. I don't have a strong basis for comparison, but I thought it was a great class. I was mostly able to follow along, with my poor flexibility and beginner status, and Mel wasn't completely bored the whole time. I was more or less ready to go home afterward, but yoga was just the appetizer for a whole new world of pain.This was my first time climbing other than this one random and largely unsuccessful night at a now-closed gym in Connecticut in 2009, at which I didn't have a Mel to keep insisting I try this or that wall, and so mostly watched other people and hoped no one noticed me. I guess beginners are advised to start on the walls with ropes, but that seemed like a hassle, what with all the harnessing and the having to teach me to belay and be belayed, so we went right to bouldering. I have no upper body strength (or lower body strength), so this was definitely the bolder choice (writing puns on Yelp requires no muscle).The thing about climbing gyms is they look super fun and friendly, with colorful fake rocks that make you fantasize about monkey running up walls. Mel told me I would love climbing because it was like a puzzle, and I was like nice try but a puzzle is something I do with just my largest muscle, my brain. Climbing is closer to a bad dream in which you arrive at Willy Wonka's factory and every fucking thing tastes like a vegetable. I like vegetables fine, but I know they're for my health. These candy-colored holds are no game, but an enemy to be vanquished, and only by the mighty.The rocks are color-coded, indicating different paths up the walls of varying levels of difficulty. The levels start at 0 and top out at 10. Mel is at a 3, which kind of blows my mind, and I looked no further than 0. I tried out four of these 0 courses, and was able to finish two of them. The others involved feats of strength that nearly defied my imagination. I honestly tried my best, but shit was not happening.Even with all this failure, and a lot of down time watching Mel and two of her climbing friends (I guess people are social here), I became sore in ways that my body didn't recognize. At one point, I marveled at the way my forearms felt more like rubber than flesh. Climbing is supposed to build strength pretty quickly, and I believe it.I live moderately close to Cliffs of Id and would theoretically be open to joining, but only if this phase of shame-driven physical activity lasts more than a couple of months. I don't know that bouldering will become part of my life any time soon, but I do see the appeal, and this seems as good a place as any to develop a punishing hobby.", "date": "7/21/2017"}, {"review_id": "OHnTWBT59K7fpjs6h_yy8A", "user_id": "34VIYiEuySNP7rx4e0N10w", "user_name": "Jeff M.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is amazing. If you're into bouldering, this is your place. No autobelays if you're a solo rope climber, but they are pretty helpful at find you a climbing partner. They also have a sauna in the changing rooms!The only unfortunate part is the lack of parking, but that's more of an issue with the neighborhood than the facility itself", "date": "4/1/2018"}, {"review_id": "ZJuQGPPjB0BmsaMRyqSgEg", "user_id": "asXbxVvop8hm1BV2a37mYw", "user_name": "Bianca J.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really love this place! First off, it has parking so 5 stars for having a parking lot in LA. Second, I love the spaces. It is a big gym and they keep the routes fresh. The workout room is smallish but it is never too crowded when I need to use it and it has all the equipment you need. They also have a nice offering of fitness classes.", "date": "2/20/2019"}, {"review_id": "FIsPWH2qrotIlDyEsdBCyA", "user_id": "MuMFK6hlLixQeo-nsYRn-A", "user_name": "David P.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "I've been here several times, and I don't understand why anyone climbs here. It could be the best gym in the world and it still wouldn't be worth the frustration that comes from the shitty parking situation, and slow service. Overcrowded. Understaffed. Wildly inaccurate ratings. There are better gyms with taller, and way more interesting walls.", "date": "7/7/2018"}, {"review_id": "8XCHrcq-kDIb02sUT2-zjw", "user_id": "GU8z_Hq5adEoe96AC3amCg", "user_name": "Jason L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The place is awesome and one of my fav places to climb in LA. You've got plenty of room for bouldering and plenty for top-roping. The locker rooms are well maintained and clean, and have a sauna. Best of all, the crowd who climbs there are solid peeps. It seems 'climbers' are just a great calibre of personality and integrity. Seeya on the wall  :)", "date": "8/6/2018"}, {"review_id": "WqAUhJzbaNaM_Ieje345BQ", "user_id": "0KgqplyXwCzjeStc1BYK-Q", "user_name": "Wayne K.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "I'm pretty new to this and liked it overall, but I thought the staff there were pretty rude. I went with a friend who has a membership there and every month, he gets a guest pass. I went with him and paid $4 for the rental shoes. Other than that, it was free which was pretty awesome. We did a lot of level 0-2 climbs which were pretty challenging and I can see how it'll give a great workout. I also liked that the vibe overall was pretty laid back but you can also tell there were some douchebag types who  are regular climbers but nothing more than what you would find at any other type of gym. Every gym has a few arrogant asses. I'm giving it low marks for the horrendous parking. The lot is completely full and street parking is also challenging. Also for the totally unhelpful staff. When I injured my finger and asked for antiseptic, the staff was downright rude.  For that I can't give this place high marks.", "date": "5/24/2017"}, {"review_id": "NOch9VkAhtJpssxuARXsUg", "user_id": "hDH_9mlCUmbKDJ9ZIgDALg", "user_name": "Anna C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 3, "useful": 7, "funny": 2, "cool": 1, "text": "The facility itself is very nice, and state of the art with amazing climbing walls, that are reset often. They offer yoga and other classes which are a nice added value to the slate. There is a huge problem with the gym being far too crowded on weeknights to the point where it is impossible to get on a problem without 5 people surrounding you. The workout area is nice, but gets super crowded and often times its hard to find a cardio machine that is open.", "date": "4/7/2017"}, {"review_id": "Ld5ipKTZYMSzLzsdzVfVeg", "user_id": "U5A118CfzynpJmcKhMWYkw", "user_name": "Jada H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I absolutely love this place! I could truly spend hours here. I spend most of my time in the bouldering area, which is very spacious. They change up the routes every couple of weeks, keeping it fun, fresh, and challenging. Echoing the sentiments of others--it is a sanctuary! The fitness area isn't huge, but it has everything I need to get in a good workout. I mostly use the cardio equipment and free weights, and I've never had a problem getting on a piece of equipment. The staff is all friendly and helpful, and it's nice to be greeted by staff that remembers you. The only downside is that if you come during peak hours (at night), parking can be challenging (though not impossible, like many places in LA). It's not super residential in that area so walking far at night to my car isn't ideal. I do, however, avoid that problem by coming early in the morning when there is plenty of parking and I don't mind walking if I need to. Thanks Cliffs of Id for being my happy place!", "date": "11/16/2017"}, {"review_id": "33kPrfDYUsOsZkfLSwM9hA", "user_id": "BIigoyHX-W2Y7m0ePiYPBA", "user_name": "Anna-Marie T.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 3, "funny": 2, "cool": 4, "text": "Beautiful new bouldering gym (rope climbing to come later) located in Culver City. The facilities are spacious, clean and has TONS of routes in varying difficulty, angles and inclines. There is also a second story with regular gym equipment and rooms for classes. If I lived in LA I would totally have a membership here. Day passes are $20 and there is parking on site.Definiatly come check it out if you are in the area and looking to mix up your workout routine.", "date": "2/17/2016"}, {"review_id": "GiWo9bMLrW_XQOIUO2EAQA", "user_id": "80K2WomtvdMlICk3lt0Yeg", "user_name": "Matt C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Gorgeous state of the art gym, ENORMOUS! The only downside is that it is always hard to find parking (and there are a lot of spaces) but even with how crowded it is outside and how many people are inside, there are always plenty of options and open wall space for bouldering, top roping, and sport climbing.  It used to be rated very easy, which was a nice ego boost (Sending 5.11c's, no big deal!), but now it seems on par with most other gyms (back to being lucky to send 5.10d's for me).  They redo routes often to keep it fresh.Lastly the staff is really freindly, helpful, and responsive.  Just a perfectly run gym, and I can't believe it's only $75/mo for membership. I wish it didn't take me 45+ minutes with traffic to get here after work, or I'd definitely be partaking in the membership here instead of my local gym; more expensive, way worse overall, but only a mile from my house.  L.A. traffic wins again, womp womp.  But I still get a hankering and make it to Cliffs every month or so.", "date": "2/16/2017"}, {"review_id": "6E6k4v5m1VF3ir7ynGdttg", "user_id": "_cYTU3uFAjZI5qSY0ZNaww", "user_name": "Jacob F.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym with a broad variety for bouldering, top rope or general workouts. The staff is super chill and always helpful.", "date": "7/14/2018"}, {"review_id": "p4a1XnYOY15u2Jgd8KBi8Q", "user_id": "BqMJbC0b4vwB2syH4cbPGA", "user_name": "Robert W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 1, "useful": 1, "funny": 0, "cool": 1, "text": "Very poor customer service experience. Went during a comp day and they were charging $10 to watch. I had a competitor's phone and needed to return it. Told them I didn't want to pay $10 just to drop off someone's phone. They refused to page the person or help find them (there was a mob of people). Asked if I could walk in, drop it off and come back out. Nope. Supervisor told another employee in front of me, \"I don't want to let him in because we don't have him on a leash to bring him back.\"", "date": "9/25/2018"}, {"review_id": "SphPK19Vb5F9DtpeV8xYsg", "user_id": "L2MVxXahCzxAQVM8uO7W7w", "user_name": "Emily G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is my sanctuary. It has top roping, bouldering, a gym and yoga studio. Plus, there's parking. The facilities are always clean with a bunch of amenities.", "date": "1/12/2017"}, {"review_id": "ESAXf2BcQoVq3OwY9nQWmg", "user_id": "WhqHTTUAoXnd5QRdPc3_aQ", "user_name": "shane m.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I travel all the time and have been to maybe 30 different gyms.  This is the best.  It's top 3 climbing spaces and the classes, sauna, and cool food carts easily put it in the number 1 position.  Not to mention their monthly pass is not any more money than some of the worst gyms that I've been to.  In a perfect world, every city has a gym this nice.", "date": "7/10/2018"}, {"review_id": "mwbqLUZ_ri3qK89vZgDAbQ", "user_id": "V_V5GvasPh3XWx4GLmVfyQ", "user_name": "Jessica C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 3, "funny": 2, "cool": 1, "text": "H.E.A.V.E.N.H: Huge place. It is an enormous gym with lots of climbing walls, a separate area for top roping, huge bathrooms, an upstairs dedicated for exercise classes + gym, and a decent sized parking lot (with plenty of street parking). E: Exercise classes. Besides providing one of the best climbing routes, Cliffs of ID provide exercises classes like acroyoga, my new favorite class!A: A rated gym. Spacious and well maintained everything including bathrooms!V: Various climbing problems. I usually climb in touchstone gyms in the Bay Area. The best indoor climbing gym there is called Dogpatch, which is one of the largest bouldering gym in the nation. Cliffs of ID is as big or bigger than Dogpatch! The routes are similar too, because they are as diverse and they challenged me. There are plenty of flat walls, short walls, tall walls, inclined ones, and caves. There is basically a wall for just about everyone. E: Exercise gym. Yay amenities. N: Nothing beats to this place. I wish this place was in the Bay Area. I would come here pretty often.", "date": "9/28/2016"}, {"review_id": "2-FAiivf6xYQZz33DjGc-A", "user_id": "4JBNPPPNTVxs0g9y6v70Mw", "user_name": "Gabrielle H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "I hate to rate 1 star because I love LA's Touchstone gyms and although Cliffs gets busy, parking sucks, etc. that's not really the \"fault\" of the gym and I pretty much always get in a good climb and a good workout whenever I come here.However, I have a major problem with the tall skinny guy who did my belay certification test this past Tuesday around 1pm. When it was time to demonstrate belaying, he gave me absolutely no tension on the rope so I had to quickly try to belay rope that had so much slack it was touching the ground in front of me - meaning I had to pull pretty much down to my knees and ended up doing this super awkward thing to slide my hands and maintain contact with the rope. It made me look like I had no idea what I was doing and he stood there doing absolutely nothing other than stare at me blankly and wait for me to hurriedly gather up more rope than I would ever have to deal with if I were actually actively belaying someone.He did the same thing to my partner, so we both ended up just getting day passes even though once we were on the wall actually belaying each other we were totally fine, because we're not idiots and actually knew what we were doing.This guy has led shitty certification tests for friends of mine as well, and he's already gotten a couple complaints because of it. He was looking directly at a friend while she was undoing the ATC since she thought the test was done, and said \"falling\" and immediately threw his weight back even though it was clear she didn't know the test was still happening and he could have communicated to her that they weren't done yet.Next time I come in to toprope, I will turn right the hell around if he's working the test area because I am not dealing with that garbage again. I don't know what his problem is but last time I checked I pay to belong here, which means I pay in part for him to do his job properly and without a shitty attitude.", "date": "8/10/2017"}, {"review_id": "Iv3oNcUDPak5VPtbNvycrQ", "user_id": "57YP1XHFtMVqPjVNlHViEw", "user_name": "Daniel B.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Favorite.Gym.Of all time.I never thought such a place could exist. I am so glad to be wrong.", "date": "2/26/2017"}, {"review_id": "qrrmLh6FQyHjdfFsOWdCjA", "user_id": "bsDRkOkkPeMWCsuu8ehe7Q", "user_name": "Chelsey B.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Tried out bouldering for the first time at this location on a guest pass, and as a beginner it was really fun! The staff was friendly and the climbing paths were a good challenge, even starting at V0 and V1. Definitely hope to revisit soon!", "date": "8/13/2017"}, {"review_id": "bg7KiArgr2C1qyg1LPcByA", "user_id": "m52Qc_ym46ug4Kp9z7pToQ", "user_name": "Payal M.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My fiancé and I absolutely love climbing! We are so happy to have found a climbing gym near the Valley! Cliffs of Id is HUGE and has walls that are around FORTY feet tall! I was amazed. The routes are nice and challenging! Great Perk: If you have been belay certified at any  Touchstone gyms then you will not be required to test out again!Price: $25/day if you bring your own shoes! Parking: available in front of gym! However is usually packed so be prepared to park on the street!", "date": "9/12/2017"}, {"review_id": "Jy0b6HvD02eCbYhO3fMbRA", "user_id": "oYC3R6LxQltCQK9-SLcKwA", "user_name": "Maggie L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "MOST EXPENSIVE rock climbing gym I've ever been to....But also the one I've frequented most!$25/day pass if you bring your own shoes...Definitely the biggest and most fun climbs I've seen around SoCal.Place is very clean and doesn't smell musty like some other ones.Lots of facilities and additional cool stuff... like ACROYOGA!! I don't go enough to justify the the monthly cost, so I'll be sticking with the 10 punch pass for now which discounts each day pass to $23 with your own shoes.Happy Climbing!", "date": "6/16/2017"}, {"review_id": "v8I51CcuvalRENWLlPi6Bw", "user_id": "cbeTr8E3wYiAgl3J1zB2gQ", "user_name": "Domenic P.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "'Cliffs' is a stellar spot for getting your bouldering fix on!This is one of the three gyms in the LA area, which belongs to the Touchstone Climbing Gyms family of gyms. There are eleven gyms overall, with most in the San Francisco & surrounding area regions. Between the three in LA, I dig Cliffs the most, as I feel it offers the most creative set of bouldering problems. It also has 4500-5000 more square feet of bouldering compared to the other two.A membership gets you access to as much bouldering (and top roping at Cliffs only, between the three) as you can set your fingers on, access to most of the classes, weight & cardio equipment, locker room amenities, special event entries, etc. Towels are provided, as well as equipment for the classes (yoga mats, blocks, etc.).You also get one free guest pass per month, and a second on the last Friday of every month. There's a generally down to earth vibe when you step inside, and most folks are friendly and open to chatting. Some climbing gyms have funky crash pads, but the crash pads at the Touchstone Climbing Gyms are effective (excellent cushioning), comfy (so you can lay back and piece together the next route), and clean (so you don't feel nasty while doing the prior).", "date": "11/24/2016"}, {"review_id": "SM3Eb98BjvH0F2z95sEIdQ", "user_id": "CQ0SbavxipXOkJkA3zDI8Q", "user_name": "Kyla N.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "So I bouldered for the first time here and lemme tell ya, I am in pain. But, it was really fun!The place is pretty cool, well, at least for someone who has never bouldered before. Cliffs of Id is spacious, well ventilated, and even though there were a lot of people when I went, we didn't think it was too crowded and always found nice routes to climb and places to just sit and chill at. The workers are really nice too so no complaints there! Also, for someone used to paying for parking, it's really nice that you can park in their lot or the one across the street.Overall, this place is pretty nice and I had a great first experience!", "date": "6/26/2016"}, {"review_id": "CxEk1_mbke1SzMfuKKvuNg", "user_id": "lgCBMBC0_lSbEuSnnFLwVg", "user_name": "Guy J.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "This place has a lot of potential. It has great climbing walls, a small workout room and nice, clean bathrooms with a sauna. It is also, WAY overpriced. They charge for everything! If the monthly cost is that much, the least they could do is make the shoe rentals free for members...Staff is also not friendly. I will not be continuing my membership.", "date": "6/28/2017"}, {"review_id": "83utRhlqyjqPoRqtqFlSNQ", "user_id": "uI5Rve_2YWFrhX2rowdkUg", "user_name": "Jennifer T.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 12, "funny": 6, "cool": 9, "text": "As a long time fan of LA Boulders, and a fan of Hollywood Boulders, Cliffs of Id, although not my favorite, is surely a beautifully built Touchstone gym!  First off...the space.  It's HUGE!  At least 3 times the size of LA Boulders, AND they aren't even done building the top-roping area!  They also have a steam room in their locker rooms, which I have yet to use, and their studio (for yoga, Acro yoga, TRX, and a BUNCH of other activities) is gorgeous as well!  They also have the separate weight room for other exercises along with treadmills and many other gym equipment.    Now on to the actual reason we're here!  Bouldering.  Keep in mind, you don't use rope for bouldering...all you need is a pair of climbing shoes (which you can rent)!  The shape of the walls offer climbers a variety of levels that require all sorts of technique!  You have beginner problems at V0's and V1's, all the way to crazy dynamic V11's!  The routesetters here are mostly the same who set at LAB or Hollywood Boulders, so expect those quality problems!  The holds here are still relatively fresh and rougher compared to the ones at LAB, so my hands always hurt a bit more after a session here. Always be mindful of where you walk; climbers can fall from the sky at any time!  Weekdays before 3pm is $15 + $4 for shoes.  Weekdays after 3pm and weekends  is $20.  Kids under 12 is always $15.  If you need chalk, you can rent a bag for $1.  If you're going with a group of friends, just get one bag for everyone...really...there is no need for too much chalk on your hands.  Currently, parking is kind of horrible (it may be because I go in the evenings around 7/7:30ish) since a part of their lot is still being used for construction of their top-roping area.  There's street parking...but that can be kind of tricky at times too.  Anyway, if you want a great workout that will make you question your strength and still have a great time (and if you're in the Culver City area), come to Cliffs of Id!  You won't regret it!", "date": "5/4/2016"}, {"review_id": "oDkOyJqk_YoiNIexZKLuqw", "user_id": "qenN5JwRyj9jRrwiufDSzA", "user_name": "Rosie B.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Can't beat this gyms capacity for various activities. Top roping, huge bounding area, great gym with free weights and cardio, and their various fitness classes (TRX, yoga, etc). To be fair, and this might be because I come here more frequently then the other touchstone gyms, but I think the bouldering routes are easier than Hollywood and LAB. (I personally love finishing a v4 in one shot or a v5 after a couple of attempts, really not complaining)", "date": "3/13/2018"}, {"review_id": "5Y8AxSSi2oOKpDNGFr3yEQ", "user_id": "Q3ptO9w0ax5dJgUdxoHosQ", "user_name": "Crystal F.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Parking is rough. The facilities for climbing and sauna are awesome, but the gym upstairs is too small and not well maintained. Some of the new staff they hired are rude and get really hostile on the microphone. Tuesday food truck is awesome and towel service is great", "date": "9/26/2018"}, {"review_id": "l19ehzrCNvLt1cyD1FiHnw", "user_id": "UwnDzkmn1P4b8YjhqI7pgw", "user_name": "Ben L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "WOWIE-ZOWIE!!! What a magically enchantment wonderland of indoor bouldering and rope climbing!!  The bouldering area is quite expansive and the problem sets are very fun and creative.  The ratings are definitely more soft than at other gyms (Sender, Factory, Hanger), but overall the setup is pretty sweet.Participating in their bouldering competition was a blast and the event was really well run.  Good bang for your buck. Definitely worth multiple return visits if you're not a regular.", "date": "9/22/2016"}, {"review_id": "K1v9nIKLxlDTM5ui4VJCAA", "user_id": "Se54KLDDmPDyEfgCKc-6tg", "user_name": "Haile J.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "First time here and had a good time. We lucked up and found a spot in front so we didn't have to struggle with parking. But be prepared to pay with quarters only. The staff was nice but not very informative. The girl at the front was really rude, and kinda made us feel like we didn't belong. I wanted to walk out but glad I didn't because I actually had fun. I am giving it a 3 because the staff (pregnant girl) was less than welcoming and needs to learn better customer service. I literally was ready to leave because of how inadequate she made me feel when asking about the facility.  Not sure why people are still the way they are in 2017.  I would love to come back one day but I think I'll practice my skills elsewhere.", "date": "6/3/2017"}, {"review_id": "MNMHcS-tN6yz89vsm-TWmg", "user_id": "HnvxBF0qtFlR1rRbgqVwCw", "user_name": "Chelsea B.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I've climbed a handful of times for the past few years. My boyfriend is a climber so we would take trips to Joshua Tree every once in a while and I'd also join him at his climbing gym in Long Beach every now and then. When I moved out to Culver City I decided to join a climbing gym because I wanted to get more into it! I've never had a membership at a climbing gym before, but I've been to a few and climbed with a day pass. This is a GREAT first gym to get a membership at. It's a fantastic gym in general. I've had a membership here since it opened in late December of 2015 and it's been so awesome. This place is HUGE and there are endless problems to work on. There's something for everyone here from beginners to the very experienced climbers.They also host classes in a room on the second story. I've been to the yoga classes and loved them. I think they also do TRX classes and a few other activities too. Right next to that room is a weight and cardio room. There's free weights, ellipticals and treadmills. And on top of that they also have a steam room. This place really has it all. It's a little pricey but I'm more than willing to pay to go to this gym. A membership is $75/month and a day pass is $20 (if you come before 3 p.m. the day pass is $15). The vibe is awesome, the employees and members are super welcoming and helpful, and it's a really nice facility. Parking is pretty tough. It's a small lot and it fills up really quickly. There's street parking around the area but on weeknights it's still pretty difficult to find a spot, so be prepared to hunt for a place to park your car.Right now they only have bouldering, but around summer 2016 they'll have top roping! The walls will be 30-40 feet which sounds so cool. I can't wait to see how that turns out.", "date": "3/6/2016"}, {"review_id": "sVFkLnXZ2iOPIWSRkkLU6w", "user_id": "3hB-h2l-vEXuiIye3NV9sg", "user_name": "Daina S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We took a ropes class with Gibson and HIGHLY recommend it. They do instruction for 30 min and then you can climb your heart out. Really welcoming to beginners and SO much fun and an adrenaline rush!", "date": "1/11/2018"}, {"review_id": "KHlR_3RaHThlsgqu2ezlmA", "user_id": "N_SWwvjdM6c3-_g-PuaAfQ", "user_name": "Orville C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Great gym not just for the climbing (e.g, bouldering, top roping, and lead climbing) but the classes! Jonathan Edwards offers a Thursday night TRX class that is intense it'll get you sweating! Yoga is a daily offering if you're looking to find your zen. Locker rooms, showers with towel service and unisex saunas area clean and readily available. First time climbing no sweat there are tons of classes to guide you through the basics and beyond. The one down side is parking... but it's LA and parking generally sucks, there's tons of street parking, and a lot across the street (avoid the tandem spaces).", "date": "9/23/2017"}, {"review_id": "lzYLXAlclydWmYAkxhcTtw", "user_id": "YUyG2IUG8rDSWAnuNvTtjg", "user_name": "Casey Marie S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great environment! Friendly people, all ages, and helpful staff! I decided to get a membership for my son and I because of my experience here. I have been looking for a place to be more active and exercise regularly. This has become the place. Yoga classes and a gym comes with membership. It is huge and feels good being here. Well taken care of and fresh air environment.", "date": "2/5/2018"}, {"review_id": "D18unHfscmA_RzC4-mFI2Q", "user_id": "GkzJfxH27j6glfOqBr-Rlg", "user_name": "Tessa L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Have had a touchstone membership for a couple of months, came here for the first time today. Biggest of the touchstone gyms I've seen. Nice long table and seating area, lots of space to put your stuff. COME ON SUNDAY! The smoothie/ healthy food (D's super blends) truck was here, of course I enjoyed a delicious smoothie bowl! Def bonus points for this truck being here. Walls/ services offered: Really good top rope climbing! Good options for lead climbing too. Lots of easier climbs in the 5.10 range, perfect for learning and practice. I didn't do really any bouldering today. Bouldering walls lower then Hollywood's, and very little slab selection. Not super impressed with the boulders.... I'm a sucker for some good slab and longer routes. Loved the top rope though! I took their belay test. I was very nervous and the staff was nice about it! If you haven't done much belaying or have done a class somewhere else, it's a good idea to do their intro class. They have some specific questions they ask, I mixed up one thing and they gave me a temp pass, so I will take the test again next time I come back. They rent harnesses and belay devices, climbing shoes of course and chalk I think as well. Very nice and spacious with sauna and showers, classes every day of the week. Best music playing of all the touchstone gyms I've been to. (Cliffs, lab, and Hollywood) there was a blonde staff member with short hair working behind the desk who was awesome! Really friendly and helpful. They also have a little mini store that's stocked with tons of route climbing and general climbing goodies. I was able to find some nearby street parking which was great. Really enjoyed my day here!", "date": "2/4/2018"}, {"review_id": "xxuBON2OEo63xmhZZxDGGA", "user_id": "G1t7tdP-0rbZztrNkH1E_A", "user_name": "Katie C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love it here; everyone (employees and patrons) has a great attitude and the facilities are expansive and clean. The only thing I'd want is a larger parking lot, but, then, I suppose that'd leave less space for climbing...", "date": "2/5/2018"}, {"review_id": "SQZhgrXvy_f0zeO6EqmVBQ", "user_id": "4MgQG-HHyAt2INd5h83CYQ", "user_name": "david k.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Beautiful facilities, staff are amazingly friendly. It looks like Superman's Fortress of Solitude in there. Seriously a dreamscape when you walk through the door. Yerba Mate and Cold Brew coffee on deck at all times. Routes are always fun and challenging, but grading can be a bit soft at times. Which makes me feel great about myself, and also gives me something to laugh about when climbing with butthurt elitists. I basically live there. There is a climb in the top rope/sport climbing section named after me. See if you can spot it. Harness, shoe, chalk, and belay device rental if you fear financial commitment are always good. Location is perfect, I live about 7 min away. Only a quick jaunt to the delicious restaurants of culver city post-climb. Food trucks rotating in parking lot all the time. Great music at all times. Can't imagine asking for more from a rock climbing gym.", "date": "3/19/2017"}, {"review_id": "l3kUcg-SDRPeWnD8cvUY8A", "user_id": "Mi1S4Jz1p9lTjyRZfEMjhw", "user_name": "Michael K.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "Have been a member for a while. Parking at LAB was bad but I lived close enough to walk. Then they opened Cliffs of ID near my office. I am glad it's catching on...but parking is the worst. You are gonna have to drive around for a while to find parking, walk or stalk a parking spot. Good luck. I am looking for another gym. If I can't pop in to work out, what's the point of being a member?Nice enough facilities, Helpful staff.", "date": "12/5/2016"}, {"review_id": "UdEotdMw92ie_zyjPcrBPg", "user_id": "86JX_xYfGKXIngxEcDnUog", "user_name": "Morison W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I like this Bouldering Gym a lot! I recently started getting into bouldering. This was one of the better gyms I've been to. Pretty new and plenty of space! There's a lot of challenging ones to conquer! They also have an upstairs area for other workouts. They have treadmills and also a separate room for classes that helps you stretch out your muscles after a long climb. The restrooms are super nice too. They have a sauna in there and places to shower. I haven't seen a restroom this nice at a gym before. Highly recommended!", "date": "3/1/2016"}, {"review_id": "ni2syW4idkMnSG5V14jIdA", "user_id": "vW4ZgNXiPi0x65IGupiQPw", "user_name": "Cleo N.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 4, "funny": 2, "cool": 4, "text": "This place kicked my butt! I was invited to this indoor climbing (bouldering) gym on a guest pass and had no idea what to expect. Walking in I thought this would be so easy. Lol, I was so wrong. This place is quite challenging. I barely completed the beginner baby climbing . Bouldering is a great alternative to going to the gym. You will be sore the next day especially if you're not athletic which I'm not. This location is big and well ventilated. No smell of feet or body odors. They have classes and a small workout room upstairs. The bathrooms are super clean with showers, lockers and a sauna. Though the bouldering was very difficult for me, I'm considering signing up for a membership. Membership gets you access to their other climbing gyms as well!", "date": "8/30/2016"}, {"review_id": "1gMmgBx_qfX5klZV_p6Kcw", "user_id": "xZSY8IUShi4zUJL61XdvzA", "user_name": "Liz L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "It's very roomy, with a lot of routes of varying difficulties. It's for the most part a bouldering gym, but it's also got climbing routes, some workout rooms, a class exercise room, and a sauna. I've been going there for a couple of months (on a monthly pass) and it's great! Go during a week day if you can, and you'll get the place pretty much to yourself.", "date": "12/9/2016"}, {"review_id": "WFybmFFTiP90zMwOzMXz-w", "user_id": "wTGFI5Mz0hb68Xr22nDWxQ", "user_name": "Miguel G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty great, though some of the topouts seem a bit dangerous for their rating (not surprising as they learn how to work with the new walls). Way more spacious than LA.B, and the sauna is a nice touch. They seem to still be working out some kinks, though. For example, I went last Saturday and they ran out of shower towels towards the end of the day.Friendly staff-- many familiar faces from the first Touchstone gym in LA, LA Boulders.", "date": "1/15/2016"}, {"review_id": "VfGCjvMLpNzcOt3oBK-P_A", "user_id": "YiJQSKn5BrtWwRhSLBlw8A", "user_name": "B K.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The newly birthed Cliffs of Id are as immaculate as advertised. Their gluttonous selection of bouldering routes are only eclipsed by their vast array of amenities (saunas, stretching studios, and TOWELS for fucking DAYZZZ!!!)But in all seriousness, Touchstone nailed it. They got a great staff (shoutout Alex/Kimi) with killer setters--Can't wait to see how legendary this place gets once ropes are up.If you're itching like a fiend for a proper indoor climb...HIT THESE ROCKS", "date": "1/16/2016"}, {"review_id": "U1506T42enXYg3Mn2TlgGw", "user_id": "F4OmF3ZOMNoJCpd4frLluA", "user_name": "Raven R.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "oh my gosh I can't get enough of bouldering! Every Monday I go for their Stretch Class if I'm in town with Lauren who is amazing and it's only $15 if you wanted to pay an extra $5 or $20 you can spend the entire day there not only do the stretch class but also go hit the dry sauna Boulder and rent shoesOh I sore the hot active Asians there but that's just me! LoL", "date": "6/20/2016"}, {"review_id": "z8rSQWvDda7q36huchGplg", "user_id": "VO8KT5M7-BoEbnvBnLvFfw", "user_name": "Kristin R.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Still the best climbing gym I've ever been to. Unfortunately I'll be moving away! Great bouldering for all skill sets and top roping!", "date": "7/30/2017"}, {"review_id": "ZuFskEuCEt5qg5pJf9Sy2Q", "user_id": "ozSKZajIyzEcG-p6_es3YA", "user_name": "Pam D.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "nice facility, day pass is $25, but awful service and rude staff. Had the WORST experience with one of the staff on duty on Saturday. We came in to lead climb, and had to take a lead certification test. The staff that tested us had attitude and demeanor like we were his enemies or something. We will NEVER return to this place again because of this one asshole. Sender One is much better for lead climbing and their staff are nice, professional and provides good customer service. I would stay away from this place!", "date": "5/15/2017"}, {"review_id": "3MNoorX1hl-gyLqT1v7rfw", "user_id": "1XIqoPBLSV8f6fyxP3sNFA", "user_name": "Katherine A.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The youth team coaches are fantastic.  They inspire the children and make it fun to push themselves to improve at rock climbing.  The front desk people have always been super friendly, and the facility is clean and well-maintained.", "date": "4/2/2018"}, {"review_id": "QsZ0r9ldGAIwgHj-4KGY8Q", "user_id": "xrGLy0dRQIeBm4jKmFsRjQ", "user_name": "Isend R.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Walls are high and nice. Bouldering is plenty. Don't dig the walltopia look but whatever, it is a climbing gym. Allows you to get the pump. I also like some of the holds a lot. The gym area is cool too. Solid spot imo.", "date": "9/27/2017"}, {"review_id": "Qwo-UuJyAS1wBmw5xZAM1g", "user_id": "dJCG8mqiW4mjgosrISRyXA", "user_name": "Eleanor W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Cliffs for the first time last week and had a BLAST. This place would be an excellent place for employees to have team building outings. The place is clean, fun, and challenging for true athletes...lol", "date": "2/23/2018"}, {"review_id": "vgMc9d4JnIWbVBjvdRuYlA", "user_id": "o9Uh5XWfuwy5mbJcjyB9NQ", "user_name": "B F.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Phenomenal gym.   There is a ton of wall to climb, and it gets refreshed A LOT.  The routesetting is very good.  Of all the local gyms, I found Cliffs to be the airiest.  The only negative is that parking fills up quickly and the surrounding neighborhood's parking can be a bit sketchy.", "date": "7/29/2017"}, {"review_id": "Ui0DtLw8RTfCEAG6SOD0Lw", "user_id": "5r0PU9KUkNIp3C0Krk10MA", "user_name": "Christopher H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "First a disclaimer about the ratings, there's no way I'm a V5 climber. Never have been. So let's just say 'soft' might be a good way to describe them.That said, the problems are sooooo goood! It's rare for me to be able to compare pulling plastic with climbing outdoors, but I did today. More than once! The less than vertical section in the back is alone worth the drive from Pasadena and I sincerely hope they incorporate slab routes in the roped section once it's complete! Did I mention this place has the nicest bathrooms I've used anywhere, much less a climbing gym, in a long time? And the saunas? Please, please bring a Touchstone facility to the SGV! We climb, we have disposable income and respect for world class operations. Driving to the west side, or even DTLA where I am a member of the impressive Stronghold, is a drag but totally worth it to climb at this stunning facility! Absolutely coming back - the best experience I've had in over ten years at a climbing gym from the moment I walked in! Right.The.Fuck.On!", "date": "4/24/2016"}, {"review_id": "B6bqxwKKUZI4n57QSO1jIA", "user_id": "NFIi_aXNp4QM29Ufn_lzyA", "user_name": "Michael L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The best gym I have ever been to and the staff are extremely helpful and nice. I will be back!", "date": "5/24/2017"}, {"review_id": "ytd2JniycqL5Wr1NOUjNcA", "user_id": "NhvaHKwSp3axbB6T4bqqIA", "user_name": "Kathleen L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 4, "funny": 0, "cool": 3, "text": "This gym rocksI love the boulder color schemeI've tried a few bouldering gyms, and this one is far beta than the restI'm always pumped when I know i'm about to get hereCool glad I got that out of my system. I'm relatively new to climbing, but I've checked out a few bouldering gyms: Pipeworks in Sacramento, LAB and the Studio in San Jose, Hangar 18 near Torrance, and The Austin Bouldering Project in Texas. That being said, Cliffs of Id and LAB are my favorites. Lots of different and interesting routes, good variety in difficulties and technique, and wifi. They're also still working on their top rope climbing walls, exercise classes, and I think weight room. once that's set up this gym will have it all!I noticed that a lot of the people at cliffs are the same as those at LAb. In other words, everybody is friendly and willing to chime in with some tips or encouragement. At $75/mo their membership is a fantastic value. If you're reading this in 3/2016 or later, disregard: Finally, their new holds may take some getting used to since they're extra grainy.", "date": "1/6/2016"}, {"review_id": "lZTKQJEOW_uTbcFUIaAH4g", "user_id": "62KnH1Pw2MqAjVwIvTjt8w", "user_name": "Sarina P.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Came in from Las Vegas and wanted to check out a gym while we were on vacation. Came on memorial day, and they were on holiday hours, so this place was packed. Not sure if that's how this place always is or if it was just the holiday, but there were tons of people. The gym had awesome walls with really cool angles that I haven't seen in a gym before. The problems were fun to do, and could get pretty lengthy depending on what wall you were on. Mat softness was perfect, and the holds seemed new, though they weren't sharp like brand new holds can be. They were doing construction on one half of the gym, so when they're done it should be a decent size. My only negative was that there was not enough walking room because the mats stretched so far and there were tons of people sitting and laying on them. It would be better to have less matt space and more walking room with benches to sit on, especially as they have signs saying not to leave items on the mats. Overall, it was a nice gym. It should be really nice when the rest of it is finished.", "date": "5/31/2016"}, {"review_id": "nxjl5NaKWOTimRZjUawInQ", "user_id": "1opW2OUyjuHw_tUzDxO_6Q", "user_name": "Zalo D.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fast, easy, enough walls for a beginner and a introductory video. I went during the week. good cold brew coffee. Going back!", "date": "6/30/2017"}, {"review_id": "kmEmGnbX_Qif_rJC0rhjkg", "user_id": "gOKvN9lKUeb1STpSqErFJg", "user_name": "Toya H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I enjoyed my visit. A friend and I started our day in the hip hop class. The instructor was great and taught us some exciting new moves. We then took the Intro to Climbing class. The instructor was amazing and patient. I like how they really focus on safety. After the climbing class, I attempted to conquer the wall. The wall won. The entire day was fun. I'm a little sore but I will definitely go back sometime in the near future.", "date": "2/11/2018"}, {"review_id": "LbcYwv8PqJuJus-yRpUUKw", "user_id": "k7CjbmFAz43uKKheVMeskQ", "user_name": "Naoko S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 3, "funny": 3, "cool": 3, "text": "This place is awesome!! I love it because it has a campus board room and it has some awesome facilities. It is one of my favorite climbing gyms and I go to ALOT of those. It is so awesome because the staff is so nice and they give actual feedback. It is great because it is so huge and the routes are so unique. I personally shoutout to all of the staff like Matt, Jeff, Alex, and Tia. You guys are so nice and I appreciate it. :)", "date": "11/24/2016"}, {"review_id": "nqlpRTBSVZuDl8hXu5m3Ng", "user_id": "lNxRaIO2wNqMkCcQ8hhtyQ", "user_name": "Kathleen W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 2, "cool": 0, "text": "*Bouldering area review only*SF climbing crew and I stopped by Cliffs of Id during their limited holiday bouldering hours.  In true Touchstone gym style, the setting was great with nice varied setting and fun features to climb.  I appreciated the opportunity to practice overhung routes and liebacking - there's a lot of that here!Most of all, the tapeless, clean route setting and seamless flooring made for a nice aesthetic.  I could photograph this gym all day!Lot parking was a breeze, but I'm sure once the gym is running at full capacity, it will be a little tricker.  The gym will have rope climbing, fitness room, weight rooms, and yoga in 2016.  I loved what I saw and will come back for more!  Great gym addition to the Touchstone fam!", "date": "12/28/2015"}, {"review_id": "dibumGdNpEdZdqdAmbOkXw", "user_id": "66nWrFokAbBaCfgl4nfM8A", "user_name": "Corey G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Went to this gym while traveling to Culver City and it was amazing. Best climbing gym I've ever been to. Routes are set very well, but the grading is pretty soft. I was flashing grades that I usually have to project at my local gym. Tons of climbing area and each wall is different. You can go from slab to a massive overhanging wall or anything in-between. The wall is basically made of sandpaper so you can almost smear every route. If your footwork isn't great, you could probably wear through a pair of shoes within a few visits. I'm sure this will get better overtime. I've been to at least a dozen other gyms in the US and Canada and this one is by far the best.", "date": "3/9/2016"}, {"review_id": "pyd-La7mEREBFccSGQB39A", "user_id": "XnRs0pcBX5mhYGN9doC1Lw", "user_name": "Becky G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "While on a 2016 LA summer trip, I dropped-by Cliffs of Id.  The lead/tr section was still under construction so spent my time in the awesome bouldering area.  Lots of problems and different terrain.  Great padded thru flooring as I sense crash pads (indoors) are becoming outdated.  Friendly and awesome front desk staff.  Definitely another great addition to the Touchstone family!", "date": "1/10/2017"}, {"review_id": "D2FqO2aw5cNsXp487pAXUw", "user_id": "FXgJTjdVotlVSIJQmmhhHg", "user_name": "Rico T.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Probably the best climbing gym I've been to . Especially if you don't just want to boulder, they have lots of options for both roped climbing and bouldering. Parking is a pain but not any worse than other gyms I've been to ..", "date": "11/28/2016"}, {"review_id": "rQ8ux9hdvY2Z2waBWSowtA", "user_id": "SddNitt8M4dCuhPGYox7nQ", "user_name": "Alex E.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Cliffs of Id is an amazing gym... and it is not even completely finished yet!  The bouldering area here is among the best on the west coast, and perhaps in the country!  Over the past couple years I have frequently visited Seattle Bouldering Project, Planet Granite, and Touchstone sister property Dogpatch Boulders... and the walls at Cliffs of Id are my favorite, by far. There is a huge variety here, and the gym is approachable for beginners and experienced climbers alike.  The facilities here are also really taking shape. You can tell that this place is going to be a world class gym when it is complete. The bathrooms/locker rooms are immaculate, and I love the addition of a sauna here.  This will be quite relaxing after a climb!  Lastly, the staff is outstanding. I have greatly enjoyed chatting with everyone I have encountered behind the desk.  Additionally, I dropped by the lost and found today.. and they still had my unmarked/generic chalk bag that I had left last week. So helpful! I am loving my Touchstone membership, and am looking forward to many more hours spent at Cliffs of Id.", "date": "1/5/2016"}, {"review_id": "AueYd194fIXQaMERK3yH1A", "user_id": "pGgI55IsOWoe-qMQJhqpJw", "user_name": "Frank S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "SICKEST GYM EVER!! parking is a little tight but I always manage.The climbs are great, not too crowded and the people are amazing :D", "date": "1/6/2016"}, {"review_id": "QnMj01U4b9MX7kV_pu845A", "user_id": "kxCb8YZaCsOrIk6W-6lg3A", "user_name": "Aaron S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best mid-city / westside spot to get your climb on.Nearly a hundred problems for you to play around and get busy. Great people and fun attitude here, no egos and people are patient and willing to give beta. Cool atmosphere, except for the sauna, which is sweaty.", "date": "2/11/2016"}, {"review_id": "UMaDPSxdJ4LGQFfYJSjgDA", "user_id": "UJ0VcEFOXNpP7lim11Fe4Q", "user_name": "Heidi C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time bouldering and it was way more fun than I'd imagined! The facility is amazing - huge space with lots of problems to solve. There's a rock climbing wall with ropes that require a training class before getting started. It could get a bit crowded but people were really great about taking turns and giving space. They have a parking lot but I hear it's pretty packed during peak hours. Street parking is available. Will def recommend to friends and family.", "date": "3/16/2017"}, {"review_id": "z3Ja327Wz2VRHeKyzFquMA", "user_id": "RV1mwV2sebVjEu75gcPcvw", "user_name": "Anh T.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Disclaimer: I'm a climbing noob and have only been to one other spot. But LOVE it here.This may sound weird because it's really just a gym, but this place is BEAUTIFUL. Everything is brand new, the walls look cool, and the colors are so pretty. Although they are currently limited to bouldering, it's humongous. Climbers are so nice, it already has a community feeling of sorts.The staff is super helpful and friendly, though they're still figuring things out. Package is about $75/month (no intro fees through Jan) and includes access to other gyms. No classes available until January...but can't wait for yoga!", "date": "12/29/2015"}, {"review_id": "3-Fgr_jqcfs1JdgtW3-ZJA", "user_id": "sLNiFfCqvicZIPxk6OEXaQ", "user_name": "Jake S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been waiting with great anticipation for this gym to open, mainly since it's closer to my home than the LAB, and it's been worth it. The layout in general, and the routes in particular, are far better than I had expected, and as a longterm Touchstone member I expected them to at least maintain their high standards, but they've gone above and beyond this time. In addition to the bouldering problems, which, in my opinion, are better than those at any other gym I've been to in California and New York, the So Cal Touchstone staff are amazing. Remy, Jeff, Graystone, Nash, Kevin, Matt, Ryan...to just name a few. Always super helpful, patient, and generally friendly. And the little things are also really nice - the clean, white, neatly folded towels I can always count on, the clean bathrooms, everything. Excellent job all around, Cliffs of Id. You should all be proud. Thank you.", "date": "1/19/2016"}, {"review_id": "eXLpeVFWPRR6Lz7Did0HQA", "user_id": "XmldNVdTs9PyJ47a7roFTQ", "user_name": "Nina H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "Some of the staff here, as well as at LaB another touchstone gym, have some weird attitude. They are so rude and arrogant when facing clients who pay a very high membership and try to communicate with them nicely. Sure you may be tired - hey but it's your job and we all come back from work and tired and still try to have fun here. Really want to treat your customers like that??? Parking is terrible. Other than that the facility itself is good.", "date": "8/20/2017"}, {"review_id": "gLBJ8byC7bTNfnUv_IJ-ug", "user_id": "T0iLiZftrJGNrhD6l6jRdA", "user_name": "Nathalie C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "the best bouldering place i've been to. I'm a beginner but have gone to multiple places and they all seem fairly small. This one is very spacious. Even when it's crowded I don't feel like it's too bad. Been debating on whether to sign up for a membership - we'll have to see after a few more sessions but bonus points for the yoga studio. not sure when their cardio/weight room will open up but more bonus points when they do.", "date": "2/8/2016"}, {"review_id": "6npLwVjtg_f97jT4yEzJTg", "user_id": "Cx6yMgbxkXiuVxwChVmeIA", "user_name": "Ryan S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Great place new to climbing never had so much fun. Like anything in LA, you can avoid leak hours or go firming and meet people everywhere. I cancelled my gym membership because they have yoga, climbing, other classes...great community that get you to exercise in other ways than a lab rat on a treadmill. Parking isn't as bad as it seems, just chill out in hr parking lot and you almost always find a spot within 5-10 minutes even during peak hours.", "date": "8/27/2016"}, {"review_id": "PUrWOvvNM7av0CrEppWkmg", "user_id": "7oAUlxgIMMVAr9At0jOPdA", "user_name": "Dani V.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome facility.They are constantly adding new routes that are challenging and fun. They dont rip down things so fast that you don't have time to work on it. The staff is knowledgeable, helpful, and super laid back. As far as amenities they have nice locker rooms with saunas which is awesome post climbing.The only bummer about this place is its so popular that sometimes you're not able to find close parking but honestly I've never had to walk more than a block.", "date": "1/30/2016"}, {"review_id": "0IyGLaEfZuvLz8gCp-bMcQ", "user_id": "JUsgPMN5QRTqFCfG-oeVYg", "user_name": "Frank S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "There is a ridiculous bounty of bouldering to do here!  The gym has been crowded ever since it opened, but the climbing area is so large that the crowds dont matter.  Super thoughtful and creative layout, and such generous amenities!  Big changing rooms with nice showers, towel service, and saunas!I love this place, and love the fact that membershio here gets you membership at the other touchstone gyms here and all up and down the state.  It is a great time to be a climber!", "date": "2/13/2016"}, {"review_id": "Z-fPwhKtqdRZiwffuWIgfg", "user_id": "_KJuqLwGnc3ukdFLALsrig", "user_name": "Ashley C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hey there fellow yelpers. If you're scrolling down this page searching for reason to come to Cliffs of Id, let me tell you, there are many. With it's recent opening and amazing offers, there's really not much more you could ask for. Let me break it down for you.Service: There are people who are good at customer service, and then there are genuinely awesome people who are just as excited as you are to be there. Joe and Kimi were so helpful with all of my questions about the gym and were happy to help my friends with anything they needed. Joe gave really great tips to a friend of mine who needed new shoes, and gave a really thorough breakdown of their membership program for the others! By far one of the best and most honest customer service I've gotten.Space: Not only are the walls set up in beautiful shapes, but they're really fun to climb! They offer so many different levels on each wall so there's no getting bored in there. They're not even done building the place - can you imagine how amazing it's going to be? Despite their \"in progress\" construction, they manage to keep the place clean, functional, and comfortable. They offer you a sauna and shower in their bathrooms for you to clean off. Talk about being pampered!Parking:This ones a little tricky, but I've always managed to grab either street parking or a spot inside. The gym is growing to be popular so parking towards the evening gets filled up. But if you drive around, you're bound to find a place to leave your car.I used to have to drive 30 minutes to get to LAB downtown, but this gym is an awesome and more convenient replacement. I'm so glad I met Joe and Kimi - they really bring that inviting atmosphere to Cliffs of Id. Thanks for making my friends and I feel so welcome! We'll be coming several times a week!", "date": "1/11/2016"}, {"review_id": "GQZ1tKJ6h5-nlQKmkhvI8w", "user_id": "bglLIiHyp98f2jnD5r8GcQ", "user_name": "Laura G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I looooooooved Cliffs of Id, even though my time there was short.  I was a member for a few short months before leaving LA for a while, and I can definitely credit Cliffs of Id for creating my love of climbing!!!  The facilities are gorgeous - open air, clean, spacious.  The bouldering area is super welcoming, and the top rope area was awesome.  The staff was super friendly from my first to my last day there, and this is already one of my top things I miss about Los Angeles!!!  Highly recommended!!!", "date": "10/5/2016"}, {"review_id": "tWSD5U5z5t43kA0rOq-vBQ", "user_id": "BL3wfAXptaNQq1AAw5WawA", "user_name": "Sarah M.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Good routes and problems but the rating on the big walls were a little soft, but this was consistent so it is not a big deal. Employees were friendly and welcoming. I was in from out of town today and they only had one person staffing the entire gym at first on an extremely busy day which seemed like a poor decision. From a safety perspective I was mildly worried that they use static ropes for the fixed rope ropes without mentioning that to climbers that were about to use their walls. This shouldn't be a big problem that static ropes are used, but falls on static rope, even on top rope could end up pretty rough if some slack is out. I believe a warning about this would be a solid call. Otherwise it was a fun place and enjoyable.", "date": "11/25/2016"}, {"review_id": "NUUZKUSn1vs0nluSczg6fw", "user_id": "ztJhe6oXgaid7dLW3M6bWA", "user_name": "Alex S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to get a fun workout. Perfect for beginners to advanced climbers. My only wish that their weight area was a little bigger.", "date": "12/11/2016"}, {"review_id": "onNcllUyuzEVvYC1yFt2QQ", "user_id": "JMlHUp7TdDdPTEdu_BXW7g", "user_name": "Mariel W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super clean and always fun to go! Hope everyone follows the rule so the place can stay as nice as it is now.", "date": "8/27/2016"}, {"review_id": "2R_GTPBNdHfeldx_eZvciw", "user_id": "r0EQqSTgw7K_r9hixgco4Q", "user_name": "Jeremy F.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm new to climbing but this place has something for everyone. It is so spacious that even on a busy evening I never have issues with crowds or anything. Good vibes in here too. Easy 5 stars for me.=====Update=====After more then one year, Cliffs of Id is still top notch. The staff is amazing and super chill.", "date": "1/14/2016"}, {"review_id": "irEhxp7GoSVkHG54w7FfIg", "user_id": "4Fd1llC9GwigoSX_qGhPog", "user_name": "C W.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is huge, clean, and has a wide variety of bouldering problems. The staff is friendly, and I had no problem finding a spot in the lot on Sunday afternoon. The grading is a bit soft (good if you need a self esteem boost), about one level softer than dogpatch boulders and mission cliffs. I personally like the grainy holds - the graininess, while painful, makes it easier for you to hang on!", "date": "5/14/2016"}, {"review_id": "4O_Yj0tATOrz84cHcV8ejw", "user_id": "Z-tuWqofUJqNfUgog8N2ng", "user_name": "Moulton H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym with creative route setting and fun vibe. The new addition of rope climbs is great. The routes set bellow hard 11 are soft ratings but we'll set. The bouldering gym is awesome.", "date": "11/29/2016"}, {"review_id": "Lhx5YWxoGZd4f66xDYIDxw", "user_id": "GUWkZNvAJ3snnMH0uxN5Pg", "user_name": "Payal S.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Matt was a Great instructor for our group! He stayed with us throughout our entire time both coaching and challenging us.  It was our first time and we had a blast!  Great facility and low cost for a day pass.  Will be back!", "date": "2/28/2016"}, {"review_id": "b8-MUwB6RlTayOI0yo1yKw", "user_id": "YfI7Id9l7QE5nTywSYpFPw", "user_name": "Jordan P.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My first Touchstone gym experience was at LA Boulders in Jan. 2014 when they were still relatively new. I had never ever bouldered before then, but I thought it was a fun experience. In summer 2015, I learned that Cliffs of Id was opening a few miles away from my home, and I eagerly awaited its opening so I could put my gym membership money toward a place that I actually enjoyed going to since I can be the most sedentary and lazy person I know. I've been a member of COI since January 2016 and it's been exciting to see the gym attract more and more people while taking root in the community. Now that the rope walls are finally open, you can now practice the ultimate trust fall with your belay partner. While this relatively huge climbing gym attracts a lot of people, there's still enough room to move around, and street parking can still be found if you look hard enough. Of all the Touchstone gyms in LA, this is probably the best one in terms of general size, both the bouldering and roped areas, and the sheer size of its own private parking lot. Routes here seemed to be graded super soft during the first few months after opening, but I think the grading may have been stepped up slightly since. Regardless, it makes it more fun for beginners when they can actually send problems. Routes are changed out anywhere from 3-6 weeks, so you have plenty of time to project problems if you're a regular, or if you're just flashing everything, there always seems to be something new to try. Monthly membership is $77, which isn't bad if you come to the gym at least 4x in one month to recoup the costs of a day pass. You also get 1 free guest pass per month to use for a friend and on every 4th Friday, you get a bonus guest pass to lure more of your friends into the gym. The gym also has yoga and other fitness classes, a weight room with machines, and really clean locker rooms with showers and a sauna.All in all, I'm super happy to have a place that I look forward to going to 3x a week instead of spending another night in glued to Netflix. If anything, I'm one step closer to getting myself some Michelle Obama arms.", "date": "9/2/2016"}, {"review_id": "dzZw_AJJTWz9gb94pqMSBA", "user_id": "KbJk0d2URzL0V1mwiq5sQg", "user_name": "Wayne G.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Be sure to check out the stretch class offered by Lauren in the upstairs room on Mondays at 8:30 pm.  I always feel better after her classes and she know how to change up the routine for an effective workout.", "date": "5/5/2016"}, {"review_id": "mn3ZzXDMncJGRSlRh_z7WQ", "user_id": "CKFT3HAoPBEuGfj70TBo0Q", "user_name": "Lenny D.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time doing any kind of climbing. This place is cool. Tons of routes. It really fucks up your fingers though but it's a good workout. Did a V3 my first day : )", "date": "7/1/2016"}, {"review_id": "dn791jWebua_Ul-3pOLxCg", "user_id": "xZmpnE_lJpvySOPbb_AkYw", "user_name": "Amanda D.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So glad this gym is finally open! Been apart of touchstone since LAB opened up in dtla and still a happy, proud member. Not only is this new gym bomb af, staff's insanely personable and amazing. Super helpful, sweet, and all around happy group of people.It's like going to hang at your best friend's place - if your best friend lived at a climbing gym. Shout out to Joe and Kimmy, you guys are rad and can't wait to come hang out again- these guys will become your family.The climbing is chill.The people are chill.You wanna chill here. Also, ropes climbing soon. As if it couldn't get any better. So stoked.", "date": "3/7/2016"}, {"review_id": "mMaFIyKyrmwldP-tJmFjMw", "user_id": "qTp9N_RgczzZvXSRqWENlQ", "user_name": "Steven L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you want to have a good exercise and stretch out your muscles, this place has the potential to make you be the next Stallone as the cliff climbing champion without the near death experiences. It's not too high but they have levels from v0 to v7 which is extremely hard. Beginners can mostly do up to v2 which does get your muscles going. Today we got to experience climbing and stretching where they had an hour of stretching your muscles after climbing. Parking is limited but they have about 20 car slots but the place does get busy so parking can be tough. It's a great experience to do and work out muscles you don't usually work out.", "date": "2/29/2016"}, {"review_id": "IpcORVOH94J3l9qTlNHzAg", "user_id": "uzzrki9Wp-WUywMGttX7nA", "user_name": "David H.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place already and it is only going to get better. Only bouldering right now but they are under construction to build some lead and top rope walls. It is fantastic. Great climbs and lots of variety. They have some big caves and films that really get up there, this is bouldering only so far. Also have lots of top outs which is something I wasn't used to. The staff is super friendly. I wish I was able to come more often.", "date": "1/11/2016"}, {"review_id": "eRjTL_zblMRasXk79rKb0w", "user_id": "aSeJMMi-ugTYV3i0v-8i-A", "user_name": "Angela C.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Place is large and nice. The upstairs gym gets quite hot and does not have much ventilation", "date": "7/22/2016"}, {"review_id": "4MeEi_UUVNZKgu95j-fZ7g", "user_id": "_aFq0QFvZB48y7MZK-wDxA", "user_name": "Christina B.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We love Cliffs of Id. The gym is brand new, spacious, clean, and their routes are varied and have decent turn around time. Check out their showers, sauna, free weights, and yoga classes for a real good time!", "date": "4/5/2016"}, {"review_id": "z-Vu3Ed54owITR4b8dYONQ", "user_id": "EQ4b8azU270lyHdbRaLpPQ", "user_name": "Ryan B.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Cliffs of id and LAB are the best gyms in LA. Cliffs of id is a beautiful gym, great route setting, all new holds and lots of variety. The staff go out of their way to make you feel a part of the community.", "date": "1/14/2016"}, {"review_id": "1u-SKhnbqmvsruW3_hpkVA", "user_id": "Zn_YkaLKMaPJE9bxBu2BIw", "user_name": "Deven L.", "business_id": "RdxAwYiXLb3PQY4MJCGzXA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing at LAB for a while now, and we were pretty stoked to have another touchstone gym so close. The amenities are great, and the routes are awesome so far. Only con is the new holds. I haven't had the sorts of problems with my hands getting torn up like this since I first started climbing! But even so, it won't keep me from coming occasionally, though.", "date": "1/31/2016"}]