[{"review_id": "QcFOeOdJysSOtTcR9upz0w", "user_id": "wnRhiV9Nlrv2bXQN2EwpWA", "user_name": "Stephen M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "The reviews here are a little harsh. The owner is always here and is the only employee I've ever seen. She is in no way a saint, but I have run into worse people in this world. The gym is awesome. There are probably 15 walls, a boldering area, and a few other climbing obstacles. I can do the order 5 or so from each end. The middle gets crazy hard. Go in, enjoy the exercise, and try to let anything negative roll off your back.", "date": "2/12/2017"}, {"review_id": "62syRCA8UYKgbmK4qviWHg", "user_id": "HqIvWrF1q7B46Luy3_5PCw", "user_name": "Jenna J.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I actually want to thank the owner today for being such ugly person. Because of your unwelcoming presence at your business you actually sent me on my way along with my kids. You said there's moisture in the ropes and my kids just wouldn't be able to climb.So here you go thank you for turning me around ! I actually went to a wonderful climbing gym The Pad and was welcomed by friendly people who were happy to have our business. What a relief to know that your NOT the only place of business in town.  Climbers and non climbers that want to try this sport you can actually have a great experience out of her facility . Her open parking lot with no cars shows that this is a normal thing for her - along with all the yelp comments .I only put A star because I had to just to post !", "date": "3/3/2019"}, {"review_id": "cJWWQMaMJoG74z7Fr9VoXw", "user_id": "qel-49vQ6492dAn0VOgpig", "user_name": "Aj A.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "This was the worst climbing experience of my life. The owner is neurotic and the climbing center is filthy. I wouldn't even call it a climbing gym. If you want to climb, go to The Pad. That's all I can say without being repetitively negative.I had to give a star rating, but unfortunately there are no negative or zero star ratings.", "date": "9/17/2018"}, {"review_id": "xqvPpAoXetW4gtTfLCfyrA", "user_id": "6ZEo534e24rlYzsaWnNAbA", "user_name": "Triatan B.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "the owner was the rudest person ever and she would let us climb! WORST rock climbing place ever", "date": "1/6/2019"}, {"review_id": "9KhYXw3BT_7ufqsPVzt6tA", "user_id": "tGoX9rRUJfdGkswOIYHZhA", "user_name": "Katie M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I parked in a completely empty parking lot to go for a run and case back to find my car towed. The towing company said this is very typical behavior. After reading other reviews I am appalled at this persons behavior all around.", "date": "6/13/2018"}, {"review_id": "wNBRLETQ4DagRhybX7K5vw", "user_id": "Ij2VZko4pE5T-oQXl1WY3Q", "user_name": "Josh K.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Lady at desk wanted to charge me full price to assist my kids in climbing because they were under 14. And because there was 2 children she requires two adults or one child would have to watch the other one climb wile sitting outside the climbing area. So it would have been $62 for 2 kids to climb and for me to assist them. What a joke! I have been to many climbing gyms and this is the first I have ever walked out of one...", "date": "2/19/2018"}, {"review_id": "Oasr70XuSeCdwOtRtWrELw", "user_id": "n0aFWyaDfisK_27Yl17yaw", "user_name": "Pam M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "We never even got inside! The lady is crazy who owns this place. My husband took up 2 spaces in order to park under the shade.  The owner came out and yelled at us to \"park like a normal person\" There were 50 other spots available. We were the only car in the lot.  But she was so rude and mean!!! I can see why we were the only car there. Also we weren't going to stay more than 5 mins..only wanted to get a pamphlet or info.  But we will never ever go there again..crazy crazy rude woman!", "date": "10/8/2018"}, {"review_id": "oMGoqiIG_FSKk-nzTmRiUQ", "user_id": "STy0lPs9FlvZxyciTzNS-Q", "user_name": "Matt T.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "ALL THESE HATERS ARE WRONG. The manager that works here is really, really nice. The walls are fun and have a good transition between easy and challenging. The reviews here do not represent my experience at all. We will definitely be back.", "date": "7/16/2017"}, {"review_id": "jwGSg-4cb-fXNE5JrRinWw", "user_id": "cqY80pbScREzNeEivXt1MA", "user_name": "Anthony H.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Just here to post what everyone else seems to be posting. The owner is NUTS. So rude and mean to customers for no reason. I'll spare you the stories... just be warned. It's actually laughable how easily agitated she is. Best of luck!! You'll need it.", "date": "8/1/2017"}, {"review_id": "K6L-wC_hn0t-70khpwBl2g", "user_id": "akwS3tcVkZRr93TEqTtUTg", "user_name": "Cassie T.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Crux is great! I was worried my first time because I'd read so many bad reviews, but the owner has been amazingly sweet every single time I've gone in (6 times now). She's very attentive and personable!This is not a super easy climbing gym, however. The rocks aren't colored like some, so they're difficult to spot. I'd say Crux is more geared towards adults. If you're looking for a great workout and a challenge, this place is perfect!", "date": "8/17/2016"}, {"review_id": "09HrCoyeJBpPoRN7IMqU8Q", "user_id": "w6qkR5tRyamEhcfRzHoVSA", "user_name": "Keith F.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 1, "cool": 0, "text": "The owner is constantly rude. Today was the last straw. She was rude and I pointed it out to her finally because she was bitchy to my girlfriend. The owner became argumentative. I told her she simply need to go apologize. She refused to, continue to be argumentative and raised her voice, and then said I was argumentative (I was very calm, never raised my voice). I simply told her I was pointing out that she had hurt her customers feelings when they came in to spend money at her business and should apologize (hoping this would give her perspective on her behavior). She said she would not. My hard earned money will not be spent here ever again.", "date": "2/5/2017"}, {"review_id": "s5NsSHxkW03WjFtDqARnOg", "user_id": "dW9uCAh9PV3AzL9vT6Affw", "user_name": "Dan B.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Brought my wife here to practice climbing. Prior to this I have brought my kids here as they were growing up, so they could practice climbing. Any time I've visited Crux I've had a positive experience. As for the owner's dog barking... He is only asking you \" who are you!?\" I love this place!  Take your family there for a good time climbing! It really is a type of \"help yourself\" kind of place. Just the way I like it. Once you are shown the ropes(figuratively speaking), it's all you!  Enjoy!", "date": "10/31/2016"}, {"review_id": "l90UJVdG61sIqfhwgdyzPw", "user_id": "snipWpXnq-WF75NK1KLWfg", "user_name": "Lalena D.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 6, "funny": 0, "cool": 0, "text": "Is there anything below one star? I have read bad reviews about this place, but wanted it to be good because it is so close to home and I have a soft spot for all small businesses. I have been going to Crux about once a month for the last 6 or 7 months with my son and some friends. The service has never been great, but last night was awful. The woman who runs the place yelled at our kids for going to the bathroom, talked down to us as we tried to check in. Ignored us while we waited to trade in shoes that did not fit (despite the fact that we were the ONLY people in the gym). She then laid on the counter picking her teeth and watching a movie on her phone while we attempted to have a good time. We left after 30 minutes and will never return. You cant say that we did not give it a good try.", "date": "2/7/2016"}, {"review_id": "BEj8mh0-12C4e8wayq05Eg", "user_id": "3MMIk7HA8gSXYkqtd6g-5A", "user_name": "Danielle G.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 17, "funny": 5, "cool": 1, "text": "I don't usually write reviews on yelp... But... AWFUL. When I first walked in the lady that helped me was so rude. Walked in with a smile, ready to climb, said hi, and she immediately goes \"have you been here before. It'll be $22\" and turned around and walked away. First impressions are a big deal! Climbers are happy and excited to be alive and well. Not angry, rude, monsters of the ocean abyss... I turned around and walked out the door. I will absolutely be going to slo-op from here  on out... Sorry about it.", "date": "4/13/2014"}, {"review_id": "LOL2LxWWcezIUviusMXg6Q", "user_id": "gSFM7ILXAsZAKXG0mJ3x_Q", "user_name": "Emily D.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I took my brother to Crux as a Christmas present and was overjoyed with our experience. It was his second and my first time climbing, so we were both given excellent hands-on training on how to stay safe and have fun while on the rock walls. They also have additional climbing poles and ropes, which my brother loved. All the other climbers on the walls were very courteous and friendly and everyone had a wonderful time!", "date": "4/21/2016"}, {"review_id": "Wi_DjK3xFWpzdc5tllvefw", "user_id": "hbgWITnPxwzMXPlyddd3ow", "user_name": "Katie R.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 8, "funny": 0, "cool": 0, "text": "I never even made it inside the climbing gym. The owner was in the parking lot and stopped me as I was walking towards the building to inform me she was the owner. Idk why that was necessary, but I said hello and told her I was looking forward to my first time climbing. I had my son with me and had some friends who were meeting me there as well. She literally blocked me from walking through the little archway that read \"Entrance\", and told me she did not want my son in there because she did not want to hear him make any noise. I was shocked out how she treated me as a customer. Her gym was EMPTY. I was literally the only car in the parking lot. I called my friends and told them what happened and they did not want to give her their business after that either so we did not climb. Very disappointing experience. I wish there was another climbing gym in SLO that provided better customer service.", "date": "12/4/2016"}, {"review_id": "k5AFh3zbliT5alyGvGQg1g", "user_id": "nCqUoNyAyoUpAhVwEUuWkw", "user_name": "Naomi O.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I have always had a good experience the three or four times that I've been. The training is simple and effective and the wall is challenging but manageable for an average fitness level adult. Recently the owner agreed to stay open for an extra hour to accommodate my party's needs. I call that great customer service!!", "date": "5/15/2016"}, {"review_id": "1aOtnpVaWUyvAZNNowiHtQ", "user_id": "pqcJ9iFdVAc9txaI2anAGg", "user_name": "Liz E.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "If I could give this business owner 0 stars I would. I was towed from her huge empty parking lot where I parked for a couple of hours to go to the local Blues baseball game. After hours from 6 -9. Towing guy said she enjoys being a psycho! He added that she had about 25 cars towed the day of the San Luis Triathlon. Cost me $360 to get my car back. Crazy crazy mean thing to do.Stay calm Stay calm Stay calm.....", "date": "7/25/2014"}, {"review_id": "UBfZgI6fRrMRbLa3tzuUOA", "user_id": "6wrmxmVHodL6INin6xF8Fg", "user_name": "Mike T.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "I should've read the reviews before going here. They were all right and I could've saved a lot of money. Too bad the kids like to climb. After going a second week in a row the owner double charged us and made one kid rewatch the safety video again just because he wasn't technically our biological son. It was absurd and when I question the nickel and dime game she got extremely rude. Had it not been my sons birthday we would've marched all six kids out of there. It really ruined the experience. Had an almost similar story the week before. Shame on us for going twice. We will not be stepping foot there ever again. I really wonder after reading the countless other reviews how this place is still in business. She must be a miserable unhappy person.", "date": "11/23/2015"}, {"review_id": "H9Jo_dhKUDOZ2Pbl9AX84Q", "user_id": "-U60SgwVH5IjfqnZEyYz-Q", "user_name": "Mark M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Owner is obnoxious and more concerned about herself than safety. My son had a nonlocking carabiner so I added a second for redundancy. I was yelled at - apparently extra safety offended the owner. This happened a long time ago but we occasionally go by to see if there is new management. No luck", "date": "2/10/2017"}, {"review_id": "atP7XJFJbBcIw9Zk20wLOw", "user_id": "keZtx7hXV8ETH06ofseiyg", "user_name": "Jose F.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "It was fun and a good place to go climbing and im going back next week. many people have comment saying that the service sucks but i think u go their for the climbing not to be friends with the person at the Desk. Also im sure that the other lady working their got fired because when i went the service was good.", "date": "10/11/2014"}, {"review_id": "XPH6_YZb63H5lF_j_HjDkg", "user_id": "V2Nt5f15p5C0dk3mYT9yKQ", "user_name": "Dave P.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 2, "useful": 4, "funny": 3, "cool": 0, "text": "Went in as a first time climber to see if I would enjoy that activity. I was looking for some enthusiastic motivation to get into the sport.Instead of a hands on demonstration, the visitor is sent up to a sketchy lot area to watch a video for 20 minutes. The video itself is of the owner at least 15 years ago showing how to set up the harness.When done you go downstairs and are pointed towards the wall.During the entire time there were no other customers or climbers in the store, but instead of being in contact with me she was just sitting behind the counter. Also they keep a scary dog there who barks and growls at everyone.After 30 minutes of climbing by myself, I got down and left.It might be a fun sport but I'll never know it by going there.", "date": "10/23/2013"}, {"review_id": "yQMZamhf_q5dD5UpSCjVwA", "user_id": "DmZwkINMCBXtXmiG7V8VSg", "user_name": "Robbie M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "We had a great time today. The place is clean, organized, and safe. For a beginner, the climbing was challenging, and there seems to be a good offering of different levels.  This house has rules. Follow them. You'll have a good time.", "date": "1/7/2017"}, {"review_id": "nyZywRS4RW1TPfTIRcdLcA", "user_id": "b91xfpBCt0dCWgQEQ4ae8Q", "user_name": "Jason L.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 8, "funny": 9, "cool": 0, "text": "1 and only visit there was awful. The owner (we asked, and she confirmed she was) was probably the rudest, sourest person I have dealt with in 10 years.I'd rather go climb the side of a building than give this business a cent of my money.Apparently, according to the other reviews,this is her normal personality. Some one must have drowned her puppy as a child. Just a guess.", "date": "1/28/2015"}, {"review_id": "4Ht_MqLMZwJnxtI0NfX6Dw", "user_id": "lu-6mKwbF6i9witGxNlJwA", "user_name": "Toby W.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "The owner is Rude! Showed up with a group of over 16 family members-  no one else in the gym and we were all treated  very poorly! We were  waiting for a few more to show up and were asked to wait outside until our whole  party was there. We did have  some kids with us and went through the training process and followed all the rules and precautions but seemed like we werent welcomed but rather intruding and an inconvenience.  Not friendly at all!  Don't plan on returning.", "date": "11/9/2013"}, {"review_id": "DVpgczBtkciQLq16H8PlUQ", "user_id": "s7EjTbtJpLkYPJefM3UGrA", "user_name": "Joshua M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went here yesterday with my 11-year old son. Had a great time!  The owner was extremely helpful and professional, and she was very encouraging to my son, who was trying the hard ones.  The place takes safety seriously (you have to watch a long video before climbing)--and maybe this is why the owner seems harsh to some folks--but I appreciated it . . .I want to be very safe up there.  We will definitely be going back--and I'm going to recommend the Crux as an activity for my son's scout troop.  A beautiful, modern facility.  Highly recommended for parents and kids. My arms and legs remain very sore.", "date": "11/23/2015"}, {"review_id": "-a7BMNK4xJOUJIAt4rZ4ig", "user_id": "IOsYhv77HGQFLpzRT0xUyw", "user_name": "jules s.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We love this place! My fiancé and I first came in here just over a month ago. We have greatly enjoyed practicing climbing and bringing our friends to join us! The owner, Melanie, is very straight forward and doesn't sugar coat things or beat around the bush. Which we appreciate. She is very kind and generous. We will continue to refer our friends here and come here to climb! Thanks for providing such a great spot for the community!", "date": "8/8/2015"}, {"review_id": "S9N4B_9OfuTXMHlGIzK8qA", "user_id": "h24FkU-ItMNNWZlNNPg_Eg", "user_name": "Steve E.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 26, "funny": 0, "cool": 0, "text": "Updated review.  The owner is one of the rudest people I have ever met in my life.  I have about 20 climbs left on a 30 climb pass (worth about $140) and I have no desire to use them because she offended me so much last time I came in to climb.  FYI I was making small talk and joking about something and she told me \"not to f$&* with her\".  Wow.  I am a nice guy and did not mean to push her buttons...just trying to interact with the business owner whom I PAY.  I am local and will tell every pertinent person about her treatment of me at Crux.  I boycott this establishment.", "date": "8/18/2012"}, {"review_id": "BzcRt2ne89MEyrWjJyrUSQ", "user_id": "6KGSCYzkoPcdfLhMtQAslQ", "user_name": "Rob F.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 13, "funny": 0, "cool": 0, "text": "Wow how is this place still in business?? Is about all I can say about this the owner is horrible and extremely rude. I love all local businesses in SLO and the reason I moved to SLO is because it really is the happiest place on earth. But This lady is out to destroy any happiness that you might have in SLO. Went and checked out the place liked it a lot and was going to come back to hike another day when I had more time. Then I was in the parking lot talking on my phone, standing next to my car, when the crazy owner came out and started yelling at me to get off her property, and if I did not she was going to call the cops. If this review makes it to the unfiltered reviews page you have to read the filtered reviews. They only enforce my opinion why you should never visit this gym.", "date": "9/7/2012"}, {"review_id": "Lrfmi61gMF-Vl5Ar80u_LA", "user_id": "5evfXeEmvQNw4MWItgvfuQ", "user_name": "John C.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 15, "funny": 7, "cool": 1, "text": "One star is too much for this place. The owner impresses me as a witch-like creature; excessively rude and soulless. She has an irrational, paranoid obsession with the empty parking lot that borders on neurosis. I thought perhaps my experience was an exception, but the many, many similar reviews validate my personal observation. Although I have enjoyed climbing at Crux, it's not worth the trauma; I won't patronize this place ever again.", "date": "6/25/2014"}, {"review_id": "F5_wKa3h7lqGuiBH43RLFQ", "user_id": "4U1chtOglOn6U5GvGtrlJg", "user_name": "Cc G.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "Well I wish I could give negative stars for customer service. The place is awesome and my husband and friend had a great time.... First. .. I came in and bought gift certificates for 3 people a few days before we planned on going. The young girl that helped me was very nice. Second... the day we decided to go.... walked in and right off the bat the \"owner\" was the rudest lady I have ever met.... so abrasive and unfriendly I could not believe it. \"At MY facility we do this and blah blah blah.... At MY facility we do not allow video..... WTFIf we were not there with friend I would of ask for our money back and gave her a piece of my mind. How can you run and own a business and be a totally rude person and expect people not to notice. If my husband didnt love rock climbing we would NEVER go back.", "date": "1/2/2015"}, {"review_id": "13Pbrir92OHr09ZBunDMQw", "user_id": "ocl5Zj8LNwzpnWCC079wLw", "user_name": "Danyel B.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "What should have been a fun day of climbing turned into a lesson about bad customer service for my kids. The owner was unbelievably rude, I have never been treated that way by any business establishment. I don't know how the place is still running. It was completely empty inside and now I understand why. I do not recommend this place to anyone, try SLO Op!!", "date": "7/15/2016"}, {"review_id": "4ZsToa49Mu-Sx0ALadrBwg", "user_id": "FI39kaakT8xir_VkLpVNsw", "user_name": "Laura Y.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I was solo on a work road trip and desperately wanted to get some climbing in; without reading anything except that this gym had auto belays when the other local gym didn't, I just showed up. I've been to about ten gyms in the US and Europe, I'm used to taking what I can get. At first I was taken aback when I didn't recognize the belay system but the woman explained they invented it (these are not the blue/grey circular auto-belays you see in other gyms). While watching the required video, I thought about leaving because it didn't match what I know about climbing gyms. HOWEVER, I'm really glad I didn't leave! This gym is totally a labor of love by the owner's father. He designed all the rock walls (!!!!), which imitates climbing outside. HELL YEAH! I prefer this 100% to contemporary style gyms. Sure, there were some slick areas because it's been there a long time (over 20 years I think), but the routes are 100% more fun than the new style gyms with colored holds. Even the belay system is better than the blue circular auto-belays because it doesn't bring you down to the ground if you come off but holds you in place like a human belayer would, which means you can work on a crux. The routes were really interesting and fun; the sides, arrets and overhangs were awesome and challenging and you don't have to hang on fully extended shoulder joints the whole time like in regular gyms because the wall imitates rock - so you use your body in the more-complicated ways you do outside. I wish all gyms were this interesting. You can climb each route totally differently since it imitates rock, thus there are no grades or specific lines except that the walls become more difficult as you move into the center of the gym. I've never climbed anything like it and wish all climbing gyms had natural features. Also, other than my own gym, this is the ONLY gym where I didn't feel judged or watched by the staff. Since I arrived two hours before closing on Easter weekend, there were only two other people there when I arrived. The owner and I had fun talking about a variety of things. No bratty hipster climbers running the place, thank god. I'd love to have these types of walls in my gym. Sigh.", "date": "4/21/2017"}, {"review_id": "0jwGkvcT45dSDGd_PXR_xQ", "user_id": "jbXYxgADVghgx0gMI1QlWA", "user_name": "Aaron S.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 7, "funny": 1, "cool": 0, "text": "How are you in business?Walked in to find an obese employee (only person in the place) chowing a snickers bar. Doubt she's ever climbed.She had a terrible attitude and after I asked if I could bring in my own climbing shoes/harness she got angry. Obviously that insulted her intelligence because 'that's not the way they do things there.'Then, the owner comes in yelling at her employee, yells at me for asking where the restroom is, and then yells at my friend about how much of a piece of work I am for asking for my money back so I can leave. Sorry, but I don't pay people to treat me like dirt. And I have no idea what the business model is here? Treat people like dirt so they will seek your approval? Why don't you do everyone a favor - if you hate climbing and climbers so much, just get out of the business. You make the whole sport look bad every time someone meets you, when a lot of people could have otherwise found a positive outlet to better themselves with.Your entire personality detracts heavily from the average, and that's just sad.", "date": "6/18/2012"}, {"review_id": "ekKZjf8MfefaPxql9iAQ5g", "user_id": "jjCTF9nkA0PjDaI54CtwZA", "user_name": "Jackson B.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 5, "funny": 4, "cool": 0, "text": "I have friends that go here and have wanted to myself for a long time, but unfortunately i never will and instead will be another person that badmouths a local business. Visitor parking was full to visit some friends next door, and seeing the crux had tons of empty parking (because no one was there) I figured it's no skin off anyone's back to park there for a couple hours. Came back and my truck was gone. If the lot was full and they needed space for customers, I'd understand. If I left it there over night or my car looked like a homeless person trying to live in the parking lot, I'd understand. 3 to 6 o'clock on a sunday afternoon when no one's around, I don't understand. The tow driver who i had to pay 350 bucks to get my truck out said the lady is crazy and towed 12 cars out while people parked there to watched the marathon go by a couple months ago. I wanted to go make some statements, but it looks like I'd end up arguing with an idiot who has no human kindness anyways based on the other reviews I'm seeing, so its not really worth it.", "date": "6/23/2014"}, {"review_id": "xALnm1ZYWdWRfuY4pbvcsA", "user_id": "e4BMt7f1Y7s4TmAvaGXPnQ", "user_name": "Oka S.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 16, "funny": 0, "cool": 0, "text": "Worst customer service ever! Never seen anything like this .. Absolute scam . Don't go there unless you are ok being treated by someone who is extremely unhappy and plain disrespectful", "date": "2/23/2014"}, {"review_id": "nyBpuVv36sTNaAos6IXbdg", "user_id": "LhvfSTdCSuRIaPlg3LrxGA", "user_name": "David Z.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 14, "funny": 1, "cool": 0, "text": "Have to agree with R.B. and Alicia G, the owner was VERY rude to our group. No, she didn't tow any of our cars . . . but overall TERRIBLE CUSTOMER SERVICE. I honestly don't know how she can stay in business.Sure, it's a very nice place in terms of facility, but I would NEVER go back - and certainly would never recommend it to anyone I know.", "date": "11/12/2011"}, {"review_id": "hv4RVmKzL8Db_YzkawHT5w", "user_id": "YOsL3tHgBmKr1PDOJxHtzQ", "user_name": "Gina D.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 1, "text": "This was the worst customer service I've ever experienced. The owner was extremely rude, unhelpful and I wish I hadn't spent a penny at her business. She would not help our group of 8 ( sweet, excited children included) and acted like we were inconveniencing her every minute we were there. I will never step foot in that climbing gym again.", "date": "12/27/2015"}, {"review_id": "uiD6FxvVfKUIOO1IuHVmBw", "user_id": "M1xFCQ6pxO0RX3fBMme4Xg", "user_name": "Karissa P.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 8, "funny": 2, "cool": 0, "text": "My boyfriend and I just moved in around the corner from this place. One day, we decided we should check it out. As we were walking up to the establishment this crazy lady came out from the side and told us we better leave or she would call the cops!!!??? We were taken aback and before we could explain we weren't trespassing and were trying to check out the business, she just kept belligerently yelling she would call the cops. So,of course, we left! Now after seeing, via yelp, that this was the owner, I am dumbfounded!! I can not believe she would act like that towards future patrons. I'm glad we never made it through the threshold of Crux. We are happy to take our business elsewhere!", "date": "7/25/2015"}, {"review_id": "X7aoF_kk-pDzi0pDwhs2tw", "user_id": "ewleimx1N5LR580XGMNnTA", "user_name": "Ryan L.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 2, "funny": 1, "cool": 0, "text": "Hi,So much has been written here that confirms my experience that I don't want/need to repeat it. I don't have much time here and very rarely write yelp reviews, but this gym (while totally fine at the least) is managed/owned/operated by one of the most disrespectful people I have met in my life. Seriously. I was visiting an old college friend in SLO and we decided to go to this gym. He doesn't climb and had never been to The Crux. Being most convenient for where we were, and acting on that info alone, we headed to this 'establishment'. I will just take the time to 'second' what effectively every 1-star review has mentioned: threats, disrespect, talk of law enforcement, intense 'control' over what I consider very standard gym etiquette, safety guidelines, competency, etc. I rarely climb indoors but have plenty. I have nearly a decade of climbing experience in places/ways where things are, for lack of a better word, incredibly legit (e.g. big wall, 3,000 ft, aid/trad/sport/etc. climbing). My experience at this gym was just short of scary in regard to the staff...scarier than a hanging belay on small gear 1,500 feet off the deck. Here is a link to perhaps the most time-tested, legitimate climbing forum for veterans, pros, newcomers, etc. : mountainproject.com/v/th…Stay away, for your own safety and belief in the goodness of humankind.", "date": "5/24/2014"}, {"review_id": "2Q2BJn209jBKp0W_DU4m1A", "user_id": "n9LzAknkXUavKZkjk_wr0g", "user_name": "Eric W.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "TERRIBLE DO NOT SUPPORT THIS PLACE OR WASTE YOUR MONEY!! I attempted to take my 9yr old son to climb.  The lady behind the counter was rude and did not care to provide any support.  We paid and before even watching the training video we decided to leave. The lady refused to refund our money and charged is despite not using the facility in any way.  This is not a place for kids.  Dont be fooled and bring your children here, terrible facility and even worst customer service.  The lady behind the counter needs to get her head examined shes nuts.", "date": "4/1/2016"}, {"review_id": "gMbCSm-8UoERp5QGLq6zGw", "user_id": "vJMWwqZbCFTkdWkcI5P4nQ", "user_name": "Michelle M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great place to get total body exercise.  The climbing faces are quite challenging. I really like the auto-belay system.", "date": "2/11/2015"}, {"review_id": "ZmXYZhaszp9u0AYcrM3P_w", "user_id": "DtjC8X950zQmn7UIzKkZsA", "user_name": "Michael D.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Beware!  Do not patronize this business if you expect to have a memorable and educational experience.  We planned a medium sized group event with our cub scout den and before we even entered the door we were insulted and disrespected. No joke!  The owner was not prepared to handle a group of 9 year old kids and appeared nervous and anxious.  The web site suggests a family and kid friendly facility.  It is not.  There is a much better climbing gym down town: SLO OP.  Their staff welcomes business and their social skills and company culture are far superior.", "date": "4/18/2014"}, {"review_id": "iXazpg9JfSUAV-akTVVzIQ", "user_id": "2umCR08WWVqDwaQV2yx2nw", "user_name": "N M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Not the best experience.I am left bewildered by the rude and bitter service we had to suffer through. Here is a quote for the owner ponder on...A bad attitude can block blessings and destiny from finding you. Don't be the reason you don't succeed.", "date": "8/30/2014"}, {"review_id": "jcDGcWnCNo16eMXaGuPRSg", "user_id": "UEXV98KIdrSGIZj1LagNvA", "user_name": "Allison O.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Yikes. Crux is a decent facility but the owner is so rude it is almost like she wants to drive away business. Never again.", "date": "1/29/2014"}, {"review_id": "S1hgesxOw_ORcbxc44-5OQ", "user_id": "4APvfXd1A5Xv1rf0jn4xXw", "user_name": "Dodie M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "We tried Crux on a recent trip to SLO and despite the negative reviews and my wife and I were delightfully charmed by the place.   Unlike traditional rock climbing gyms, Crux has simulated outdoor rock climbing by molding features into the walls.   We found the owner both charming and helpful.   The auto-belay system is unique to the gym and extremely safe.   Unlike other systems - when you fall - you do not drop to the ground - this allows you to try the move again without wasting energy re-climbing the route.  The peg board towers are a really fun and exhausting challenge.   We have climbing in many gyms around the country and had plenty of fun at Crux.   BTW- we are also big fans of SLO-OP.", "date": "8/8/2015"}, {"review_id": "yxsO2oTVRoLT9N1SBZlSog", "user_id": "xejqnlHMjyS_hGQY3W5lTA", "user_name": "Susan M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "I will never set foot inside this place again. Took my son and a friend here to climb and was treated so horribly by the owner. She was condescending and basically spoke to my husband and I with such disdain that we decided not to stay. I seriously have no idea how they stay open with such discourteous service. Spend your money elsewhere, where it's appreciated!", "date": "2/3/2013"}, {"review_id": "J8VPH-WoTMXF3E-MnlGaMw", "user_id": "zxQY3cCIBYzZbTjwIZO8xQ", "user_name": "Jordan M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 7, "funny": 1, "cool": 0, "text": "I have been on a team that travels doing indoor climbing for the last few years and I have been in more gyms than I can count. That being said. This is the WORST gym I have ever been too. The owner/operator is rude, belligerent, and arrogant. Despite being experienced an climber, I willingly submitted to the long introductory video that she insisted that I endure. I relaxed, tied in, and started climbing, only to discover that it is the most bizarre wall I have ever seen. The holds are completely molded to the wall, routes in this place will never change because it is essentially all naturals. Finally! the owner physically threaten the life of the climber that I was belaying when she grabbed me by the harness and UNHOOKED my climber. This place is a disaster and I am surprised that they have not been sued.", "date": "3/14/2014"}, {"review_id": "Ocqn_JLGPBavfb1qoJ76TA", "user_id": "Y4eXMnZcs1PmH6XERm2Okw", "user_name": "Andie O.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "This is one negative review you should definitely pay attention to!!  The center itself is amazing.  Great climbing walls, safe equipment, and really cool for the whole family.  Now here's why I will NEVER go back: the owner is bat sh*t crazy.  She's neurotic, horribly rude (she cussed me out and used the F bomb several times in front of my young kids!!), and completely flipped out on me about bringing a group with 5 more kids than I had originally asked her about bringing.  She's absolutely unprofessional and I will NEVER go there again as long as Melanie is the owner.", "date": "8/2/2012"}, {"review_id": "pbU_1962efmsgFM-oADIRw", "user_id": "gGOwZqVCILZYKOrSVMh_7Q", "user_name": "Chris K.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 3, "funny": 2, "cool": 0, "text": "An inscrutably excruciatingly unpleasant experience. I thought that Crux might be a good environment to introduce a friend into the world of rock climbing. WRONG. When we arrived, the only employee that was there had never been climbing before and glazed over the safety in such a manner that my friend had no idea what they meant for her to do. Luckily, the owner arrived - (drumroll please) and made the situation deteriorate from there.The owner's glib and boisterous attitude was wonderfully complimented by her own personal mantra: \"don't ask questions or understand how things work, just climb.\" This was not only an uninformative atmosphere, but one that fostered a downright dangerous mindset for new climbers, which is clearly the target demographic as any self-respecting climber would quickly abseil away from this foundering wreck of a gym.     In addition to some of the worst managerial work I have witnessed in recent memory (from the owner, no less) the gym itself is quite run-down; the rock surfaces are worn smooth, all major and minor surfaces are entirely covered in dust (like the employee(s)? ever climb so they could clean them, HAH!), the auto-locking carabiners were gummy and needed to be forced shut manually (after much effort), the ropes are dirty and stretched out and the auto-belay would occasionally \"stick\", meaning that if one were to keep climbing that they would essentially be free soloing without any protection.      I only went there so my friend could use a pair of shoes since I didn't have an extra. Oh, and one of my climbing friends later informed me that SLO-Op would have let her borrow them for free, honesty policy. After climbing at Crux for several hours i can now fully appreciate why the girl at the front desk had never climbed before; how could you, and still force yourself to work in a place like that???The owner is clearly unconcerned with her customer's well-being and only cares that she cover her own ass by avoiding a lawsuit. And I quote: \"you can kill yourself climbing outside of my gym and I don't care, just don't do it in here\". She clearly doesn't belong in the climbing community with an attitude like this. One star is too good for this 'business'. tldr; Crux Sucks.(oh, and for an added bonus, read the \"filtered reviews\" in the bottom left corner of the screen - wonder how those got filtered out? read: sarcasm).", "date": "6/18/2012"}, {"review_id": "zIr_14zB8rdgu41RdDJGJA", "user_id": "veykg-wk0b9pYFhAeZdgfQ", "user_name": "Niya W.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "My family and I were looking for something to do with the kids( since there isn't much where we are from) and we're super excited to go rock climbing. We drove all the way to slo, the kids practically foaming at the mouth with anticipation, only to be bombarded by questions  and insults  from the owner when we entered the gym. We didn't even have one foot in the door when she told us that we couldn't climb today because we didn't have enough adults. We had two fourteen year olds ( whom she said could climb alone) , two adults, two more kids, and a baby( whom she also complained about). We started to tell her that we could figure it out when she responded with ,\" it's says right online and in this book that you cannot climb today because you don't have enough people, do you want me to read it to you ?\" She continued to badger us and made me feel insecure and uncomfortable around her. How can one human being be so cruel! The kids and I went to a Mexican food restaurant and joked about her being the wicked witch ( promptly after leaving) while I sat and read all the other hilarious yelp reviews.", "date": "1/2/2015"}, {"review_id": "j9z2oaJGoqJCyiPODk-OKQ", "user_id": "hAPTfwT3yvTuwXkBs0STZw", "user_name": "Carrie B.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 3, "funny": 5, "cool": 1, "text": "I am beyond blown away at the ugliness the owner spewed during out 4 hour day at Crux.  Reading some of the other reviewers, I am amazed that this place has patrons, I certainly will never be back. Let's start with being yelled at to go up stairs, watch a movie and put on a harness (we are talking the soup nazi looks like Mother Theresa compared to this hag). The sound was turned off, the picture on the TV was terrible and the safety system ended up being entirely different than what was pictured on what we could see of the TV. The harnesses were GROSS. It was fun but after a few climbs you get the gist... and it is in no way worth being treated like a filthy piece of garbage to climb a few traipses up the wall. In my life.... my entire life, I've never been treated more poorly and ESPECIALLY AFTER PAYING TO BE THERE. Mind is blown.", "date": "2/9/2014"}, {"review_id": "VWzB5ALr7sPtbuXM7rxyCw", "user_id": "k1xsAMBD_CtvjuitgHjtuQ", "user_name": "Jhenna S.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 2, "useful": 4, "funny": 1, "cool": 0, "text": "My boyfriend and I recently visited the Crux in SLO, hoping to find a closer climbing gym than the one down in Santa Barbara.  We learned that it's better to drive to SB.  We brought a picnic to eat in the beautiful tree covered area outside of the climbing gym only to be greeted with a snobby \"can I help you\" from the owner as she stuck her head out the door.  We told her we were just fueling up with a picnic lunch before we came in to climb.  She then hautily and very rudely stated: \"Well, we would really rather you eat the food we sell here.  But ok, I guess.\"  There was no welcome in her tone or graciousness in her attitude.  We were very close to leaving right then just because of how rudely she received two potential patrons.   When we got into the gym, we looked for the food she had suggested we should purchase from her establishment and saw a wall of processed junk such as Cup of Noodles.  Other snack-type food and a cooler of drinks was also available.  A gym owner who would prefer their patrons eat junk instead of healthy fuel for their bodies just to increase their own profit by a couple bucks turned us off even further.The \"preparation\" portion was a dated video that demonstrated using a style of harness that is not even used in the establishment anymore.  It also wasted time explaining the manual belay system which isn't used either except on ONE route and for which the owner has to help you do anyway.  Very little personal attention was received.  No technique was taught.  No explanation of routes or levels was received.  Luckily, my boyfriend and I have some experience.  If we hadn't, this would not have been sufficient instruction for rock climbing.  The facility:  Limited hours so double check day and times before heading there.  It looks very impressive and they have the computerized option for speed climbing.  That is pretty cool for those who are into that.  The auto-belay system is nice for those who don't have friends to partner up with, so I guess that is a plus, but I don't feel it prepares anyone who really wants to learn to climb because mountains don't have auto-belays.  The walls are FILTHY.   Our hands were black with grime despite using chalk.  It is gross.  The holds are slick from use and human dirt and oils and the routes are vague and confusing. Perhaps they would have made more sense and been of more use if the owner bothered herself with explaining anything to her patrons, but she doesn't.  THE BOULDER, is a joke.  It's one rock formation with VERY OLD crash mats that don't look safe at all.  It's even filthier and grimier than the top rope walls.  No routes are established which makes it very hard for beginning climbers to know what to do or how to even start working toward skill improvement.  It's a total waste of potentially fun bouldering.  And, lastly, it was COLD in there.  I warmed up and stretched out but was instantly cold again which adds risk of muscle injury.  So if you go, wear layers to keep your muscles warm.The cost is less than some places I have been and she does include the gear rental in her price, which is nice.  However, for those of us who have our own gear, there is no price reduction either...which is a bummer.Overall, the owner does not make people feel welcome and fails to offer actual instruction.  The walls and boulder are disgustingly dirty.  You can climb alone, which gives potential for getting a workout in, but the options are very limited.  Don't dare to bring your own nutritional food or you will receive a self-righteous reprimand.  The only reason I will go back here is to get a workout and spend time with some of my SLO friends.  But I already know the basics of how to climb...so the lack of attention and instruction isn't as big of a deal for me.  If I want to improve and really have a fantastic time climbing with wonderful people in a clean and awesome gym, I'll drive to Santa Barbara.", "date": "1/8/2014"}, {"review_id": "YAhfhKi8HSbMuwA2EEJ-NQ", "user_id": "5GiSTEdjovjhKhOeIhSjAA", "user_name": "D J.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 4, "funny": 2, "cool": 1, "text": "I thought this would be a fun place to buy gift certs for Christmas.  After standing at the counter for several minutes completely ignored I decided to leave.  As I walked out the door a woman called out that she could help me.  Apparently the woman standing ten feet from me while I stood there waiting was an employee who couldn't be bothered to so much as acknowledge me... until I left.  Too little too late.", "date": "12/14/2013"}, {"review_id": "8BJME6cbf3UBq_HxKgvDFA", "user_id": "FhNkuoKQxKQGHh96LBMylg", "user_name": "Chris M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 15, "funny": 1, "cool": 0, "text": "When we travel we use indoor climbing gyms all over. This is by far the worst. Beware of the owner she is way out of control!", "date": "4/23/2011"}, {"review_id": "OKkHwDW-COozLhqGJ-U8iQ", "user_id": "ICneo4vzmffOjSE_IaS7nw", "user_name": "Casey H.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 7, "funny": 4, "cool": 0, "text": "My mind has been completely blown! Me and my boyfriend walked in here happy and ready to climb. Walked in and the lady sitting behind the desk didn't even both to look up at us or say hello. We were literally standing in front of the desk and she was staring down at her phone watching something and answering us quickly and shortly without ever making eye contact. She quickly made it known that she was the \"owner\" and must've said it 3 times. Not sure why she would want to mention that so many times seeing as she is the rudest business owner I have ever met. She showed no professionalism and overall no social abilities. The very first thing she told us we're the priciest and not in a nice way. It was very clear that she did not want us there and didn't want our business. When we asked if there was anyone there to do the \"intro class\" with she replied (while still staring down at her phone) \"just me the owner\". I have never had such bad customer service before in my life! The place was completely empty we weren't even sure that it was open! Her car was the only one in the parking lot and now I know why! Would never recommend this place to anyone and will never give this business a cent.", "date": "4/12/2015"}, {"review_id": "HLD8JdFvQ5b3xKUlrLttqg", "user_id": "8vYw_njm21eFA2qksiPECw", "user_name": "Phil K.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "Bad owner, bad service and no customer service from the staff. So many of my friends wanted know how I liked it, they wanted to try it out. I told them save your money, the owner could care less if you come. She will also row your car if you are not careful.", "date": "5/19/2011"}, {"review_id": "fKuPKK-ZxXEC47NbDJwcwg", "user_id": "WFt3CJQO1UwlXY0PIDBfOQ", "user_name": "Michael W.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 2, "funny": 1, "cool": 0, "text": "I went to the Crux with my kids to do some rock climbing. We are from out of town and wanted to support the local economy. It's too bad that that crazy, bitchy, very unhappy blond woman who either owns or just runs it was there to greet us because we were ready to spend some $$$ and hoping that the kids would have a great time but I have never been treated with such disrespect!!! She is just plain RUDE!!! Anybody who is thinking of going there, please beware!!! Instead of a \"beware of a dog\" sign there should be a \"beware of the crazy rude owner\" sign! She is something else. We quickly left after being treated like second class citizens. Think twice before spending your hard earned money there. Terrible!!!!", "date": "8/14/2013"}, {"review_id": "ri7jTali0DYKgYWosGV_nw", "user_id": "HFCRM3EKyplFO5MbFk7rng", "user_name": "Lilani E.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 5, "useful": 2, "funny": 3, "cool": 1, "text": "There are so many beautiful things I missed about SLO.  No not just getting \"hammered\"...all the fun \"active\" things people do there.  This is one of them.  A rock climbing gym.  It's really awesome!  Fun and a great work out.It's about $90 for a 10-punch card and you can go in and climb for as long as you like.It's pretty simple, you just have to allow one day to be orientation and safety / training course but once you get that out of the way you can climb, climb, climb all you want.*Spoken like a true American Gladiator Guru circa 1990*", "date": "3/1/2007"}, {"review_id": "-kBxu5AN7D1HgLhPUFNPoQ", "user_id": "w3mo-x5ZUrAZU1eRY8vIqg", "user_name": "Kimberly B.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 4, "useful": 3, "funny": 1, "cool": 0, "text": "Crux is pretty flippin' awesome!The husband and I have been getting into rock climbing recently and decided to check this place out while we were down in the area.We went on a Tuesday evening during winter break so there was absolutely no one else there. Besides the room being super cold, the atmosphere was pretty nice. Everything was clean and organized and the equipment looked quite new.The beginning part of our experience was quite hazy because all I remember is going upstairs and the husband frantically strapping me because the instructions from the video we were watching were going super fast. And then we went downstairs and pretty much started climbing! Although the auto-belay system is nice and convenient, it's so easy to cheat on that thing. When we got to the harder levels, we would sit and lean back on our harnesses, resting every few minutes before moving on, hahaha. Other than that, we had a fun time going through each level until our arms were about to fall off.It is DEFINITELY a much better deal to wait until 6pm on Tuesdays and Fridays to go because you get the student discount. Although rock-climbing is super fun, it can get pretty expensive so any discount helps!", "date": "1/19/2009"}, {"review_id": "BVH8E1lq7xc4Sd5MtoGmBA", "user_id": "RFPCE-b0uEaGpWERzjGuCw", "user_name": "R B.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 48, "funny": 7, "cool": 0, "text": "I used to go to Crux and noticed the owner wasn't very nice but ignored it. But now I will never go back after the owner had my car towed while I had 3 kids with me. I actually can't afford to go back if I wanted to because it cost almost $400.00 to get my car back. Anyways, owner, if your reading this you might lighten up and try being nice. Its called Karma. If you keep having your clientele towed they are likely not to come back. In an effort to keep karma alive; will be sure to let everyone I know what a mean woman you are and not to go to your place.", "date": "7/26/2010"}, {"review_id": "g1W1nxf_sHOT7oyxpJryZQ", "user_id": "iyEITNC10U-zLGxD91k__A", "user_name": "Miranda R.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 4, "useful": 2, "funny": 2, "cool": 1, "text": "Crux is fun! I used to come here with a kid I watched and we would be entertained for hours. Yes, your first visit you do need to go over a safety video, but that only takes about 15 minutes until you're out there climbing. It costs like $10 extra too, so you do need to go at least once every calendar year though or that training will lapse and you'll have to go through it again. There are 10-12 wall sections in total, all but one or 2 of which are equipped with the auto-belay system. They vary in difficulty (steepness, grip placement, etc) so there is something for everyone of any climbing ability. They also have a lower overhang wall for bouldering, a cargo net, and a climbing pole, so if you're looking for an indoor climbing gym in the area, Crux is your place.", "date": "12/18/2008"}, {"review_id": "_HBHL3bSGBQTc0kYi19eEw", "user_id": "AQIrrdc48QTyHbhUiL6izg", "user_name": "tina b.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Racist!!!  If your looking for a place were the owner is racist this is the place!!! Apparently the owner still believes that it's ok to be rude, and very unprofessional towards minorities, I would diffidently not recommend this place!!!", "date": "7/23/2011"}, {"review_id": "adZd0vgJHCx6sWyrKeWPBw", "user_id": "AyadK1WvoPmDEc-yksJ7bQ", "user_name": "Randa H.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 6, "funny": 0, "cool": 0, "text": "worst service ever! check out the 43 reviews yelp has as \"not recommended\" at the bottom of page in a faint print!! shocked business owners like this exist to start with", "date": "2/24/2014"}, {"review_id": "9hUvK0phEcjHSoW5xf9GoA", "user_id": "y2QF_Kr_EH_XHSaUqXIdIQ", "user_name": "Lisa S.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Please read! I got a 40 dollar gift certificate for my boyfriend a couple years ago for Crux (2-person pass), and we didn't end up using it because he wasn't very interested. I finally got a friend to go with me last summer and the owner would not let us use it. She said it \"expired\" which is ILLEGAL. I kept my ground and tried to reason with her, VERY POLITELY, telling her that she had my money and it wasn't right for me to not be able to get anything in return. She said rude things like, \"did your parents not teach you to read?\" and I said, \"I'm here with my friend, please\" and she responded with \"I don't care if you were here with your dying grandma\" She threatened to call the cops for me \"loitering\" and ignored me for 15 minutes. I'm a very polite person and I didn't try yelling back at her, she really does look like a fool around her customers. They gave me the \"oh my god, i had no idea\" expression. She tried to GRAB the gift certificate out of my hand! It's completely illegal to have an expiration date with gift certificates. Her dad owns the business and she has worked for him for who knows how long. Let your daughter work there? more like HIDE your mistake of a daughter from the world! I wonder if he is ashamed. Her manners are used less frequently than the DUSTY gym she runs. The money will run out, it always does. Someone will get revenge before that, I'm sure.", "date": "5/9/2013"}, {"review_id": "zw8vKx5dWDs8WOXr_WKfQw", "user_id": "4JOSvHh4T14g2P__5nN0Mg", "user_name": "Alicia V.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 36, "funny": 3, "cool": 1, "text": "SHE IS THE OWNER!! I can&apos;t believe that woman stays in business. I have gotten on other sites and the BBB and read so many complaints about the way she treats her customers. I went in to get some information and I have never been treated so disrespectfully. As a business owner on the Central Coast I know how important customer service is and word of mouth...I hope she eventually gets shut down!! And better people take over. Crux is a great rock climbing center!! It&apos;s just not the kind of atmosphere (or people) I want to surround myself with. She will never get my business again. BTW she will yell at you and call the cops if you \"loiter\" in the parking lot too long waiting for a friend. I would have rated this 0 if I could!!", "date": "4/8/2009"}, {"review_id": "9sEachkS0X4mXcukLyIwpg", "user_id": "BdllThiTsZogRGov_I29rQ", "user_name": "Michael O.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "DO NOT go there. Most unprofessional owner of any place I've ever dealt with. We had a few more kids in attendance for my son's birthday party and she flipped out on me. They got paid the extra amount for the extra kids in attendance still. But I had to hold it in and watch my tongue after she cursed me out in front of my kids and their friends. I should have left right away but taking 20 kids to another location for a party is hard. I should have just stuck to the basic party at a home.  I would rate this at 0 stars but I can't. They still had a good time and its a good facility, but WOW.", "date": "8/2/2012"}, {"review_id": "bdgApG0KsTJiwEkAaSlxgg", "user_id": "l64PGWtXRgcODbrT74J-sA", "user_name": "Samantha J.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "I agree with Chris M. The owner is crazy stay away!  I was meeting a friend and his kids to go rock climbing.  We got there and found out it was closed to the public for a week.  We were trying to decide what to do next and out comes this lunatic yelling at us to get off her property.  She really upset our kids and us!   I tried to find out the problem and there is no talking to this women.  I have talked to other people and they said the same thing she is scary...BEWARE!", "date": "9/17/2011"}, {"review_id": "wGr7_Q2PLCFrGhKYstHIrg", "user_id": "QiIIvbttlyYAtBjJzDtUKw", "user_name": "Trevor S.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 11, "funny": 1, "cool": 0, "text": "I have never dealt with such a mean, self-centered, and socially ignorant person in my life. This lady kicked us out after just 20 minutes of climbing because she suspected us being responsible for a tangle in the rope that took her a whopping 15 seconds to undo. She then proceeded to ignore us when we asked her why we were getting kicked out and refused to give us a refund. This lady has serious issues with human interactions and is one of the most pathetic excuses for a business owner I have ever come in contact with.  She doesn't deserve to own a business in such a great town like SLO, and if she keeps treating her customers like this she won't own one for much longer. Lady, if you're reading this, look up the definition of RESPECT and take some notes.", "date": "12/18/2010"}, {"review_id": "G2wHt0nlx-EdGoEMtDJAeg", "user_id": "F9Nj4DHcBlscWGvJHHoLxg", "user_name": "Nicole Y.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Do not go here!! The lady (I think she is the owner) is absolutely terrible and unfriendly.  I went there with my friend to have a fun day of climbing but upon entering the building was almost attacked by her psycho dog! She made us stand far away from the counter because otherwise her dog would have attacked us. She was so rude and made us feel completely unwelcome that we decided to get our money back (which she threw a fit about) and go climb bishops peak for free!!! Take my advice and go on a hike outdoors. Avoid this place the lady's attitude speaks volumes!", "date": "12/28/2011"}, {"review_id": "gAamJeO7N1SrL_913iVFbQ", "user_id": "tdUiQIeooDnF3qchNKb-JQ", "user_name": "anita c.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 4, "useful": 1, "funny": 4, "cool": 1, "text": "awesome place! i was staying in the central coast for a few days and looking for options to stay active. particularly, i wanted a good upper body workout. and this place was just what i was looking for. it was a nice alternative to getting a day pass for a gym.i love the self belay system! i didn't have to worry about bringing a friend or bothering someone who works there to belay me. i could take my time as long as no one was waiting for the wall i was on. and it was all really easy to use. first timers have to watch a 15 min training video and pay $10 first timer fee. then it's only $12 to climb for as long as you want (or really, until your arms scream in pain) for the first time and thereafter.i'd read some people had issues w. the owner (not just yelp reviews), but she seemed perfectly fine to me. sure, she wasn't oozing w. sweetness (those are the ones you have to be a little weary of anyway, hehe), but she was far from rude or mean. she was pretty much just straight to the point (nothing wrong w. that!). good times! great for those that live in the area as well as those passing by looking for a gym alternative.", "date": "4/21/2011"}, {"review_id": "h0iXL_vTBp4vzEseMtcXag", "user_id": "d-5gWThyELEJZdFKUx5Pzg", "user_name": "Al L.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "The place that fostered my love for climbing. I started going here early in my college career and frequented it almost weekly. It did help that they had $5 Tuesdays, do they still have that? The walls are molded rock, that of which you don't find too much at climbing gyms. And if you don't come with a climbing partner it's okay because they have an auto-belay system for every wall. The center three walls are quite fun because it's on an electronic belay system. You don't see that too much either. There's nothing else more to say than Crux is a great place for a great full body workout that has elements of resistence training as well as cardio. Basically, go to Crux to get ripped.", "date": "1/5/2008"}, {"review_id": "Ha8r5YatrkLDjQUl8C9IEQ", "user_id": "so7nHBxeh-p2V8sr3XgaUQ", "user_name": "Kristen C.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "Owner is very rude. I goggled Crux and apart from YELP the owner is getting terrible reviews. I also read that she is towing her own clientele which I think speaks for itself.  I will never go back to this place.", "date": "7/26/2010"}, {"review_id": "RR_v8AW72tppszbphYLgKg", "user_id": "Gcu35FrQdnOrSbAx2oBl9w", "user_name": "Lauren M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Rude, absolutely terrible customer service on the management part.  I pulled into the parking lot to get some information (with the intention of using their business) on a day they happened to be closed--and got a stern, defensive, and extremely UN-welcoming greeting from the (owner? I think she said) who was there with her dogs.  She demanded to know what I was doing on \"her property\" (the parking lot), and informed me coldly that they were closed.  Only when I told her I was interested in getting prices (and thus patronize her business) did she soften and give me the info.  Since when is a business parking lot private property that a person can't pull over into? It makes me wonder if she is living there illegally and was getting defensive and possessive of her territory. I am determined NEVER to go to Crux again for this reason, and to defer any and all people who might be interested in going there.  I have had fun there years and years ago as a little girl, but if this arrogant dragon lady is the kind of person in charge, not only would you be treated poorly, you would be supporting a business that absolutely does not deserve your time and money.  You would do better to go to Slo OP on Prado road.", "date": "4/10/2013"}, {"review_id": "D3n4vX5BL1fRu4Y-fT7rLA", "user_id": "SjWCOqo9C5x8SGuY9cknWg", "user_name": "Denita M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 6, "funny": 2, "cool": 0, "text": "Eight of us were excited to visit Crux during a visit to SLO...that is... until the witch came out on her broomstick, literally!  We arrived at 12:05 on a Thursday.  The place was supposed to open at 12:00; therefore we waited by the doors - which were still locked.  The owner (or should I say Wicked Witch) came out with her broom and proceeded to sweep the sidewalk.  Without even greeting us, she told us to get back.  She proceeded to plow through us, while sweeping leaves and dust all over us and practically knocking over my 6-year-old.  Still, no apologies, or greetings from the witch.  When she finally got off her broom, she looked at the 8 of us and said \"this isn't going to work.\"  Apparently, she had mistaken my 40-year-old friend for a minor.  When she finally realized we had four adults and four children, she said, \"fine you can come in, but you all have to climb.\"  Although we had planned on climbing the entire day, we decided that we didn't want to endure an entire day of rude, ignorant people!  The owner needs to drink some witches brew filled with customer service!  Don't go here - seriously!", "date": "4/29/2011"}, {"review_id": "iOGU1JW_564i0eS3HsqkjA", "user_id": "Hzw5lp2915UlGiWBpuutuA", "user_name": "Annie L.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I was very disappointed with my experience at Crux Climbing Center. When my two friends and I walked in excited about our first climbing adventure, the employee took our money and then started barking orders rudely at us. She told us that she was the owner of the gym for several years now and that things on her website weren't correct, including price and equipment available. She interrupted us when we had questions about putting on the safety gear saying we should just watch the video. When we told her the video was already going too fast, she refused our request to pause it for a moment while we attached our straps. She also yelled at us for coming down from the video room to ask questions about the gear, saying, \"I told you to stay there until I said you could come down. Did you not hear me?\" Overall, the interaction with the owner was unpleasant and marred what would have been an otherwise fun afternoon activity with friends. I would not recommend this place for anybody.", "date": "4/1/2010"}, {"review_id": "XVLHX4ZDUVNY9zniIvNvlA", "user_id": "SdtUf229JXaqEaD4FuU68A", "user_name": "Tim M.", "business_id": "cQOMU7by5pdsElUiGEapPQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "The owner strikes again! Our second visit she promptly screamed at my children  for bringing in water...my bad taken care of but no need for the tone and treatment. As I was taking out the water her small dog lunged over the counter and growled at my kids who were being quite and not provoking. The dog then lunged at me while standing at the counter being a K9 handler myself I asked if she was working with a \"rescue dog\" she replied \"No it's trained to protect me and he will attack you if I tell him too!\"  Hoping this was a onetime encounter she proceeded to yell at us the entire time and charge the non climbing adults the climbing rate. We finally left after she was yelling at a Grand Ma and Grand Pa type taking the kids to the gym for the day. I filled a complaint at the SLO police department  regarding the dog and the threat who informed me she does this all the time and she even goes as far to accuse police cars parked in her parking lot of trespassing while working on reports. This a great example of poor little rich girl being given a gym by somebody because nobody who earned their way through life would treat their customers in such a manner. She is nuts! Now I know why it's always empty!", "date": "12/29/2010"}]