[{"review_id": "6YfoSjuyd3e7ot9oQpX80Q", "user_id": "9Hl064L7vRqwtxOenbO43w", "user_name": "Brandon M.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I do enjoy Granite Arch a lot. The walls are great, the routes are fun, there is a section for working out and the prices are affordable.My only problem is the parents of kids. They don't watch them when there are birthday parties and other large groups like that. The staff are not kid sitters. I bring my own kids here who are young so I know it's not really easy and as a parent, as I want my kids to have fun. But this is more about safety.", "date": "2/14/2019"}, {"review_id": "x_0wQbgSJ-iEaAQW5Afz5w", "user_id": "BinNY56Al_0U9cqCrNbyAQ", "user_name": "Francesca H.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "I really like the variety of walls they have at this gym, its really kinda realistic with all the cracks and textures the walls have.Its a great gym, that I think is mostly oriented towards youth climbing, and when we went (Sunday Afternoon) there were a bunch of little kids running around, like little running accidents waiting to happen.While top roping, one of the belay anchors at the top of the wall was squeaking really loudly when i was being lowered - something  that I really dont want to be hearing when I want to be feeling safe and secure! That really needs to be addressed by the management. I'll probably still be back since the bouldering was really cool :)", "date": "11/9/2018"}, {"review_id": "df_26Erg4UNcD2RfzxBX7A", "user_id": "vB-HxJa7MAjNPHIE81SCvw", "user_name": "Maureen V.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Drove 50 minutes after having been here 2 times and had parents complete waiver for my grandchildren., they tell me they need NEW 2019 waivers, no mention on website. Last time here!", "date": "2/14/2019"}, {"review_id": "dE07BhdjhMtSan2LwHzTVw", "user_id": "o9JhHYO7yAXPbQ00Mj9Zbg", "user_name": "Jason Y.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been looking around town for a rock climbing and bouldering gym. Came across Granite Arch in Groupon and decided to give it a try. Noah and Matt were very helpful and informative. The Groupon came with a 1 hour belay class, it was a nice refresher, since it's been half a year since I've belayed. They have auto-belays which is convenient when you don't have a climbing partner. I will definitely give this place consideration after my Groupon deal runs out", "date": "1/11/2019"}, {"review_id": "-kolNGymR2m4QbtYsko7nA", "user_id": "IIZgQ2FPyWh-CYbdnFGdcw", "user_name": "Nimai S.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Been climbing here about 8 years and I love the place. I've been to most of the other gyms in Sacramento and none give the same outdoor indoor experience as granite arch. They have both top roping and bouldering climbing areas. They also have a kids area in the back. All in all a great experience for all ages and fun for the whole family.", "date": "12/29/2018"}, {"review_id": "TIK2RKlImtWMFSuTCzeyOA", "user_id": "H70T5sNFJnfYOzwPk5YwpA", "user_name": "Michelle M.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for my kids to climb.  I took their belay class and got certified so now they can climb all over.  Staff is very friendly and knowledgeable.", "date": "1/7/2019"}, {"review_id": "hMkS2iiXcTILGT5WRglXDA", "user_id": "bbz9hDL1ZIa3QwjBVX76Tw", "user_name": "Kyanh N.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a good fun event for families. I have a hard time seeing how a person coming here alone would enjoy this activty fully. There are a lot of interactions involved. Therefore as a family, members can use this activity to bond with each other.", "date": "11/29/2018"}, {"review_id": "oeFcGEsxVMy0x8m4uEn5GA", "user_id": "-JxJM5T7CEPYVO-13K3I2Q", "user_name": "Lance A.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "In my college years I was very involved with climbing at Granite Arch.  Time passes - about 20 years actually, and I'm glad Granite Arch is still keep it real! If you want a good workout, full body, strength and gets the blood flowing - indoor rock climbing might be ticket!Some things have changed: no more rubber shreds - its been upgraded to sports matting.A handful of belay stations can be found throughout the roped climbing areas. This is great for when you can't hook up with a buddy to belay for you - you can still get a good sweat doing roped climbs.My first time back in years resulted in quickly swollen forearms and sore fingers... definitely need to work on my grip strength and flexibility. Bouldering was decent with lots of challenging routes, I did however have some trouble putting together a solid traverse in both the bouldering areas and roped climbing areas... some additional jug style holds placed here and there would help connect everything together.Punch cards available if you don't think you'll visit enough to become a member. There is some weight lifting equipment in the back and some fun training boards to play on. Going to try some routes next week once I dig up my harness! See you next week!", "date": "10/17/2017"}, {"review_id": "prmo8IWPIxQKGAkytJlj2g", "user_id": "YfEWDn-oiYRDMha0iAom5A", "user_name": "Brittnie S.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I had never been rock climbing and I wasn't sure what to expect but this place was awesome. We spent 3.5 hours climbing on our first visit ever!!!! Definitely something I want to continue to do and I will return to this facility any day. Also looking forward to trying their other gyms in different locations. The atmosphere was great no pressure and you didn't feel weird when people watch you climb because it's just neat to see someone succeed. There was a wide arrange of levels and ages there. Staff was super helpful and inviting. Love it!!!! Everyone should try thus activity at least once in life.", "date": "5/21/2018"}, {"review_id": "LHaS1ibNPuGUIgAxzWktZw", "user_id": "gKHQep5jkcs36lnjXXI8GA", "user_name": "Hailey D.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Granite arch was soo fun I went with my best friend. The workers there are so nice and helpful there is so much things to do and it can be for any ages for example I saw from ages 1-40 years old.  It was dog friendly too! It was really fun I recommend it", "date": "3/7/2018"}, {"review_id": "y6SDH2NUl28oDrAbufNwWw", "user_id": "FX_OV4CVbQ3cQWZo6ba0zQ", "user_name": "Benjamin N.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I only bouldered but enjoyed it. There are plenty of routes, but didn't enjoy the mixed use of \"official\" holds and feet with \"unofficial\" holds and feet.", "date": "6/8/2018"}, {"review_id": "VTavgQgV_uzvv3IBDPMC7Q", "user_id": "bzrtEr8a8rYl98Ypwdmelg", "user_name": "Buddy D.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Great price on Friday and Saturday nights!The routes are definitely harder but shorter than pipeworks.", "date": "4/26/2018"}, {"review_id": "31NjQqeKh_cox067OwAp5g", "user_id": "2sKfipB-l7NdL-xp94KX_A", "user_name": "Janice C.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Came on a Sunday afternoon to utilize the Groupon my friend and I bought for the belay class + 5 climbing day passes and equipment rental ($62 total). The front desk was informative and very helpful, we came around 30 minutes before the class because we wanted to make sure we got our equipment and stuff all set - but that wasn't really necessary, the class started around 2:10pm and we had plenty of time to spare. You will have to fill out waivers if it's your first time there though, so maybe like 10-15 minutes before a class is appropriate. There are free lockers for you to put your things into, but you must ask for a token from the front desk. If you aren't too worried about your stuff you can also put it away in cubbies near the bouldering area on the right side of the gym. The belay class had about seven people total with one instructor and lasted around 15 minutes. The instructor was really patient and explained things thoroughly - we were able to learn how to tie knots and belay pretty quickly - I thought it was going to be a much longer class but it was pretty simple and doable! Afterward he asked for a few volunteers to try to demonstrate what they had learned and my friend and I were able to switch off belaying each other in the demonstration. And then we had free rein of the gym for the next couple hours! We climbed around and had a good time until they closed, all for a pretty reasonable price of $12.50(ish) - including equipment rental!There were two birthday parties happening during our time there so it got a little chaotic with a lot of kids running around in the beginning, but overall it was pretty quiet after the parties had passed. There were a lot of people climbing too, but we had plenty of routes to choose from as beginners, the facility is pretty large and in a quiet area on Folsom Blvd so I wouldn't worry about it being too busy.I think after the Groupon value expires I'll be trying out a punch card or monthly pass. This place was a great way to exercise and spend an afternoon, would highly recommend you check it out!", "date": "1/17/2017"}, {"review_id": "TflTZpn5314oZy-CRmU-rg", "user_id": "eMv5YJUmws6J9PDaw8FQHQ", "user_name": "Alyssa Mae C.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "Great for all ages!  It's cool that some leashed dogs are welcome, too.We visited on a Saturday afternoon and they had more than enough walls at various levels, clean rental equipment, snacks and beverages for sale, and plenty of lockers.  They also offer a $7 group class to learn about belaying, but an extra fee can be discouraging for first-timers and I wouldn't recommend it.  The group class is not designed to accommodate different learning paces.  Safety is a priority, so it's ironic to admit that YouTube turned out to be a better resource ;)", "date": "3/8/2016"}, {"review_id": "mNNPbsnSstBDAsAn-4fcjg", "user_id": "YcOyOhpM3Qih6z1Hu0KeWw", "user_name": "Jessica T.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 3, "useful": 1, "funny": 1, "cool": 2, "text": "I'm pretty new to climbing but I came here with a friend to boulder for a few hours.The center is located in a large parking lot near other physical activity centers such as a trampoline place and a sports center. There is plenty of parking nearby.I decided to try out Granite Arch because I was looking for a relatively cheap place to climb and Granite Arch was affordable and provided shoes with a chalk bag for a little extra fee. The bouldering section was pretty large with a lot of different routes to climb. During the first hour, there were only about 4 other people bouldering, so it was relatively quite and easy to concentrate. During the second hour, there must have been a birthday party or something because all of a sudden there were about 20 young kids running around and and under you while you climbed. It became a little chaotic and I was worried I would fall on a kid since I wasn't very good. It would have been nice if the person leading/teaching the group advised the kids to not climb underneath another climb or to not play with someone else's chalk bag. Other than that, which probably is hopefully not a frequent problem, the bouldering was great for someone who was just starting. There were lockers and spaces available nearby to hold your items and belongings while climbing. There also seemed to be a small separate room to exercise, but the equipment looked a little run-down.Overall, the staff was friendly and there was a good variety of climbs for climbers of all levels.", "date": "11/19/2016"}, {"review_id": "HhK9brf2zHDMWxd2iH3Pwg", "user_id": "NTNitC54luCRbsr0w1W9Ew", "user_name": "Clare P.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 3, "funny": 2, "cool": 3, "text": "Pretty awesome rock gym. The staff are very friendly and they offer affordable memberships and classes. As far as Rock gyms go I think it's great! I would def suggest become a member here if u are in the area looking for a gym. Rock on kids rock on", "date": "8/7/2015"}, {"review_id": "bffwPxAZHALSWf7PKxOckw", "user_id": "VyhZA8kSitxY3Xg7lLiSYg", "user_name": "John J.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 3, "text": "I wish I could get here more often.I have done a good amount of climbing mostly outside but have hit rock gyms all over the place and Granite Arch is a good one.The facility has something for all levels. The bouldering and outside areas are especially cool. The areas have always been very clean the times I have been here.The staff is very cool and knowledgeable.Definitely worth a try!", "date": "8/21/2015"}, {"review_id": "N2eyjf6fqL1yKVtg34uNzw", "user_id": "AyVI_VJ3My6ibiIkcLQYGw", "user_name": "O M G.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 4, "funny": 3, "cool": 4, "text": "On Folsom Blvd, behind a Cheer building..Never did any indoor climbing before and this was a great start... plus I had a Groupon. It included equipment rental and you gotta take a belay class prior to climbing. The belay class is daily and every so many hours.. call or check their website.Checked in at the counter and filled out a waiver on their computer. The staff was exceptionally friendly. I got a harness, some shoes.. but they asked for my keys as collateral. There's cubbies in the back to keep your stuff OR there was also lockers with a key. You just need a token to use them and that was complimentary. I just had to ask for the token at the counter.. but then you had to hold on to that key.Jeremy led the belay class and he's a super doll. He had patience and expressed knowledge well with his helpfulness. In addition to the belay, I learned how to use the auto belay as well for when you don't have a partner to do the belay while you climb and vice versa. They had several auto belays.I can see why it's a good team building exercise to hit up a rock gym. I seriously had some reflecting to do regarding some trust issues. I didn't trust a belay partner or even the auto belay. When I just went for it, it felt really good. Freeing. It's fun and challenging. The other people climbing offered helpful tips and encouragement.. then there were kids doing it and I always feel like they're my reference point. If kids can do it, fuck yeah I can do it. ..and where the cubbies were, they had a bouldering area where you free climb. There was sort of a mini gym there, too, with weights and shit.I could have been there for hours. I gave the equipment back and got my keys back. Felt sore the next day. I don't know how this place compares to other rock gyms but as a beginner/newbie, I liked it. It was a great experience and it brought me to think of those dudes that climbed El Capitan in Yosemite. Wild.", "date": "1/10/2016"}, {"review_id": "IyL7oeqUReKcDy2rk_RWWQ", "user_id": "WPDs1HnU6U1djxk6vla4YQ", "user_name": "Danielle B.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I fell in love with rock climbing while living in So Cal and when I moved to Sacramento I knew I really only had two options of climbing gyms. While no offense to the other gym in the area I really loved granite arch right away. It feels homey and I often see the same people working on their skills every time I come. They are very proud of their home grown talent which they display posters of around the gym. The rock is realistic and you can do routes with just the cracks and other \"natural\" rock formations. They also have a good variety of ratings on their routes, I don't feel like they cater only to more advanced climbers. I do think they rate a little harder than other gyms, like a 5.10d could be an 11a or 11b elsewhere. But that just means you are getting more awesome at climbing than you even think! The membership is also pretty affordable compared to other places. I have a membership and will continue to climb at granite arch. Try it out it's a pretty awesome time", "date": "5/31/2018"}, {"review_id": "GorF8HxDsRfFZo-8KjU06Q", "user_id": "wD6UpprKUhGmRHoYoeH3Tw", "user_name": "D G.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "First time here and will be back. Great for your whole family and they have lots of fans going to keep it cool.", "date": "6/10/2016"}, {"review_id": "4OU6qCCgC3QnoebE30cfYg", "user_id": "0JGU7X3w7wdnfYxRCF-V6w", "user_name": "Corina J.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 9, "funny": 7, "cool": 9, "text": "We drive past this place often on the 50 fwy and my boys always laugh at the oversized man tied up in a harness. So I was delighted to see this place is on my approved vendor list for my boy's charter school. The compound has a bunch of interesting businesses so make sure you yelp everything and plan accordingly. We walked in and my boys completely started freaking out!! There are several areas for climbing with riggings and handholds brightly marked. Easy to direct a kid to climb with confidence. Of course Mom or Dad has to sign the waiver before climbing. They have a free climb area around the corner in the back. That looked pretty wicked! And at the other end of the place was a little kid party hang-out area with hand made looking obstacles to climb and hide in. Kind of fun. They have clean bathroom/changing rooms and a small store for shoes and assorted climbing gear. We will be signing up here for a membership...the animals must run and climb!", "date": "9/4/2015"}, {"review_id": "d7u3G-gGnP2XfscqXEO1YQ", "user_id": "czITO24_p0Q6vbLIPfGtiA", "user_name": "T D.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I started climbing here three years ago still go twice to three times a week.  The staff is very friendly and very accommodating unlike another climbing gym in Sacramento.The gem to this gym is the natural rock texture.  Lots of small hidden holds on routes, hand and finger cracks, roofs to pull over, arches to climb over, and natural routes.  Gives you a lot more of the outdoor experience.  The only downside to Granite Arch is the low wall height but it is not something they could change (limited to the building)I have heard people complaint that the rating system is set stiff but they are usually coming from the other Sacramento climbing gym and have never done any outdoor climbing.  I climb 5.11's at Granite Arch, 5.10's outside, and 5.12 at most other gyms.Im a Granite Arch climber for life!", "date": "4/20/2016"}, {"review_id": "RUPZnaqP14q5arkG86gnIA", "user_id": "BKrmKtRRbfETrAvI8A6GWA", "user_name": "Jared O.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love coming here! Friendly staff and a clean facility. They are constantly updating routes which makes each time fun and challenging. I come with a group every couple weeks and we always have an awesome time. Dogs are also allowed (As long as they're friendly)! If you want to have a fun time and climb on, this is your place", "date": "5/1/2017"}, {"review_id": "rObzAZd_5VGDN3d95XQexQ", "user_id": "rQLmUU8y6xDAY6tNNv68kw", "user_name": "Ally L.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really reasonable member pricing, the staff is awesome, and they change up routes regularly", "date": "10/13/2017"}, {"review_id": "Xavqhm2ksByamZnbWcYE2A", "user_id": "3uTJ9baaxEFNC0usNKmNgQ", "user_name": "Channon R.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 2, "funny": 2, "cool": 2, "text": "This was our first time rock climbing and it won't be our last. This place is HUGE! The staff are VERY friendly and helpful and made us feel very welcomed. We can't wait to come back and do it again!", "date": "6/27/2015"}, {"review_id": "g_SYWW6u-I_5HzBfwT6GUg", "user_id": "dSH_K5fX4dNmPnYC1tHnQQ", "user_name": "S F.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Took my daughter here on Saturday for a birthday party, pretty cool place to have a party I think,  very different from the usual parties. My daughter had a great time!", "date": "9/15/2015"}, {"review_id": "mJxhh9SBvBRvMEez8y9bsw", "user_id": "1VFIZy-bxQfDsxKNsBiiQg", "user_name": "Daniel M.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "A climbing gem in the Folsom area. It's a bit smaller than some other ( over crowded, stuck up gyms around) this place is always friendly helpful and never to busy. They have auto belays which is great for a quick solo work out. Anybody that climbs should support this little gym and what it does for the youth and the local climbing scene.  Climb on Granite Arch, Climb on. P.S. Yoga on Wed night is a great addition too!", "date": "7/1/2015"}, {"review_id": "LK18orKzmJLd9E8g_65G0Q", "user_id": "jkDACt6JN2Nwqi-QuxWu5Q", "user_name": "Luke B.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 3, "useful": 3, "funny": 2, "cool": 2, "text": "After we found out the Kids Ninja Warrior Course in Shingle Springs was for 8 years old and up, I needed to find somewhere to bring my little ninjas in for training. I've been driving by Granite Arch for years, so we gave it a shot. Looks like a GREAT facility for adults, but not a lot going on for kiddos. They did have a kids area full of parkour-like features and soft shredded rubber for landings, but the obsticles were pretty weak. We paid $9 which isn't bad and that included the bouldering section as well.The bouldering section is quite impressive but out of the possiblly hundreds of lines, there was only really one my 6 and 7 year old could do. Overall my girls had a great time, but I'd like to find something more kid friendly.", "date": "1/6/2015"}, {"review_id": "YOkyenSqR46l1qFOzbe5Qw", "user_id": "Gh7F5ugk2E1WqdJOkn0CEw", "user_name": "Frances L.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "The choice of routes and facility itself were fine, however the staff was subpar. My family visited on a Sunday afternoon and as soon as we walked in we were not even given a glance. There were about 5 staff members standing around the counter and nobody was interested in helping us. There was no greeting or any type of friendly exchange.The staff appeared in their 20's with very little customer service experience, it was quite disheartening. The facility also appeared to need a good deep cleaning. It smelled of body odor and feet with a coat of dust on top of all the walls.", "date": "10/2/2016"}, {"review_id": "UDeuTSD_FL3XonyUaUZ10w", "user_id": "PBmotLhDczArA10xRJ-_5w", "user_name": "Dominic C.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Came back here after a good 7 years and it was the same old awesome place it used to be. They're a lot stricter with the safety stuff but that's understandable. I have all my original equipment from over a decade ago and the only people with similar stuff are the dads who come with their kids. Thanks for making me feel old arch-enemy TIME. For what they offer, very cheap. Around 50$~ a month. If you own your own equipment then it's about the same as a gym membership.", "date": "3/3/2013"}, {"review_id": "ZsV7pKeQ3UbWxwPhaQBNug", "user_id": "2ThEgZjMVYCoR9hIsrk35g", "user_name": "Wendy P.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "We had our daughter's 7th birthday here and it was a hit. This place is a lot of fun, while still being safe. The staff is friendly and relaxed. It doesn't feel as though they are trying to shove you through as fast as possible like some birthday places. The kids definitely had plenty of time to climb and play.Our  party hosts had already left while we were chatting, so we left a tip with the manager for them. A few days later they called my cell to thank us, which I thought was incredibly respectful and classy.I would highly recommend this business.", "date": "4/13/2015"}, {"review_id": "LUGc3aicZ1bN06ER5OzTqA", "user_id": "RdiNFobfTEUc1LsnrMSIBw", "user_name": "Treva K.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I used the Groupon for this and it was so awesome!  The girl who taught us to belay gtew up climbing in Utah and she was friendly and a great teacher.  It's the most fun I've had in a long time and I didn't even feel like I was exercising, but it was a great workout.", "date": "7/31/2016"}, {"review_id": "GGk3-XoTce2p--2QtEfYxw", "user_id": "-vSjtg9piYy2cEFltdjDHg", "user_name": "Jennifer P.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 4, "funny": 1, "cool": 4, "text": "Our go-to spot for indoor climbing in Sac. They always have great routes (Lil P, I love you, Cowboy, you must have monkey arms). The staff here are super friendly and knowledgeable, and know how to correct people to keep them safe without making them feel dumb (a characteristic that I'm sure can be very difficult to balance when there's a lot of liability at stake). I love the environment, clean and well kept. Writing this makes me want to drop everything and head over there right now. That's how much I love it.", "date": "8/26/2015"}, {"review_id": "OlgeABgz47z4MpU7PJHpfg", "user_id": "dPJbT_8BBi1cPn-Jb0nLMQ", "user_name": "Amanda B.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Affordable membership, huge facility, friendly staff. The routes are changed up pretty frequently and the walls have a nice natural texture to them. A really fun way to spend time. the only con is that it gets pretty stuffy and hot in the summer.", "date": "5/24/2016"}, {"review_id": "urJsGh3FmnAVMpK5AJv-5w", "user_id": "8-lSjwqZpylN7q3UC9-NFg", "user_name": "Maggy C.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Love it! Staff is friendly and show me to the outdoor bouldering area. I paid boulder only Day pass $10, so affordable. Wish that I live closer! I enjoy the realistic feel of the rocks, and their thoughtfulness in sculpting the rocks to outdoor feel.", "date": "8/27/2014"}, {"review_id": "nSa_TQzXRiLeNHJQxyCD7g", "user_id": "cic_UTColMGeB3umbuYX3g", "user_name": "Patrick M.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 4, "funny": 2, "cool": 2, "text": "Had a few fun days climbing here. There are some pretty good routes usually and between the different types of walls you can find something to challenge you. The staff is knowledgeable and friendly. I have no idea what people are talking about this place is cold. I'm fairly certain I didn't see a single A/C unit or vent and just a bunch of big fans blowing around the air. It is as hot as the 3rd level of hell in here if you're climbing.The good: You can usually find a groupon/LS deal for this place so you can check it out on the cheap and decide for yourself. The routes are changing constantly on the walls so it gets a little different each time.The bad: People bring their kids here and let them run wild or climb in the adult section which puts them in your way. It is kind of a pain to find because it is back off the road and there is no signage.", "date": "11/6/2013"}, {"review_id": "6mUiOAev486tAyQNdZwsCw", "user_id": "C0el0SuXLmzMzlPbUdSozg", "user_name": "Tammy S.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have never done anything like this before, so coming here was a completely new experience to me! I am bringing a group here, so I went in beforehand to take a tour and also to take the belay class. The guys working there were super nice, helpful & friendly! They answered all of my questions, even though many of them were silly. I was a little intimidated before I went in but they immediately put me at ease. I am so happy that I found this place and that we decided to do this.", "date": "1/22/2015"}, {"review_id": "l0QNF5uNAIArek-ug9_3GQ", "user_id": "UPFOom50ATpuFzp29qUQFQ", "user_name": "Chrissa P.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I went there on a Friday night because they had a good deal for students during the weekend. They have a friendly staff and the courses here are fun yet challenging. I like that they have separate sections for top rope and bouldering. They also have self belay, which is pretty neat. This place can get quite hot in the summer because it's in a warehouse and they just have huge fans blowing air.I found it a little odd that there were a bunch of guys walking around topless... Other than that, this place is a good rock climbing gym.", "date": "7/29/2014"}, {"review_id": "dB1Hrjp8u3U9oXBVfrdXZA", "user_id": "9KiBIOk1saBHAWIihb_OQg", "user_name": "Erin W.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 4, "funny": 2, "cool": 4, "text": "Like rocknasium it's a great climbing place.  Affordable unlike pipeworks .  go here I recommend.   Lots of parking.", "date": "6/14/2015"}, {"review_id": "_KVM_xR3PzXzVcGH8XgCuA", "user_id": "qFyZMf88Zq1qsU1UaEJZng", "user_name": "Daniel K.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "We came here in the afternoon and got two day passes (and included equipment rentals) for $35. Since this was my first time, I had the option of taking a belay class for an extra $7. We decided against it (because we were pretty nooby at rock climbing anyways) and instead received a free quick training on the auto-belays. They had several auto-belays, each with 3-4 courses of varying difficulty. If you can belay, you will find yourself with a much wider selection. But for our purposes, auto-belay courses were enough. They also had a section in the back set aside for bouldering and gym equipments. We tried our hand at some easy bouldering tracks after top-roping for the majority of our time there.For first time climbers out there: The skin on my hands got torn up pretty badly after a few hours of climbing. Granted, I might have had poor technique (according to my slightly more experienced girlfriend), but try not to go too intense on your first try!Everything else wise, we were given free lockers to place our valuables. We didn't realize there was a water fountain (apparently it's by the kids area), so we had to cough up $2 for a large bottle of water. The staff was super friendly (they gave me a total of five bandaids by the end of the day with minimal judgment), and so were many of the people climbing there. (We went there while a summer camp was going on, so many many kids were present as well.) The place is a warehouse, so it wasn't air-conditioned too well, so it may get a little hot even with their big fans going. Overall, an enjoyable experience (again, minus the humungo blisters)!tl;dr Great first experience climbing at an affordable price! Variety of courses with helpful staff! Some extra conveniences would have been nice, but not complaining too much. Will continue rock-climbing, if time allows!", "date": "8/2/2014"}, {"review_id": "pRBY3mto2UZZjHem2VA6bw", "user_id": "FkEw0c7g5xku04iqMKF7sw", "user_name": "William C.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Great place to climb. It was not busy and there was plenty of open terrain. The staff was great and helpful. The manager even delivered my wife's license that we mistakingly left behind. Great people, cool gym!", "date": "12/27/2013"}, {"review_id": "W5HEThFxz1ZG9SmFMKHnPQ", "user_id": "AG8YIj7Ii2Yx7DAGPJj0Ng", "user_name": "Sabra F.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "I haven't personally climbed but my kids have and they loved it.  They have very friendly staff, my kids love Addison- he's enthusiastic and fun.  Seems like a lot of people know each other by first name and that's really cool.  I love how the challenges are labeled by color and available a good deal of the time.", "date": "11/9/2015"}, {"review_id": "rstiw7fGSJhCVhNzZ6K1PQ", "user_id": "MMoD6uHCkcw7FyHH0787Yw", "user_name": "Amanda T.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The facility is great. There is a climbing wall for all ability levels. Their customer service was incredible. One of their employees, Austin, went above and beyond and helped coordinate our 14 person belay class. He was awesome. I'm very thankful for his generosity. I loved that the waiver/ release paperwork was all online. That saved a ton of time and the staff got everyone checked in very quickly. The equipment was well maintained and looked to be in decent/ good shape.I look forward to going back to the climbing center again. It was really fun!", "date": "2/17/2016"}, {"review_id": "OD6j2HQ-3mw-EJZD-X1Ryg", "user_id": "39XVFsaNUWvZrMRu5Hemag", "user_name": "Andrew T.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Friendly and helpful staff, not too crowded, and a good variety of routes. Also the pricing is pretty reasonable.", "date": "7/31/2015"}, {"review_id": "hmGBJ4PuBuEDiMpbyY0Niw", "user_id": "Gy1TLF1cKEk1pqMtHTtjZA", "user_name": "Cassandra T.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "It was my first time climbing so I have nothing else to compare to, but I had a good time at Granite Arch. With my student ID, I paid $17.50 for a day pass with gear rental, and it also included a free belaying course which was easy and helpful. They have diverse bouldering and climbing routes, and as a first timer, definitely enough variety to challenge me. It was a little cold, so make sure you bring a sweater or a long sleeved shirt if you are climbing in the winter.", "date": "3/18/2013"}, {"review_id": "bqXyXwH5Ge9U9gykzb6G0w", "user_id": "er0HYy6mDWrtpIrM72kG_A", "user_name": "Drew G.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Large walls with nice bouldering area. They could use more crash pads in the bouldering sections, when a couple people want to use them there isn't enough to go around. Whoever does the setting does a great job but they still are using tape. Get with the times guys! It's so wasteful and hurts your climbing experience.", "date": "8/9/2015"}, {"review_id": "YAxAJrcNElWi11HBdAKGrA", "user_id": "tVwe9oz4qaRx7XGx7qTgng", "user_name": "Terry E.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I love Granite Arch!It all started years ago when my kids attended a summer camp at GA.  They had so much funtheyasked to go again the following week.  Ever since this has been the #1 camp on the wish list each year.  Now my son is on the climbing team and loves the sport.  Recently I took up climbing as well.  The gym is not intimidating and Bob and Lynn and their staff make learning fun and easy.  If you are looking for a full body workout in a sport that challenges both your mind and body, then climbing is for you.  The more experienced climbers are happy to offer good advice and tips to help you improve.  Even though the first few days were challenging for me, I now look forward to trying new routes each day.  Break out of the traditional gym and join us at GA.", "date": "4/2/2013"}, {"review_id": "6nUbcMY7u1ymedMfAGl7xA", "user_id": "Thew2366O9v9n8fKcQUYxQ", "user_name": "Felecia F.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "This is a great location to climb! I had no idea this place existed until I found a reasonably priced groupon! My only complaint is that it can get exceedingly cold. I was freezing even with the continuous climbing...so dress accordingly.", "date": "1/8/2013"}, {"review_id": "qTgR5X21itLufo7_x1jMwQ", "user_id": "EyMExxQHXdx8Cr6BfmIbDg", "user_name": "Mary W.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "My husband and I went for the first time (ever) on Friday afternoon, not to crowded which was nice.  We took the belay class and both did well, so we were off and climbing.  Very fun place, and you get a good workout from it too!  We will be going back!", "date": "3/23/2015"}, {"review_id": "u3PEC8LY7r7MukN3LfuN2A", "user_id": "tBfHYEXmeHRxW_AvM61IJg", "user_name": "Travis S.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "This is a fantastic alternative and/or addition to physical therapy. Its not just A climbing wall, it's a climbing GYM so they have exercise equipment as well as an ice wall and boulders. Its in a huge warehouse. It's pretty cheap to climb and you can rent anything you need for pretty cheap as well. They're open till 10p and everyone I talked to was cool.", "date": "2/27/2015"}, {"review_id": "aeHSKd4i9eG2c0EWuKewqw", "user_id": "1Va0rEQzZGNryNcb52HwtA", "user_name": "Elizabeth F.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "If I could give a .5 star I would. I am not normally a person to write Yelp reviews but am so dissatisfied with the treatment my mother relieved from one of the staff members that I cannot keep it to myself. Yesterday she took my 2 nephews, whom she has legal custody of, to enjoy the climbing at the center in hopes of beating the heat. When she arrived and was informed to fill out the consent waiver the staff member asked my mother if she was the boys guardian, I assume because my nephews are Hispanic and my mom is Caucasian and the staff member could tell they weren't hers, to which my mother responded yes I have been their Legal guardian for 6.5 years. My mother responded quietly, in hopes to not bring the issue up loud enough for my nephews to hear. The staff member then asked my mother if she could PROVE it. As if to assume my mom would carry around her legal binder in order to prove that the children are hers. Does everyone have to PROVE guardianship of their children? Would my mom not have been asked to prove it had she been a bit more young or more tan because the staff member would have assumed custody?Sadly to say this is somewhere I would NEVER take business to, or recommend.", "date": "7/30/2016"}, {"review_id": "nxYNZx4-H2koy4YCPSPtlA", "user_id": "_kt3KnoigNHG3cTUj1Ia4w", "user_name": "Jennie Y.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "My two friends and I got the groupon deal and it was so worth it! We took the belay class with Sean and he was so helpful and fun to learn from. Can't wait to go back and rock climb some more!", "date": "8/16/2014"}, {"review_id": "tyf53hlVyXuKVV1wmF8wPQ", "user_id": "vqBbZr01jMtfOETKkhjN3Q", "user_name": "Misha I.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 4, "funny": 2, "cool": 2, "text": "Grat prices, huge space, discount for students, and right off highway 50.ive been to a few places in the bay area and checked out pipe works but who wants to pay nearly $40 to climb? Granite Arch has awesome staff, and even better prices.  hard to get bored becasu they constently change routs, and have very difficult climbs that will keep you coming back for more.Great place, for friends who never climbed, for first time dates, and for general work out,  very fun stuff!", "date": "8/5/2011"}, {"review_id": "_gh9jIPXB0EGEkvo92RgHg", "user_id": "ZjknSPgDNQGawU8CcgR4pQ", "user_name": "Kahikina R.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "I thought the workers were friendly and helpful. I was a little disappointed that the walls are not very high. Despite this, some of the perks here that I don't get at my other climbing gym are more crack climbing opportunities as well as the ability to self belay. Don't forget to wear something warm if you come here during the winter months- it's freezing!", "date": "11/29/2013"}, {"review_id": "KARJM-PzSRArdY9S-oEbYg", "user_id": "eCcjxh8zjAqn-kZVWZ_HJQ", "user_name": "Katie S.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "An amazing rock gym.  They are located in a giant warehouse outside of Sacramento.  Unlike city gyms that have to cram their walls into a tiny little space, Granite Arch is sprawling.  Because of their size they can afford to have a great deal of variation in their walls--from the Dr. Seuss kids wall to their giant arch.  They also have an amazing bouldering room.  The bouldering room is larger than most gyms I've been too!  I believe they also have outdoor climbing during the summer.  Not those shady county fair walls either.  Nice, well-made, bouldering walls.", "date": "4/9/2006"}, {"review_id": "XyZQF1s1d3FjAayH7rpu0g", "user_id": "6__GeBRtpat5jQ7yzj2iMw", "user_name": "Pritika C.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 2, "funny": 3, "cool": 2, "text": "I have been coming here on and off for several years.  Large facility and great for all skill levels.  They also have a bouldering room to play around.  Staff are friendly and knowledgeable.", "date": "4/24/2011"}, {"review_id": "AMwUF95KxThPJczZRWfbBQ", "user_id": "_R3RgsqtG_1s3UGs3TKdSQ", "user_name": "Anna C.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My friend picked climbing at Granite Arch as a group activity for her birthday, and it was super fun! The instruction class prior to climbing was informative, and the instructor very friendly. Afterward we had a great time trying different routes and difficulties and testing our skills in the free climb area. Would definitely try it again!", "date": "2/17/2016"}, {"review_id": "AwXuBeQNNy_o8zbJLq18mw", "user_id": "cBF3VpXrg2KUUeOeciTAOA", "user_name": "Michelle B.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 3, "useful": 2, "funny": 1, "cool": 2, "text": "I had a nice time climbing. The gear seemed in good shape. The belaying course was easy to understand. It was Sunday and pretty crowded. They close early on Sundays, so make sure to get there early enough to get some climbing time in.", "date": "1/7/2013"}, {"review_id": "zrVK5jkVfIf_PUnIkSUcow", "user_id": "OdMtzcz9cRElYaBgS9q1TQ", "user_name": "L A.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "My friend was celebrating her bday here and it was my first time going indoor rock-climbing--so I did not know what to expect.   I was very scared of course because 1, I'm afraid of heights, and 2, I'm afraid of heights =P.  The staff at Granite Arch were very friendly and helpful.  Thanks to Tyler and Ian for being so patient with all of us 'beginners'  They helped our group with all the team building exercises as well as the whole 'tying a figure 8' 101, (which I personally didn't get until Ian had to walk me right thru it).  Overall, I thoroughly enjoyed this experience, got an excellent work out in and hope to go back again soon!", "date": "4/14/2011"}, {"review_id": "HJuBB_PWV1-8mh_IeAJLsA", "user_id": "454Z3tgIGSIoJE-uf-WQlA", "user_name": "Albert L.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Employee here don't know their own contract. Turned down my waiver because I used my own email. If you actually read the waiver it asks for the PARTICIPANTS email, NOT the parents. Employees should not assume--please read your own contracts.", "date": "7/19/2015"}, {"review_id": "BNRASwJsx8HhbIbbVR-lzg", "user_id": "up5r43pc91NKqN0GGsopbg", "user_name": "Gray S.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I climb here only in the summer time. The place does not have that good of air circulation so it gets pretty hot inside (Especially at the tops of the top-roping routes). So make sure you bring lots of chalk or come at night. The staff and people that climb there are very nice. I do not like the shaved car tires on the ground, it gets everywhere. Also there is not much work out equipment. All in all, its a great place and not too expensive. climb on.", "date": "5/3/2011"}, {"review_id": "q3HhTwhm-9t7cJkExz3YxQ", "user_id": "dg99DjO52wBpfPKsq6u03g", "user_name": "Conrad B.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 2, "funny": 2, "cool": 3, "text": "One of my favorite places to go! Great staff, both friendly and helpful! Great atmosphere as well! Fellow climbers are kind and courteous. Competing gyms cannot compare to service and atmosphere.", "date": "9/25/2011"}, {"review_id": "rgXn0B2TXpQ0FemfzgLgCw", "user_id": "4lWnLmNdW3mAOIMgxqqyPA", "user_name": "Raoul D.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "Stopped in on the way home from Yosemite after getting rained out over Memorial Day weekend. This place was one of the bettter climbing gyms I've been to. A great place to develop outdoor climbing skills while not actually being outdoors. Cracks, pin scars, huecos and more. They even have a Gunks-style wall with horizontal cracks. I wish I remembered to pack my tri-cams!My favorite routes were the so-called \"natural\" climbs that did not have any colored tape or holds showing you the way. The routefinding was all up to you.", "date": "5/27/2008"}, {"review_id": "6uMViwWe1ZC16vdASDJXQw", "user_id": "9ZT191GsJ7J_kF9AAcfwKw", "user_name": "Abigail L.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "The people here were pretty nice. I came here because I wanted to go rock climbing and i bought 2 groupons so I could go here with the bf. The groupons included rental equipment, day pass and a beginners course on how to belay which was perfect since my BF has never done it and it has been a while for me. The plus side is that the rental equipment comes with chalk which was fantastic since it sucks to rock climb without chalk. Luckily for us when we went to the belay class we were the only 2 people. I believe on the day we went which was a Monday they had classes offered at 12, 2, 4, and 6. The 4 pm class had a lot of people by the time we were rock climbing. This place definitely has some challenging courses and there is bouldering in the back. It actually wasn't as big as Id imagined since I've been to pipe works and rocknasium in Davis so I was expecting something like that. Regardless it was still a good size and I had a fun time rock climbing. All the staff was super nice and I would come back here if I am in the area to rock climb.", "date": "1/6/2014"}, {"review_id": "qyOEbiKyc-rac4G9wclLZA", "user_id": "LfwSFDYHsgfJIfWNIJkyeA", "user_name": "Jeff B.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "The staff is very friendly and the interior has a lot of variation.  They even have yoga classes every Tuesday night that focus on flexibility, and they have a small gym, and a children's play area.  The prices are OK.  It is definitely not the cheapest, but you get a lot for your money, especially if you are a member.  You can do outdoor bouldering too, although this may only be for members.  People don't seem to use the outdoor part very much.  I think that it is always open though.       If you want to learn how to climb the staff often points out things that you can work on if you ask them, and throughout the year they tend to offer specialized classes, but your best source would probably be the regulars that spend their lives there.  The people that climb here are part of what make this such a good gym.", "date": "4/1/2007"}, {"review_id": "igvl1Ly3CH2mvOEkKeiKcQ", "user_id": "3pRRsIzsrCtJBtmfPkJWxQ", "user_name": "Danielle D.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 5, "useful": 1, "funny": 2, "cool": 1, "text": "Fantastic climbing spot! Really nice staff, great bouldering area and good music. A little cheaper than Pipeworks if you aren't a member. I like the rubber padding in the bouldering area- funner to fall on than crash pads.", "date": "5/4/2011"}, {"review_id": "n_DxConinWCWRXte2HwtmA", "user_id": "pqRbOEWuLcqPuhAXCrRgcA", "user_name": "tyler m.", "business_id": "L2QBytHClqaRe3oLzCbyjA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "im from joshua tree, ca, but while visiting family up in nor cal i decided to stop by and try this place out. until granite arch, i'd never climbed indoors. i have to say, it has its perks and downfalls. i went to this gym 2 days in a row and overall really loved it!! the staff was nice and always helpful, and the gym itself was amazing. it was so nice to climb different walls without having to build anchors like outdoor. my favorite part was the bouldering room probably. it has a variety that goes from incredibly simple to \"that's possible?!?\". i only have one hand and i am over all still a little new, but the gym helped my technique quite a bit. the first day i failed a couple routes i tried, but the second day i made it to the top of a few of them. the downfall to indoor to me is that almost all the walls slope out. i prefer a harder straight up climb rather than a outward sloped one with easier holds.with one hand it's pretty hard to reposition your hand if you immediately start falling away from the wall when you let go. not that big of a deal though.but really the only complaint i have is that there is NO air conditioning. i live in the desert, and i never thought i would climb anywhere that would make me sweat more than there, and i certainly never thought it would be indoors. they do have a lot of huge fans, but even still it is humid and you get drenched. by the end of my days climbing, my harness would be fully saturated, along with my shirt, hair, and partially with my shorts... with climbing in joshua tree, it is less humid at least with a good breeze. oh well though... it is still definitely worth it!!!", "date": "7/5/2011"}]