[{"review_id": "nSxXvTKhu6o4yRbVp00AQw", "user_id": "2nXeO4juxvcT4y0403xm-Q", "user_name": "Almost P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Reading the public and recent reviews of GWPC - the consensus is that it is entirely insensitive, up its own butthole, and generally lacks diversityI just wanted to say I think starting my third year here would be a lot easier with an increase in price for monthly/annual users. I wouldnt mind paying closer to 150+ for less traffic, safety, friendliness of the GWPC family and staffLets have a great 2019 folks!", "date": "1/9/2019"}, {"review_id": "Iog0k1T-teEWNOdycZwqXA", "user_id": "tUag3J3hSI6kfAQM8UuY-g", "user_name": "Kaitlin W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was a really fun rainy day activity to do. We took the intro class and spent the day climbing once we were certified. Great location with great teachers!", "date": "4/21/2019"}, {"review_id": "1E7F7kdlK_w6Wl_36C_Pfg", "user_id": "WwmWdDCJREohcxQqfnOL-A", "user_name": "Semuteh F.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 5, "funny": 2, "cool": 2, "text": "Really fun learning how to climb/belay here with girlfriends. The staff and our instructor were very patient and kind to us newbies. It was my first time climbing and they did a great job explaining the basic knots, safety checks and technique. Shoes were included in the beginners class and the studio itself is large and welcoming. They have some nice places to lounge and wait for your class to start. I thought it would be a little snooty (climbing gym in gentrification central) but I didn't get a standoffish vibe at all from either the staff or the people there. They have a bouldering section as well as a really impressive climbing section with SUPER high walls and what seems like endless courses. I'm not sure climbing is for me (fear of heights and all) but I would definitely recommend this gym if you want to learn the basics in a supportive environment.", "date": "10/15/2017"}, {"review_id": "sAiA5WysKUk6MXVFzSm-ng", "user_id": "dBS3ds0NNa5YXNqfLEBcZw", "user_name": "Gary Y.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Must been a decade since I last visited GWPC. Was hoping it has some kind of expansion within the last 10 years. Nope, still small with limited set of routes. Definitely not beginners friendly so make sure you have can climb 5.10s+ if you're thinking about coming here. What is nice about this place is the location is right by BART. They'll also open up the giant sliding doors to let the air in on a nice day for some breeze.", "date": "5/20/2018"}, {"review_id": "DA1d7GAa1VSUU4-_wbAsXA", "user_id": "Zd5UMZHlJdMy_iUXYDyFWw", "user_name": "Hugh J.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "3/5... minus one star for each of the following: Desk staff, amenities, overcrowded. I've been climbing (mostly between Ironworks and Great Western) on and off for years now. The staff at Ironworks are always pleasant, welcoming and helpful. I don't get this vibe at Great Western. Some say hi but many times I'm just ignored - it's a very commuter, city-type small gym (less a community which is how Ironworks feels). There is one long hair brunette dude in particular who makes me really upset with his curt and uppity attitude every time I see/interact with him. :/ The manager is super awesome. He is smart, serious AND friendly.Classes and teachers are awesome (with the exception of one female yoga teacher who is just on her own planet). Upstairs exercise machines and weight room are A-ok. Bathrooms could use some cleaning and updating. We all know how expensive this gym is so hopefully some of that money can go towards little touches here and there... like having paper towels and new non-molding shower curtains that close all the way).Last, in the ~3 years I've been with the gym, it has become wildly more popular which is both great (more climbers, welcome!) but also awful. There is hardly any room to stand or walk around the bouldering area during peak hours (which starts as early as 4pm and lasts until ~8pm M-F) and you have to wait to top rope routes because the demand is larger than the supply (also, only a few route 5.10a or easier... some 'easier routes' on the bouldering side but again, when it's a packed house... yeah right). Wish I could go during non-peak hours... there are just too many people at this gym now!", "date": "11/8/2018"}, {"review_id": "qTAWurusqm7iaZj5clD9cw", "user_id": "6l7VXFVWb79Cv0vezDvq2Q", "user_name": "Phillip N.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 7, "funny": 5, "cool": 5, "text": "The other Touchstone gyms are much better but I live by the lake and this is the closest.  I think it's the worse managed in terms of the dirty bathrooms, up and downstairs and yoga teacher, particularly one yoga teacher who could learn to speak to people in a better way and actually engage people more courteously.And I'm not one to stay quiet once I pinpoint the issue.  You can read my review about how I feel my personal space being violated because someone needs the yoga room cell free.  It seems according to some tacher, I'm not allowed to stretch as I check in with my boss and family.  Maybe some people have work to wrap up and sick family members to check in on.  The 10-20 minutes before a class starts shouldn't belong to some controlling teacher, who then seemingly to me passive aggressively brings it up during class how her space wasn't phone free, even if it's down and off before class but faced up.  Maybe some people would like to check in with their sick family and friends before class while stretching to get ready.  I don't think this gym tries to serve a mixed group of people.  They are the kind of people who gives me the impression they would take her side with some fake hippie, non-sense, privileged, entitled reason like cell phones are distracting and people want to meditate.  Can't people close their eyes and mind their own business.  If it's distracting to people on the floor stretching before yoga, why not just ban it in the whole gym where there's heavy equipment or people who are supposed to be spotting each other.Please forgive me for having the tradition of checking in with my mom after work who spent years taking care of my dad with dementia.  It would be nice to see how she was doing before starting yoga.  God forbid if I wanted to text my mom and get to stretch in the room on a foam roller before yoga or have a phone nearby for emergencies.yelp.com/biz/elizabeth-r…", "date": "1/5/2018"}, {"review_id": "dGk2FdeutOhRUj0i-tS9oQ", "user_id": "zY6ufR2neHnhlbHLn6D-0g", "user_name": "Hj M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "The staff are unfriendly. I recently joined the gym, and the man behind the front desk was impatient with me as I was filling out my paperwork. I'm a brand new climber and this is actually my first ever gym membership...this was not the welcoming experience I was hoping for! Unfortunately, this has continued to be a pattern. They act like I'm an annoyance when I so much as want to buy a granola bar at the counter! The climbers, on the other hand, are lovely and warm...so you can thank your customers that I continue to pay my monthly dues!", "date": "9/13/2018"}, {"review_id": "9tAJAz1s32qwiym8gj6y0Q", "user_id": "REWjbYaUkmGw04lNZraeQA", "user_name": "Austin W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I climbed here last night with a few friends during peak hours and it was a surprisingly positive experience. Despite rows and rows of people sitting around on the mats waiting for their turn to climb, I was able to get in all the climbing that I was looking for for the night. I signed up for membership and the woman at the counter was friendly as well. No complaints really :)", "date": "4/4/2018"}, {"review_id": "uVW_QA89kqrF6-4nueK42w", "user_id": "Bb_p1LJj4kRqfe2QdzLRrQ", "user_name": "R. B.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 16, "funny": 4, "cool": 3, "text": "If you ever wanted to have a walking, talking representation of what the worst aspects of gentrification looks like in Oakland, it's the guys that run this place. An Oakland business is supposed to be friendly towards prospective customers and yet when I worked out there several times over the last few months, they were aggressively unpleasant. Nobody smiled. All the workers acted like they were making you a favor for even talking to you when asking them questions. Worse, I paid close attention to when they spoke to minorities and yea, there were dismissive. I can provide concrete examples of what that looked like. But they already probably know. Do better. Be a part of the community. And have some respect for what came before you.", "date": "1/11/2018"}, {"review_id": "5KcrTPpU6i6UpVbae4htEg", "user_id": "gL5SEt-T589abMkqsv8yAg", "user_name": "Jabari S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "$80 a month. Great for climbing. Small gym, too packed during week days. I didn't like the customer service, always felt like a burden. I have been with this gym for over four years and still felt like I didn't belong. Lacks diversity/color. switched gyms.", "date": "1/21/2019"}, {"review_id": "ZzXdhWkbKOhvAu_vWmb_wg", "user_id": "Q4lmqXlmTiUJRwJchFk_2g", "user_name": "Richard T.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 3, "funny": 1, "cool": 2, "text": "I generally like this gym. I like rock climbing. They have some really good route setters They have an area for a standard gym workout. However, you're always waiting to use any piece of equipment. Always long lines for top roping. Lines to use the one bench press in the gym area. Only two squat racks. I know it probably feels exacerbated given it's January and everyone is setting their new year workouts, but it's usually like this during any regular evening gym time. I'm told I can use the weights in the cross fit gym when a class is not in session. Unfortunately, cross fit is in session every week day from 6:00am to 1:15pm and again from from 5:15pm to 8:15pm. So as someone who works a general 9 to 5 job i would have to wait until after 8:15 to get a workout. I can't be the only person at this gym that feels this way. Are there any plans to expand the free weights for the people who don't want to do cross fit? The gym feels like it's at capacity. Are there any plans to expand the space and have a larger overall gym? Again, pros:- good rock climbingCons:- constantly waiting to use any form of weight equipment or top rope.", "date": "1/10/2018"}, {"review_id": "lU6i7f2ZKu3pDZEK-3anAg", "user_id": "GxihDOLxan7XcUgAtQbhhw", "user_name": "Jouella F.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "It may seem that everyone is so engrossed with their headphones, workout routines, etc in the gym upstairs, that you may feel that it's just one of the regular old gyms to do squats, do some pullups then come home and watch some netflix. But if you want moreStart climbing - that's when you'll experience the GPWC community. Here you'll meet a ton of down to earth people. They are not snobby nor are they arrogant of that V6+ route they just finished. They're just happy to climb. And I think that is what makes GPWC special in Oakland.I agree with the other people that it's not the biggest area nor the best gym to workout. Yes, there are other nicer gyms in the area - but if you're into climbing and want to get into the climbing community, then I urge you to try GPWC.", "date": "1/17/2018"}, {"review_id": "61tf6B9UnauJuUsr2sI3og", "user_id": "OakCiU-Grfjpd1ZHwwqvag", "user_name": "Josey W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 5, "funny": 1, "cool": 1, "text": "Not sure what the deal is here.. as others have pointed out, the staff here are surprisingly unfriendly and unpleasant. They made me feel very uncomfortable my first time there, one of the guys in particular was aggressively condescending. I was thinking \"I don't even know you\" why would an employee act angrily to a prospective customer. Like one reviewer said; they act like they are doing you a favor by allowing you in their gym. Bunch of arrogant unprofessionals. Other than the negative employees, the climbing is small. There's a couple cool top rope routes, but it's crowded and smelly and pretty limited. PG SF is way better.", "date": "3/26/2018"}, {"review_id": "Xre6y04TFSpJDbi97gX2FQ", "user_id": "8NY37gbm2WMBUgQFcDlEJA", "user_name": "Julia D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Fantastic quality, affordable group classes for beginners.Came here for a birthday celebration where 6 of us took the intro to belay and climb class. Day was our teacher and he did a great job of teaching all of us the basics in an hour. Thank you! From there, we were ready to climb together for as long as we liked! The class was $35 per person which was a great price for all the instruction and time we got!My only complaint was that while one person at the front desk was perfectly helpful that day, the other employee wasn't. He made a lot of snide remarks at our expense and seemed very closed off and judgemental. It's hard to put into words but we just didn't feel welcomed by him. I wondered if we just weren't the same gender/age/experience level as most regular climbers there.", "date": "11/24/2017"}, {"review_id": "JxNIEOn8wsFgHnmIghyNLg", "user_id": "p-_2S1yA1tPW0EribCWkSw", "user_name": "Sarah W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love Great Western! I joined as a beginner about three months ago and now go at least three times a week for bouldering. The staff is not overly friendly but they are not unfriendly or rude. Who wants saccharine kindness?? I personally enjoy the challenge of trying to win their affection... My favorite thing about GWPC is the crowd it attracts. I have met so many nice people in the bouldering area. I have been to all the Touchstone gyms in Southern California and most in the Bay Area and, honestly, this one has the best vibes of them all! Most people are having fun, open to chatting, not competitive, and not snobby. Instead of techies, man buns, and Lululemons, it's filled with people of all ages and levels encouraging each other. I went to Dogpatch the other day and I just missed Great Western. Keep it up!", "date": "12/16/2018"}, {"review_id": "LoPIHVADQZvHjMWtSfwQ4Q", "user_id": "jBQ8SwSXXk1UvMhHgwbmGg", "user_name": "Adam D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love this gym. I'm here 3-4 times a week. The staff are super friendly and helpful, I'm honestly surprised to see reviews stating otherwise!The community here is very inclusive, and it's easy to strike up a conversation with just about anyone.It's definitely smaller than Ironworks, but I find the bouldering to be more exciting here.There is a great range of routes, from very easy to extremely difficult... something for everyone.It can get a little crowded in the evenings, but don't let that turn you off: even then it's mostly people hanging out, resting in between climbs. I've never once felt like I couldn't get on the wall for a significant period.  People are very courteous about sharing the wall even when it's crowded.Lastly, while the weight room is small... I enjoy the layout.  There are also several punching bags in the boxing/yoga room on the second floor (pro tip, go during the daytime on a weekday and have this room to yourself most days).", "date": "10/21/2017"}, {"review_id": "JotcjAG8cqTVSm7N9Shr1Q", "user_id": "BI_PXSF5M61S8O9bqR7VVA", "user_name": "T L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 5, "funny": 2, "cool": 3, "text": "Staff is great. Good location as it's right next to a Bart stop. Decent amount of top roping too. Good gym area as well.The boulder area is very small. Ground is lined with large crash pads but some spots are iffy.The restrooms need renovation. The showers smell funky! It's gross.There are much better touchstone gyms elsewhere. Sorry :(", "date": "8/8/2017"}, {"review_id": "aS2zWSCaJKljH4sypJdnoA", "user_id": "shlYUw2-W9BVX95H7OXWmQ", "user_name": "Jan W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 5, "funny": 2, "cool": 1, "text": "-Review strictly for the weight room from a weightlifter's perspective-THE BAD:I've never seen such a blatant lack of gym etiquette as I've seen at GWPC. Literally every bad gym stereotype comes to life here, from super setters that think it's acceptable to take up multiple barbell stations and then look at you funny if you ask to work in with them, people who don't understand that the squat rack is for squats only and not for curls (YES CURLS IN THE SQUAT RACK), deadlifts, overhead presses or even goddamn pushups, all the way to an overwhelming amount of rockclimbers who go to the weightroom barefoot despite all the signs on every wall begging people not to go in barefoot because it's goddamn unhygienic. Hell, people here don't even bother to rerack the weights, which is literally the most basic form of gym etiquette, and the worst part of it all is that the weight room has zero staff on site to enforce basic gym etiquette. Even just a couple of signs explaining basic gym etiquette would probably do wonders.Also, only two squat racks (smith machine doesn't count as it's useless) and only one bench press station? Really? The weight room sacrifices essential lifting equipment in favor a bunch of useless machines that almost nobody there uses. If they simply added more bench press stations and squat racks and removed some of the useless and pricey machines this would literally be the PERFECT GYM.THE GOOD:The price is really good for a bay area gym, and the open crossfit area when classes aren't in session basically negates all the bad aspects cause there are more than enough benches and squat racks present there so serious lifters can get a decent workout in without having to navigate a sea of of oblivious people who dont know how to use a gym properly.", "date": "6/7/2017"}, {"review_id": "RyKzx59AOhNcSOLHyhXENg", "user_id": "Aa0u9wT267WL2_EGFzvOhw", "user_name": "Arcolina P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 4, "funny": 1, "cool": 1, "text": "I was really looking forward to trying this place out. I called before I went to inquire about the 4 day $25 registration special and a couple other things. The guy who answered the phone was really short with me. I asked him if he had a minute to talk to me about what the gym offers. He responded by asking if I had specific questions. I asked my questions quickly. I learned: heavy bags hanging to use anytime but TRX not. (Later I saw the TRXs locked in an equipment cage.) No free trial day or anything like that, except if get day pass and want to join can apply towards membership I think.I decide to go in and suspect same guy behind front desk when I got there. I asked to look around, said that I was considering membership at discounted registration price. He said sign electronic waiver and look. The computer for waivers is on a shelf above a garbage can that happened to have some rotting food in it, slightly unpleasant.Then I looked around. No more interaction with guy behind front desk. Older weight machines, no calf or inner thigh machine that I saw. Leg press is one where you have to put plates of weights on it, not pin style. Most of the treadmills are out of order.As I walked out past front desk, same guy raises voice as I'm leaving, \"any questions?\" Um no.I suspect you have to ask for towels, and you need a lock to use the lockers. Sign in bathroom said management dealing with complaints about crowded classes by issuing laminated plastic passes handed out beginning an hour before the class starts until passes run out. No idea what cap on classes may be.I hope this review is helpful for others who benefit from my experience scouting this place out. Other recent Yelp reviews helped me get a better perspective.", "date": "6/3/2017"}, {"review_id": "vGHnyY0uB-G8acrvm178OA", "user_id": "adKonsQWY64vJYglPotH5Q", "user_name": "Stefanie C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 4, "funny": 2, "cool": 3, "text": "I'm a regular at Mission Cliffs and Dogpatch Boulders, so coming to GWPC was a different experience. The gym is much smaller, but the routes are just as challenging. There are several floors of this building, and the top floor is dedicated to an impressive selection of workout machines and equipment. Plenty of spaces to hang out when you're not climbing or gyming.The facilities are not as clean as other Touchstone gyms I've visited, but I do like the chiller vibe of GWPC. It was less crowded on the Sunday afternoon that I visited, so I didn't have to wait for any bouldering routes. I love that Touchstone has a variety of gyms in different cities, each with their own personality. I don't go out to Oakland much, but when I do, I think about stopping by GWPC!", "date": "4/24/2016"}, {"review_id": "CY8KzPn-yYqxEQ1SO1-PYw", "user_id": "G8awp6mo4GGVz0y4iO7h4w", "user_name": "Julia N.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Summary:-there is a pretty extensive gym on the 3rd floor-they have a number of group exercise classes at the gym-bouldering, top-rope climbing, and lead climbing-option to rent shoes, harness, and chalk-intro class to rope climbing gets you shoes, harness, and (after completion) a day pass to belay/rope climb-you need to take a test to get a permanent belaying/rope climbing pass-the employees are really chill/not very serious -pretty small wall climbing area, despite the large external appearance -mostly mid-/advanced-level circuits (beginner: ~10 V0/1s, ~10 5.5-5.9s)-different membership/temporary use prices (be aware of the fees involved)**Note: the \"couples\" deal listed online is only applicable for married people or individuals with legally binding contracts (e.g., a joint bank account). It doesn't apply to unmarried/non-legally-bound couples, regardless of how long you've been together.", "date": "7/4/2016"}, {"review_id": "Jm8AtmLC_gBaxcTGlKTMgQ", "user_id": "H5avBytFZxJQ44-IB0h6VA", "user_name": "Monika Y.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "All the equipment of a regular gym + one of the best rock climbing in Oakland. Ive been a member on & off for 5 years & now back to join full time. Love that they have actual boxing classes. This is full boxing with gloves, punching bags, ect. And when you're not boxing or cardio training you can join people & start climbing. Everyone here is super friendly & it's super easy to make friends!!", "date": "8/27/2017"}, {"review_id": "2kdJiIzuGjxqw8YWdR2rEA", "user_id": "4q27A3gXq2pN3bj-RdYAig", "user_name": "Beth G.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 3, "funny": 1, "cool": 1, "text": "This review is specifically for the lunchtime yoga class taught by Robert and management's lack of response to concerns. I've been a Touchstone Climbing Gym member for over a decade and think that classes offered at their various gym locations tend to be top-notch. I've enjoyed yoga, boxing, and core taught by many of the instructors. The instructors tend to be knowledgable and motivating. So my concerns with this particular instructor are regarding his pattern of tardiness for which he has never once acknowledged or apologized. Furthermore, it's not uncommon for him to keep a class after its official end time. I find this to be very inconsiderate and unprofessional. This last Monday Robert went so far as to bring food into the class room and give instruction while eating -- with his mouth full. Now --maybe -- if he had come in and apologized for being late because of xyz and that he needed to eat because of this unexpected thing that happened, I would have not felt disrespected. But come on Touchstone -- your members are paying about $80/month and want instructors who show professionalism. And I am disappointed that the manager never responded to my direct message about this concern. I'm left to think that basic, good member service not matter at this gym.", "date": "5/10/2017"}, {"review_id": "rXo5DNGZHx-zdXY7qO1yAA", "user_id": "nh9WrOTcZh2Kyvq0E37fjw", "user_name": "Justin K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 8, "funny": 2, "cool": 1, "text": "This is probably an awesome gym for rock climbers and cross-fitters. I use the gym for the gym and studio. I am writing this review after an instructor kicked me out of the work out studio a half an hour before the class started, so she could \"prep.\" Which is funny, because yoga instructors don't actually prep anything before a class, unless you count laying down a matt and getting blocks. I contacted management and they said it was within the instructors rights to use up to a half an hour to prep and use the ENTIRE studio.  That is my main complaint. The gym is super dangerous. I cut my hand on the rails going down the stairs, because the hand rail isn't flush. There are wires hanging everywhere. During the winter the gym is ice cold. Machines are constantly broken, and no-one who works there has any interest in tagging the broken machines, let alone letting maintenance know they need fixing. However, none of those things really bother me. Just the lack of respect for paying members. Just rubs me the wrong way. Other than that it's a very nice gym with a lot of cool toys you wouldn't find at a 24 Hour Fitness or Golds.", "date": "2/15/2017"}, {"review_id": "9A66Y2DKXjKGzslqR_hyNg", "user_id": "kGal388xLnmCwI4mw2TG8Q", "user_name": "Christopher L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Update to my previous post, I explained my situation with the auto break-in to the staff, and they very generously comped some gym time, and for that we are extremely appreciative.", "date": "7/20/2018"}, {"review_id": "qdH9dmDmQn8X2jW3XA8-gQ", "user_id": "CpSM_pTDdmKtS20mDLtVxA", "user_name": "Mary M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 10, "funny": 1, "cool": 4, "text": "As a new member, I am very disappointed that within a span of a couple of days I've not been able to attend yoga class. On Saturday, September 17th the vinyasa yoga instructor Johnnae never showed up to his 10am class. GWPC didn't make an announcement, and many of us waited in the class for 30 mins. On Monday the 19th, I came from the city specifically for the 6pm hatha yoga class with Liz Raven. I was 5 mins late to class, because I had to go back downstairs to get a pass card to get into class. I ought to have been given this the first time when I asked at the desk. I opened the door at 6:05 and was about to stand quietly at the door, until the yoga instructor Liz Raven shook her head no and motioned me to leave. I waved my pass card to show her that the front desk had approved my attendance. To which, she rudely pointed to the door. The room was not full by any means, perhaps 12 people max. In India, where many of us yoga teachers go to study mats are touching. At no point, was it explained to me that students are turned away from class five minutes after it starts especially when you have a class pass to attend. And I have seen people come in late to other classes - and the instructors are only happy to have them in class. I can honestly say that these two experiences with GWPC have left me with a less than stellar image of this gym and Touchstone in general. The behavior is very unprofessional for a corporate gym. I bought a $100 new member pass to try out GWPC and Touchstone in general.  I was looking at having dual membership at Touchstone and Planet Granite...my home gym. But after this, I'll not be signing up for membership with GWPC/Touchstone. Such a great reminder that Planet Granis the best!!!", "date": "9/20/2016"}, {"review_id": "RavVnKNGplZ-ePJs1Yn7xA", "user_id": "DiKex_WQeSYQrF_ayHBDyA", "user_name": "Big B.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 3, "funny": 1, "cool": 1, "text": "Employees are extremely rude. Wouldn't even take the time to teach me the techniques for belaying so I took it upon myself to youtube it. Get it together climbers!", "date": "7/6/2017"}, {"review_id": "0nMYRlSxqLWSUAzCmFGEqw", "user_id": "YNO12tNEiO1BW5kiV7uXJQ", "user_name": "Caroline K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Currently on a cross country road trip and this is the coolest gym we've been to yet. Staff was great, great bathroom/locker rooms, and the gym is just so wicked cool!!!! The routes are ranked higher than they are, but we still had a lot of fun and really enjoyed they routes. Highly recommend!!!", "date": "11/7/2016"}, {"review_id": "RPXIzkwrWTAkFhZeTEcyzQ", "user_id": "agiorMvhQ-xlBDAGNdUM3g", "user_name": "Trish R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 4, "funny": 0, "cool": 2, "text": "Ah.  GWPC.I love your facility, but the amount of people coming to the gym necessitate extended hours at this point.  There's a single power/squat rack (can't use the half rack next to it since the fixed positions on the bar are too low on one peg or too high on the next)... other regulars who I've encountered also hope for a second squat rack, which would fit nicely in place in between the full squat rack and the weights, OR in place of the Smith Machine which never seems to be in use and is collecting dust.  Nevertheless, I try to keep busy.  During one impacted evening, while waiting for the power rack, I jogged on the treadmill for about 30 minutes, then stood around and waited an additional 15 before I got to do a single squat.  I had arrived at the gym shortly after 6PM, and only partially completed my workout by the time the gym closed.  I've had to move my schedule around quite a bit, or just avoided going here, which is frustrating, as I am trying to make the most out of my annual membership.Otherwise, no complaints.  The members are generally friendly and keep to themselves for the workouts.  I hope to find a gym buddy and enjoy the facility/\"work in\" with them.", "date": "4/17/2017"}, {"review_id": "WoSaOGy_PPFwvEye3NtFbQ", "user_id": "Q1llIhzon5v_8lmZok_UOQ", "user_name": "Nick K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 9, "funny": 1, "cool": 2, "text": "Stick to Ironworks, this place is overcrowded and unfriendly. Coming from someone who used to manage the top-rated gym in San Diego, the staff at GWPC is by far the worst aspect. They're lazy, rude, and clearly need to be reminded that their members aren't paying over $100/mo for them to get stoned and act like a bunch of angsty teens.", "date": "1/13/2017"}, {"review_id": "-5Jc6VXfOzAeI66CznrSbQ", "user_id": "otICYaqnUVWGykG3LmhOlQ", "user_name": "Seigi K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Disclaimer: GWPC is my home gym, so I may be biased.GWPC is awesome.Jokes aside, Friday nights are definitely one of the least crowded evenings here. If you don't like to boulder 'nd bump knees, I'd recommend coming here then. Other people have commented on the relatively small size of the bouldering section here (compared to Ironworks, Mission Cliffs, and obviously Dogpatch), but I don't mind. The community is great, and it never feels crowded to the point of eff-this-I'm-out-of-here.I do have to say that the treadmills here aren't as new as the ones at Ironworks. The biggest different to me is that the Ironworks ones have their own little fans installed in them. Pretty significant if its hot or if the run is long.", "date": "11/24/2014"}, {"review_id": "GRxer1Kf-gT5gk_OIDW1tQ", "user_id": "Fi7SDz3yCJ9guc9SAbB8Ww", "user_name": "Emma S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Although it has a small bouldering area, the problems are well designed and are updated frequently. Gym area is clean and kept organized with a big variety of equipment. Restrooms do need renovation as Ironworks has a sauna and steam room.", "date": "12/31/2017"}, {"review_id": "Lf3oWjMZBJDPAt_V9w5zZg", "user_id": "wpQjjKb-PKIOR3es_dob9w", "user_name": "James V.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you're in Oakland and looking to climb, look no further. This place is great. They've got a nice bouldering area and rad top roping and the staff is super helpful.", "date": "5/15/2017"}, {"review_id": "ZaCIwAtyGow4qdJ16W4I6w", "user_id": "jFXisyS2R4eOkxZpttwW4A", "user_name": "Erin D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Love the $15 day pass before 3pm on weekdays because most places in the area seem to charge $20 if you're not a member.I use the weight room only and it's never been too crowded on my visits. I travel to the east bay regularly but I don't live here so I love that they provide a lock for the locker room and towels so it's easy for me to just roll up and get a work out in.Took a star off because the equipment seems like it's seen better days. Metered parking on the same street as the gym and haven't had any issues finding an open spot yet.", "date": "5/6/2016"}, {"review_id": "Z2v4Xa9gmfhxzRHYPijc3A", "user_id": "USfr9HVAuprkT9z6Bo2-GQ", "user_name": "Jolena J.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 9, "funny": 3, "cool": 1, "text": "1) I called Tuesday night about class times for Intro to Climbing at Great Wester Power Company and the guy on the phone said there was a class at 7:30 even though when I checked the schedule for Tuesdays there was only 5 and 6:15pm classes. So I didn't go because I knew he was giving me the wrong information. 2) Instead, I wait to go to the 6:15 class tonight (Wednesday) with four friends. When we get there the front desk guy (who was very rude) bluntly told us we weren't climbing today because there was no classes available due to the competition this Friday - (no notification of this online or when I called) so there was no space. He didn't even give us an alternative solution and I had to drill him for information about other classes available. 3) So then I called Ironworks in Berkeley after the front desk guy from Great Western told me there were classes available there. The lady on the phone said there was a 7:30 class and I even asked her twice if it was tonight and she said yes come in.4) So finally, all five of us drive over to Ironworks straight from Great Western just to have the front desk guy tell us there was no 7:30 class. 5) At this point not only was I frustrated and disappointed, I was furious. He told me \"no one here told you that we had a class, you must've dialed the wrong number\". I checked the number just to prove a point and sure enough, it was the CORRECT number. So seriously fuck these gyms. I'm so let down and so disgusted with the employees. Not once did someone take responsibility or try to help me in any way. I assure you none of us will be back but we will actively share our experience. Thanks for wasting our time.", "date": "5/13/2015"}, {"review_id": "vYOQ37UlLbqTqAN7_aPKPA", "user_id": "RlXfOTtpgTfcisRmukrGbw", "user_name": "Jenn C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 4, "funny": 2, "cool": 3, "text": "For years, I have been wishing to join and promising myself that I would - and finally, I couldn't say \"no\" when a Groupon offer popped up last fall.  After getting myself into better shape for climbing, I joined up almost 4 weeks ago and I'm having a lot of fun discovering the route setter personalities through their routes (I prefer the 5.10d routes of Jeremy and JAH, some of the 5.11a and 5.11a/b routes of other setters, for example).GWPC is not the biggest of the climbing gyms but it's a super fun space in an old industrial building with these awesome skylights at the top.  Definitely pick and choose your time of day - earlier is better on a Friday, and mornings on the weekend are pretty mellow.The classes and the fitness equipment are in pretty good condition.  I have plans to start taking the Monday night class - so will update my review with my experience.I have only done one yoga class so far - and it was taught by Craig.  I might as well have been watching a video as Craig just went quickly through his whole routine with the assumption that everyone in the room was able to keep up.  He didn't offer any alternate positions for less advanced students or people with injuries.  Nobody followed him on his multiple repeated hand-stands.  I didn't bother to stick around after to talk to him as it was clear that he was there to do his own thing and it was great if we all followed along.  I'll check out some of the other yoga teachers and maybe I'll get lucky and find someone who does more of an Iyengar style vs some flowy or speedy routine.Overall, the gym satisfies my needs - it's only 2 miles from home, and it has some great routes.", "date": "5/19/2013"}, {"review_id": "sIBoCiU-C45pGVoCxfg_7w", "user_id": "YlnOzp45KWr1-VGN1WIJoA", "user_name": "Ada C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 3, "funny": 2, "cool": 2, "text": "This place is right down the street from my cousin's place, and since I got these awesome certificates that offered a free introduction to rock climbing class with an all day pass and rentals, we decided to give it a shot. In all honesty, if I never went to other rock gyms prior to this I would have rated this place higher since the establishment itself is pretty nice. They have a large bouldering area, and a decently sized top roping side (however they do lack beginner level top roping). The class itself was very informative and the instructor was pretty nice although seemed a bit lax at times. Without a comparison this place would get at least 4 stars; however, if you compare this place to Planet Granite, the area itself is much smaller and I feel that the staff at Planet Granite is more attentive and welcoming. This place is still worth it, though, especially since there are so few rock gyms around and this one is in a particularly convenient location next to BART. Just beware when parking in this area, don't leave anything valuable in the car!", "date": "4/3/2013"}, {"review_id": "5glwZnOnXurv54WAQHRhww", "user_id": "4uVjS4Oa7zK7H-vvjZkl1g", "user_name": "Dan L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 7, "funny": 4, "cool": 2, "text": "I was out in SF for job interviews, so I stopped by here because I wanted to climb, and GWPC is the closest gym to a BART station. Overall, it's a great place, but the neighborhood leaves something to be desired (I lost count of the number of homeless people I passed, walking from the BART to GWPC).The bouldering area is nice. They've got a variety of interesting problems set, and they've got walls with varying degrees of incline. The only issue is that the walls aren't very high, so most problems meander back and forth, which means you have to wait a lot when it's crowded. But, no one ever seems to work the problems they have set up on the slab opposite the bouldering area, so that's an option when it's packed. And, unlike most gyms, they actually have interesting bouldering on the slab.The staff is great. I (very mildly) sprained my ankle while I was there, and they had an ACE bandage and approximately 2.6 billion ice packs ready. Super friendly and well prepared.", "date": "12/26/2012"}, {"review_id": "PFZRTol8yEnKPdkzNNSoFQ", "user_id": "QkVmqoMxol_Vz0RJ4jc7Ww", "user_name": "Cami A.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "Synopsis: Great unpretentious gym.Dets.: Review is based on A) Classes, B) Front Desk Staff, and C) General \"Vibe\"A) Classes: The instructors are amazing, positive, and will challenge you. I haven't yet had the pleasure of taking Marie's bootcamp, but I have taken yoga with Craig, abs/core (and yoga) with Avram, and did abs/core with Mike Rogers today.Avram is a super sweet and encouraging instructor; he keeps the energy going in his classes with great tunes and playful banter. He teaches abs/core on Tuesday and Thursday evenings; Tuesday's class starts promptly at 5pm and is generally less full than Thursday (which starts at 6:05pm). You will get sweaty, and you will partner up with someone next to you. The class gets you pumped, but is not impossible.Craig's mid-day Hatha/Ashtanga yoga class is good; however, I'd recommend placing your mat as close to Craig as possible. I could barely hear/understand his instructions when I did my practice in the back of the room near the speakers. From what I could tell, the flow worked well. Craig also introduced himself and thanked me for coming.Last, but certainly not least, is Mike Rogers - the crazy abs man. Others in the class said his class was far more intense than Avram's, and they were right. The class IS hard and you WILL feel the burn. Mike has a huge personality and great big energy, so he goes \"hard\" the entire class and encourages the same from you. B) Front Desk Staff: Never had any issues with anyone at the desk, except a bit of snootiness from one of the women. I most often see/interact with the light skinned, light eyed guy who seems to get off around 6/7pm. He's always extremely pleasant.C) General \"Vibe\": Most people who come here are pretty enthusiastic about their fitness. That being said, they are actually more interested in working out than say chit chatting or standing around looking cool. I really like that and feel like I can workout in peace without some dude creeping on me.LOVE. THIS. GYM.", "date": "5/20/2015"}, {"review_id": "iLHyYChwzBX83tNlDWfOFQ", "user_id": "Vo-5-SD5lPVwNthI5Z2w8Q", "user_name": "Kelly X.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Simply amazing, I couldn't ask for a better place to rock climb! I do wish there were better parking though...our car got broken into today...and yet I still wanna come here (which just shows how great it is). But seriously, where is a good/safe place to park?!", "date": "1/29/2016"}, {"review_id": "x_eYDUpvpszKS1myGUiRTg", "user_id": "6GGzJsCfvXJ8HEP79EZTlg", "user_name": "Candida B.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We came here yesterday for a birthday party for my daughter's friend. There were four instructors assigned to help the kids with their turn, but one instructor went above and beyond, and that's why I am writing this review. Victor was so great with the kids from the moment they walked in, getting them harnessed up, and encouraging them to have fun and cheer each other on. My daughter was one of the youngest in the group (at 5-years-old), and a little timid at first, but with the constant encouragement of Victor, she set her sights on achieving her goal before cake time. She made it all the way to the top, even after wanting to stop several times - Victor encouraged her to shake it out, and keep going. We were all blown away once she made it to the top. Thank you so much Victor for your awesome demeanor with the kids, it is an experience my daughter and I won't forget. She can't wait to come back.", "date": "10/17/2016"}, {"review_id": "x5Z-VSbqiB6Aofq1DwfI8A", "user_id": "jzqLpVkB1rg9AssLKm7lvw", "user_name": "Wendy H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "Despite the occasional difficult parking (if you want free parking you have to park on 21st street and walk a block), I enjoy going here after I drop off my daughter at preschool. It's a lot less crowded than Berkeley Ironworks so it feels more mellow and peaceful. I know that's not great for business, but it's nice for my state of mind.", "date": "10/7/2012"}, {"review_id": "5UjEYBGoaGnkliq5NP7QGA", "user_id": "WAOYUrK1diaBdILvRd2u_A", "user_name": "Emily K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "I just moved to Oakland and was looking for a gym to join. I have been really into bootcamp style classes and yoga, and have always wanted to do more climbing. I found this place and was super excited about it. I came in, took a Crossfit V16 class, did some bouldering, and used their simple but well-done shower/locker room. I was so happy with my experience decided to join the same day. I paid the $100 initiation fee and join the gym. I loved it!My girlfriend had been a member at the gym too, but hadn't been using her membership. It was scheduled to be canceled on Oct 1st. When she got a taste of my enthusiasm, she reinstated her membership. Now we can enjoy the gym together. The only unfortunate thing is that two days later, they started a promotion where they waive the $100 start-up fee. I ended up feeling a bit ripped off since no one had told me that if I had waited 2 days, I could sign up and save myself $100. I talked to them about it and they agreed to refund me half of the initiation fee, which was kind and fair of them. I guess if they had been a bit more generous, and refunded me in full, I would be their biggest cheerleader around, and I would have given them 5 stars for amazing customer service too. Instead I am satisfied, but not gleeful.I took their cardio boxing class last night and it was a great workout with wonderful people and a really fun vibe. I would recommend this place for sure!!", "date": "10/2/2014"}, {"review_id": "VgvAQKFAQKhwY7SFGAX1pg", "user_id": "sut16E1RvcCUxf2jc4lp-Q", "user_name": "Malinalxochitl B.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "My partner and I joined this gym in an effort to get back into the workout scene- it claimed to have a crossfit class which was my main reason for joining. Ultimately it didnt work out because the class was so large it was hard to really find a place for myself to actually workout in, I stopped trying. I then tried the yoga classes and gym plain working out upstairs, both were ok- not absolutely fantastic but not horrible either. The most difficult thing about this gym was the parking situation. I didnt do much climbing per say, as thats not necessarily my thing- for that my partner liked it well enough, its much smaller than the Berkeley gym. We also had a strange interaction with one of the employees who brings her dog aggressive dog to work. My partner requires a service dog and on one of the days we attended- this other dog lunged at our dog. The employee then proceeded to be rude to my partner as is our dog - who again, is a service dog and extremely well trained, was at fault. It was awkward and extremely unwelcoming for people with disabilities.", "date": "3/9/2015"}, {"review_id": "SRGeYN0Z0xECN-JqlnoKvA", "user_id": "ARovTKw6IO9jfX9bw4OLXQ", "user_name": "Joji V.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "My first time doing rock climbing indoors or boldering(I think that's the word). it was a very fun experience with friends. Came here and met up with some friends after I came back into town from sky diving the same day. I'd love to do it again but sadly I don't know others that would go as after so I suppose it will have to wait a little.", "date": "12/29/2015"}, {"review_id": "QQ-FHMCrNNdeuaMe-1vgxw", "user_id": "yaI1NWGGnAAKGKGdyox_8A", "user_name": "Katie S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "There are a lot of great things about this gym, but my favorite is Marie's Boot Camp class on Tuesday and Thursday mornings.  It is one of the most challenging group fitness classes I've ever done, and the results can be seen immediately.  Marie will kick your butt in ways you never knew possible, helping you to seriously tone and strengthen with just two classes/week.I went to boot camp a lot before my wedding in July, and I firmly believe that the instruction and results I got from Marie's class were far better than an expensive personal trainer.  Thanks to her, I dropped a few dress sizes and got to show off my newly formed guns at the wedding.And the best part?  She's a rockstar.  She's got an awesome attitude that makes you excited to get out of bed and go to class in the morning to get fit and be hard core like her.So go ahead and get off your butt and go to boot camp on Tuesdays and Thursdays at 6:30am.  Thanks, Marie!", "date": "9/4/2014"}, {"review_id": "rsCGmkEtljlEoeTafz54UA", "user_id": "b3zyo92BZ9bWYKKOlIElgw", "user_name": "PJ O.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love my gym.  I've been going here for more than three years.  For me its not about the newness of the equipment, the classes or the amenities .... its about the people.  The staff are wonderful and try and get to know all the regular members.  In addition, the community at this place is the best.  Whether you are a climber, cross fitter or just a gym rat, you'll find friendly, down-to-earth people with common interests willing to befriend you.", "date": "3/2/2016"}, {"review_id": "pLun6KOjHfmzOy3plK6Ghw", "user_id": "sUI1P5UBLtf9Ioxf234lTw", "user_name": "Mike W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "A bit smaller than Mission Cliffs, LA Boulders, Brooklyn Boulders, and the other major gums, but still a great place to climb. Very easy to get to from BART. I went on a Saturday and it was a lot less crowded than other gyms at peak times.", "date": "1/16/2016"}, {"review_id": "HTqAbc5DEZ-GyrDnIulATA", "user_id": "9phHWtw9dK8tDp1woaUnOA", "user_name": "Antoinnae C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "i'm pretty new to the whole climbing thing (thanks boo and former co-workers), and i'm finally a member after bumming guest passes for a few months! the recent no-initiation fee promo helped! this place is smaller than mission cliffs or the berkeley one, but it's actually the closest to me/BART, and i really enjoy the vibe and the music here. like there was so much drake last sunday, that's cool! the staff here are great too and regularly check for safety - we saw someone lose their belay card once while we were there. glad they are all about keeping us from seriously hurting ourselves.yea weekday evenings are kinda packed, but we can all use breaks in between routes. i haven't taken advantage of any of the fitness classes yet, but i hope to soon, as well as the climbing technique clinics that they offer periodically. parking can be hard, not really there fault, but it's easy to take public transit here. i think this is also a good place to take friends for their first time climbing - there are plenty of  beginner routes, and forreal the \"climbing community\" is really supportive.", "date": "2/1/2016"}, {"review_id": "roTOJVBMHjBRFEZhpsjsIw", "user_id": "7mxpHsuPTEPGpLnHRtYh_w", "user_name": "Jared F.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 5, "funny": 4, "cool": 3, "text": "Please excuse the long review; but a lot needs to be said about this gym.  GWPC has become my primary gym for fitness and exercise.  I've consistently been going to this gym on average 2/3 times per week alternating with 24HR fitness on other days since the beginning of this year.  I have a previous review on 24 and I may soon be ending my 10 year relationship (we're only still together because we're comfortable).As you can imagine, this gym is definitely more fitness focused vs having bulk amounts of equipment.  Bring your bike; there's ample bike parking but street parking can be hard.  However, don't let this deter you from coming here; they have accommodating amounts of weights and gear for you to use upstairs should you choose to weight lift (don't worry, they have treadmills, bikes, stairclimbers, etc as well).  And it's NOT crowded; don't worry about having to wait as opposed to 24.  Additionally, they offer classes in two areas in the gym that you can join for that extra workout (yoga, boot camp, crossfit, core, and boxing to name some).  Locker rooms, showers (with separate dispensers for shampoo, body wash, conditioner, and lotion!), and towel service. They have multiple locations (parent company is TOUCHSTONE) that you can go to as well around the bay area and I believe one in LA.  The point here is that they have all the essentials for you!  However; here's what sends them above and beyond from your typical gym:Bouldering/Top Roping:  Obviously, what they're known for here.  You can rent shoes and equipment if it's your first time.  You do need to go through individual instruction and approved before top roping.  I'm happy with the variety of paths on the bouldering wall and they are pretty awesome at changing it up consistently to keep you hanging on the ledge (pun intended).  You'll know right away who's been coming here for quite some time and are really good; but they're all very welcoming, motivational, and supportive.  I've been given so many tips (I definitely needed it).  I've made some friends and recognize faces around Oakland here.  If you don't have a top roping partner, tell the front desk and they'll make an announcement to find you one; it's not embarrassing.  There are usually other people looking for partners.  I say try it!  If you love it, then stay and come back.  Don't worry, every one falls; there's very thick, padded, and soft flooring and mats to catch you.  They do have a first aid station for you should you require it.Competitions/Events:  They throw several events and competitions for the community.  I've received a free t-shirt and pizza while watching kids, children, teens, and adults compete on the walls.  It's pretty exciting and the amount of skill and strength it takes is extremely impressive (life goals).  You can throw parties here too but you'll have to inquiry within about that.  I do remember coming in during some company's work event (you're still welcomed to climb at the same time).  They have a lot of merchandise and food available to purchase too.Crowd/Patrons:  Like many Oakland businesses, you'll find every sort of person here.  There is no discrimination nor judgment.  Everyone of all sizes, shape, race, sexuality, age, form, gender, you name it comes here and has an enjoyable experience.  Come all welcome all here.Location:  Right in uptown.  You can go workout, take a shower, then head into the night life!Anyways, there's plenty more that can be said; but my best recommendation is for you to just come by and to try it out for yourself.  I don't think any review can say it all so stop by the front desk and I'm sure the friendly staff can tell you everything there is to know!", "date": "7/29/2015"}, {"review_id": "yDFFn56T6pF3QNjmewiuVw", "user_id": "jbLwHsY8lpS_v157cNBZAg", "user_name": "Jenna K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I give this place a five star for multiple reasons:1. Super helfpul chill, knowledgable staff2. Great section of bouldering problems3. Route section that extends so high up it's crazy4. Super convenient to BART", "date": "1/8/2015"}, {"review_id": "ZuOADXcu1eTf-1YZmaC9tw", "user_id": "J3jq4La1FlZnvTgKoRXMrA", "user_name": "Sam L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I go to GWPC the most of the three Touchstone gyms I frequent, and I really enjoy it. It's on the smaller side, and I feel like it is usually less crowded than some other options. That said, when it DOES get busy, it's really noticeable since it's smaller. The small size makes it feel more homey though, and I'm just really partial to this gym.There's metered parking on 20th and free parking on some of the neighboring side streets (which I always go for, because the meters are crazy expensive!).I find that there frequently aren't as many lower level routes here for warming up/ for beginners (5.9, 5.10 a), but the ratings here also seem a bit generous (so sometimes it seems like a 5.10b could easily be rated a 5.9). The workout area upstairs is super cute, though I always wonder why they haven't turned the ellipticals and other machines around to face the window? Seems like that would be nice!One of the things I really like about the Touchstone gyms in general is that they double the rope at the top anchor, so there is additional friction that prevents the belayer from being lifted up from the floor. It makes for a nice gym experience, even if it isn't super reminiscent of climbing otudoors.", "date": "1/11/2014"}, {"review_id": "bokLUZY0ETWuqPBItu6PJQ", "user_id": "PopQ_2hkWcgswqJGior-NQ", "user_name": "Miss W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 2, "funny": 2, "cool": 1, "text": "A climbing review for climbers:Bouldering:I'm mainly into bouldering so I am biased toward that. The bouldering area here is very small, and the walls aren't very tall. The cave section is very very small. It's hard for multiple people to climb on the wall at the same time. But it's great if you come by here once every couple of months to climb on new problems. I get the feeling that when the holds on the roped sections of the gym get too old, they give it to the bouldering setters. Ropes:Definitely come here to climb ropes. The walls here are taller than Ironworks. That's about all I have to say about that.Service:Everyone here has been really nice. No \"I'm cool because I work at a climbing gym\" attitude detected. Sign up process was easy and fast. BUT I'm going to relay the following story: I left my yoga mat at the gym in a cubby. MY FAULT. I called 5 minutes later to ask the front desk staff to please put it behind the desk until I came back in a couple of days. The front desk staff said that they did this. When I showed up a couple of days later, no yoga mat to be found, no one had ever heard of this yoga mat. It was a really really nice yoga mat, otherwise I wouldn't care. And otherwise someone wouldn't have swiped it, I'm sure. I asked them to please ask the other staff to be on the lookout. I go in every couple of days to climb and to ask about my yoga mat. Each time the staff have never heard of the stolen yoga mat. So this tells me that they really don't care, and I suspect that a staff member swiped it. This has nothing to do with my ability to climb at the gym, however, just be aware that the way the gym is set up makes it really easy for someone to walk off with your stuff. If you really care about your stuff, lock it up in a locker. Also, in the evenings parking can be annoying, but there is a paid lot next to the gym. 5 STARS FOR THE YOGA CLASSES!", "date": "2/4/2014"}, {"review_id": "yH19-TLIGwqChs00i-C52g", "user_id": "4pfMvXeP2YYZ-p90V47w2w", "user_name": "Bianca T.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I adore this gym. I've been a member for 2 years and it feels as much a community as it does a fitness center. There's a good variety of classes, some amazing instructors (Marie, Darrell, and Amelia are the best) and it's never too crowded to jump on a weight or cardio machine. The climbing walls can be busy depending on when you come, but if you don't mind waiting, it's a really fun time. Love me some GWPC.", "date": "9/3/2015"}, {"review_id": "2NviFQIBDjEfjbRUVyb5GA", "user_id": "Ep7kmWiq_RjqSG6n2pDcpA", "user_name": "Samantha C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love GWPC and all its staff. What a relief to have a climbing gym that mixes aerobics and crossfit classes in one! They also have cardio machines and a weight room, but due to the climbing emphasis you are not tortured with endless exposure to \"Bro City\" filled with obnoxious grunts, yells, and awful smells. Well, the latter you might get from some of the dirty hippies that linger around. Can't win 'em all! It's on the smaller side compared to the other Touchstone gyms, but also feels more laid back in comparison. They've got a decent number of routes and do an excellent job updating things on what seems like a weekly basis. It's also easily accessible, especially compared to Ironworks. Minus one star for opening later than all the other Touchstone gyms on the weekend. Typical of Oakland... Overall though, I'm very pleased with GWPC!", "date": "5/24/2014"}, {"review_id": "8oVkTH7Ee3t77mSvul-S0g", "user_id": "opdbggrufvUGH8gP9wHL8w", "user_name": "Brian S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "So, it seems that most everyone is writing about GWPC's great climbing features, which makes total sense since it is, after all, a climbing gym. And that's where I'll break the mold by saying that I love this gym, I come here as often as I can manage, and yet I have never so much as tried climbing. I primarily joined GWPC for CrossFit, and it's still the number one reason why I go. I like the CrossFit instructors, class times, and other athletes that I get to work out with. I like the staff of the gym, the great hours, and the cool selection of weights and other workout materials. I love that the gym is low key: everyone is laid back and there's no one pushing personal training or long-term membership commitments. I also like that there are four other gyms under the Touchstone umbrella that are included with membership, including one in Berkeley and even one in Fresno. And I like the classes offered at this and the other gyms. I'm sure I will try climbing some day, but for those of you like me who are mostly interested in working out and only occasional climbing, this is still a great gym to join.", "date": "1/4/2012"}, {"review_id": "bL42W9r2q6yc7taEt-ofvg", "user_id": "ufltg5labfo76nV7Hb3etg", "user_name": "Grace M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great. I am new to Oakland and I used to climb daily ages ago in a gym near Seattle. After a long hiatus from climbing I decided to jump back in and this is a great place to do so. The routes are really interesting and there's great variation in difficulty. The staff is friendly and helpful too - a big plus because I've had the unfortunate luck to come across mostly snobby employees at other gyms. I saw a couple of kids in today too and they seemed right at home, another sign of a friendly staff.I have yet to try out their weight room or take a yoga class (I made my second trip here this morning), but the convenience of having everything in one place is also a big draw for me. Definitely plan on making this gym my home base for climbing.", "date": "7/19/2014"}, {"review_id": "ZjNiIdfVN45TG_UmHBDK0A", "user_id": "ls3ltbmmpCP5I5oaKdnwVQ", "user_name": "Andrew E.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I have a short anecdote about my trip to GWPC that will explain the 5-star review.I was visiting a friend in Oakland, and wanted to climb while he was running some errands. I had just moved from Santa Cruz to San Jose, and was in the last month of my membership at Pacific Edge. I had heard that the Touchstone Climbing gym memberships were valid at any location, and I was planning on making the San Jose location my next gym, so I thought I would just start my membership early at the Oakland branch.When I explained this to the employee at GWPC, he hesitated to let me register. He explained that, while I was right about the membership granting access to all Touchstone gyms, each gym collects statistics on membership initiations. Presumably these statistics are used for internal review/reports. I understood, and prepared to buy a day pass.To my surprise, he instead suggested that I climb for free, taking my word that I would start a membership with Touchstone soon, which I indeed have done.Great staff aside, I also had a blast bouldering here. Wide variety of skill/style, and the people there were really friendly. I'll be back next time I visit Oakland (this time as a paying member)!", "date": "10/1/2015"}, {"review_id": "M1oXeRHEuYljt6E0S_On-w", "user_id": "dw7t_K0eNnGklF-Fqahf5Q", "user_name": "Lupe M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I am always looking for new and exciting things to do, but I never imagined how much fun I would have rock climbing indoors!  GWPC offers many climbing routes for every level and degrees of difficulty. I was lucky to come here with a friend who has climbed before which proved to be very helpful.  I also found the staff to be very friendly and helpful as well when we needed assistance on how to use climbing equipment and gear. A day pass (weekdays after 3pm and weekends) cost $20 and equipment rental cost $5.  I will definitely continue indoor climbing and next time try the more challenging climbing courses!", "date": "9/2/2013"}, {"review_id": "crBP2LFRQb7Vo08iqC6Ptw", "user_id": "gLke-4oih1t7urvoQAENcQ", "user_name": "Kevin L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "The urban legend/rumor that Touchstone had thrown up holds into the big steam pipe atop the building totally got my hopes up. I don't know why I was so excited about hopping into a dirty tube and getting black lung, but still. Definitely much much smaller than Mission Cliffs and the bouldering area is essentially the left wall while the right wall is toproping. I did like the upstairs gym area though; spacious and empty.Just bouldered the last time I came. Fun and straight-forward V2s, and the kiddy wall had some ego-boosting routes on it too. Weird slope made me wonder about falling and face-sliding down the wall, but thankfully topped off without blood anywhere.Surrounding neighborhood seems like it's in a transitory period and JUST about to get gentrified, but not quite there.Close to where I'm taking the bar exam, so I hope they're ready for my neurotic post-exam self. ROAR.", "date": "7/13/2011"}, {"review_id": "l1a_KeVATxwTmfC5sdovfA", "user_id": "L3ilyT4_HZUqdkHrZfkIIg", "user_name": "Sylvester N.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I enjoy climbing here when ever I get a chance to. This gym is a great alternative to the busier Berkeley Iron Works. The place is a bit limited compared to larger climbing gyms, but it's all there. The cave is always a daunting challenge, and bouldering problems seem to be well thought out for very fun climbs. Other climbers here are usually very friendly and will give you tips and work with you. I love the environment and feel of this gym!The only thing that is a bit bothersome is the parking situation.", "date": "3/8/2011"}, {"review_id": "7E7R75DFH0cw01fQsHCJjA", "user_id": "vvSfOdvJdUIQSm6HUSNT3g", "user_name": "Anna P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I was tasked with scheduling a team-building activity for my coworkers - and the timing came down to be rather last minute with such a large group for any gym to be prepared for us... The staff at GWPC were beyond accommodating and super friendly in the process of helping me organize an adult climbing party. Our time in the gym was a blast and the staff who assisted our party were sweet, personable, and welcoming people... Many thanks to GWPC for such a fun, successful event! -from myself and my co-workers at The North Face home office!", "date": "12/8/2015"}, {"review_id": "nQbMqCqNRlTMWMkWsyLRbg", "user_id": "8S28smb-vDQHX0UhLBjBHQ", "user_name": "Jon F.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Friendly, helpful staff.  Very diligent about safety.  Lots of fun courses.  Manages to make exercise fun!", "date": "1/14/2017"}, {"review_id": "c9FaVy10gTRmD6cLUKUtdQ", "user_id": "qhoBMj2sjmV9VhwOhfILvA", "user_name": "Sherie B.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I never write reviews but I feel absolutely compelled to rave about how awesome my experience was at GWPC. The bf and I took the beginners class, with Ricky as our \"belay staff\" and he was outstanding. His instruction was thorough and easy to understand, leaving us feeling completely confident before (and while) going up (not easy for someone totally terrified of heights). He was definitely a \"rock\"star  Desk staff were also super personable and helpful. Would definitely recommend this gym for beginners.", "date": "11/18/2015"}, {"review_id": "A8Kde1ezfoD2hfUtRYBguQ", "user_id": "WuO2HUp7OgcQLtTnh95Wrg", "user_name": "Eric W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 2, "funny": 1, "cool": 1, "text": "Cons:Hours. Sat-Sunday hours only open 10am - 6pm. WTF.  Always chasing a group of people out the door when they close. - Organizing equipment and checking on the cleanliness of the locker room is a little lacking. - CrossFit is fun but crowded. - The gym is not cheap. Pros: The least expensive CrossFit class in the entire SF/East bay area. - Good CrossFit Equipment and instructors. - Gym has overall low key atmosphere.(My stars would go way up if the hours were better. I have lost count of the number of times I look at the clock at 6pm on Sunday and think, \"Damn gym!\")", "date": "12/15/2012"}, {"review_id": "1NY8rI5BVQi653evx09aoA", "user_id": "dB11NQfvGM-cv-05YV_SGQ", "user_name": "Liv A.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "It's about time I reviewed a rock gym! I went to GWP a few times to climb after work. They are a full gym with machines and yoga classes as well. Too bad I didn't have time to give those a try. The walls here are great....every level and definitely challenging if you want it to be.  The staff is cool and all the climbers I met while I was there are super cool. Great place to bring a friend or meet a new friend! Also, very kid friendly. It's located close to the bart station, but the area may be a little sketchy later at night. Street parking is not too bad though.", "date": "11/27/2012"}, {"review_id": "5ffLM1XtnwbpvtZ-lalRdw", "user_id": "Qe6tXcHKWeaFsS8ga1M3RQ", "user_name": "Yogi S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 6, "funny": 1, "cool": 4, "text": "I have been a member for about six months now. I like that the gym upstairs is never too crowed and the teachers have been nice in the various classes I have taken. What I hate about this gym is how EXTREMELY RUDE their staff is!! Since day 1 when I signed up no \"thank you\", introduction to the studio or any information was given. When I simply asked where the locker room was the girl pointed somewhere towards the back and seemed very annoyed with my question. The front desk never seems to know whats going on with the yoga classes: do you need a pass or not?? Which results in you running back downstairs to get one last minute. Every time I have called with a question they snap at you that they can't hear you and simply hang up without a thank you or a goodbye. What's with this?? I generally like this place but try to avoid anyone who works there as they will try to make your experience miserable.", "date": "11/2/2016"}, {"review_id": "vzUqzmpdKU3OtH1HV3Fw_A", "user_id": "z3Y2-jlS2nV8snZRrkczAw", "user_name": "Erik M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I lived right next door to Great Western Power before moving to South Bend and this was by far the best gym I have been to or been a member of. The price point was great and it offered a couple different locations throughout the Bay Area -- I went to the Pleasant Hill one and enjoyed their climbing walls a lot. I primarily used the weights and found that a. it was never very crowded +++ b. people didn't just put ear buds in and lift...there was actual talking going on, which I really liked. Overall, when I move back to the Bay I will definitely sign up for GWPC again.", "date": "3/11/2015"}, {"review_id": "cNjI1nhW9rXVlf6sZWLtNQ", "user_id": "hYfva21b0cBwZ01lnEmtow", "user_name": "Dayva S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I really love Touchstone in general, and I go to this gym as well as Berkeley Ironworks. I am giving this gym 4 stars just in comparison to the Berkeley location. This location is small and has much less fitness equipment, but you can still get in a full workout! The climbing area only has a few easier routes, so this gym isn't really good for beginners. It does, however, have a huge room for fitness classes, and a crossfit studio, neither of which I've used so far, but...good to know it's there!I also took a wilderness first aid course here which was very cool. The staff is always very friendly and helpful.", "date": "6/22/2013"}, {"review_id": "G3_kHakA08inK31LJg2ijg", "user_id": "y3pgJ3fImo4F1pB_im_ncw", "user_name": "Jimmy C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 2, "funny": 4, "cool": 3, "text": "Everyone below has said pretty much everything there is to say about how great the facilities and staff are, so I'll write some tips instead (though I would like it if the changing area was bigger and the shower area narrower and how awesome would it be if the lightly used weight machines upstairs would be replaced with spin bikes or boxing bags). 1. I did not spot a single water bottle while here. Oh wait, yeah I did, my own. There are drinking fountains and things are probably different in the yoga class, but I didn't see one in the upstairs gym or the crossfit class. I felt very un-eco with my 1.5 liter plastic bottle of TJ electrolyte water. 2. Don't forget sandals for the shower. Shampoo, soap, and conditioner are supplied in the shower. Lotion is available by the sink. 3. Members here have a tendency to drop and scatter everything they own onto the locker room floor as they change, obstructing everyone's path. The body odor ranks up there in rank. Lawdy!4. Dude, I've never heard \"dude\" said so many times in my almost 40 years in Oakland. I've been here long enough to remember when the gym was the Navlet's nursery and garden supplies.", "date": "1/13/2012"}, {"review_id": "KN4no0UIeiinnQVC0FGxTw", "user_id": "rGxWTCy-YXl0VnC6tEUzaQ", "user_name": "Jeremiah W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great atmosphere - cool staff. Military discount helps and the facility is pretty cool.", "date": "1/21/2015"}, {"review_id": "IwzJsHFPzRIwPrAnp4rZhg", "user_id": "zDLCSZXrZupwvdsNKQrrEA", "user_name": "Paul G.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Nice & challenging place.  Kids loved it, it's bit noisy because of loud music & street traffic.", "date": "10/19/2014"}, {"review_id": "b242LXRSIGL1VBFqYMI6Qw", "user_id": "Ins7VMizfVCxQBID4wGZRA", "user_name": "Kara R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 5, "funny": 3, "cool": 3, "text": "This gym just keeps getting better. During my absence from the best coast, Jeremy has taken over and brought the gym to all new awesome levels. I have always loved this gym the most, but in recent visits I have noticed even more how intent they are on proactively improving the members' experience:-All the employees are still very nice and approachable-Jeremy took pity on my broke-ass student self (and longtime former membership) and worked with me to figure out the cheapest possible way for me to be a member again-They now have lockers you can rent if this is your primary gym and you hate carrying your harness around-THEY RENT OUT IPADS with subscriptions to Netflix and HuluPlus!!! This was my biggest complaint (nothing for my ADHD ass to do while on the machines but read), and now it's been fixed.What a gym.", "date": "6/22/2011"}, {"review_id": "hQn5r22XZXij4DJFBzb_eQ", "user_id": "jTDcNS2xWNkFldkYOGRXgw", "user_name": "Scott W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "I was convinced to come here after reading the reviews. I just got into rock climbing, so I am a bit of a novice. I used the great Yelp to find good places to climb and this place was jogging distance from home. I usually go to Ironworks in Berkeley, but decided to go here this time. I couldn't find the door at first, but someone popped out of the front then *BOOM* it was like Fairyland! Not like the Disneyland people were describing it to be. It was quaint, small, and had a good amount of people in there. I expected it to be emptier at noon, but oh wells. The people here seem to be really advanced. I felt a bit pressured and intimidated with the people in the room, but I figured no one really cared how good you are. I just wanted to climb, so I just went up the wall and grabbed any color; I didn't follow the route most of the time. There was this group who knew what they were doing. One of them would spot and make suggestions to where to move next in the route. Then I would go when it was free, but grabbed anything. I JUST WANTED TO CLIMB! haha After an hour of being a monkey, watching others, and falling, I left. I felt like I should have stayed longer, but the place only has so much.", "date": "1/18/2012"}, {"review_id": "qYE0nnD5USVtD0Zo_DCS6w", "user_id": "r0CoeSrWxPWYFxwnidnjtw", "user_name": "Robbie J.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It has become a nonexpendable expense for me with all they have to offer. I used to drop gyms but the climbing and the classes keep me here. I really enjoy all of their gyms, but what GWPC lacks in amenities, they make up for in classes. Kudos to management, keep up the good work. If u wanna climb less crowded learn to lead or go during the days. If you wanna sauna go to berky jerky! It's only like 10 min drive away.", "date": "1/20/2015"}, {"review_id": "ANsiL2IOen7MW4OaDdSQIg", "user_id": "Qhd0WCEUdex0KNX-JVyKCA", "user_name": "Ryan G.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "I've been really enjoying this gym. I actually don't use it for climbing, but the weight room is never very busy. It's easy to bounce around on equipment. And the locker room and showers are super clean and nice!", "date": "3/9/2014"}, {"review_id": "eF4GbrdxshvPjTpI2rVNDw", "user_id": "_B2TM-RpXdwlrnx_trP4Zw", "user_name": "Tom D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 4, "funny": 2, "cool": 0, "text": "This is a great gym in a dangerous location. My car was broken into parked within 20 feet of the front door at 4 pm this afternoon. Somebody just broke the window out, pulled out my stuff and left. It happened within 20 minutes of our arrival. I suspect the trashy gang-banger handing around out front when we arrived.I do enjoy the great walls in this gym, but recommend that you take nothing of value, avoid being there after dark and use great caution with your personal safety. The damage and cost of my loss today far exceeded my years of membership within the Touchstone climbing gyms; making memberships fees pretty insignificant.", "date": "6/25/2011"}, {"review_id": "nAb3aVRTi6URqLOyB8jvDQ", "user_id": "7YI8M_18t-mmPzsw5kt9qw", "user_name": "Rona Y.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 2, "funny": 1, "cool": 0, "text": "This is not the best place for top rope beginners - there are only a few 5.7-5.9 routes and even those can be tricky. They also don't change them very often, so for beginners like me, I either have to reclimb or just expect to half climb a harder ones. The place is pretty small and can get really crowded after work... I've never been on the weekends or during the day, so I can't speak to that... I'm sure its less packed. The gym is pretty decent - they now loan out ipads... I don't know if hulu plus is installed and it is suppose to take the place of a TV (which there isn't one) or if it's meant for you to surf the web as you are biking/running. But props to them for the forward thinking. Also now they have free chair massages on Tuesdays.. can't beat that. All an all it is probably a great place for non beginners... but it gets the job done if you are a beginner.", "date": "10/7/2011"}, {"review_id": "4drVl83AytIno-kUc9yYJw", "user_id": "1ZLhZZfLtxMrqPjK2u4MAQ", "user_name": "Andrea R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I like the poor review by the jack ass who was pissed that someone broke into his car in Uptown Oakland. Lol. This gym is cool. The routs are pretty easy, which is cool for me because I'm a new climber and getting to the top of a 5.10a makes me feel like a bad ass. I agree that the climbing area is kind of small, but that is why you utilize the multi gym access that comes with the membership. The bathroom seemed ok even on a building competition night. The gym upstairs is cool, and I've never taken a class so I have no opinion on that. And yes, it is in a busy urban area. Don't leave anything in your car when you park.", "date": "8/30/2014"}, {"review_id": "4V3TC-iW6Vj13m6iBsxFCQ", "user_id": "sLNiFfCqvicZIPxk6OEXaQ", "user_name": "Jake S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "I finally took the plunge and signed up for a year pass after several years of very sporadic climbing. To refresh some basic skills I took the intro to climbing class with Andrew. This guy is amazing. And it seems like people know it because everyone in the gym was demanding his attention during our session. He couldn't have handled it better, though. He's a gifted teacher with tremendous patience, great tips, and a very easy-going and kind demeanor. I'm still getting to know the gym, but am so far really satisfied.", "date": "5/7/2013"}, {"review_id": "thuMRYrVhoiwSuBBHHQeFw", "user_id": "IL2yTm7zGmsTF4iKVSZ0ug", "user_name": "Suzie R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 4, "funny": 1, "cool": 1, "text": "I've been climbing for over 17 years, and I am not impressed with this place.  I thought, at first, it was going to be my everyday gym, but I'd prefer to drive a little further to Ironworks.  The people here are young, and not very cool or laid back.  They are more concerned with you memorizing their requirements to climb, than really knowing how to climb and what to do.  They have a good amount of climbing space, but no routes, and when i say no routes, really NO routes for beginners or intermediate climbers.  So, it's hard to get someone to go who rarely climbs because there is nothing for them to climb.  The upstairs gym is actually pretty nice though.  I like to go up there during the day when no one else is there.  Quite peaceful.", "date": "3/3/2011"}, {"review_id": "kmjpXVe99b9Iny5xIpuKtQ", "user_id": "OBDbLgzFw-qTbVp3LfbiRg", "user_name": "Andrea L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "I was a member here for several year because I used to climb.Then I stopped climbing, and I stayed for the nice cardio machines.Then 24 hour fitness had a makeover and I left this spot like a hot potato.If you are a climber and need a place to train, I recommend it (usually not busy, etc) but as a gym there are cheaper (and now equally as nice) places you can go.", "date": "1/29/2012"}, {"review_id": "ll4QXkVdXnqn_8tN2v-qhw", "user_id": "tD-RHUW0O4A9VbrzJ94i5g", "user_name": "Jonathon S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came for the first time today as a birthday gift and the crew was amazing! They gave me a nice discount as well. I definitely going to go back. I just went up to see the gym, but didnt use it. The atmosphere is awesome and all the other climbers where really nice.", "date": "2/13/2016"}, {"review_id": "Bv4ESSPBo_-jRtqZ6iMtbA", "user_id": "2N01swZ5nQuSTDwrF08qMQ", "user_name": "Dan F.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 2, "funny": 2, "cool": 2, "text": "GWPC is like my second home. I can't get enough of this place. The staff is friendly, the music is awesome (usually), and the atmosphere is amazing!", "date": "5/12/2013"}, {"review_id": "hp7wUxSJqPDXE3yHjd9hkQ", "user_id": "KuTIo-fiK3BCg4JyshPOyQ", "user_name": "Whitney M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 8, "funny": 1, "cool": 3, "text": "Now, admitedly I'm pretty loyal to IronWorks in part because they have a sauna and GWPC does not. But I like their routes for both bouldering and top rope and I like that it's near BART. But the thing compelling me to write a review today is there employees. I went in on Sunday and found myself super wheezy. I told the employee at the front desk afterward that I thought they might have a mold problem. She wrote down my name and contact and thanked me for telling her. I didn't expect anything else to come of it. The very next day I got a call from the gym's manager asking me questions about my experience and soliticing information on how he can confirm the claim and treat the problem if there is actually one. I'm so impressed by how responsive they were! So quickly and so respectfully. I can't tell you how many businesses are afraid to acknowledge if they might have a mold problem because of the potential costs of remediation. They totally win points with me for responding to my concern so quickly.", "date": "11/29/2010"}, {"review_id": "DCyij59OA5wpVdkP1B-0DA", "user_id": "t1UZNFVtkDAYi1YGwzhJKg", "user_name": "James M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "This place has it all and is an awesome addition to the Touchstone gyms.  - 1 star for friendly staff- 1 star for a clean gym with new equipment- 1 star for crossfit class- 1 star for challenging rock wall climbs The only minus is that it's smaller than some of the other Touchstone gyms. However, if you live in the area and don't feel like traveling to some of the other Touchstone gyms in Berkeley and Mission Cliffs, this place is for you.", "date": "7/16/2011"}, {"review_id": "cRIgdmfQCJKZi5bAnHPRkQ", "user_id": "vFyV47D1mJxU_45VnbLr9g", "user_name": "Sharma H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "Calling this place \"good for kids\" is a joke.  It would be awesome for kids if they'd actually let kids climb.  As it happens, kids can only climb during classes that take place one day a week from 4-6.  I joined because my kids love climbing, and we thought we could climb together on the weekends.  Joke's on us!  Too bad I had so many different people behind the counter tell me the wrong thing.  Super unprofessional.  ugh.", "date": "2/5/2013"}, {"review_id": "rmPyuSewRxtB4IJXDhoC-A", "user_id": "5aCEquYmXUIsWmpUp1gqxA", "user_name": "Kathleen W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Smaller than the other gyms for top rope, but looks to be a great place for bouldering.  Also good for beginners since it was really empty this Saturday morning (though it could be because it was gorgeous outside).Cute little lounge area for the the non climbers to hang out.Parked in the lot next door ... which didn't seem to be an issue ... but you probably have to pay for it on the weekdays.  Metered parking on the streets which is enough reason for me to just head to Ironworks instead.Would definitely check it out again on a weekend ... the climbs that I did were pretty uneventful, but the structure of the building looks like there could be some fun routes.", "date": "3/28/2009"}, {"review_id": "SyWu8C6cbaiJ0lxQ22JzkQ", "user_id": "veLWPGA-1MMtcRNDYWm-BA", "user_name": "Samanta V.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I bought a groupon for here, and took my friend Holly with us.  We took the class with Andrew, and loved every minute of it.  So much so, that we ended up buying our own gear, and have started climbing together every Friday at a gym closer to home.What a fantastic beginner class!  Also, the place is really clean, and you can tell that a lot of expense was put into making it safe, and comfortable for all levels of climbers.Great experience!  I would suggest to anyone who wants to come try it to start here.", "date": "5/18/2011"}, {"review_id": "zAa3gsafIWfjNXFzwZnmKQ", "user_id": "eduDTeTIynGDh6hnKYjFXQ", "user_name": "Matt H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "What a great spot for a team retreat!  We did a group introductory climbing class here last week - there was a mix of different experienced climbers and we all felt like we learned something new.  Our instructor was knowledgeable, while really promoting safety (we had to practice our knots, etc like 4-5 times, but I'm always a fan being over-safe).  Overall, staff was friendly, the climbing courses were challenging, and we all left in great spirits and a little bit sore.  Thank you Touchstone!", "date": "4/3/2013"}, {"review_id": "r7qgucVRVM9KOq8MNXq6Dw", "user_id": "kP20_xSdbU_4bUrtb0RFYw", "user_name": "Monica S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Lots of long routes. Neat bouldering area. Friendly vibe. They just added a bunch of challenging routes. Also, nice little gym area upstairs and Crossfit Easy Bay works out of here. Very nice gym overall. Only slight downside: I'm a 5.8-5.9 climber, and I feel that there are not many routes in that range. Oh well, guess I better up my game! Oh, they also have hang boards upstairs. Way helpful. Gotta get that grip!", "date": "2/18/2013"}, {"review_id": "KZsCdypnrVAvRxPi70U5YA", "user_id": "NRYbf_1MgHkbZW5gnQ2CAw", "user_name": "Edrian D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "The Great Western Power Company...Got to love this place.  I go here every once in a while (keeping it loyal to Touchstone climbing).  I have favorite features in almost every single location in the Bay Area.  But let's break it down...Atmosphere:  Absolutely love it,  I boulder so it's nice to have Beta from the less than annoying \"mr know-it-all\".  The music played is definitely in good taste, from underground hip-hop it mellow jams, you can actually think without the side effects of saying \"I HATE THIS SONG!\"  Also, it brings me back to when I first started climbing, when MC was free of \"hipster-galore.\"  There's always a problem open to project because the traffic isn't as intense as MC, granted I still love MC.  Staff:  There really isn't any complaints when there's a cute person behind the counter.  Besides the fact that they are knowledgeable, a fellow outdoor climber and keeps the gym impeccable.  Features:  My favorite has to be the wall before the cave, I'm a sucker for big moves and you'll definitely find an awesome v4-6 calling your name.  The mushroom is awesome also, super techy and will definitely make you go insane for not projecting that day LOL.Rope:  Not too sure, I haven't climbed rope here since it opened, sorry kids, rope is not my deal.Mezzanine:  A cool little hide out to get some private time.Weight room:  WOW, huge-jung-gous!  Talk about an all around work out.All-in-all GWPC, 2 thumbs up!", "date": "9/7/2010"}, {"review_id": "NMkWjwcBMTnG5zxlgkvGWw", "user_id": "U8hFophfc3hcNVAu8GRHUQ", "user_name": "Pamela S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I know nothing about rock climbing, but my son was visiting for a college break, and we decided on a whim to check this place out as something fun to do.  So here is a complete novice's perspective:- The staff was super friendly and welcoming.- We paid $28 each for instruction, equipment rental, and unlimited use of the facilities that evening.- Super cute instructor, John, was fun, patient, and a great teacher.- Once we got the hang of it we tackled several of the tall, tall climbing walls on our own.  It was exhilirating!This proved to be one of the funnest things my son and I did during his visit.  The thrill, the trust involved, the physical exertion, followed by going out to dinner... a great evening!", "date": "1/16/2012"}, {"review_id": "IfGOPHc6pBuu1Pf-QSruYA", "user_id": "VAHoaaRobeW9ngSwdYcoUA", "user_name": "Michael M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "Long story short, I spent plenty of money with touchstone gyms for memberships, lessons and equipment. The gyms are alright, the staff is (usually) pretty welcoming, and i would love to rejoin after being abroad for a year. Unfortunately, it's \"been too long\" (just over a year) since i was a member, and will have to pay the initiation fee again if i want to start forking over 70 bucks a month for (at least in oakland) a small, crowded patch of hard plastic to scramble around on once in a while. Give me a break Touchstone, you greedy bastards. The company probably makes its nut in guilty new years memberships alone, but has to nickel and dime its members over and over again? \"Initiation\" fee. sort of implies you pay it once, right? i think i'll ride my bike over to indian rock..", "date": "9/22/2010"}, {"review_id": "oirDWN2zZQe5MDdJ1sYqVA", "user_id": "YFDQNnPD5_oPF5JVIf8U2A", "user_name": "Jen O.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Came here to get a change of scenery and was pleasantly surprised. The sapce is small for sure, but the climbing is pretty great. I usually climb at Ironworks so was super impressed by the bouldering wall for such a small space.The staff was extremely friendly and knowledgable..It was almost empty which was great for me.  I've been climbing for about 6 months and absolutely love this gym. I am here about 4 days a month for a change of pace, and just love it.You guys rock!", "date": "3/13/2011"}, {"review_id": "BsdcBpO89YCBi16MonyfeQ", "user_id": "XkLK2iBsgqF6mWwDfRgqqQ", "user_name": "Song P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I thought I had reviewed this place before.  I went to check it out before dragonboat practice at Jack London one evening around 5 and it was practically empty.  The place is clean and the weights/ cardio machine area is huge compared to Mission Cliffs.  There aren't as many walls to climb, it's smaller overall, and there is no parking lot so it's not as convenient or as fun as the other 2 locations.  I think it closes earlier too.  If you're in the area and want to climb, it'll do the trick.", "date": "10/19/2010"}, {"review_id": "LgUKNhLMAlGhvsgx2C8wqQ", "user_id": "0GHsxjCk-Ynzx4Ihj8tjPQ", "user_name": "Debbie C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to go if you are trying to escape the crowd of Ironworks (IW) but definitely smaller than IW and Mission Cliffs (MC). It just opened in November so the fitness area is still under construction and there aren't lots of routes set yet. In terms of square footage I believe GWPC has 11,000 square feet of climbing terrain versus IW and MC which both have about 14,000 square feet. The routes are longer than IW but not quite as long as MC. I believe the highest climb is about 48 ft.  One thing to keep in mind is to make sure you have a crash pad underneath you when you boulder. The bouldering wall is taller than IW or MC and the ground is not very well padded, so if you decide to jump instead of down climb....ouch!", "date": "12/16/2007"}, {"review_id": "dq4c4fi9zgA_-3-DKoJwMw", "user_id": "q7f-5fganQUCVjePW5GNWg", "user_name": "Stacey A.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I bought a beginners class for two on Groupon because A) It was oober cheap, B) I'm afraid of heights so why not face it head on, and C) I needed something to keep me occupied on one of those random days I knew I'd be bored.  I went with my sister (we call her Thighs because she's an avid runner and has the musulature to prove it) because I knew she's up for anything physical.  The class was very intimate which was helpful when we weren't sure how to tie out knots.  I didn't expect any less because I didn't want to plumet to a premature death as I have aptly seen on many occasions (I have a very vivid imagination).  But what impressed me the most was that as soon as the class was over, we were climbing super tall walls!  All I have to say is 4 words: I'm such a beast! Sooo much fun! If you want to do something indoors and different because it's starting to rain and the weather is just poopy, stop by here!", "date": "11/23/2010"}, {"review_id": "x_6GlZYKJgmp___bdX1eug", "user_id": "j8A2aS-L55gxcX-MaRiF0A", "user_name": "Roxie R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Part of the Touchstone Gyms, I find that GWPC is my favorite of them all.  It's smaller compared to Ironworks but the smaller crowd at this gym makes it a more tranquil place to climb.Parking is a pain so try to bike here instead.  It is awesome that they have indoor bike parking, makes me at ease knowing that my bike is that much more safer.I find that all touchstone gym problems are pretty consistent, very fun to boot.  I just wish membership was cheaper.", "date": "3/18/2011"}, {"review_id": "glzJZUWcyB5orxzsrNnnDg", "user_id": "h1JEjco-E5uJyoK32nKH8w", "user_name": "Sydney H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "This is my favorite gym in the Touchstone system (having not been out to Diablo, where I hear they have a new swimming pool, how sweet is that?!).  It can get super crowded around 6:30 when everyone gets off work, but you can always find a spot on the massive bouldering wall.  The staff is friendly, though they all seem to be getting better at climbing much faster than I am--the \"easy\" routes that are being set now are significantly harder than the \"easy\" routes that were set when I first started coming here.This place is much less of a meat market than either Mission Cliffs or Ironworks.  I feel far less self-conscious about the level I'm climbing on a given day.  I think the top rope routes more interesting than Ironworks' (I hear tiny cries of 'blasphemy!' working their way through Yelp as I type that).  Also, due to the fact that most people wear shirts, it smells significantly better in the bouldering area than Mission Cliffs.  Bathrooms are also nice and the showers are actually decent.  Inordinately small towels, though, and you can't leave your stuff there overnight, which makes life significantly harder if you travel by bike.  Easily BARTable.Yoga with Susan at 6:15 on Tuesdays is awesome.  The class is fast-paced, she plays music, and she gives you a whole mess of interesting poses, all of which help to stave off my most common yogic ailment, boredom.I wish they had more classes, and I wish they had a pool and a hot tub.  And I wish that their bouldering classes, etc. were free for members.  But otherwise, GWPC rocks.  He he.", "date": "5/19/2010"}, {"review_id": "bai1PlcMOkvtCKJ0r0owyA", "user_id": "1kpMAKRZuAz3OzxBav3XTg", "user_name": "Ligaya T.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 25, "funny": 19, "cool": 26, "text": "Ahhh rock climbing, the great physical equalizer. I've scaled the walls with athlete friends of all kinds: bodybuilders, swimmers, tennis players and it seems that no matter how hard core, scrambling upwards remains a challenge for all. At GWPC, it's a little more encouraging than the other Touchstone gyms; the top roping ratings are a wee bit easier though with less variety, and there's an interesting bouldering area. The anchor spools at the top freak me out as the rope seems like it could just slip off if you belay far enough back, but since no one's mentioned it, I suppose it's just me. Maybe the super high ceilings add to that.Anyhow, they've got a second floor with proper looking weights and macines, though I can't attest to their quality as I admittedly haven't touched one in years.There's also the original furnace stack that now splits the wall. How cool would it be to climb up the inside? Good stemming, eh?All in all, a great gym BARTable for beginners or denizens of the 'hood but too small to be a destination gym unless you just want to spice up the routine.", "date": "7/14/2009"}, {"review_id": "ylp7OLJkoy-TSv6fBvt_Cw", "user_id": "oQ6iMyAFx1iB8_LigQ7qhg", "user_name": "Ben A.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 5, "funny": 3, "cool": 4, "text": "This is a sweet little addition to Touchstone's climbing gyms (Mission Cliffs, Ironworks, etc.) and one that will hopefully take some of the pressure off of Ironworks, which can get crowded.I was disappointed to see that Great Western is pretty small.  Currently, Ironworks in Berkeley draws from two main populations:  the Cal community and Oakland hipsters.  Great Western stands to inherit half of Ironworks' customer base, but without the size to support it.  I am told that Great Western's second floor will be a massive fitness area, with a room dedicated to climbing-related exercises, but I still doubt whether that will ease the crowding around the climbing walls.The towers are really high, and the climbs are deliciously long (but that will only make the crowds that much more of a problem, since people will have to wait longer to get on the walls).   The features are probably the best part -- amazing looking cracks, crags, and overhangs.  Same goes for the bouldering area.  Great shapes and, aAs my friend Michael pointed out, there is a very secure top, which helps since the bouldering wall is a little higher than at Mission Cliffs and Ironworks.  Great Western will be my destination at off hours, when I think it won't be so crowded.  But on a weekday evening, I am guessing that I can forget about it (we'll see).", "date": "12/2/2007"}, {"review_id": "_n5peg5t3NauTDkmoPIaPw", "user_id": "cfdglEQwDNigOycYf2_GhQ", "user_name": "Mimi T.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "This gym is smaller than Berkeley Ironworks, but the routes go up higher and the bouldering section is larger. This gym also doesn't seem to get as crowded as Ironworks. I like the indoor bike parking, and the old smokestack gives the place character. My friend and I do wish there was a route that either went up or inside the stack though. ;)", "date": "5/14/2010"}, {"review_id": "9BI0lfNxIBRFhCYObFEHUA", "user_id": "EF9d4b8xYqvkk7HWGEtdgQ", "user_name": "Stanley L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 3, "funny": 2, "cool": 2, "text": "So the shiny sparkles of new-ness are gone. What now G.W.P.C.?You're still okay by me. Climbing is aaalright, but there are a few things you can work on - You have 3 stations in the gym (squat rack, bench press and incline press) that need an olmypic bar. Yet they never seem to all be there- Your ab crunch machine has been broken for 3+ months? and counting. It's covered with dust. Try fixing it.- For god sakes, throw away stained towels... it's GROSS - Do your workers check the men's locker room? Towels on the ground  and dirty showers (not gonna go into detail here) the last 3/5 times I went. I'm not that lucky, but I sure hope it's just a fluke. You got some stuff to work on, but I still love ya GWPC. Yet I find myself driving the extra distance to go to Ironworks more often.. sorry Oakland.", "date": "6/9/2009"}, {"review_id": "BTET5MVSaHfZkxUBBO9QIA", "user_id": "33h7LVT9XKNOVJgBGolH2Q", "user_name": "Shelley L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Nice small gym. Climbers here seem a but more experienced than other touchstone gyms I've been to. Down side it is small but still great. Parking is not very good. I wish there were more dyno moves on their bouldering wall. Great location right off the bart station for san francisco patrons.", "date": "12/9/2011"}, {"review_id": "ZZSMsrFl5bF-gAfPihDj8g", "user_id": "fx_oas0OGcUWsAF_jOCx0Q", "user_name": "Paul A.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "As a member of the family of Touchstone Gyms and having reviewed both Mission Cliffs (SF) and Ironworks (Berkeley), GWPC needs a proper review. In terms of Climbing, I feel that Ironworks or Mission Cliffs routes set harder and require a little more strength/techinque. The routes are set well and require a little more endurance. This is one my main reasons I love to climb here. You can work on your endurance on the 45ft walls and lap'em to your heart's content. The bouldering is quite interesting and somewhat over hung. Also they have a nice system board in the second floor annex which a nice plus.There is a nice up-to-date weight room with plenty of cardio equipment.   Pros:ClimbingCleanFriendly StaffCons:Parking sometimes is an issue", "date": "6/23/2010"}, {"review_id": "A40YywMQ8iw-_p1KOaXmAA", "user_id": "UnG4LPz49UWbGvBzVxQaMQ", "user_name": "Steven L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 2, "funny": 2, "cool": 2, "text": "That pipe itself near the lead wall has got to be at least a V10. I'm a touchstone member and although Ironworks is a stone's throw away, I decided to check out GWPC last week. The walls are surely higher because I thought I had established this indifference to falling, but when I got to the top, I was damn scared. Compared to Ironworks, the gym equipment doesn't seem 10+ years old, and albeit it's smaller, I think it's worth the extra five min drive for me to go here more often.Oh, there's only street, metered parking by the way. I'd look around the inside streets for the 2hr parking. Actually, in retrospect, that's enough of a bitch for me to go to Ironworks instead. Either way, touchstone has been putting up quality gyms.", "date": "2/7/2009"}, {"review_id": "xafS29_LSAWIAoOf4GyW8g", "user_id": "AZtDj1WfNkkb78uBYRtaoQ", "user_name": "Stefani P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Last night was my first venture out to GWPC, and my first impression was that it's like a \"hole-in-the-wall\" style place - probably because architecturally it's set up in your typical narrow bay area building style with basically what looks like two long hallways that have either bouldering walls and very basic short climbs in one and belay and lead walls in the other.Now I'm a novice climber, having only gotten into this just over a month ago, so don't take my word as rote. GWPC is definitely worth a look, and if it's local, it may be awesome for you, but it defintely made me glad one of their other gyms is closer to home. My termonology may not be correct, but I think you'll get the gist. The bouldering wall is either straight up and down or has a serious overhang, with not much curvature overall. All the walls in this place seem to be taller than my normal location, which on the bouldering wall specifically I guess is to make up for the lack of interesting rock formation. This was my first time climbing on a corner, which was... abrasive... my poor fingers.. but overall the climbs are less exciting on the V0 & V1 routes. Hey, I'm a newb, that's the best I can manage, don't laugh! ;)The belay walls are really crowded from about 6pm on, and we often had to wait 5-10 minutes for a spot that I could climb. There are tons of 5.10A and above routes, but a very select few lower levels (I think I saw 2x 5.7s & 2x 5.8s. The lowest route I saw was a 5.6, so if you're truly a beginner, this won't be the gym for you. They have lower levels (I've seen down to 5.3) at other locations, but if you can't climb a 5.8, you're better off sticking to one of their other spots.I didn't check out the upstairs yet, which I hear is marvelous, and the ladies locker room was small but clean, so it seems they're on top of that. They monitor their floors a lot more than any other location I've been to, so if you don't have your belay card, you'd better get it, because they'll catch you.Overall I think I'll need to give GWPC another couple visits to have a well-rounded view of the place, but for now I'd say it's alright. It's definitely nice for those Oakland folks who've been driving to Berkeley, but I'm glad it's not the closer gym to my house.", "date": "3/25/2010"}, {"review_id": "9RCRZIOj2Mf_I3ntncAvjQ", "user_id": "OF1Dwu3fWeyNzX2ehlyM3A", "user_name": "Cynthia P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "i joined GWPC to fulfill my longstanding promise to myself to see what CrossFit is about.i *really* wanted a gym that had spinning classes and a pool, but the corporate rate was such a steal for including CrossFit classes and reciprocal membership to all of Touchstone's facilities. i figured that since no contract was required, i could bail when i feel i feel the itch to swim.so far, i'm really digging the beginner CrossFit  classes and bouldering. the walls are a bit crowded after work, but i can deal (and everyone is really nice).the gym upstairs is a nice add-on, though if i wanted just the upstairs gym, i'd probably join gold's or something.", "date": "1/11/2012"}, {"review_id": "zeh-ThTh1Z30Klup-pavIg", "user_id": "4TlJDkOl9dlul7YUzs8_Xw", "user_name": "Bethany H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Not only is it close enough to ride my bike to, it's the best climbing gym I've visited! It's rarely crowded, the staff is friendly and helpful, the music and the temperature always seems right. If I could, I'd take off half a star for not having enough routes at my level (just a bit beyond beginner, with short arms to boot), but there's enough variety to keep me occupied, and enough challenging ones to spur me on.", "date": "2/26/2009"}, {"review_id": "-WQo41GJBPDRyOVyfDBa0A", "user_id": "4tvAhMoIKiq6bsJfVqNtwQ", "user_name": "J H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Being the closest climbing gym to me, I find myself here more than any other climbing gyms.  Driving here is such a huge pain, only meter parking and the closest residential parking is where cars tend to get broken into.  Bike here if you can.The problems here are fun but because the gym is small, it tends to get boring quickly.  If you're here with some creative friends, just make up your own problems.  With the right people, you'll find yourselves losing track of time.It gets really cold here.  To some, it's a good thing because gripping on to the holds becomes easier.Another thing that makes this place so distinguished is the training wall upstairs.  You'll see what I mean when you go upstairs to the training room.The main reason why I really like this gym is that I have not encountered any kids running amok resulting in an unsafe climbing atmosphere like many other gyms.  No one wants to fall on top of a child.", "date": "3/19/2011"}, {"review_id": "IqdQG_47w1LgzZbPOnj5CQ", "user_id": "nBUnHU3RlHy-pPkT_L1lFQ", "user_name": "Corinthia C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I was a member for a couple of months, and have left. This gym just never grew on me. I know some awesome climbers, but somehow I always ran into the snotty ones here. Maybe it's just indoor climbers in general. (The lack of sunlight/vitamin D indoors is my theory.) The routes themselves are OK. You can definitely start to identify the setters by how their routes are oriented for taller or shorter people. The staff was usually friendly. The locker room was usually clean. As were the gym and weights upstairs. Actually, the artwork on the walls upstairs was really well done. After thinking about it, though, it's all dark colors. I make fun of the cheesy neon gym lights at other places with the over-the-top glitz advertisements everywhere, but I now think it does make a difference in the workout. I need bright colors! I just felt sad, no matter how hard I worked out, at GWPC.And the neighborhood isn't the greatest for parking, when I had to drive. Bart is a block away, though. I think this gym is worth it for short-term training purposes. Otherwise, go outside and climb a rock!", "date": "3/1/2010"}, {"review_id": "Ry8lAMWppDijSA1gRrScsA", "user_id": "ggczhgImo5iuSYvl16H9Ww", "user_name": "Farhad F.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Love this place. Great climbing routes, and the fact that it's a climbing gym keeps the weight room from getting to bro-y. Also yoga, crossfit, and a bunch of other classes. The staff are super friendly and are eager to get to know you by name. Ze'ev is a baller.", "date": "5/29/2013"}, {"review_id": "dPvgEBTqGJ6zHvT2AlAqNg", "user_id": "PVPm6St72kHKk-9bo3V83Q", "user_name": "Derrik S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Bouldering Review: I'm in Oakland on business and stopped by GWPC for an early morning bouldering session. I come from an amazing gym, The Front, in Ogden, Utah so my expectation bar had been set fairly high. The bouldering area was pretty small but there were some fun routes. I found the taping confusing. I'd recommend using thinner pieces of tape to make it less chaotic when you're trying to find your route. I don't think they clean the holds when they change the routes, most of the feet were suuuuuper greasy. Besides those two gripes I had a great time. I climbed many of the V4-V6 routes and felt they were fairly consistent.", "date": "12/24/2011"}, {"review_id": "Ct0syYeZSDxJYWO0fbnRzQ", "user_id": "gKU7XvO5kLiiwED7QCcDsA", "user_name": "Elizabeth J.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I really like this gym. I still go to IW, because they have more route, but GWPC has really fun, challenging routes. They have plenty of mid-range routes (5.10 - 5.11), and lots of beginner stuff too. The bouldering wall is really tall, and when I first went, the wall was really rough. It's smoothed out, and the routes are fun and challenging. The upstairs cardio/weight room is super nice and clean. All the machines are brand new and fun to use. It's great fun, and much nicer than IW. I try to do all of my cardio at GWPC because it's nicer.This place does get a bit crowded on week nights, but Saturday mornings are amazingly empty.", "date": "10/4/2008"}, {"review_id": "8dpvnkHR_CaHQwtAPDzrOg", "user_id": "eIpTf-Ex9WOhWWGO1o-hhg", "user_name": "The Angry Vegan H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I like Great Western Power Company a LOT. I am a member of Touchstone, so I prefer to go to the one on Ashby (it's bigger and has a sauna), but GWPC is really close to my apartment, and I spend a fair amount of time here. There are a lot of amenities here for a small space-- bouldering and top-rope, a full gym upstairs with lots of machines and equipment, Crossfit classes, yoga classes... I've only been to yoga a few times, but I really like the Wednesday night teacher, Raven. I was there last week for a super crowded class (first class in the New Year, everyone was making their resolutions!), and she very earnestly asked everyone to make space for other devoted yogis-- and everyone responded graciously, which was awesome.GWPC gets pretty crowded during weekdays after work, but for the most part people are pretty considerate. When I first started climbing at GWPC I was a little discouraged by the small number of beginner routes, but there are a few V0s and V1s on the bouldering side as well. Now that I can climb 5.10s, I don't usually find a shortage of routes. By the way, you don't have to rent ipads as some other reviewer mentioned... it's a FREE loaner! Love that! :)", "date": "1/11/2012"}, {"review_id": "IjIalyTs1Ly7ki128qjZ5g", "user_id": "XWxX51LXp-Oh0X2VJmsfIQ", "user_name": "Derek S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "Climbing is fun. I've been climbing for about 4 or 5 months now and am a member at the Touchstone Gyms. GWPC isn't the best of the Touchstone gyms -- it isn't even close -- but the chain is well-run in general and this gym is no exception.Bouldering here isn't spectacular, but the routes seem to be changed often enough that I don't get bored. The top rope climbs are all really tall, which is my main beef with a lot of gyms. Unfortunately, they don't seem to be set as frequently as the bouldering area, so I get bored if I rope up too often. The lead area is rarely set and is definitely sub-par with regard to the other gyms in the Touchstone chain, particularly Mission Cliffs. Even Diablo Rock Gym has something unique -- a short, but seriously sloping lead wall. GWPC just doesn't stand out. All that said, it's still not bad.The fitness area, though, KILLS most other gyms. In fact, I like it a lot more than Club One at City Center where used to work out. For starters, it's nearly empty all the time. I use this space in some capacity almost every day and have only once had to wait for equipment (and not long). They have a pretty complete array of free weights and machines, making this a really great spot to be a member, even if you don't climb. Bonus points for allowing me to work out without a shirt on.", "date": "1/10/2009"}, {"review_id": "fSULuLMqxY8UbOQwhFHRLA", "user_id": "J4Ji-QwqC6XOlogCiI-WBg", "user_name": "Elspeth P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Being a beginner at this climbing rocks thing, this review might be most helpful to other newbies like myself.  Aside from a 5th grade birthday extravaganza at City Rock, GWPC is my first experience with climbing and I must say, it has been a pleasant one.  The employees, aside from one guy whose mood swings are worse than a menopausal woman, are very helpful and friendly.  Most of them do not press you with information, so if you need something, ASK.  Don't stand around waiting to be taught how to climb because you'll just look like an idiot covered in chalk.  And no one wants to be that guy.  The facility itself is clean and well-maintained (especially the bathrooms!).  Aside from all the climbing there is also a bunch of yoga classes and exercise equipment (which I rarely see anyone using...most people are on the walls like a bunch of spiders).  Basic advice if you want to get into climbing: get a bag, get some chalk, get a friend, and get ready to hate your once-useless muscles.  They are always changing up the routes so it's a different experience every time.  Technical stuff:  two parking spots right in front of the entrance are free; meters on 20th street are almost always broken, so go around the corner and there is free parking.", "date": "12/2/2009"}, {"review_id": "2YfIY0kv8blBzHnVobjNTA", "user_id": "NpGXAgdQfMBwg0ijaitq3A", "user_name": "Andy Y.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Compared to the other gyms, this place is okay. It's like a mediocre mix between the gym in Concord and Berkeley.This isn't something against the gym itself but more of a heads up to anyone who may read this. The gym tells you but you most definitely must bring all your valuables with you when you go to this gym. The first time I went here, there was a good amount of broken glass on the sidewalk. I'm familiar with the difference between car window glass and just normal window glass seeing as how my car was broken into the day after Fourth of July.Onto the gym. The climbing areas are pretty small. The bouldering area takes up the whole left side and the toproping gets the middle and right side. The toproping area is a decent height. Since the gym is brand new, the walls are brand new. These bouldering walls are like sandpaper and just there you up if you make the slightest mistake. Simply touching your knee or elbow against the wall is a guaranteed rip/burn. It's harsh. It's a complaint but about something that is brand new. So, hopefully now it's been worn down a little bit.Upstairs there is a full fitness center. Everything you need is provided. At the end of the second floor is a yoga room or a multi-purpose room. I don't know, I've only seen it once. And right next to that room there is a very small bouldering room where you're able to create your own problems. You might have seen them in pictures where it's an angled board with holds completely covering it. This is pretty much the only thing that makes this gym unique out of the ones I've been to that Touchstone owns.I personally like the Berkeley location better and I definitely like the Concord location more so than the Berkeley location. They have their pros and cons. However, it is still a gym to check out. I've only been there about three or four times and I think that's enough.", "date": "3/12/2009"}, {"review_id": "YrQrHjnUgSHyBj04X7wp9w", "user_id": "KYC4BNx3m0i94ymxtL1ZEA", "user_name": "Aaron S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love climbing here. The staff is cool and the gym never feels too overcrowded.", "date": "12/29/2011"}, {"review_id": "rz1D6sF21-61A_QRSoOeOg", "user_id": "WXnibfV40ylxBXP75W6syQ", "user_name": "Brian M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I usually go to the Ironworks gym in Berkeley or to this Oakland one to bolder. They both have their pros and cons, but let me focus on the Oakland one.Every time I've been here its never been really crowded. Even if there are a lot of people, I don't have to wait really long for it to be my turn. Point for GWPC.Also every time I've been there, the service is a bit obnoxious. I guess I just don't get them and their sense of humor, but it does ruin my focus when climbing. Point against GWPC.In comparison to the Berkeley gym, this one is much smaller and they don't change their problems as often. But if you like a more intimate setting for climbing, this place is better suited for you. Overall, it's clean, fun, and kinda cool.3 stars!!!", "date": "1/12/2009"}, {"review_id": "9Ftwa7zk_nTHt6I_IOVfMw", "user_id": "OT3D55achPotu9QERZcCNQ", "user_name": "marcella r.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "As far as public transportation is concerned this place is just a block from bart so is super convienent. the parking lot next door is only two bucks or something like that when you get it validated so that is nice since the parking here sucks if you come one a weekday. it is overall smaller than the other gyms but it is nice to be at when not crowded and the smokestack in the middle adds some charm. big lead cave and bouldering is varied. the mural that they have upstairs is awesome. more places should have murals, dammit.", "date": "5/23/2009"}, {"review_id": "payuiS43eHp0J6m3iWN7dg", "user_id": "Qvo6dV1ROR8MswaMfVLq-g", "user_name": "Perry K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I like this gym!  Although it is not as big as the other bay area gyms, it does offer some great routes and it is not as crowded as Ironworks.  The damn walls never stops, I kept thinking when is it going to end!  They are so much higher than the gym I go to in the Los Angeles area and most gyms.  The facilities are great!", "date": "1/30/2008"}, {"review_id": "PJjXnhP-qj-U1esUqXPsdA", "user_id": "wnwSsp30k5nSdkUiRVlIpw", "user_name": "Stacey M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "As a regular at Berkeley Ironworks, I was so excited to hear about the gym opening up in Oakland, five minutes from my house.  But my first few visits were a mixed bag:  the main climbing walls have interesting technical challenges but the terrain is pretty monotonous.  I guess that's what you have to do when the floor space is limited, but it seemed heavy on the slab.  The last time I was there, the lead climbs were all really heard and the draws seemed pretty far apart.  Slab + hard routes + far-apart draws = scary combination for a new lead climber like me.  The bouldering was fun but also limited.  I am sure this is a great option for advanced climbers but, for someone at my level (10/11 in the gym), Ironworks has a lot more to offer.  I'd give it a 3.5 if I could because I am psyched to have a climbing gym in Oakland and, in all honesty, it's still 100x better than the climbing gyms I've visited in other cities.", "date": "4/5/2008"}, {"review_id": "FwDZfncL9AE9XMBoEeln5g", "user_id": "9lofaGTIj5sEwBpsV-SSbQ", "user_name": "Kenji L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love GWPC. It's not as large as Ironworks, but it's awesome having a climbing gym in Oakland. I got introduced to bouldering here, and now I'm addicted.The gym is clean and it's usually not too crowded except for the post-work crowd that comes in to boulder around 6 pm-ish.I also go to a hatha yoga class twice a week with Raven, who I highly recommend. I dislike new-agey yoga teachers, and she's down to earth.For a while I stopped bouldering here because one of the staff kept playing punk and metal all the time over the sound system. Not that I'm against punk and metal, but all the time, without any variations, and in Oakland? Yikes. Not really what I want to hear when I'm climbing, it just stresses me out. These days there seems to be more variety in the playlist.There's also a comfy little lounge seating area where people sit with their laptops and use wifi. Pretty cool.One thing - if you're used to a wide variety of ages and body types at your gym, you might be surprised. The majority of people at GWPC seem to be in their 20s-30s and relatively buff. I actually prefer variety. But maybe it's a certain age range that tends to be into climbing.", "date": "2/19/2009"}, {"review_id": "a7PIGzGYpPFiUn_FPq_cog", "user_id": "-PWXaG6epoTzj333K0_9Sw", "user_name": "Andrew W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A gym I can walk to!!Friendly attentive staff.  Friendliest of all the gyms I have been to in the Bay Area.  And they pay attention to the suggestion box - Yay! Muscle Milk!The holds still have some texture unlike Mission Cliffs or Ironworks.  Sometimes at those places it's like climbing polished marble.  But I haven't been to MC or IW in a while so maybe they have purchased new holds.Cleaner, better organized in terms of workout equipment  and not as dusty as other TS gyms.  Routes changed with regularity.I wish they were open later on weekends.Sauna would be nice.  Maybe a sauna and cafe on the roof?!?  Go for a climb, have a sauna, then a smoothie.", "date": "6/12/2009"}, {"review_id": "V26os45QfAtJ4HZ74fEPpw", "user_id": "Jbk37l7vBU-SwVCSmg9eCA", "user_name": "Cat C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "GWPC has a nice staff and facilities, but I was rather a bit disappointed with how small the gym was. There wasn't much of a range for noobs, and there were a few 5.10's, but then there were a bunch (relatively speaking) or 5.11+/lead climbs. But then I went upstairs and was floored by the fitness area. Wowzah.", "date": "4/21/2008"}, {"review_id": "jP32vyaqkGW-1UQ2Pe5neg", "user_id": "A4SJLSbKpiDdfjTxvjj-0Q", "user_name": "Mike D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "If you want to get in shape fast this is the place to go. The trainers have been very professional and have continued to push me in succeeding my goals. Before i joined crossfit i couldn't even do a squat or a sit-up, but now i can do them both with ease.", "date": "4/10/2011"}, {"review_id": "lVq9q2UPOS26R1kESCoj8A", "user_id": "hGFlCrUXGU_JVUYG37dXZg", "user_name": "Bren L.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Just went here for the fist time this past weekend. The trainer was knowledgeable but she yelled at me when I couldnt belay for the first time. I always have a grin on my face so she thought i wasnt being serious about belaying. I got scared a bit and felt like i was in grade school again. sheesh, chill woman. i guess she just wanted to make sure i wasnt putting my friend in danger. dude, thats my buddy up there. you think i want her to get hurt...now if it was my enemy, maybe. kidding. everyone knows i wouldnt hurt a soul. i didnt expect much so i guess it was cool. got a bit crowded around 3-4pm ish on a Saturday so i guess better to go there early. Initiation fee is $100 and $67 monthly membership available. is that steep or cheap? i dont even know. might go back but this time with no grin on my face why i belay...", "date": "11/22/2010"}, {"review_id": "bcIqPWeBrKFAYgN5UvY4lQ", "user_id": "-fArTy74H8r8a0goRzpNbA", "user_name": "Rich M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great.  Climbing, Crossfit, Yoga & traditional gym all in one!  The people are super cool and the membership fees are reasonable, especially when you compare to what you get here and other overpriced gyms.  I think the offerings and fair price structure reflect the future of gyms in this economy!", "date": "10/8/2010"}, {"review_id": "NRCJw9gPzasKq6KF-1a5IA", "user_id": "XnRs0pcBX5mhYGN9doC1Lw", "user_name": "Becky G.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you're in the downtown Oakland area, GPWC is perfect for climbing - a variety of routes, helpful staff, mellow crowd.  There's also a cardio area with the basics (just what I really need).  The women's locker room is well kept.  I'm a fan!", "date": "4/28/2011"}, {"review_id": "3sMEcMqeSeGVVl1nMWp88g", "user_id": "OsqtMH1_cC0L9k0bscHkfw", "user_name": "Jennifer K.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This review is STRICTLY for the yoga session. I've been a Touchstone member for a little under a month now and as I really like Ironworks in Berkeley, I decided to give this place a try as well. It's a lot smaller compared to the Ironworks in Berkeley - so I decided to try the yoga class upstairs. Vinyasa yoga (with the male instructor, forgot his name) was GREATTT! I've been to multiple yoga classes elsewhere before but this was was the best I've ever been to. He heated up the room b/c it was chilly in there and was an evening class, told us to introduce ourselves to the person in front of us, and hum along with him to a song we all knew. He was awesome - and definitely worth my 2 hours time!", "date": "2/14/2011"}, {"review_id": "PAfEPD3BYL6AK1hr6_RxbQ", "user_id": "Ph1mDtDIIDEMmG0oGiqLXA", "user_name": "Chris S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Loved this gym!...a bit tight, but plenty tall.  Some of the climbs are integrated into the original architecture of the Power Company.  They even have iPads to use if desired at no additional charge.I wish there were better deals on 10 pack visits and/or reduction/elimination of member fees.  I would be down there quite a bit more often.", "date": "3/18/2011"}, {"review_id": "rZmytkBtgNOtn9kZ8P7tNw", "user_id": "pE4zmmIPzlq8EU-EnLlJyw", "user_name": "Sean R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here after climbing at Mission Cliffs for a while just to check it out and because my membership grants me access to both.The staff was extremely friendly and knowledgable.I felt like the routes here were slightly harder than at Mission Cliffs.It was almost empty which was great for me.  Right next to BART which always makes my life easier.The workout room upstairs looked very nice although i did not use it.", "date": "8/1/2010"}, {"review_id": "qjELxh1zbQy9atjQJUQ7fQ", "user_id": "4XW7JSPH8-jO8-V7gcbRxA", "user_name": "Felix W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I used to be a member at the Berkeley Iron Works and love that gym. The Oakland gym is much smaller and has many fewer amenities. I went there with my girlfriend who had to rent shoes and a harness. Total came to $42, which I thought was steep for such a small place. The person at the front desk did not make my girlfriend take a belay test, which I thought was a good thing at first. Later I was watching some people climb around me who did not even know how to tie a figure-8, which made me feel uncomfortable.The biggest problem was with the anchors at the top of the top roping courses. The ropes stuck so much that I was barely able to pull them though when belaying. My girlfriend, who is pretty small actually couldn't pull through some of the rope and I had to stop a few climbs half way up. I had enough when I was belaying her, went to lower her, and nothing happened! I had to throw her some extra rope, make her hold onto it and literally pull her down. We asked for our money back after this happened and left.Ratings seemed very random, some easy, some hard and route-setting appeared unimaginative.Lastly, the 150ft chimney they advertise on their website did not have any holds in it. I recommend going to the Berkeley Iron Works instead, it's only 10 to 15 minutes away.", "date": "10/24/2010"}, {"review_id": "PMFEgBWfvHPRMPO8zODWXA", "user_id": "zlAxp6iJ8FiyoX2sRKe2Dg", "user_name": "Ali A.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I cam here having really high expectations because I saw that it was voted best climbing gym in the East Bay. I don't really have any complaints but I guess going there I thought it would be bigger. I liked the climbs I did there, they were really cool and I had to use a slightly different skill set from the usual climbs I do at the Iron Works which around the same level. I guess in comparison to the Iron Works, I liked the Iron Works better simply because it had way more climbs.. But this gym is still pretty solid and I'm definitely making some more trips here in the future since it's always cool to try new climbs. It also doesn't have as much traffic on Saturdays, so if that's what you're looking for this is definitely the place to go.", "date": "10/18/2010"}, {"review_id": "kg-87alcgwtJz5OKlPzngA", "user_id": "j8mIPH18DpTF-CdJFHV87A", "user_name": "Jeremiah W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "the newest addition to the family happens to live downtown, in oakland. i recently went here as i needed to check it out, see if it's up to snuff - and it is. there were a lot of bumps along the way to getting the GWPC up and running for the touchstone guys, but now that it's open, i might be here more often. it's great in that (and this may be due to the holiday season) not many people were present when we climbed. as much as i love sharing the joys of climbing, i also love having entire walls to myself. and the routes were set the way i like them - difficult. get here while the texture of the holds and walls is still present, unless you're too delicate that is.my two main issues with the GWPC are in the bathroom. unlike the other touchstone gyms, there is no soap in the shower. so if you need a shower, bring your own suds. also, as it's a new gym, i think they were having issues with the hot water. they had signs up that said \"we have hot water\" in all caps, but i couldn't seem to find any that day. the other issue that might arise is in the size of the place. GWPC is fairly small when compared with gyms like mission cliffs or concord, but it will make a nice overflow for ironworks. oh, and i didn't see any weights here..", "date": "12/25/2007"}, {"review_id": "3fq9Hwi6meIM992klkeb-Q", "user_id": "Bp9wc211LRKGCUd7rY1J2g", "user_name": "Steven T.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 2, "funny": 2, "cool": 2, "text": "Great addition to the touchstone climbing gyms. One membership will get you into any one of them and allow a free guest pass each month. With membership you gain access to boulder, belay, or utilize the gym and classes offered up on the second floor.  Place can get a bit crowded, so dont be afraid to throw some elbows around =) note: Ironworks in Berkeley is probably more crowded then GWPC. For us hurt folk they are well equipped with bandages, tape, chalk, etc... You can rent shoes for $4, but I would really recommend investing in your own if you plan on climbing more than once. For starters, renting can add up. Secondly, I found the rented shoes did not provide the needed support to be able to climb efficiently.  Staff is super friendly and the climbers whether beginners or advanced are accommodating and willing to help beginners and give pointers.", "date": "3/15/2008"}, {"review_id": "uK5gNmBe5F-fffjHEQVnmA", "user_id": "RQulQkYo_0bBIOwtiiu7cg", "user_name": "Jim S.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I have been a member of the Touchstone Climbing Gyms for several months now and I have discovered that I like going to different gyms for different services.  GWPC has, by far, the best gym that I have seen amongst the gyms.  The equipment is clean, high-end, plentiful and usually available.  The staff is always courteous.  My only warning about this location is that the climbing is more challenging here.  With limited acreage to build the gym, they built climbs that are both very tall and usually over-hanging.  The climbing, and especially the bouldering, is better for climbers who are experienced, fit and comfortable with a competitive atmosphere.  This is not to say that the staff and patrons are not welcoming to beginners, but I do believe that Touchstone has better gyms for people looking to start climbing.  That being said, you can't beat the whole Touchstone package; being able to use 6 gyms around Northern California.  I have been very happy with my membership and I recommend it to anyone.", "date": "5/2/2012"}, {"review_id": "RSwpaYSCodZl2B4ggBIYlQ", "user_id": "ZObHXI05ILUFpDo_m7DjzQ", "user_name": "Andrew D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Oaktown PC, A great climbing gym located in downtown oakland. Its residence near 19th st oakland bart is great for bike riders, skaters, runners and speed walkers like me. The smallest of the touchstone gyms, it can get a lil crowded during peak hours, luckly its also the hidden jewel of the touchstone family. Its bouldering wall space is a bit limited in size but not in challenges, and is usually saturated with alot of leet climbers. As in all touchstone gyms, PC boasts a full wieght, cardio, and crossfit gym, located up stairs. All in all I would deffinately recommend climbing here. Music is always smear worthy too.", "date": "12/3/2009"}, {"review_id": "Lo_f21bT-7kGfVJTOVRxTA", "user_id": "zFtFgeIpiAWQW7Gzbz9hfg", "user_name": "Allisoto P.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Very fun here.  A LOT LESS busy than ironworks. I got through all the courses that I wanted to complete and more on a weekday night! WOW. There are fun courses, but the selection is more limited than at other TC gyms in the area. I really liked the crowd, the testosterone rating was within my limit. Nice change of pace from the madness that ironworks can be.", "date": "4/29/2008"}, {"review_id": "kysnlA0Nwy4Llgctrtj8hA", "user_id": "44rdpV3WDF5Cxr90sEPpvA", "user_name": "Jena D.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym for fitness with CrossFit classes, yoga, and great cardio and weight equipment. The staff are incredibly friendly (as they are at the other Touchstone gyms as well). It is a cozy gym, which makes it a bit more difficult for climbing but still a wonderful gym. They also lend out iPads to use while working out! Been a touchstone member for several years. I've stuck with Touchstone even when I wasn't climbing. I am a regular at Mission Cliffs and Ironworks as well - both also great gyms!", "date": "12/1/2011"}, {"review_id": "srKGC31BwMes_ioRE4Dl4Q", "user_id": "PAGIppDXVg12CyCa-gdLoA", "user_name": "Nick H.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "GWPC is a cool new Touchstone gym, and quite a bit mellower than the others. It is nice and accessible from the 19th st. BART station, and after climbing here for an hour or two you just might look pumped up enough to intimidate your way back to the station late at night. Really though, GWPC soundly covers all the rock climbing gym basics, and its proximity to BART gives it bonus points.", "date": "11/29/2008"}, {"review_id": "t1LjnH8Dhqpg8EXOHKQw2g", "user_id": "ohAzf4MIkB9Am6FGFLyZIw", "user_name": "Jenny Y.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've checked out some of the other Touchstone gyms and GWPC is my favorite thus far. Besides being bikeable from my place, it also is nicely maintained, the fitness equipment is new, the women's bathrooms are clean and well stocked with shampoo and conditioner, the staff is laid back, helpful, and has good taste in music, it doesn't smell musty, and it's not hot and humid (unlike Mission Cliffs). It only gets crowded after 5:30pm on the weekdays (and usually only for bouldering) and it's never crowded on the weekends (no hordes of kids having birthday parties there either). But, because it's small, there are a lot less options for climbs so you don't get as much practice in your particular level so if you go to another gym you may be surprised to find that your 5.10A skills at GWPC only amount to a 5.9 at another gym!", "date": "11/3/2008"}, {"review_id": "6-9GASFaCt9bl99O9y2d4Q", "user_id": "M5D4GUWV1k8QTtUHwuwnuQ", "user_name": "Simple N.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Stopped by to boulder for a few hours and was surprised by the quality of the problems.  I am not much of a gym climber (love outdoor bouldering), but I must say that I had a blast and since I am soon to move to the bay area, this gym would be a welcome addition to my routine of seeking out fun and staying in shape.  Super nice staff - clean gym - not so large that you will get lost trying to find a boulder problem to suit your pleasure - and I imagine when it is raining out, this will be where I am climbing :-)", "date": "11/29/2009"}, {"review_id": "Vm_KJB7TGhv-tvVhXCoAAQ", "user_id": "SRpuAjChmw2C7t5GCfJ1Jw", "user_name": "Kath R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's so so small, but the climbs are nice, the features are interesting, and the facility is nice, new, and clean. Which means that (unlike Mission Cliffs or Iron Works) it doesn't smell like sweaty climber's feet. So worth it.", "date": "10/8/2008"}, {"review_id": "4vguu7_YcgHzx5vis2GKJA", "user_id": "brR3_xcVublpFQ4Am1iO_g", "user_name": "Eugene R.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It's not a best place for a beginner, 5.5-7 routes are very short and there is only one 5.8 and 5.9 (I have no idea how this is going to change in the future). If you can do 5.10 and up or want to boulder it's a great getaway from crowded Ironworks.", "date": "1/29/2008"}, {"review_id": "vKEfainnPzuAp_ExF4flAg", "user_id": "Ug56c7d8Gd6mKiSLIzI1hA", "user_name": "El C.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I like this gym a lot - I only wish it were bigger! The whole second floor upstairs is weights, cardio machines, and classroom. Downstairs is climbing and bouldering. The routes are extremely high quality - tricky problems and very interesting features on the wall, especially the dihedrals (that's inside corners and crevices). I don't particularly care for the gritty texture on the walls that roughs up shoes and skin and makes it too easy to smear your feet on the walls, but that will fade with time. It is really empty during the day, just like Ironworks, so all y'all students and artists and self-employed PLEASE get your butts to they gym between classes and leave weekday evenings to the worker bees.   Oh, and it does seem somewhat geared to higher level climbers. The lead cave is almost all hard 11s to 13s. And because of the size of the place, you're usually only going to find 1 to 3 free climbs at any given grade, whether it's 5.7 or 5.10C or 12A. Which is really limiting if you climb below 5.10. The bouldering is a bit better for variety at the easier levels.  Conclusion: This is a great place for dedicated climbers and folks who just want to use the gym equipment. Not so good for large groups of beginners or kid parties.", "date": "3/19/2008"}, {"review_id": "_nUf6g-i4KkcG4oIWJ1A-w", "user_id": "V1VbVvnt5uKxH4LJEqcNYA", "user_name": "Jacqui W.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my favorite gym out of all the other Touchstone gyms. The staff is super friendly, laid back and helpful. The gym doesn't reek of smelly old socks. It's much nicer than the other rock gyms that I have been to.", "date": "12/27/2008"}, {"review_id": "WK_o3DWgzvSyZ7bSfpHpgA", "user_id": "XslwtAAgcTQKOwWOBGIq0Q", "user_name": "caitlin c.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "so fun and addicting.  clean, friendly staff, awesome gym upstairs, not crowded.  The price is very reasonable for what you get.", "date": "2/15/2009"}, {"review_id": "mwX_HwCXqFeq0U6gTaaW9g", "user_id": "UydWxQsxMfzLhbCRGZCc-Q", "user_name": "Isa M.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "My car's window was broken at the parking lot next to their building, and this seems to happen frequently (they had signs inside). I do realized that this is beyond their control, but it is definitely something to keep in mind.", "date": "12/19/2010"}, {"review_id": "APAgptoDMSKAkIQRxQXYOg", "user_id": "pUGFgqhAdhR7C7ErutFGdg", "user_name": "emmie k.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "gwpc is a nice addition to the touchstone gyms in the area, though i think if this were the only place i climbed, it would lack variety after a while.  the slace is cool though, and since i mostly climb at ironworks, i like the additional height and variety of having two gyms in close proximity.  the bouldering here is a little taller than at ironworks, and there is a beginner area with shorter routes graded 5.5-5.7", "date": "2/3/2008"}, {"review_id": "61Y-KpbpV3_BKEZTVp4Pew", "user_id": "J1jCtSz6dRdw4LMXsgJpwQ", "user_name": "myra O.", "business_id": "NNloS0Q6nDRX4V4x0MaC6g", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "OMG! This place was such a stupendous disappointment. The gym here was waaay too small, and some members of the staff were ...how to put this gently...not that sharp. I'd suggest sticking to iron works.", "date": "9/9/2008"}]