[{"review_id": "TPDjyaE1M4Ms_KWv7RwB6w", "user_id": "v4CjRxJEVNPtAAhbbqmncQ", "user_name": "John W.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Incredibly friendly people and atmosphere, regularly updating/changing their routes to keep things interesting.As someone who isn't nimble, with a mild fear of heights (and people), I'm not the ideal candidate for a rock climbing gym...but Grotto is different. Pros: open climbing area with a lot going on, all different skill levels- Yoga classes - Free-weight/gym area - Dog friendly - Shoes/chalk always available as well as gear discounts  - Classes for novice climbers/kids- The staff is very friendly, and people are even allowed to bring their dogs. - Staff/management isn't aggressive about selling you on an expensive membership or gear, but they do have deals for people who are regulars.Cons: Can be expensive (?) possibly compared to a conventional gym (chuze is the cheapest conventional gym), but you get what you pay for and what you put into it. If you're only going once a month, just get a day pass.Bottom line: Try it. I might go once a week but I feel more sore doing an hour of climbing than I do from multiple days in a conventional gym each week.Note: due to an accidental miss on a discount by one of the newer associates, one of the managers (Brad Gibeaut) was able to reimburse me the difference and then some, I now have a great pair of climbing shoes and will probably end up spending what I saved on my own bag/chalk etc.", "date": "5/20/2019"}, {"review_id": "UbmPQMdJ-aIRBQWyd51N_A", "user_id": "5WNpVilRzHWPky9uZNsQtw", "user_name": "Coleen J.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I visited San Diego for the weekend and was in dire need of a climbing gym so we decided to give Grotto a visit! PROS: - ample parking in the back - helpful staff - cardio machines - curved treadmill - interesting walls with a good variety of kinds of problems - relatively large training area - good deals for first time members - 40% off a day pass by checking in on Yelp! - large, clean bathrooms - an array of fitness classes available- ping pong table - dog friendly!! (so many cute pups during our visit) CONS: - not the biggest gym", "date": "5/16/2019"}, {"review_id": "HdyTkHsnClghqT0INyK8Og", "user_id": "lfAVJ_fr6p56JIGZI47IhA", "user_name": "Sylvia G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "If anyone else was like me and nervous about trying stuff out, don't be!  This atmosphere here is super low stress, people are friendly and willing to give some advice if asked. They change their setups about once a month.Oh and, also, so many dogs.  So many Close to SDSU, gonna make this my go to bouldering spot!", "date": "5/15/2019"}, {"review_id": "SCZH8NaZ1aH4oFVjKHNIMA", "user_id": "eijfUFNF6flY-cY4Ff6BIA", "user_name": "Margaret D.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I've been wanting to try bouldering for a while because there are actual boulders near my house. However, I also like not dying, so decided to try this out in the comfort and safety of a gym. I bought a month membership for $48, which includes yoga and shoe rental. Because a day pass is $20 and shoe rental is like $6, you only need to go twice before you get your money's worth.Sam helped me out with shoe fit and an introduction. She was very sweet and helpful. She even showed me how to do a pull-up (with band assistance, for now!) in their outdoor weight yard. People are friendly in that they smile at you like you are human, but also leave you alone, which is nice. I still don't know about the different grips, like how to hold onto the pieces that don't have the fingerholds built in. Apparently there are different grips with different names that you can learn about-- someone else told me. That would be helpful info to know as a beginner who was at a loss as to hold onto certain pieces. The only negative is the shoes are super smelly. I don't know whether they spray them but if they are, it's not working that well. Bring a separate pair of socks.Also, make sure your nails are short.", "date": "4/29/2019"}, {"review_id": "9e3JknxFo4t1SBTwpy08iQ", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 7, "funny": 5, "cool": 6, "text": "I believe that this has to be one of the nicest bouldering gyms down here in San Diego. Grotto was only open a few years ago, so the gym itself is fairly new, but the vibes here are classic. I love the atmosphere of this place and the variety of climbs that this gym offers. When they have climbing competitions those are sure a hit because they prizes are pretty legit. When you walk in you can take a look at all the walls. There is the overhanging arch, that leads into a cave like area. Straight ahead is some fun technical climbs, and to the left is your overhanging climbs and across from that is your slab problems. Past the slab problems leads a door where there is an outdoor area built for training and getting your strength up. Back inside there is a yoga room, as well as some cardio machines and a small area for stretching. They have a clean facility with bathrooms and showers available to use. There are also cubby storage by the cardio machines. The guys who work here are awesome. They sure make it easy for those that are starting off, or for any old-timer like myself.", "date": "2/18/2019"}, {"review_id": "AvVxuvgY1g8bFDt0qQM7zQ", "user_id": "xRfZSpbXSsz60yLcr_zFcQ", "user_name": "christine c.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "I've been going to the Grotto for almost a month now. Love, love, love doing yoga here! The instructors have been super helpful and sweet within each practice. I highly recommend for anyone looking for an inexpensive yoga membership to join the Grotto! The reason I'm giving this place 4 stars is because of my first time climbing experience this morning. I'm sure this place is awesome for experienced climbers, but as a first timer coming in with my friend, we were pretty lost. The person at the front desk was not helpful at all- we were pretty much left to our own devices, really. Etiquette and safety? Have no clue. I wish she could have pulled aside a worker or something to give us a rundown of the facility. I'm hoping an intro to bouldering class happens soon so I can attend. Nonetheless, my friend and I still had a great time.", "date": "3/2/2019"}, {"review_id": "9XrEWbYrlpC2TMCkj4Torw", "user_id": "3sVC_jyU2mqQhpVkeJlcQw", "user_name": "Einna S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 6, "funny": 1, "cool": 4, "text": "My man surprisingly purchased the month intro pass and I honestly fell in love with the art of bouldering.  The staff is chill and the people are cool.I even met a pal to boulder with here. This place slowly helped me lessen my fear of heights. It's a great workout without thinking about it.  I enjoy the challenges that each route entails.  The place is clean. Trust me,  I have been to \"SMELLY\" gyms and this one does not even compare.  Highly recommended!", "date": "1/16/2018"}, {"review_id": "Awrm5TchWSLcvLGh1_CiNQ", "user_id": "wOdRrBK1nXaTVCn8lYiOhw", "user_name": "Vida F.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "I came to The Grotto initially with a Groupon. I had no idea what I was doing and had many questions! I assistance with by far the best customer service I've ever experienced and comfortable immediately! I signed up for membership that day! I've made many new friends at The Grotto and enjoy bringing my friends with me! The prices are great! There is also a small gym connected that allowed me to cancel my general membership. Weights, punching bags, climbing walls, and yoga! I'm completely satisfied!", "date": "4/1/2019"}, {"review_id": "QTwy0CeVSsifFI4yP33RLQ", "user_id": "LWcONKCeWGLaYn6eqEtUmQ", "user_name": "Heather G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "I can't say enough amazing things about this space! I came for Rex's yoga class, stayed for the yoga and stayed even longer for the climbing. There's something for everyone in this space and it's truly one of the best values in San Diego for fun activities that help you find mind+body+spirit balance. Would love to see you Saturday or Sunday mornings at 8 a.m. for yoga! ‍", "date": "3/13/2019"}, {"review_id": "xWHwC0qhk03Nj75zW8qLQA", "user_id": "0FUv_CTsXFyKJjE0Sz3GbA", "user_name": "Ashley I.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "If you like good vibes and non judgy people this place is for you. I just started a membership here and compared to the other climbing gyms in SD this place blows the competition away. It has everything you need. If you're just starting out of an advanced climber then the challenges are there. First night I went was on a Friday it was super packed by any means. I went alone and I had people motivating and pushing me who didn't even know me. Honestly so stoked to continue to grow with climbing with this gym. Stoked! Yeeewwww!!!", "date": "2/17/2019"}, {"review_id": "r2lLe4tRaEzts8bI2W59TQ", "user_id": "TpbiCeOknX6HQA2wUfYbEQ", "user_name": "Bradley G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "This is definitely my happy place. All the people are so encouraging and the staff are super knowledgeable and friendly. They switch up the routes weekly and it leaves a very new and fresh feeling to gym every couple times you go. Yoga!! Yoga!! Yoga!! Sound the alarm. By far the best value dollar for dollar yoga program in San Diego. Experienced teachers with amazing attitudes that genuinely care about The Grotto's clientele. If you want to get strong in the company of good people , The Grotto is your gym!", "date": "7/19/2018"}, {"review_id": "AB76f4vDksPv8-gWAGbH_w", "user_id": "f3byhiFoo7RObq9MluMLrg", "user_name": "Aubry W.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Literally my favorite place in San Diego. The climbing community here is incredibly supportive and welcoming. The climbs are dope- super challenging and fun. + tons of yoga classes.", "date": "7/31/2018"}, {"review_id": "wiWALfVrEF8yKUNBe-7RQA", "user_id": "NXozRBbYbaM-3YQtv7IUWw", "user_name": "Darren L.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I've been going to The Grotto since they opened over three and a half years ago. They really have a lot of love for the climbing community and it shows. After visiting gyms in several other cities, I can say that The Grotto has the best routes hands down. The color coded hold system is the best. The other gyms use tape. The staff keeps the place super clean, even washing the holds regularly. The community is friendly and helpful. I really value my membership there and intend to keep going.", "date": "7/25/2018"}, {"review_id": "H9nw2NvZ44fR5fF3jhgATw", "user_id": "BWr9e1uFPsLKO4xbWfN2Ng", "user_name": "Jenifer F.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "We got a day pass while visiting San Diego. The staff was friendly and the bouldering was great. They had a small aerobic gym section that was well equipped. Restrooms we're clean and we all had a good time climbing.", "date": "12/19/2018"}, {"review_id": "L0eQ9uj3Wc3BGaA3CREeZg", "user_id": "CfgjBS3wDdQDvclYENy7Ag", "user_name": "Kelli F.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Born and raised in San Diego, we come every summer to see the Grandparents and family.  I found the Grotto 3 years ago, when my kids wanted to try climbing.   This is our 3rd year coming for camp.  My kids ask for it every year.  We live in the Bay Area and while there are climbing facilities, there is nothing like the Grotto with the vast bouldering options.  Nothing.  Grotto never feels like I'm dropping my kids at an overrun kids space- everything about the facility is professional: the cleanliness, the bouldering walls, the class size. Maybe I got lucky with every drop off and pick up, but the kids appear happy and in control; ideal for campers, and adults that come to climb.  My son likes the camp because they give climbers some independence- not spending half the time watching and waiting as their classmates climb.  My only negative: I have to drive 500 miles to get here.  (Grotto- PLEASE open a facility in Marin, Ca! !)   Until then, see you next summer!", "date": "8/10/2018"}, {"review_id": "qBf5BmLnaemQiIov-oPpFg", "user_id": "0fNjJDZmIDV9HOAvsEgDCQ", "user_name": "Mosa M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "So if you are looking for a solid spot to boulder and feel comfortable and welcomed you can stop searching, you've arrived at The Grotto! The walls are partitioned and the schedule for when they chance is clearly posted so you know when you're favorite route will be switched out.Routes are color coded for everyones convenience and there is a wide range of problems for beginners and experts alike. The outdoor area has a full gym, hangboards etc. They also have more routes outside too!There is plenty of varying cardio equipment, jump ropes, TRX bands for you to get any kind of amazing workout.They have a convenient healthy food vending machine and a ping pong table! Locker rooms come equipped with showers, scale and lockers for your belongings.Bottom line is that you'll never have a better boulder sesh and feel more welcomed than you will at The Grotto.", "date": "6/12/2018"}, {"review_id": "IEiWqMtbkbwKIaCh21iGug", "user_id": "pe1YrixZWUlUNwBdChkulA", "user_name": "Adriana D.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Funnnn without all the hassle of rock climbing harness thingys since it's just boulder! Took my Bf and it was so funnn still sore", "date": "4/3/2018"}, {"review_id": "gtRT-FygzFk9iK6tddnTeQ", "user_id": "Kwj0OnUBnkXuJu1dbcesVg", "user_name": "Darlene N.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Friendly and welcoming staff! When I went to UCSD we would drive out here to climb. UCSD has an on campus climbing gym, but it's much smaller. I would say that the grading here is on the harder side, but I think that it's made me a better climber. I like that there's a wall outside the gym. I've also taken a yoga class here and it was really relaxing but also challenging.", "date": "9/18/2018"}, {"review_id": "yP3VOl5WNe35gQu3L7bK4g", "user_id": "VOMnbpOOIz9b4BjxV7B2hg", "user_name": "Jessica L.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I decided to try out the one month pass then to write a review. But after just the first visit I am in LOVE! The place itself is a little small and run down,. But still great walls and workout equipment. Mainly thou, this review is for the front desk girl/girl who does the Wednesday night women's climbing (have not been yet), her name is Sam! I went one morning to check it out, maybe one or two other people there. And she showed me the ropes and her \"5 min intro instructions\" turned into her helping me the whole hour and a half I was there. Growing my confidence. Showing me the best way to learn. Literally the best customer service/human kindness ever! This place better not loose her. It would be a huge loss!! Thanks Sam! See you Wednesday!", "date": "2/7/2018"}, {"review_id": "sMP9iNAxMlWyeQuvLRZFXw", "user_id": "OL2lDQMRt3BAaV--DASpUQ", "user_name": "Jonathan C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Join this gym in January, this place is pretty good!  I love that they have a roof area, which I'm training for a roof climbing trip in June.  I'm a old vertical hold guy and also have membership at solid rock/new vh.  I must say that I'm really enjoying the vibe, climbs, training area at the grotto.Parking can suck at time but that's a good thing because that means a lot of people are there.  You can park at adventure 16 down the street.Get the membership deal in january.  Also don't pass on the black friday punch card deal.", "date": "2/28/2018"}, {"review_id": "AFodcpCeRRTzXY-JMhNLMg", "user_id": "gTuzxeadzk9ai668I26P1g", "user_name": "Jennifer B.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "The last time I came in I was mocked by staff for my English. Some comment about how English must not have been my best subject. That's funny because I received that comment after discussing my background, including a full ride to UCLA. Jealousy reared it's ugly head quickly.", "date": "10/20/2018"}, {"review_id": "xp0ozlX839VjkBLjRB1img", "user_id": "mQZ8VmbLwmr3jtisHt7MBQ", "user_name": "Dyryl B.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My first bouldering gym! My friends encouraged me to try it out using their free buddy pass. All I had to do was rent some climbing shoes. Definitely got hooked! Signed on as a member that very same day. The fellow climbers are really encouraging and will show u tips on the route! There's a weight area and cardio area too. I've tried yoga for my first time here too and the instructor was phenomenal! The staff is really cool and they play some dope tunes throughout the day! You'll definitely meet some great friends here!", "date": "6/12/2018"}, {"review_id": "UXWY62p-a2KGcQjp7trqBQ", "user_id": "7dLmmw4ZLkXJKbAQAuLA6w", "user_name": "Amands L.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Grotto is more than just a climbing gym. It's been a second home and family since I moved to San Diego. The people who work here are incredible and truly care about everyone who walks through the door. I have a hard time climbing anywhere else when I'm traveling because it isn't the same. The setting is top notch and they are constantly improving their equipment in the training yard, adding fantastic yoga classes (myofascial release is my favorite!) and planning outdoor day/weekend climbing trips. Grotto might be smaller than other gyms in San Diego but it provides more than you need to become a better climber. Come join the family!", "date": "6/6/2018"}, {"review_id": "sB1vKla5mXIMscXwE-daQg", "user_id": "IbN9r55GnTCkNodvimsu1w", "user_name": "Brent N.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "If you're looking to have fun, get in shape, meet some new friends, love climbing or all of the above you've come to the right place. It may be smaller than other climbing gyms around San Diego but it packs a lot. Membership includes free weights, a small cardio area, punching bags, training walls for more serious climbers and of course amazing bouldering(climbing with no ropes). This place screams out positivity and everyone is amazing friendly. If you've been looking for that extra boost of good vibes in your life look no further. You will find nothing but support and help from both staff and members if you're a new, intermediate or advanced climber. I absolutely love the staff, they make me feel like part of the family there. Lastly if you're just into yoga, the instructors here are amazing and friendly. Can't say I have any complaints, five stars is an understatement.", "date": "8/21/2018"}, {"review_id": "iS3PzWUhkgXFtn0Zgy_moA", "user_id": "9GvMfx6qN6RcWc2CxuVjTw", "user_name": "Yuval A.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great way to get fit, I came for the climbing,Different degrees of difficulty for beginners and professionalsLots of fun.", "date": "12/23/2017"}, {"review_id": "vjLfjHACagJrmYHEB5bE3w", "user_id": "HVZ9r0geog8pz5RSgrSGFw", "user_name": "Rob W.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "As a long time bouldering guy and a big fan of working remote... This place is shockingly good and membership is pretty darn reasonable. It's tucked away, mind you.But the community here is warm and gracious. Prices are reasonable. And walls get changed up every week. Difficulty: Paths seem to be marked down. Meaning something that would be a V2 elsewhere might pass for a V1 here. Be prepared to be challenged.Like Mesa Rim, paths seem to be particularly burly, meaning you'll need to rely on upper body strength and endurance more than technique and legwork to finish. (Strong hand holds but chippy or otherwise questionable footing).Other amenities: WifiClimbing classesYoga and AcroPing pongBalance boardBig Ole Tractor Tire that you can smack with a sledgehammerWhat more do you want? :)", "date": "10/12/2017"}, {"review_id": "R_GwX-aWLBAzumhRJPYbsQ", "user_id": "67P0G-hv8Sz7PKBK35UKDw", "user_name": "Jeffrey K.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Lots of fun and the people there are really nice. Great for taking friends and practicing rock climbing and other things.", "date": "7/26/2018"}, {"review_id": "9KlA76egd5dWAWZ8Y3n6yw", "user_id": "jBQ8SwSXXk1UvMhHgwbmGg", "user_name": "Adam D.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 8, "funny": 0, "cool": 1, "text": "This place is pretty sweet!I'm a regular at the Touchstone gym series in the Bay Area, and needed to get my climbing fix while visiting family in San Diego.  Unfortunately the first thing I noticed when I walked in was the smell, which reminded me a little bit of BO, mixed with a stale and musty martial arts studio.  It was a little unsettling at first, (perhaps nobody notices it because they're used to it...) But it was immediately apparent to me. After a little while I didn't even notice it anymore.In terms of the ratings, I know there's a big difference from gym to gym... But coming from Great Western power company, or Berkeley Ironworks... These routes seemed a little underrated, as in they should've been rated higher. I'm normally pretty solid on the majority of v4/v5s with the occasional v6/v7, and I was only able to do one or two v5s and surprisingly, none of the v4s here.  Could have just been an off day though.I'm here for the week, so I ended up getting a two week pass for $50, which also includes rental gear... which is great!  I love how it's all bouldering, and there are plenty of routes: cave, small wall mantle, dyno, upside down stuff... and the walls are a little taller than I'm used to, which was a nice challenge.  Last thing I'll say, is that the music selection was uncomfortable.  It started off great, with some funky/neo soul vibes... but quickly divulged into some pretty raunchy gangster rap that featured the N-word almost every song.  The main reason why I even bring it up, is that it was unsettling (having not a single person of color in gym) to be around a bunch of white people blasting music that features racial slurs.  I'm not even sure if anyone was really aware of it, maybe just something for the staff to consider.  Coming from Oakland, something like that would never fly! OK, enough rambling... Overall great spot! Excited to come back.", "date": "8/2/2017"}, {"review_id": "weEQgCd95FT622Rd6h9C0g", "user_id": "DNEIl7O735sk-XKANREHMQ", "user_name": "Fabian S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "By far the best climbing/bouldering gym in town! Always friendly and helpful staff. A lot of cool changes have been made to the gym and now it is even a greater atmosphere with amazing art work, new workout equipment, moonboard, acro yoga and just simply cool folks that make up a great climbing community in San Diego. Since opening I have been to many of their events and a few community outdoor trips where I met a lot of great people and friends.", "date": "7/20/2018"}, {"review_id": "lKtnU0QbABPa36UTaIqC2Q", "user_id": "ZwtXbFyw_knYmmHZtBkxVw", "user_name": "Amanda A.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I tried out some other rock climbing gyms but this one is the best for bouldering. highly recommended", "date": "4/23/2018"}, {"review_id": "NGY3gvrXeJIBBzf1smELkQ", "user_id": "RG7XclzMPy52_qm9fez0_w", "user_name": "Dan S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I don't write a lot of love letters and I've never been a gym person but when a friend of mine introduced me to Grotto a few years ago I instantly fell in love with this place. The staff are truly amazing and knowledgable. I frequently ask for advice on both climbing technique and weight lifting and am always stoked by the help provided. They change up the routes frequently and in my opinion have some of the siiickest bouldering problems of any indoor climbing gym i've been to (I travel a lot and enjoy visiting other gyms) - the route setters are just amazing. The yoga schedule offers something for everyone and the instructors are all wonderful. They open early which for me is great because I can get my workout in before heading to the office. Their training area is very comprehensive with free weights, training boards and the awesome Moon Board. However, I think the biggest plus for me is the sense of community that they foster. They offer regular outdoor climbing trips and workshops for members which are great for improving as well as testing out your skills. I've made a bunch of new friends and it is truly my happy place!", "date": "7/20/2018"}, {"review_id": "gdSWBLD9k99C5ucKWUReRQ", "user_id": "3aRZkYCUW0SGCfkHWtAtmQ", "user_name": "Elias P.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Wow this place was awesome. I work as a Youth Program Coordinator and we had an event here with all my kids. The manager Brad gave me an awesome deal, and the staff  on site Allie was super helpful on the day of. She worked with us to get everyone gear and gave us a safety demonstration. They were totally cool about us using the patio to regroup and eat lunch. Clean, professional and friendly staff who work with you. Will definitely come back back. 5 stars.", "date": "4/1/2018"}, {"review_id": "vEAyd9MMkOu-yezZUXNw1Q", "user_id": "t97lil4gDlwO3kQm-l9Ubw", "user_name": "T T.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I took my daughter here when she was 4. she is 6 now still love this place . Very nice  establishment. The staffs are kid friendly and helpful !", "date": "2/15/2018"}, {"review_id": "H7MbhFb4-GxRGEQfTWfRdA", "user_id": "jUGewcZ66s5HBcqJyuCaGQ", "user_name": "Chhai M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 4, "funny": 0, "cool": 2, "text": "Got a livingsocial deal for 2 weeks free to this little nook of the gym hidden between all the freeway intersection around mission valley and downtown.  The place is a bit hard to spot unless driving a bit slow on a sunny day, but the vast amounts of parking make up for it.Once there, the guy (I want to say his name was \"Matt\") was incredibly friendly and was excited for me when spotting my livingsocial paper, as if I had a golden ticket in hand.  He gave me my shoes and chalk, a brief tour that took all of 5 minutes, a quick lesson on gym rules, and then let me run wild and free all over the courses offering to spot me if (and when) I needed it.The facility is small and focuses only on bouldering with not much land for expansion, although they do seem to change their routes every other week to a month according to a map I saw on the staff board.  The V0's and VB's are tougher than you would expect a la Mesa Rim experiences, so it might seem a bit overwhelming for beginners at first.  However, anything above provides a great challenge and both Matt and the patrons seemed always willing to lend a helping hand in plotting your next move.  The outdoor gym is nice, though seems to focus solely on core and upper body strength, so don't expect any casual cardio equipment when you come.  Why would you come here in the first place to go running anyway?The upstairs lounge with outlets and the free wifi are a nice touch for people who are heading to or coming from work and have to stay connected. The bathrooms seem clean and supplies well kept, as with all the rental equipment.The biggest appeal is that for such a cheaper price than Mesa Rim ($25 for day pass with all rental vs. something like $40ish at Mesa), you get a more intimate and friendly place to climb.  Not to say that Mesa is unfriendly by any means, as I still love that facility, but with the closer knit community that Grotto tries to build it feels like I was getting more bang for my buck somehow.", "date": "2/11/2016"}, {"review_id": "IZV5HxxKm8uD1-RDG8z5SQ", "user_id": "41aO5xpifpJzhUG6fCY1qQ", "user_name": "Gaby J.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "Front desk service can be a hit and miss. I think the guy at the front was more interested in gawking at pretty girls and talking to regulars than making newcomers feel welcomed. When I asked him for a tour, he was a little peeved and asked his friend if he could be excused. Even though I was a customer, I felt I was intruding his privacy and time. I tried to ignore it by thinking he was having an off day but he did it again the next day and the very last day I was there. What the effing hell?! The only time he feigned interest was when his manager was watching. He made me feel very small and insignificant (not cool). On the other hand, the co-owner PF is very nice and helpful as I was a bit concerned about the white supremacy symbol found in many of the grips. Although PF assured me they were just the grip manufacturer's logo, I can't confirm or deny this reasoning as I find no such symbol online. But enough of my concerns, let's talk more about the facilities. The yoga instructors are amazing. I especially like Mara's Acro Yoga class on Wednesdays. The room itself is absolutely delightful with surround sound speakers and plants hanging off the ceiling and if you're a member, you can borrow a mat for FREE at the front desk or rent one for $5 if you're visiting. Unfortunately, the indoor gym is a little dated and stuffy due to poor ventilation while the outdoor gym has rusted weights and miscellaneous parts strewn about. However, it has a great view. (Every time I'm outside, I feel like Rocky Balboa in training, which is a very cool vibe) Plus, they spend a good chunk of their revenue on their walls, which equals to a new wall every week! YAAAASSS.If you're interested in bouldering at Grotto, I recommend Groupon or a friend's referral. Overall, my experience with Grotto has been positive (thanks in part to its supportive members and most of their staff). And after two weeks of bouldering, I definitely saw some definition in my arms and abs as well as a lack of height trepidation (my greatest fear on the first day would probably be falling to death).Parking Tip: If you don't mind walking, there's ample parking at the Park and Ride next door.", "date": "6/15/2017"}, {"review_id": "8a4tNw_HWiP3cwkYD21tXw", "user_id": "YGo2xSPQ09A2xjT7XcSujA", "user_name": "Jason G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 2, "cool": 0, "text": "I don't mind comin' hereAnd spendin' all my time'Cause when I'm climbin', oh so nearI kinda lose my mind...Grotto is just what I needed!  Ok, no more Cars lyrics.  Sorry.  I'll get to the review.  Grotto is a great welcoming place for adults and kids alike.  My daughter and I got memberships at the end of last year.  We've been climbing together for a couple/few months now and loving it.  The employees are helpful and easy to talk to.  The other members/climbers are cool and happy to assist newcomers such as ourselves.  Really cool kids club and summer camps.  Ping pong table is a cool way to cool down and relax before leaving.  Highly recommend checking this place out if you are in any way curious.  Members get free guest passes to hook people up with every month.  Message me if you want to check them out for free.  I'm happy to share the love with my fellow Yelpers.  And going with me is a great way to feel good about yourself considering I'm like the weakest person and worst climber there.  You'll look and feel like a pro!", "date": "3/15/2017"}, {"review_id": "pqERMFAlaHUuppbxLKvTQw", "user_id": "axCODH6SJuMzrNXArmJwvQ", "user_name": "Dawn B.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "This review is for Yoga only. Gym looks awesome but I've only come for yoga through Class PassI followed one of my favorite yogis here; Nam Chantepie. He's now managing the yoga studio. His instruction is incredible & he gives the perfect, non intrusive adjustments. His suggestions are just what I need to get my muscle memory for the asanas I'm just not quite getting. The studio is clean & well supplied. The owner is awesome!! They put on a monthly yoga workshop / party / DJ breakfast that brings in a fun, warm, & welcoming community", "date": "12/15/2015"}, {"review_id": "yOEUeKl-mQS-eVjRL9fc_Q", "user_id": "DNn7TF_GeyqPk5k6YtjFuw", "user_name": "Jonah L.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 5, "funny": 1, "cool": 3, "text": "Love this gym!! My friend and I did the \"couple\" deal and pay $55/moI thought that with a smaller gym I wouldn't like it as much as my previous membership at Mesa RIm but I was very wrong. The open layout that they provided allows for the feel of a bigger gym but at the same time connected to others. There are just positive vibes all around, even the bathroom gives me a calm vibe haha! But I have continued to introduce people to climbing in this gym and all have loved it as much as I have. Highlights: -Smaller, friendly vibe-Owners are very involved. -Outdoor gym -Women's climbing daysMy favorite part is as someone who works with at risk youth Brian and Matt were both willing to work with me to give the kids an opportunity to try the climbing gym. Any gym willing to give back to their community is a winning one to me!", "date": "10/4/2015"}, {"review_id": "_nMbLsCBUpAf8H4-5En_PQ", "user_id": "TBvp0JoXhkgw8AMTFLH2_Q", "user_name": "Seany F.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This review is LONG overdue as The Seany Foundation had an event at Grotto Climbing & Yoga in December 2016. Matt is a wonderful host! He and his team were extremely accommodating. They opened the gym an hour early so that we and our kids could have sole use of the space. They were also very patient with the various special needs and ability levels of all of our kids. We were able to utilize all of the climbing walls as well as the yoga studio. Not to mention- they gave us free reign of their patio outside so we could host a little lunch party with the kids, complete with games. This place is a hidden gem! The kids had a BLAST at this event! We cannot thank Grotto Climbing & Yoga enough for hosting this event and giving back to the community! We appreciate it immensely and would definitely recommend Grotto Climbing & Yoga to anyone who asks about it! Kids, adults, families- there is something for everyone here!", "date": "6/15/2017"}, {"review_id": "15WIP_NvmiQa0qU6dE-HaQ", "user_id": "qdrCx4oSotn96LnZLY6o-Q", "user_name": "Ellie J.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Really fun gym! I would definitely recommend checking this place out. It's pretty new (fresh holds!) and not super crowded (well, I am here on a Monday at noon.) It is sort of on the expensive side, though. It was $18 for a single day pass, without renting shoes or a chalk bag.I haven't had the chance to check out any of the yoga classes yet.One thing I think you should be aware of is that, in my personal opinion, the routes are graded lower than their actual difficulty. Even though I haven't climbed in 2ish weeks, I personally feel as if am still struggling on V1 routes, when at my home gym (in Washington) I could tackle V3s and V4s at this level of difficulty. Maybe it's just gym-to-gym difference and my lack of climbing in the past couple of weeks though.Also, they have really really good music playing over the speakers. Which is great. :)", "date": "5/22/2017"}, {"review_id": "Bji--TRhBu8zPbbiqoJPnA", "user_id": "6iBBFnj4BvtIVOumIPTy7w", "user_name": "Ohad S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great environment, many bouldering routes.Even got ping pong !Back of the gym is a great space to strengthen your core .", "date": "6/11/2017"}, {"review_id": "Xl5cw3ZaiTJ74j488NDFMQ", "user_id": "lTqfGp4m3WAJ8khLjnxm2w", "user_name": "Manilyn P.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "I love everything about this gym everyone is so friendly and the environment is amazing. I go to the yoga classes and also climb almost everyday. I challenge myself here and i don't think a regular gym is for me. Thank you", "date": "6/28/2017"}, {"review_id": "jI9ABaMESPTzxWXPaf9T-w", "user_id": "U6gyi_hAnUHmcXksQiNEew", "user_name": "Aaron T.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "First timer, came for climbing but started with yoga. The staff is knowledgeable, helpful and friendly. Tons of good vibes! Totally recommend Grotto for all skill levels.", "date": "7/29/2017"}, {"review_id": "NvMrpy-s8vVsU-joRXmyow", "user_id": "hRne_cw3XzpeGGWuZ8Nwrg", "user_name": "Jack S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "I bought a Groupon here in June thinking it would be a fun activity for me and my five-year-old son. We tried it out a couple times, and it turns out he didn't like it - they told me that it would renew itself into a membership with an additional 20 for my son, so I canceled.Then yesterday I realized I've been charged $20 per month for July, August and September. When I called to ask them to return the charges, the person I talked to told me to call the next day. I waited and called again - The person I talked to said that they would \"look into it\" and get back to me in just a few minutes. After hours of patiently waiting, I called and asked about it again, and was told by whoever picked up that they would return two of the $20 fees. I called one more time the next day to ask about the third $20 fee. This time I was told that $20 was a discounted monthly rate for my child, which makes no sense at all because I cancelled the entire thing. There were repeated attempts to reroute the conversation to make it sound like he was doing me a favor - by stating that the fee was 55 for students and military, he hinted that I owed them, which was demeaning and insulting. However, he offered to return $5 - to me this was a huge slap in the face. Then he said that he would refund $20, which was another slap in the face, especially considering the previous day I was told that two of the fees would be returned.This is not how you treat customers - if this was my store,  I would have taken my wallet out and handed you what is rightfully owed and apologized.", "date": "9/6/2016"}, {"review_id": "P0iU4YyVzllUWx9rAOj3ZA", "user_id": "1Lhd44JC0FI-cfQjRKD1oQ", "user_name": "James M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Beautiful space and fun environment. The grand opening party was a lot of fun. Vendors and visitors were very engaging and welcoming. Thanks!", "date": "1/12/2015"}, {"review_id": "krdi0vkiO2hS9YtSnpEZzQ", "user_id": "K08Rkf9yxHdB_yw4HaXJmw", "user_name": "Danny M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been coming in for climbing and yoga a couple times a week for the last 6 months or so and this place is just awesome!They've got six different bouldering walls (no ropes, just a nice thick pad at the bottom) covered in routes suitable for climbers of any skill level. Once a week they change out one of the walls, ensuring that there's always a new set of challenges every week. And each wall has a different configuration too: some decline, some vertical, some overhangs, all with a variety of routes for all skill levels. It can get a bit crowded in the evening, but never so crowded that you can't get a great climbing session in. Most of the time spent climbing is actually spent resting and waiting for your arms and hands to feel strong enough to try another climb anyway! The bliss hour yoga class on Tuesdays and Thursdays is the perfect blend of calming meditation and deep stretching. Lena is super professional and knowledgeable and does a terrific job leading the class. I'd only done yoga once or twice ever before this, and now it's my perfect warmup before climbing. Also the class size varies but the biggest I think it's been is maybe 12-15 people or so, usually it's closer to 8, which allows for her to really help each person individually with their form in each of the stretches.If you're interested in bouldering OR yoga, this is the place for you. The fact that they offer both means you can't lose!", "date": "9/10/2016"}, {"review_id": "QSHbeOj4uDZX9cjq-_07yg", "user_id": "ifiWGJm1povN0q0HPeaH3g", "user_name": "Andrew H.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "This place is one of those hidden gems in San Diego most tourist don't hear or know about. Perfect for date nights or simply someone looking for a little more active and adventurous. I can almost guarantee that you'll run into one of the owners, Brian or Matt, who would love to teach you just about anything you want to know about bouldering. I'm always asking them questions and seeking climbing advice. Honestly couldn't recommend anything more fun to do on any given night then to visit the Grotto! Hope to see you there :)", "date": "1/17/2016"}, {"review_id": "--ORC0DoPyRyLB4tIegXkA", "user_id": "zdCT4iSE_E7WSF0Rrp14sw", "user_name": "Angelica M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great indoor bouldering gym!I am looking to get back into indoor climbing and found Grotto Climbing through yelp and a Rush49 deal.  My husband agreed to try it out with me - it was his first time ever climbing and I hadn't done it in years.We both had a lot of fun!  I think it was Bryan who helped get us set up.  He was very friendly and welcoming and gave us a lesson on how to fall safely.  The vibe here is equally welcoming to experienced and beginner climbers and you can really tell that they're very customer-focused. The problems they had are a lot of fun and what I really appreciated is that the beginner problems were doable but still interesting to climb.  We stuck to the VB and V0 problems and had a great time.They also have a nice fitness area out back with a campus board, free weights, pull-up bars and assist bands, and hang boards.We'll definitely be coming back and I highly recommend checking this place out.", "date": "4/16/2016"}, {"review_id": "3g9CF9gjorhSlKYdlonr9Q", "user_id": "ul_oDwN_gp_GhvxHKcBTuQ", "user_name": "John M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Love coming here, staff are super friendly and they change the walls up every week or two. They also have great deals for members as well as work out equipment and cardio equipment.", "date": "12/27/2016"}, {"review_id": "lUGPdBeIJAgBJPb_cz8IJA", "user_id": "Ei6y2MPqQeeKhtd70BxVEw", "user_name": "Dion C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Great little bouldering gym, good service, staff listens about concerns from gym members. Gym goers are really friendly. They update routes regularly and keep members posted. A variety of gym community events are posted on flyers around the gym. They have a training area in the outdoor area to the side which is useful for strength and power type training. They offer yoga to members which is a plus.The only concern I have is the lack of air circulation or conditioning during the day, especially with chalk all over the place. I understand the concept of having the big garage door to allow air to come in but it's just not enough in San Diego where it's hot all the time. I'm not sure if it's to conserve their energy bill, maybe because its a relatively new gym but for regular gym goers this is a downside. They have 2-3 small fans in the gym, but it just doesn't work as well. If this was improved I'm sure this will improve the experience of the all climbers who come to this gym.Edit: They improved their air conditioning and ventilation during the day! A more breathable and cooler gym.", "date": "7/30/2015"}, {"review_id": "iWXIHorlm-eRlj54377NKA", "user_id": "DStp_rXXKX-a-YHdV6yarA", "user_name": "Airee K.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 2, "cool": 3, "text": "I LOVE this climbing gym. I haven't climbed too many times to know how Grotto compares to others, but to put it simply, I have fun every time I come here.I've played here once a week for the last few weeks, and I've already noticed a few changes to the routes. I love their training area outside. Their staff is wonderful. The lounge area is spacious. The yoga room is HUGE, but it gets really, really stuffy.... I hope they improve the air ventilation/circulation in there. One thing I dislike though, is that I always get bit by a mosquito every time I visit because the creek is nearby = not fun. But the gym = fun!", "date": "5/4/2015"}, {"review_id": "8eCPovw6Pg8fDaQ8R50W2w", "user_id": "LV65ZA-Uz6uarhSY5WGB_g", "user_name": "Garrett S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "You will not receive better treatment for bouldering. This gym wants you to learn and grow in every way. From the moment you walk in, they assist you as much as possible to get you on the wall and safely. The yoga is a full experience that is the perfect way to reset your heart and soul for the week. Routes are reset FREQUENTLY. Every week, except after tournaments you will see an entire section being reset. This brings fresh routes to the wall and keeps you guessing every time you come in. The gym yard is fantastic for brushing up on specifics as well as learning new workouts that can benefit climbing as well as your body as a whole. The events they hold are fantastic. The competitions are fair and regulated and above all else, FUN! Even as a spectator, you will find yourself cheering for your favorite climber. Bottom line, you really won't ever come into this gym and leave with anything but a smile on your face. If you came for yoga, you'll leave with peace in your soul. This place is my heaven.", "date": "1/18/2016"}, {"review_id": "6FrJ0KNRhFyD6wEY8nFmPg", "user_id": "We1jbFphOYYpcgo1gCDtJA", "user_name": "Alyssa S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I absolutely LOVE this place.I have never climbed before but bought a groupon with my boyfriend for an unlimited month for like 30 something dollars. go get one NOW!!!!!!! Such a great deal and now I am completely addicted and can not wait to get better at my skills. Absolutely going to invest in a year long membership. The employees are so nice and helpful and the other climbers there create a very friendly and welcoming atmosphere!I thought having no ropes would scare me, but I think it will make me a better climber over all and help me develop a better technique as you don't have the safety net of the rope and really consider your moves (also its not super high, so the fall is not bad and this is coming from a VERY clumsy person).", "date": "1/16/2017"}, {"review_id": "594T57_ggxial_h3sbY0ug", "user_id": "I1Mk9aGY_wJJGrXgsJFP3A", "user_name": "Vanessa W.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This review is long overdue...I was looking for fun summer activities for my 11 year old daughter and her two friends and found Grotto climbing thanks to Groupon. We had some issues scheduling the camp because our 3 girls were the only ones registered for camp, however Matt (the owner) went ABOVE AND BEYOND to make the camp possible for our girls and exceeded all of our expectations. Our girls were able to experience indoor climbing for the first time in a fun and safe environment and very much enjoyed their Yoga sessions. Each day our Girls were excited to come to camp. The staff at grotto was always welcoming and skilled. The facilities were well maintained and extremely clean. Everyone at Grotto does an amazing job at taking care of customers, from the climbing and yoga instructors to the people answering the phones. I can not say enough nice things about this place, I only wished they had a location in the North County. My daughter and her friends loved this place and can not wait to go back.", "date": "10/19/2016"}, {"review_id": "taAyfGEg7aW-AAEcAbkSOw", "user_id": "l4O4r_dfe44DEP8ARdCeBA", "user_name": "Monika M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "This place is GREAT. I'm barely getting started with climbing and I love the support I get here. I have yet to do the yoga but I'm super stoked to catch some classes soon. This place is exactly what I've been waiting for. Plus they have the most inviting, chillest crew. It's definitely a fun experience every time. These new, beautiful holds feel so awesome and the walls are aesthetically pleasing to the eyes. The routes vary for all skills, so every level climber can enjoy what they do, for as long as their feet can take it.The Grotto has some sick ass merch as well, organics for dayyys and sweet,  sweet tees on point. This gym is a MUST for climbers and for everyone who wants to endure the time of their lives. Go get your boulder on", "date": "1/3/2015"}, {"review_id": "ZFadWSC4zmk9GA6lzfH6Gg", "user_id": "ZF5eCJMC0buEo_5rOipliQ", "user_name": "Marco V.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Clean space (energetically and physically), wonderful kind and caring owners, great location...and there's yoga. It's pretty much everything I could ask for our of a climbing gym. I definitely see a bright future for this gym.", "date": "1/6/2015"}, {"review_id": "RokBYYZ1rh-5UTTg2WkmyA", "user_id": "vx96Xh1igbsJbWkGUwkEaA", "user_name": "Jenni C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Warm welcoming vibe! You can tell these guys truly care about the yoga-climbing community and strive to provide the very best. Most excellent experience! I WILL absolutely be back for more!create-challenge-transcend", "date": "12/28/2014"}, {"review_id": "EeUYRfRRlpZYE8M3qg-PqA", "user_id": "8EsF-3ON_UykXZUdLPLHkg", "user_name": "Kelly M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 2, "useful": 2, "funny": 3, "cool": 0, "text": "My friend and I walked in and just wanted to take a look about & get some information. the guy behind the counter wasn't very friendly and didn't have any information to give us. To take a look (not touch or climb) the facility we had to sign waivers and give them all sorts of information which I didn't want to give if this wasn't a place I was going to come. if they want new clients and good word of mouth they need to be more friendly to those who walk in their door.also the facility itself is super small. not sure what the yoga room looks like as again didn't get a tour of the place.", "date": "2/2/2015"}, {"review_id": "A9OJAMZ25lHs5Wu36EyNqA", "user_id": "nZA_PWjsD4-FhSWP2bApYg", "user_name": "Stacey T.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My husband, 2 kids (13 & 9) and I went to Grotto to try out a new rock climbing gym. We hadn't heard much in the way of reviews because it is a fairly new gym. So when we walked in we were surprised that their main focus was bouldering rather than climbing with ropes (this is exactly what we were looking as my husband used to climb back in England and was looking for a gym exactly like this). We were pleasantly greeted by Matt (who happens to be one of the owners) who walked us through the ins and outs. I recently hurt my wrist and wasn't too sure if I would even be able to climb. Matt was kind enough to let me climb before paying which was super cool of him! (Luckily I was able to climb.)Overall the gym itself was clean, spacious and full of different leveled climbing routes to constantly challenge yourself. Staff is friendly. Location is close enough to the South Bay (where we live). And it offers yoga/pilates. We loved it so much that we signed up for a (family) membership! Can't wait to go back and climb more!", "date": "4/27/2015"}, {"review_id": "ZZU3F3w-vGy9oIgwwkVeeQ", "user_id": "aVcv9PtmUH0ycrDIqLsfHw", "user_name": "Evan G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Grotto Climbing & Yoga 5/5.I have been three times and each visit was for yoga.Climbing people were cool and offered to answer any questions.I liked the layout of the gym.  The yoga studio is perfect.  It has several windows and it's own private patio.  From inside the yoga studio, outside music (from the climbing areas) can't be heard while practicing yoga.  The studio was built to the most professional standards and is equipped with all the goodies one can imagine needed for meditation or yoga asana propping and adjusting.  There are NO MIRRORS!  I love this because any true practitioner knows yoga is not about vanity.  I trust the instructors for correcting my position, and posture.  I have taken classes from Jenn Richardson and Maura Daly.  They are both different instructors who play chill music and really know their stuff (yoga philosophy and breath to movement balance).", "date": "2/1/2015"}, {"review_id": "egelqgBZGDVJpFWRA2TAHA", "user_id": "MGQSzKNSxNyPDxwdujCIIg", "user_name": "Sohyun C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "Great chill and friendly spot for bouldering and getting a great workout in while hanging out! Would bring friends and acquaintances here. Yoga classes are sweet also. Love that they're open early in the morning and til late at night. Route changes definitely are motivation to try the ones that are currently out because you just don't wanna miss out. Staff are great and they all climb so it's sweet to learn from them and ask questions about bouldering and such. Definitely worth checking out!", "date": "5/18/2016"}, {"review_id": "272YwNjYakJsiF6as78gNQ", "user_id": "cH8rDA1SJfF5leBOxYUzJQ", "user_name": "Crystal C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Had an amazing first time at Grotto. I've always envied people who could make it to the top of indoor rock climbs. I would only be able to climb up a bit before fear brought me back down. But today I climbed to the top not once but four times! All thanks to Matthew, the amazing staff member at Grotto. He encouraged me to keep going and guided me up the first time. This place is super cool. You can challenged yourself and tackle the upside down climbs as well. They also offer yoga classes, though I have not tried one yet.", "date": "5/16/2015"}, {"review_id": "hiNdT_s5rusiKn5-5SpnBA", "user_id": "b9U7ApcHgaAG47zLTUl1BQ", "user_name": "Momo M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love this place. You can walk out of there beat before you can get tired of the routes they have. The people are super friendly and the locations is conveniently tucked away from all the crazy of SD. Great little place when you just want to go wrack your brain and walk around with T. rex arms for a day.", "date": "4/12/2016"}, {"review_id": "jKHdCbht04SFey8mQYkj1A", "user_id": "P08iBOxOlqqFr9_r4Zw5NQ", "user_name": "Amy G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I am a member at this gym and I've had just a great experience here. The staff are very welcoming and warm. They made a point to learn my name and are extremely helpful whenever I have questions. As a climbing novice, this made a world of difference to me. I think that the prices are affordable for yoga, bouldering, shoe rental, and chalk. There are a variety of climbing routes for different skill levels, which helped me develop my abilities.", "date": "4/30/2016"}, {"review_id": "v0leh0ChdZMq2ZcVxl5nfQ", "user_id": "nIorskblg76Y6vSz2ogFcA", "user_name": "Quentin S.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Killer bouldering and yoga! I took a really awesome yoga class to get loose and then did some super awesome bouldering climbing with some friends.", "date": "6/4/2016"}, {"review_id": "CrCtsBPu6gmU_V0Eo4luVg", "user_id": "d8lNH_Q7D6cCu3E3s4e2_w", "user_name": "Louisa E.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I absolutely love this place, all of the employees are very friendly and willing to help whenever you need it. There are multiple yoga classes throughout the day, so it's great to start off with a yoga class and finish the day bouldering (or vice versa). It has a lot of variety when it comes to bouldering routes, with plenty to do for every different skill level. The outside gym is a great place for strength training, especially for people looking to step up their climbing game. The grotto also holds different events throughout the month such as camping trips, movie nights, and gear demos. I would recommend this bouldering gym to beginners and advanced climbers. The routes are so fun and they are constantly changing so you are never even close to being bored.", "date": "6/28/2016"}, {"review_id": "OrNfRXVwm5zXewh2TtpXpw", "user_id": "V0UO25JrnBZeLk8smANRjg", "user_name": "Katrina C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I just bought a membership here because they have a lot to offer, and as a beginner I felt comfortable and not intimidated. The gym has a nice yoga studio, stationery bikes, and an outdoor workout area with weights and other equipment. The owners Matt and Bryan are really nice and super helpful, and they offer a bunch of classes. Also, there's a monthly women's climbing club which I'm excited about!", "date": "8/31/2015"}, {"review_id": "vFBJWMgkKNZgIUv744NHNw", "user_id": "nUZ6iprvpmSr7XQj_pZDfQ", "user_name": "Christyn F.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 3, "text": "I have been driving by this place since it opened and it kept calling to me.... ok maybe thats a little dramatic, but I was certainly interested. I'd been wanting to get back into climbing after an almost 7 year hiatus and here was a gym right down the street from my house! I went down and signed up for the monthly membership because it's the only way I can make myself get to a gym. I loved it from the moment I walked in. When I climbed in the past it was mostly on ropes, indoors and outdoors, which I found fun, but there was something really special about bouldering that I've always loved!  I was SO happy to see that this is a bouldering gym! I have been going for 3 weeks and I have already learned more about climbing in those 3 weeks then I ever did in the years that I did it before. Matt, one of the owners, is so kind and informative. You can tell he really likes to teach, and he is really good at it. I haven't talked to the other owner too much, but the times that I have my impression has always been a great one. Sam, at the front desk is super sweet, it was her first day when I came in to sign up and she did a great job! Everyone at the gym is so friendly and encouraging, it feels like a family. I took my girlfriend once and she ended up getting a monthly membership as well and is as hooked as I am!The gym has a small cardio area, a weights and training area, the grotto walls, a beginner wall and a competition wall. They do yoga, and technique classes, special events and outdoor trips. I know that there are other, larger gyms in San Diego, but this one feels like home to me and it's exactly what I've been looking for.Do yourself a favor and try them out!", "date": "6/4/2015"}, {"review_id": "TeGX9iBG2Sv0nhqsfrpBIQ", "user_id": "THeSdAPABz1MH5cvONWmEg", "user_name": "Trisha W.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Grotto is awesome.  After the multi-gym-membership company we were using went under, Grotto offered a discount for the first month to those of us left without a gym to go to. (Great couples rate too!)  They were incredibly welcoming and accommodating.  Although we were assuming we were just going to go to the yoga classes, they made the climbing so fun that we're now hooked!  The atmosphere is relaxed and friendly but very professional about climbing/yoga/weights/etc.  I highly recommend testing it out.", "date": "11/16/2015"}, {"review_id": "84NTzgIIF5fvW_0xAnkNtg", "user_id": "b_dywRudhFkQgiAk871M0g", "user_name": "Kristin B.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 4, "funny": 0, "cool": 2, "text": "Took a yoga class last night with Kellie and it was soooo good, great instruction and warm ambiance with dimly lit room, great sound track to practice and nice flow. It's nice to try different instructors in different studios, I'll be back!", "date": "1/6/2015"}, {"review_id": "pCEIHFW1K0kGzqvAI5YS6g", "user_id": "Abc62d9yXpLP-8LjWe_uzQ", "user_name": "Shawn K.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I bought a 5-visit punchcard on groupon and the routes are SO much better than when they first opened.", "date": "8/31/2015"}, {"review_id": "lhubEvMpolcWP-SZS_0nkQ", "user_id": "xXi0n887-8887TSpeU-nog", "user_name": "L H.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Facility is clean, organized and smells amazing! Great staff, I am super excited to start this gym. Got a tour today and signed up! It's what I've been looking for in a rock climbing gym! Totally recommend!", "date": "2/25/2015"}, {"review_id": "SO9v8s4TMHi9egkTHWqBTw", "user_id": "Vv-R_d8V3OgyvR9oNfKMcQ", "user_name": "Bridget K.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This place has a great environment. The routes are awesome and the yoga studio is warm and welcoming. The yoga classes are widely varied, even tailoring special classes for climbers. I highly recommend the grotto to both climbers and yogis.", "date": "3/4/2015"}, {"review_id": "8p7AZA7j2vDttmR7aXsVag", "user_id": "9XcFaKhcsKbF19W8iY27sA", "user_name": "Jenna O.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "This was an amazing gym and fun experience! I really enjoyed Matt & Brian for making this even better :)", "date": "1/17/2015"}, {"review_id": "q1lB5Wu2ve0oUEIl8cMxCQ", "user_id": "5b2CmvDbGGXzwET4pAJW2w", "user_name": "Marco G.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A amazing gym for all skill levels. If your looking to get a great work out, with awesome staff and have a lot of fun, grotto is the place for you.", "date": "10/25/2015"}, {"review_id": "Sy9S86X4HHQ7SP114z9DPw", "user_id": "9P69XZuek8D03hHBNz5k0w", "user_name": "Tamarah O.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I am new to climbing and I absolutely love this place. The location is central and easily accessible. Convenient hours for those who work late (they are open until midnight M-F) . The owners are friendly and helpful too. All around good vibes whenever I go :) They also have a legit training area outside, in addition to a warmed yoga room that offers a variety of classes. If you are also into yoga this place is like hitting two birds with one stone. I'm not a \"yelper\" but this place was legit enough to leave a review for. :)", "date": "3/6/2015"}, {"review_id": "QDVYDwR_O6KSLZyDuJcdWw", "user_id": "wQ1GTXRoS7ZdRdvkQIo1iA", "user_name": "Angela C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "So happy to be a part of this new climbing gym! The staff is awesome and super professional. I love climbing and I love yoga and I love the positive energy this place provides. I have been telling everyone how awesome this place is.", "date": "1/29/2015"}, {"review_id": "oF6dSWJ9ZiQQZDto0w5N9Q", "user_id": "U_zMVi7BDY39_KAgTiSGqg", "user_name": "Andrew K.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This gym is absolutely fantastic, I enjoy coming here a lot. The yoga teachers are awesome and create an awesome environment to learn yoga. And the climbing gym itself is a lot of fun, a great way to relax.", "date": "7/26/2015"}, {"review_id": "zuflLL3AXPQ-GHd95_8rbQ", "user_id": "lBO97YhK8IVmBj0_ZfvO9Q", "user_name": "Phoebe L.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is an awesome climbing gym. The staff is super friendly and willing to give you a hand with a problem if you ask. Things are always being reset which is a bonus so if you come often you can try new routes. There is a wide variety of levels to climb and they are all clearly marked (all the routes are in their own color) There are campuses and hangboards as well as medicine balls, jump ropes, weight vests and a variety of other training tools available. Overall a fantastic place.", "date": "8/2/2015"}, {"review_id": "dRc7Lgs4nhO8lAjHdlu-1Q", "user_id": "pLEETsvEEkGYkO84zncSuA", "user_name": "Jered C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great New Spot in San Diego. I have been bouldering for years and just found this new place. Lots of unique terrain, friendly  staff and awesome open Air lay out.  Got a membership and now im hooked.  5 Star", "date": "5/6/2015"}, {"review_id": "Vlv9faTaECo2EyPbe9ZE_Q", "user_id": "A9Vei-SWb_fX-zvtF4Uzdw", "user_name": "Richard B.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm a big fan of this gym! Bouldering, yoga, cardio, weights, what's not to love! I have been here a few times now and I love the atmosphere and community. The owners are super chill. I really like the routes they have up, super fun and pretty challenging. They better watch out, I might just become a regular here.", "date": "6/5/2015"}, {"review_id": "MhllhaVKzTgSFm7UqSNFRg", "user_id": "s22pHbhp6fzvF4Dl1NkWzQ", "user_name": "Nicolas N.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "When you come to the Grotto, you're getting more than just an amazing climbing or yoga experience, you're joining one of the most amazing communities around. No matter your skill level, you'll fit in. The bouldering problems are set in a way that forces you to become a better climber. The yoga classes are extremely versatile and the instructors are incredible. Additionally, they have hours that appeal to everyone. Come climb with me on Tuesday and Thursday nights!", "date": "5/4/2015"}, {"review_id": "45nYbe4o8rr_3BgoVOCB7g", "user_id": "de8ylUBM-tw1-wBisA_Mcw", "user_name": "Boris B.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Its small. Its a little pricy. But theres something great about it. I always have a good time The bouldering here is best in sd hands down.", "date": "6/18/2015"}, {"review_id": "qrmEkT5Fi5TRsFI6Afbhkg", "user_id": "A6w8-32nRUfN_3Ud75jfcQ", "user_name": "Brandon C.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My fiancé and I LOVE this place.  Bryan, Matt, and the rest of the staff there are welcoming and encouraging.  The routes challenge folks of all bouldering skill levels.  They offer excellent yoga classes, organize outdoor climbing experiences, partner with other businesses for various events, and have a ping pong table.  Thanks Grotto for inspiring our bouldering obsession!", "date": "4/15/2016"}, {"review_id": "5SKHfAEnRWHuIRIAqFIhUw", "user_id": "hKS93-NplJ1hObjU9a4LRg", "user_name": "Zach F.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This is an excellent bouldering gym. The walls are interesting, the routes are interesting, and the staff were great. Apparently they also have a bunch of yoga classes. Although I do like climbing on ropes, I think the Boulder problems here are better than any of the other gyms I have been to in San Diego.", "date": "1/6/2015"}, {"review_id": "G1XVwRCE-5jtgedMCKKL4Q", "user_id": "LlkX-_c7d9dr-RuBY77K1A", "user_name": "Joey D.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Love this place just wish I was better at climbing but I'll get there.  I go weekly for the climbing and yoga the staff is very friendly and helpful.  I would highly recommend this place for beginners and up can't wait to go again!", "date": "4/29/2015"}, {"review_id": "8MxzRCtU-BVNpOMXlMe5cw", "user_id": "F2-PeIj15WjxzMeRYFuqPA", "user_name": "L M.", "business_id": "YPWvUVKWwKXd0o1xIBArfg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This bouldering gym is awesome. The staff is super nice and friendly. The gym is big enough that it never seems crowded unlike most gyms. They have a cave section and several overhanging sections which makes for a nice mix of problems. They even have AC!  I have an 11 month old and he loves it here too.", "date": "7/9/2015"}]