[{"review_id": "huD_AMFwl5Hg2NhBlkji-Q", "user_id": "Fl048iKMuBuNFZPUj9AiQA", "user_name": "Brandon P.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place to climb, meet new people, and let loose! They are always changing the routes, so if you come regularly, you'll never get bored. It's fun to challenge yourself and try to accomplish one route at a time, increasing the difficulty level as you finish each route.", "date": "3/12/2019"}, {"review_id": "zVL5pjFiomOmSF25RYJ1yw", "user_id": "_xzPhxpZr1yXNuxY3AcMxQ", "user_name": "Travis T.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "There is nothing special about this place. Don't waste your time at the Mission Viejo location, other Hangar 18 locations like Long Beach or both Riverside locations are much better. The Riverside location that is off of Arlington is great!!!!! If you are only looking to boulder you should go to The Factory in Orange, CA. The Factory is a great all around gym!!And the \"gym/workout area\" that Hangar 18 Mission Viejo has is a joke.", "date": "5/3/2018"}, {"review_id": "b3rxtZtZ6-e0BG6miDpGdw", "user_id": "1ZjP7d78NgBVYWu9bo2Edw", "user_name": "Kristie N.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "SERVICE (4/5)// my friend and i came on a sunday evening (they have great hours) and it wasn't packed - yay ! the guy in front is chill. not incredibly friendly but get's his job done// for first timers, you'll have to sign two forms (waiver + orientation) ~ 5 minutes// they have a really good deal right now for students: only $36/month for all locations!VIBES (4.5/5)// everyone here's just doing their own thing so it's very chill. some people even helped me out, since i'm still developing my spatial awareness.// very beginner-friendly and also pretty small. next time i'll try out the LB location!// the area is completely \"matted(?)\" and cushioned so you don't have to move a mat around.// it got warm pretty quick.. they had a fan blowing and doors opened, so i guess there's no AC : ( ?TIPS// after a couple warm up climbs, i'd recommend trying out some difficult ones while you're still near your peak stamina.", "date": "9/16/2017"}, {"review_id": "qe6cD2vVKVGDzGQaCOJhKA", "user_id": "96BFtYNLsLTurUGngyPh1Q", "user_name": "Eva R.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great for bouldering. The routes change often so there's always a new challenge.  The staff is friendly and very welcoming", "date": "12/1/2018"}, {"review_id": "s_WIWuaauTxE065pOgD0aw", "user_id": "rT024OojWoPY_zsinrkT7w", "user_name": "Marya J.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Variety of places.  Sadly the two gyms near me didn't have top rope. Kids loved it. But mostly adults here. That's nice because other kids can get wild.", "date": "4/17/2018"}, {"review_id": "edwTFObwjpKpE5EKaRrndA", "user_id": "o3T0tXJGszJ5BJ0bRZHjdQ", "user_name": "AJ J.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is sweet! I am new to climbing and have been coming to here for about a two months. I find it cool that each route is completely different. One thing cool about this place is the awesome staff. They're friendly and always helpful.", "date": "11/15/2018"}, {"review_id": "la7hK8LppvCd3P-jsUMUXw", "user_id": "9CAqOACDsovjVgFI3W34XQ", "user_name": "Michelle M.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 1, "useful": 1, "funny": 1, "cool": 0, "text": "This review is entirely based on the terrible cancellation policy and poor communication skills of this particular location. I liked the gym itself and the girl working there the one day I went, just to be clear.Basically, I went in on a free pass from my boyfriend on 7/10. I had such a good time that I wanted to sign up for a month's pass. She explained to me that my pass was good until 8/10, and if I wanted to cancel, I could do so the day before my renewal in person, or 5 days before over the website/email. Hard times hit, I lost my job, and I unfortunately had to cancel. I emailed on 8/1 asking about canceling vs. freezing my account. The manager took 4 DAYS to bother to reply, so I just decided to cancel since it was the best option for me. So on 8/5 (5 days before my month was up), I cancelled by website.Well, turns out I was charged anyways. I called and the guy working told me that I had misunderstood. I bought a month's pass but it would always renew on the first of the month, so i was charged a prorated $26 on 8/1. I get it. I probably misunderstood and that was my fault. But I explained what happened. I explained that I can't afford it and I literally haven't been back since the first day because I can't afford the equipment. I asked if there was anything they could do. He said they could give me a free month. Which is fantastic since I said I CAN'T AFFORD TO GO THERE AT ALL. So basically I paid for 2 months of this gym to get one good climbing experience and two shitty customer service experiences.Thanks a lot Hangar 18. I will not be coming back when I am back on my feet. I'd rather go somewhere with a little more understanding, or at the very least, a decent response time for paying customers.", "date": "8/17/2017"}, {"review_id": "fRTFQ2MmvcLVF9gfnFu3tg", "user_id": "ui1oV5AlZefxSGmZfyNAXA", "user_name": "Shauna N.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place to go rock climbing esp if you're a first timer. Before we got started, we were given very clear and thorough instructions on how to use the equipment and the layout of the various walls. After we were trained, we were tested while the staff watched us climb to make sure we knew what we were doing. Their walls range from easy to hard and are color coded so you can follow a path up. Climbing was a lot harder than I expected and I was tired out after just an hour! I had a fun, safe experience and a hell of a workout.", "date": "1/7/2018"}, {"review_id": "xUBXqi8tvjuo07ul4xlSKw", "user_id": "qsCwd_5B2vVk-lLmijGt4w", "user_name": "Teresa N.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Wonderful gym for bouldering! The prices here are the most reasonable, especially with the deals. They have BOGO Tuesdays where it's buy one get one free anything. My boyfriend and I split a membership and it was $18 each for the first month! They also had a special during the summer that was $15 for the first month. Memberships come with one free guest pass every month.I think this gym is a really great beginner gym. You can also go to their other locations with the membership. We have gone to the Long Beach location and plan to go to the San Clemente location in the near future.The service here is okay. Nobody is rude... but the LB location is much friendlier.It can get pretty busy on the weekdays. They have AC on during the day, but open the doors at night. It get pretty warm at night. I wish they would just leave the AC on. It's so much better. Overall, great gym. We will continue our membership here for the near future.", "date": "6/20/2017"}, {"review_id": "HcDz0ynwppeA0RcYGJglFA", "user_id": "nerYrQx3HSbw7winUI4naA", "user_name": "ian c.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Place is too cheap to run their air conditioning. It's literally 91 degrees on their thermostat because they don't have it turned on. Absurd. Don't climb at this gym. There are plenty of other gyms around that you can climb at comfortably because they aren't cheap.", "date": "9/16/2018"}, {"review_id": "IJ4pYtKlGmSHQyuxRX9pPw", "user_id": "NTfYFaQxErdFfwYx7zuClQ", "user_name": "D C.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a free-climber's gym. Bouldering only. If you're looking for an establishment with an air conditioned weight room, yoga programs, cucumber water and/or a massage, try Equinox. Equinox is stellar. However, if you want to climb, Hangar 18 MV is a no frills gym with problems at v6 and up, that will force movements to improve your climbing. Ratings don't go up by simply putting the hold further away. They understand body mechanics and set problems utilizing that knowledge, while still maintaining a nice flow through the movements. Best manager in the biz, hiring some of the best people in the industry...period! I'm back in LA climbing Sender, Rockreation and primarily Touchstone gyms, but I will ALWAYS consider H18MV my home crag.", "date": "12/9/2018"}, {"review_id": "1M6NsQ16yy5QrNgQiG6g5A", "user_id": "vb2c3KennXSghR1WG4W9XA", "user_name": "Jennie K.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have friends who are members of other Hangar 18 locations, all of whom enjoy the gym very much. I decided to check this location out because it is located close to where I work, so I could climb between lunch breaks. In addition to this, I am curious about how other climbing gyms are built and I want to climb other routes to improve on my own climbing technique. I came in to see how the gym looked and see how the atmosphere is here. The atmosphere is warm and welcoming-from both the climbers and staff. Curtis, who is friendly and welcoming assisted me wih all the questions I had. He answered all of my questions, to which I decided to open up a membership with them.I currently climb at another gym that I enjoy very much, but, this is convenient for before work!", "date": "3/12/2016"}, {"review_id": "nfnhWNatkkk7Bwap-bShzw", "user_id": "f3vSECJ_t5iopwfffJftKw", "user_name": "Shelby C.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "super fun staff, great music, always changing and rotating the climbs so theres always something new to work on. and i love the new water bottle refill station! the membership is affordable, and the cancellation policy is super clear and the staff gladly helps with any concerns or confusion. hint: the names of the climb are super cute and clever", "date": "9/29/2018"}, {"review_id": "8dE68QrMHGPsEYD8F0FhvA", "user_id": "7dknFCxFAXx1dqRgXEWIcg", "user_name": "Ryan K.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "First thing you will notice is the overwhelming smell of sweat. After two hours of bouldering you would expect your nose to get used to the smell but no. You'll smell it the whole time you're there. Even after two hours.......Long Beach one is much betterStaffs are great though", "date": "5/4/2018"}, {"review_id": "1_NoYNxQfgtKGCFML6fBLQ", "user_id": "B4S7n_hZzv33lP44Sulg1A", "user_name": "Sean W.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I really enjoyed my time at Hangar 18. The staff was very friendly and the prices were the best I've seen, so good my girlfriend and I got monthly passes. They have a good variety of beginner to intermediate routes, which was great for my group of friends. Top ropers, this is not the place for you. They only offer bouldering at this location. The hours are very reasonable as well, and they were the only local climbing gym open on Sunday after 5 or 6.", "date": "7/27/2017"}, {"review_id": "LgPJizQRLgm_DId5RQrLjA", "user_id": "PTA0EEJy5aacie3JxmWIvQ", "user_name": "Alexa S.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I canceled my membership back in December in person. Went into the location, signed something and was told it's taken care of and I won't be charged again. It's March now and I have called 5 times now and emailed Dave the owner I'm assuming? Haven't heard a thing back. Now I have to go through my bank to cancel these $36/month charges ($106 so far). Moral of the story: TERRIBLE customer service and management. Ridiculous & will never be coming back or recommending.", "date": "3/21/2018"}, {"review_id": "IHObMIcBAHLrJrm6XDiA6w", "user_id": "8w-R2hCoJPE0zxUNZVCVuQ", "user_name": "Han D.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My son and I started our first trial month just last week.  He loves this place and he's been here 5 times in a week. When you come in for the first time you have to sign a waiver on line, it's a little tedious but it's just a one time thing.  Then you need to rent shoes, on your first time when you sign up for the monthly membership you get your shoes for free, otherwise it's $3 per rental.  The first month membership for the kid was $9, since I came as his guest and I also signed up my first month was $5! If you want to cancel you need to come in at least one day before the first of the month to cancel.There are a variety of paths to take with the easiest being V0 going up to Vimpossible, jk I'm not sure what the hardest level is since I was just trying to accomplish the V0.It's a fun pastime even for newbies like us.", "date": "6/5/2016"}, {"review_id": "ylnF7Eh_3V7z2nmoSXto_w", "user_id": "7zMnIgzhw0xGt6iYgOT0Cg", "user_name": "Erica C.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place. Super cool vibe, really friendly people, and the workers are awesome. It's a great workout and their walls are always filled with great problems.", "date": "3/12/2018"}, {"review_id": "2fgskki5bm2d8nWn9uIGkQ", "user_id": "vfgnYBZN-S-kKbgV-PITaQ", "user_name": "Jennie Q.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "I came here under a free guest pass from my friend's membership.  The deal for the pass was after that day, I could start a membership for only $5 the first month, $26 the second month, and $32 (regular price) the third month.  I heard that there are always promotions going on, so subscribe to their email! Shoe rentals are $3, which the staff never informed me when I first signed up for the membership.  Luckily, they were nice enough to let me slide for the day.  Chalk is very helpful to get a better grip and they sell that for $5 a bag.  As a newbie to bouldering, I thought this was a great place to start! There's a wide range of routes to choose from.  It's best to come with a friend that knows how to climb properly because I wasted too much of my strength and got tired too fast when I first started.  I hope that the staff there are helpful to the first timers that come alone because it's difficult to really know how your form looks when you're climbing by yourself. Note to the beginners: get ready for rock hard forearms and calluses );", "date": "2/16/2017"}, {"review_id": "Iv3qFpLUIK3pdxVhzTUS-w", "user_id": "ledjPhdbIrMZAKKcLHjh-Q", "user_name": "Jordan O.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I climb here pretty regularly and love it. Even though the gym is small, a section of the gym gets changed once a week so you have something new to climb as well as have time to master trickier problems. Keep in mind that this is strictly a bouldering gym so if you are looking for roped climbs, you'll need to go elsewhere. The staff is friendly and relaxed. Kid friendly too. Plus! It's affordable. What I like about this gym is the sense of community. If you are stuck on a problem, there is always someone around who will give helpful tips on how to conquer the climb. I'm fairly new to climbing, so this is especially awesome for me to gain confidence and become a better climber.", "date": "11/21/2017"}, {"review_id": "7RlTI1jEnRqFVpVkqJkRQw", "user_id": "5b12Ic3ktzPtsStpEdYWVw", "user_name": "Andrew T.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is a review for bouldering beginners.This is my first time here, but this Hanger 18 is very beginner friendly. There are a good number of V0s (a bit too many imho), V1s, and V2s to climb. The deviation is not too big between the levels, so you're not like, \"What the?\"The difficulty level is just right. I've been to the Riverside, Upland, and Long Beach Hangers and by far this one is the best for beginners.If you're looking for more advanced bouldering, you might find something here, but I would not be surprised if you got bored after the 2-3rd visit.", "date": "10/15/2016"}, {"review_id": "culrpcowuK1vm6r0froDdA", "user_id": "1ZtJpUE9M6g4-u1TEXExUQ", "user_name": "Lawrence W.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "Let me start off by saying Hangar 18 is the only rock climbing facility I've used. It's where I first learned to climb and where I'll continue to climb because my home facilities (rancho and upland) are just that good.That being said, I just wanted to say how disappointed I was today when I showed up at 10:30am (they open at 10am) and the facility was closed. I waited for half an hour hoping they were just running late. I finally called over to the San Clemente Hangar 18 to find out what was going on and they weren't even aware nobody had showed up to open. It's frustrating when you're on a busy schedule and specifically make time for something you enjoy doing and nobody shows up to unlock a door. My extended lunch has now gone to waste and I'm working a longer day for no reason.But anyways, don't let this discourage you from giving Hangar 18 a try. I just hope somebody reads this to ensure it doesn't happen again.", "date": "8/2/2016"}, {"review_id": "URtOAZghAmCu-k7zM7mn4w", "user_id": "e55BbQQ8AmU6znagmdEgnA", "user_name": "David C.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 3, "funny": 1, "cool": 0, "text": "I had never been rock climbing prior to this visit, so, as a consequence, I had to pay more, pore over and sign an obscene amount of paperwork, and take a mandatory introductory lesson. I had actually showed up with a rather experienced climber by my side, and she could have prepped me just as well and likely better; however, I was still required to take the introductory lesson, which was rudimentary at best and should not have cost as much as it did. I get it: We live in a litigious society...but still. The climbing experience itself was really cool. It was challenging for sure, and I have to give props to climbers in general for their agility and uncanny strength. I was exhausted after only a short while, but it was fun. Also, all the other climbers were a cool bunch, and they were really nice and supportive.My only other gripe would be that they should have some friggin' stairs (or at least one of those fire station poles to slide down) to get back down after you climb over a wall. The only option to get back down is to climb back down, but, lemme tell ya, I was frightened by the height of the wall and having to climb downward. Yah, I know, I'm a baby, but, still, there was nothing more than I wanted than a safe flight of stairs to get me back down. I climbed back down eventually, but I still would have appreciated some stairs.", "date": "5/29/2016"}, {"review_id": "S0_aDVellTZtFxXhDG-aaA", "user_id": "i767SPmrsR06VQLgGj281g", "user_name": "Connie T.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 2, "useful": 6, "funny": 0, "cool": 0, "text": "This is strictly a bouldering gym. They have a ton of cubbies and I've never had trouble finding a place to put my things, even during busy hours. But there are no lockers or showers, only two individual bathrooms. Compared to pricey gyms like Sender One, Hangar 18's fees are incredibly reasonable, especially with the Groupon (which I bought) and if you sign up for their emails, they always have special deals. And since it's a chain, your membership will get you into any of their other locations as well. But the reason why I didn't continue my membership after my Groupon ended is because of their routes. Their ratings are bit soft. Almost all of their V1s and a couple V2s felt like V0s. V2s felt like V1s, V3-4s felt like V2s, etc. And their routes weren't that technically difficult either. There were a few fun routes, but as someone who sets routes, I believe it is possible to have fun routes at any rating. Yes, it takes longer to set as you have to think through each move and be more deliberate, but it's worth it if the people who climb it can learn and improve from it. And I just didn't feel any major improvement after my two months were over. Another small gripe I have is that the staff and climbers here weren't that friendly. They weren't rude, but they didn't go out of their way to get to know people. Sure, I found one or two other climbers to talk to, but this would be low on my list of friendliest gyms.  I've been to other ones where the staff try hard to remember your name, ask how your day was, and then offer tips when you get stuck on routes. And it's that kind of customer service that really makes a gym special. The same goes for the other climbers as well. And it was such a shock when my friend took me on his guest pass to another gym close by and every one there was so friendly! I don't know if it's the way this Hangar 18 is set up or the people, but I didn't feel as welcomed. (On a side note, I came to the gym one night and the staff were shooting this bottle cap around. One hit my leg and they just giggled to each other like schoolkids who thought they were going to get in trouble. No apologies from them whatsoever. That did leave a bad taste, but I think that may have been an isolated incident and I'll give them the benefit of the doubt.)However, I do think this is a great starting gym for beginners with its shorter walls, easier entry-level routes, and affordable prices. And the Groupon is cheap enough that you can convince a friend to buy and split one with you.", "date": "2/6/2017"}, {"review_id": "yfzvCbPiz_mzLjA_r_dYhw", "user_id": "6K7j8OiLChFflIrh95Pn4A", "user_name": "Elizabeth H.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 3, "useful": 8, "funny": 1, "cool": 1, "text": "3.5 stars.  Randomly drove by this place on my way to getting my car maintenanced. Couldn't wait to check it out.I got a membership here as it's significantly closer to my home than the other gyms I go to, and the price is right.  $16 for a day pass, or $28 for a monthly student membership. It makes sense.This is strictly a bouldering gym. With that said, it is very small.  I could see this place getting unbearably and dangerously crowded.  Surprisingly, very few people come here on the weekends it seems...Even with the size, there are a lot of routes and a lot of variety. However, I found the ratings a bit skewy. Maybe it's because I'm still strengthening my core, but I found several routes that are marked below my usual level quite difficult for me. Further, almost all of the walls here are inverted. If you're a beginner, it will be a bit harder for you to start out.The walls also go quite a bit higher than I'm used to. For me, this took a while to get accustomed to, as I don't usually go 20+ ft when I'm bouldering, and I prefer top outs. I have issues with heights... My first few climbs here were scary! I still feel my heart race a bit when I'm down climbing.  On the same note, I'd feel wary of bringing children here for this reason.There are very few extras here.  You'll find a campus board, a traverse wall (though it only ever has one route), and some weights hidden at the top of a \"top out\" wall, which you are then required to down climb from. Not much in way of variety.There are no lockers, no showers, no changing rooms, etc. There is one bathroom per gender, a little \"cubby\" shelf in the back, and a standard water fountain. That's it. This is definitely a bare bones gym.They open a bit late, at 10 AM. But they stay open until 10 PM. So if you like your work outs after work, then it's a plus. If you're like me and like to get in some sweat before work, it might not be as convenient.", "date": "6/25/2013"}, {"review_id": "R8Q6BfKyvdJdTGIcqXAVpg", "user_id": "ZGKWE9umr5JMoqzk19yAvQ", "user_name": "Mia G.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym. Of all the Hangars by the beach (San Clemente, Hacienda, etc.) Mission Viejo is definitely the most private. They have a lot of beginner V's for the newer people, but favor to the pros as well. The guy running the front desk yesterday made it easy on my first timer friends and we had a good time. I'll be back soon.", "date": "9/21/2016"}, {"review_id": "1hQPlWLty41NwuQQxJi1bA", "user_id": "pb-Fw9SjbDULRRO9LOP8gg", "user_name": "Fiona L.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "It's been a month since I've been introduced to this. I have lots of hours to kill so I decided why not do some bouldering? I searched bouldering and there weren't too many in my current area (Irvine). Hangar 18 had good reviews with only 5??!?! That's good for me. Means it won't be too crowded and less pressure. I came in right when they opened at 10 am. There was 1 staff working the front and he was super friendly and nice. Price is the same as everywhere you go (~$20 whole day including rentals). I'm used to only going to one place back in Norcal so the layout of their walls/rocks were new to me. They have only one section where you could go over the top and then climb down. The majority is just tap out (which is one thing I wish they could change). Their levels ranges from V0 to V10 with +'s and -'s which is pretty cool! As a beginner, I was able to complete V0's and V1's. I also wish they could put more mattings because it feels short and I'm always worried that if I slip near the top, I might land on the ground instead.Anyhow, during the hours I went (10 to 11:30am), there were only like 3 other people. It is definitely not crowded. I feel like not many people know about this place, but once people know, I could definitely see it getting busy. This is solely a bouldering gym, so it doesn't have the many extras that other bouldering/rock climbing places have. There's a small weight lifting area when you reach over the top of the wall. They only have 1 stall per gender, so no locker rooms. I'm definitely excited for the next time I come.", "date": "9/24/2014"}, {"review_id": "T8F8IeF7zhagJA58b-oaKA", "user_id": "SYZZ42Zm9cAKKzZ1Kc0QaA", "user_name": "Nicholas C.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is the first climbing gym I've ever belonged to and I'm seriously hooked.  They switch up the routes regularly so even though it's a little small, you don't get bored. My only wish is that they had a belaying portion, but the membership allows you to go to another gym for that. Overall, everyone is nice and helpful with projects and you see the same people every week so it's a good atmosphere.", "date": "5/25/2015"}, {"review_id": "IqzGZic29eL30QV2dBoJeQ", "user_id": "joGQN89au72Ihr6Bi2DIxA", "user_name": "Daniel L.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Got a special promo for $5 for the first month(don't quote me exactly on that price), and the rest is $28/month for students. Although this exact location doesn't offer top roping, for the price I think it's a very competitive gym. With the nearest gym being Sender One, which I think is one of the best, but it's also one of the most expensive(~$80/month). So for the price, I think this Hangar 18 location is a great deal. You get a great workout, loads of bouldering challenges, and it's color coordinated. I initially regretted getting a membership because I first went to the Long Beach location, which I think Hangar 18 should take a closer look at and maybe invest more time to sort of touch it up? But coming to this location, and the San Clemente location definitely made me feel good about having a membership.", "date": "9/30/2014"}, {"review_id": "Snry56x0Vtz6bzyVKg80Gw", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "It's the 5th Hangar 18 I've been to! I so far have loved all the Hangars I've been to. My main gyms are in riverside, the one on Arlington and the one that I still personally call thresh but is now East Riverside. This place IS smaller than I imagined it to be. I know it's just bouldering which is fine with me cause I love bouldering and sport climbing regardless. But overall it was a good place to climb. Shout out to Ryan Whitey I was projecting a bunch of problems he had set there. The staff was super nice and friendly. It's a bit of a drive out there so I wouldn't say I would go often but aside from that a great place to climb at.", "date": "12/2/2014"}, {"review_id": "GPwLMTd3fIZfe8yDfWWlUQ", "user_id": "EPuRSYqrS05UYn_FRpHMaw", "user_name": "Austin S.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been a member with hangar 18 for just under a year. This isn't my normal gym as its a bit of a drive, but I try to make it out every month or two to keep things interesting. This gym is definitely on the smaller side and is exclusively bouldering. There is a small top out section, but I rarely use it.The walls here are lightly textured and the holds are relatively new. The routes are interesting with a nice mix of vertical and overhung. The routes are geared towards entry and intermediate climbers. The easy routes are almost all ladders and aren't very interesting, even for a beginning climber. But the v1-v3s are plentiful and diverse. V4-v6 is also common and has a nice split between slopey and crimp routes. Like the rest of the hangar 18 gyms, they use colored holds to mark the routes. I hate this policy because I find it confusing, but MV is better than the other gyms at keeping similar colors separate. Overall the gym feels well maintained and mostly new. Its been quiet and mellow most of my visits (weekend afternoons), giving ample time and space on the wall. Definitely recommend checking this place out!For those that don't normally climb, pricing here is fairly standard with what you'll find in the area. Definitely ask about the specials.", "date": "1/31/2015"}, {"review_id": "GF5OtT7CMkkIC-7ANnfBvA", "user_id": "Dp_lahTz91rl157gZVr7Jg", "user_name": "Robert G.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Kasey is great, she helped give us newbies some experience points. She was super helpful and made our membership worthwhile!! Great place to have a good time while climbing!", "date": "4/14/2015"}, {"review_id": "r31qPH_4lxzWnSwx_alHVQ", "user_id": "1JzAF-7GJvpEZGmxDq5SzA", "user_name": "Tammy H.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 1, "useful": 2, "funny": 10, "cool": 1, "text": "This place seriously needs to work on customer service. Apparently, they don't care to make their clients feel welcome, and I have just spent $61 on 4 kids. It's my kids first time, and I will not bring them back here again. They have Wifi but wouldn't give it out to parents who are there. It just irks me how she said no to not giving the Wifi access. How you treat and talk to your customers is key to having repeat customers. Just saying...", "date": "7/7/2015"}, {"review_id": "EdNTB3mUNVeHeM35GAnjYA", "user_id": "hGSQTJzoTx4I4ZLNlkRKbg", "user_name": "TIMOTHY C.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I already have a membership with rock city, but I got a hangar18 membership as well when I went to climb with my friend in riverside who already had a membership at hangar18. I was with my brother too, and we found that if I got a month membership, and I used up my one time guest pass on my brother, it would be cheaper than if we both got one day passes. I used to work near the spectrum, so I tried to make the most of my membership by coming here during my lunch breaks.The people are friendly, and atmosphere is very low-key, which I like. But I don't like the fact that they don't keep the holds very clean. Perhaps I've been spoiled by Rock City, which has a squadron of 'trade-members' who get free membership in exchange for cleaning and maintaining the routes a couple times a week. The holds at hangar18 have been neglected to where the holds are super slippery. Now that's still ok, I can bear with that, but since the routes are marked by the color of the holds, the dirt and chalk that accumulates on the top of the holds makes it hard to distinguish them.All in all, not a bad place, but I won't be renewing my membership, not because I hate this place, but because Rock City is just that much better.", "date": "2/3/2015"}, {"review_id": "NzzfBUh_eXNfb97nfGNKiQ", "user_id": "OHLr0T6mAF31tcjSskvK4w", "user_name": "Michael A.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Price is super fair, I think it's $28/month right now (special pricing that is, I'm not entirely too sure what the regular price is). I bought a group on that was $50 for 2 months + 2 guest passes. They rent out shoes and chalk for free! I'm a noob so I'm not actually sure if that's the same with all gyms or not...What caught me off guard is that this gym smells worse than my muay thai or jiu jitsu gym? It's bouldering... I mean how is that even possible?Still a fun place to go to on my way home from work and the people here are all so nice. For the most part, the music is great. 4 Stars, I'm a fan.", "date": "7/3/2014"}, {"review_id": "evtJlSlOiydV9M_N5Quc5g", "user_id": "KjJqtqcYTB9LL6KzhHlezw", "user_name": "Chelsea S.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "I came here through a recommendation from a friend after expressing interest in rock climbing, and stopped by on a whim one day to check it out. I'm not an athletic person at all, so I was a little intimidated to sign up, but Hayley at the front desk was really welcoming and informative and made me feel totally at ease. I ended up signing up for a month membership, which is SO reasonably priced! I like that it includes shoe rental, too.  Hours are convienient as well.The best part of this gym is the atmosphere. It seems to be a really cool, laid-back, and friendly community and you never get laughed at, no matter how much you suck (ahem, me). There's always someone there to give you pointers or cheer you on.The only slight downside for me is that it's strictly a bouldering gym, as I would've liked the option to learn belaying too, but oh well.Come climmmb with me!", "date": "5/9/2013"}, {"review_id": "4dHv_RJ7R1ooerDi2P2WxQ", "user_id": "sYYZ9LyR68AVmEt1Tl-bYw", "user_name": "Erika M.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Love Hangar 18! I prefer the Rancho Cucamonga location over all others (it's my home location so I'm probably biased hahaha) because of the the frequency that the walls get reset and the good lighting. Anyways, the Mission Viejo location has a good variety of routes and a campus board in the back. On the west side of the gym, when you make it to the top, you have to climb over the wall, and then walk across the top, and climb back down on a V0. This causes congestion at times. Good gym with friendly people though!", "date": "7/27/2015"}, {"review_id": "iuA7Ft8ToKXIJYsnIfCl1g", "user_id": "oOzFtVlqNiuSir8G00ryKg", "user_name": "Mariel L.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Bouldering only gym. Good padding (always important!). They use colored rocks to designate different climbing routes/problems (vs some gyms which use colored tape). Grades will range from V0 to ~V8/V9. I don't remember seeing many (if any) higher than that. Great location: super close to the 5 fwy and also some food for some post-climbing noms.I like that they change different sections of the wall pretty frequently (just about every week!) so that you always have something new to try *somewhere* in the gym if you've already conquered all the routes you wanted to do at your level. I also like that their holds are relatively new/fresh (or at least, they feel like they are compared to some other gyms I've been to). They have a nice flat wall that I find fun to traverse :) But they also have plenty of problems with overhangs too for increased challenges! There is a portion where you can top out and climb over the wall. In that portion they have a set of free weights and kettle bells as well as a pull up bar and two types of finger boards where you can train. The bench up there is kinda shady. But otherwise a nice semi private spot to get some other weight training / upper body workouts in.Overall, I really like the gym :) Got a groupon membership, but it's already more reasonably priced than some other gyms local to OC.", "date": "4/1/2015"}, {"review_id": "FsUdjKRijUPrUMUQFvintw", "user_id": "E3nbQxMeEUz4lAcZuFo0mQ", "user_name": "Jamie Y.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "This place needs more reviews!  I'm a little over a month into my 2-month unlimited membership, which I purchased thru Group On for $53 (AWESOME deal, btw).  Initially I was a little disappointed to find that the Hangar 18 location closest to me only had bouldering, since I generally prefer top-roping.  However I have enjoyed my experience here as it's challenged me to push myself harder. Here are things I really appreciate about Hangar 18 Mission Viejo:-there's quite the variety of routes for all levels, from very basic all the way up to level 10.  I like how they have - and + ratings as well (so for example, a 1- is an easier level one and a 1+ is a slightly more difficult level one).  This is probably my favorite aspect of this climbing gym.-they're ALWAYS putting up new routes! keeps it interesting/you're less likely to get bored.  my rock buddy & i have been going twice a week, and sometimes they even put up new routes within a few days!-the padding is very well-maintained, so if you happen to fall from the top of the wall you're most likely going to be fine.-the vibe: like most indoor climbing gyms, the vibe here is superchill and everyone's friendly/encouraging.-they do have a water fountain (in comparison, the Hangar 18 in South Bay does not).-I'll just go ahead and sneak in the fact that there is generally always some great eye candy (guys and girls woot haha).  I think we can all appreciate that!I've been very happy with my experience so far at Hangar 18 Mission Viejo, and encourage you to try it out.  Keep an eye out for that Group On deal as it was totally worth the price $53 for the following: 2 one-month unlimited membership including equipment rental and one free guest pass per month.", "date": "8/20/2013"}, {"review_id": "GOyU9V4hZNVasMgwn9FFvw", "user_id": "lA5WZZMRvK-rbsgBkgpigA", "user_name": "Arthur B.", "business_id": "b5pBOaPx0CeVzwjC7j3SgA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "this place is great fun, though i don't know if it's something i would turn into a regular workout activity. staff is cool and the atmosphere is fun. if it's your sort of thing or you're just looking for something fun to try hangar is a great spot.", "date": "6/1/2016"}]