[{"review_id": "k10hpsgz1I_5HU4D55bUfQ", "user_id": "jCEtFRMoNTjhClI3QtLjrw", "user_name": "Marisela C.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I'm giving 5 stars because of Jessica she helped me out with my belay lessons, I was extremely nervous prior and she made me feel very comfortable and the whole experience turned out  great. I now feel confident in belaying. She is always so positive and professional thanks so much for your help. Also I enjoy this location, it's not as crowded which is a plus. Quick update: I was having issues with my hangar membership and was confused about the situation, Jenna was a great help she not only fixed the issue but explained throughly what occurred. Thank you Jenna ! I definitely recommend speaking to her about any concerns you have. This location continues to exceed my expectations. Thank you for your hard work.", "date": "3/18/2019"}, {"review_id": "unvC5Q3SpmyP9S7fSIALRQ", "user_id": "sPK_Jdes7q7l3IQYKwoIdA", "user_name": "Roy And Kita L.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 2, "text": "We had a good first day bringing our kids in to climb. Everyone was knowledgeable and patient. Great prices, clean facility, friendly customers, autism friendly. A great sport for any age.", "date": "3/13/2019"}, {"review_id": "3ZCdTVDFDoqYKuR6ztfF_g", "user_id": "7WU0TWvQdtNHEmC2jmuneQ", "user_name": "Laurie M.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fun fun fun! I brought my 6 year old and she was tutored on the spot by friendly knowledgeable staff! She had a blast. Viewing A safety video is required the first time - good caution! Facility is busy and popular but not too much so. Reasonable price for a unique experience.", "date": "4/28/2019"}, {"review_id": "uF68_EQlL-QhMhMijEnH-Q", "user_id": "f316qB5gt2pP84dYOSp8qw", "user_name": "Francis D.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Small yet dense climbing gym.Large variety of bouldering problems along side a good helping of auto belay, top roping and lead climbing.There's a dedicated training area on the second floor as well as a nice area to sit and lounge.The staff are SUPER friendly! Very knowledgeable and great to chat with.Parking is ample.", "date": "9/29/2018"}, {"review_id": "Hn_l_N-EUYDfTYcccP_uhQ", "user_id": "DU0GQ88S5czT_79pQJMueg", "user_name": "J C.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "They cut the youth climbing program, yet continue to host youth comps. They have made it nearly impossible for the youth team to continue to train.", "date": "2/24/2019"}, {"review_id": "_kYMAvBoSXZrIrYfdO4uvQ", "user_id": "sdJrRenblCzvU_iR9MydXQ", "user_name": "Thomas T.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Great for bouldering and training. Their makeshift training area is just what one needs to work on their weaknesses. All climbers, what ever their experience level could enjoy this facility. Perfect if you're in the area but I wouldn't recommend going out of your way just to visit this gym.", "date": "1/12/2019"}, {"review_id": "TJLdOosYLP8aXAPkcwgkTA", "user_id": "bvfflgsu_OLOtUceED0IkA", "user_name": "Barbara F.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 5, "funny": 2, "cool": 5, "text": "Came here with some coworkers after getting a killer deal on Groupon! Upon arrival, note that it is a little hidden so when you turn in from the street, make sure you go through the gates. It was pretty packed! The 2 guys in the front were quite friendly. For a first timer, you'll have to walk over to the Ipad located on the wall to fill out the waiver and other information. Just like bowling, they give you special rock climbing shoes to wear. The atmosphere almost reminds me of CrossFit only indoor rock climbing. They offer many levels organized by color. I really loved the experience and the motivation of complete strangers around you give rooting each other on. If in case you want a little bit more of a workout, the upstairs contains a small workout area with a few machines. Overall, it is a fun alternative to work out and I would probably come back!", "date": "2/2/2018"}, {"review_id": "uF1nQbTcD-Q2FSGpUZgHZQ", "user_id": "9sZEKN1_R7u7KeS02xDyhA", "user_name": "L C.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Bigger then the one in upland. More routes and roomier. Don't let the level number limit yourself. Try everything!", "date": "12/10/2018"}, {"review_id": "Xo3Nz6JfR2UTkILOSxM80A", "user_id": "f9PjYTdo_PRv6gBPkh2QfA", "user_name": "Rich L.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 2, "useful": 2, "funny": 6, "cool": 2, "text": "I don't understand the staff at this place.. on our first visit they didn't want to certify us to top rope and actually complained to us for buying a year membership on groupon instead of from them directly... on my second visit the front desk staff was so busy socializing with each other i didn't even properly check in. also, the music was whiny and depressing, not exactly the vibe we were looking for in our gym experience. i recommend the arlington ave location for anyone interested in hangar 18... more top rope options and a much more helpful staff", "date": "2/4/2018"}, {"review_id": "7qVjMz5_uio4j4pI688-gA", "user_id": "dMs9FNS7LxzS9s_1gVM82A", "user_name": "Sarina L.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I recently got a hangar membership and my usual location was the one in Upland. I didn't know that there was such a close location near my school! The staff is very chill and pretty hands off unless you have any questions which I like. Their sets are great for all levels from beginners to advance. As a beginner, I really enjoy being able to climb some easy routes and to also be challenged with harder ones. Their grading system is just by numbers which I think is cool because it encourages you to just jump on any route and attempt it instead of being intimidated by the tag level. I was able to attempt one that was a little above than my usual level and it made me super proud when I found out later on. Not only is there bouldering in this location, but also a ropes section. So if you have your own harness ( or rent one! ) you can climb here. There's also an auto-belay system too. Rental prices are also very reasonable/cheap. $3 - shoes $3 -harness your keys- ( to be held) for a carabinerIf you want to try out rock climbing, this is a great place to try it out! Don't be intimidated there's a bunch of kids climbing here too! It's a super friendly community!", "date": "9/25/2017"}, {"review_id": "wuYrlv4mIZNtEVv0xMlCdA", "user_id": "wFMJ5riyTmtupUnkZIM8vA", "user_name": "Juliana P.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Super excited that my friend brought me out to climb at Hangar 18!I really enjoyed the environment, the people, and the music!!! Hangar 18 is a great place to workout, spend some quality time with friends, challenge yourself, try something new, and/or clear your mind! They have many different levels of intensity for bouldering and an extensive rock wall. I will definitely be returning.", "date": "3/11/2016"}, {"review_id": "FxHpovOPIKB5JNRld9Ssyg", "user_id": "O5sxpI1GDkpYfsqFfiZKuA", "user_name": "Paul K.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I like it just because it's close to my house, the one on Iowa is mostly bouldering. I like the variety of challenged climbs. I also climbed sender one and comparatively hanger 18, is smaller.", "date": "6/8/2018"}, {"review_id": "a5LB-XylRwRXhwl3w8WAbg", "user_id": "gKdnN_kuxKRg69JxJ4d5Zw", "user_name": "Becca E.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "We just started going here a few weeks ago and we love it! The workers are friendly and helpful for the most part. I love how the membership covers multiple gyms in the Southern California area! I hope to check them all out. The only challenge we ran into was when visiting the riverside gym, we were informed that we had been improperly trained with the grigri (belaying device). Lauren kindly taught us the right way, so we're happy to be using it correctly now! Apparently, the Grigri is only meant to be used right handed, but it was an easy fix!", "date": "7/5/2017"}, {"review_id": "8DQ4SZSwtLpYP_bjp_HyHA", "user_id": "te16FuIteTNsyvjuqoYFhQ", "user_name": "Saint E.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It was our first time rock climbing. The staff were very professional and informative. Fair pricing, even on bottled drinks. Facility was excellent except for lack of air conditioning (which is the reason I'm only giving 4 stars instead of 5).", "date": "8/12/2017"}, {"review_id": "XvNKJTilSD-QhO1UBXO0dw", "user_id": "Om3FK9DV6oGCF287drCigg", "user_name": "Taylin I.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time rock climbing - I have to say the staff here was very friendly and accommodating. I came with two members, so I got a guest membership that included free rentals for the day and a month-long membership all for $5! After that, it's about $33/mo. They were helpful in explaining how the level systems work and how to fall safely and getting me the right pair of shoes and a harness. Great experience, nice people, and sweet facility.", "date": "9/5/2016"}, {"review_id": "B0ULHwo_HZC3lZ9IYYJytw", "user_id": "5xzYaNd8z4MdzQ_4i-aSvQ", "user_name": "Dat N.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing for some years now and this was my first time visiting UCR to boulder and I was shocked on how nice this hangar is! Decent levels of amateur routes that is enough to get your fore arms going! I was taught how to belay with James and I was shocked on how great of a teacher he was. He really made it easy for my friend and I to learn how to belay and after that we were ready to try it out. Overall the gym is worth checking out if you're in the area, you'll get some FREE nice tap water from a wall :)", "date": "1/14/2018"}, {"review_id": "yL5nCxgX6Rbz2ORo7NtL2g", "user_id": "23Hkj5E6RrWAaQKOtS8aKg", "user_name": "Erin O.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "Love it here! The staff there is wonderful and so helpful! Climbs are challenging and technical, and there's always a ton to do. Also, William is a total babe", "date": "8/19/2017"}, {"review_id": "q5EOPzOd_1dFo8EFgxt1nA", "user_id": "INWsnr4t7eMDDjDZMhQ9QA", "user_name": "Bianca R.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place! I found this place on Groupon.. got a great deal. Took my son and he loved it. The staff was super friendly and helpful.", "date": "5/30/2018"}, {"review_id": "IKB4jcVed5_azL3H_Xp7nw", "user_id": "fDqIijPYpagyHsZBBlTztQ", "user_name": "Michele S.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "It's a smaller rock climbing gym with an emphasis on bouldering, though they do have a small leading section, two auto belays, and five or so ropes.  They also have a decent work out area and a nice lounge area.  Customer service seems great, and the community is kind and helpful too.  The only reason I'm giving this place a 4 star as opposed to a 5 star is that is it a much smaller gym - but hey, it's the one closest to me and it's still great for getting some climbs in.  ;)(oh, and maybe four star also because the music gets a little repetitive....)", "date": "10/22/2016"}, {"review_id": "OaqNcWYDs8u9E4aGN0q8aQ", "user_id": "zEYHqNM1egLq562Fi795xA", "user_name": "Michelle V.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I enjoy this location workers are cool and helpful at most time. The only thing I wish it was cleaned more often. It feels very dirty and I feel it not cleaned on a daily. I would also like to see they get a better AC unit because it's super hot during summer. My daughter loved it and we'll be back", "date": "9/1/2017"}, {"review_id": "Zkv-REP5KJtOsJ97Dbct2A", "user_id": "wherp3ta-Mwro40eS-m-qQ", "user_name": "Edith V.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 3, "funny": 1, "cool": 3, "text": "This was my first time trying something like this. Wow, what an amazing atmosphere. I'm a noob and everyone was happy to direct me to easier climb. I can't wait to go back. The gym is also well kept. Try it, you'll love it.", "date": "5/22/2016"}, {"review_id": "QeGhqZ1KRcrEQpYxXI90Fw", "user_id": "HlH3QgbOInPckYtmUKft2A", "user_name": "Ashley B.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This Hangar 18 has the largest bouldering section with a small section for rope routes. Their gym upstairs is large here with lots of gear for a good work out/ warm up. The staff are very nice and the route setters are great here. They keep stuff fresh with how often they change up routes probably because this is one of the busiest gyms due to the college being right there. Again they do not use their air conditioning though which is the only downfall.", "date": "9/28/2017"}, {"review_id": "YbTvdUwrXHDVThdPyfS5VQ", "user_id": "zjw3BG-3XC9vB_vTGtHQng", "user_name": "Jacqueline M.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 5, "funny": 0, "cool": 1, "text": "In response to everyone saying that the customer service sucks, I just wanted to say that the way the employees operate is reflective of the community that Threshold (the gym Hangar bought out and converted) fostered. At the \"old\" gym, you would literally just walk up to the desk, tell the employees what you needed, and then you'd be on your way. Everyone was a regular and comfortable with each other so there wasn't a huge need for any questions to be answered or anything.I'm sure that with the transition, management and training have been addressed and they are all working to get everything up to par.That being said, I'm still a fan of the gym itself. Clean enough for climbing, good size, well-lit, decent weight/fitness room, and a little place upstairs for watching TV. The employees are actually really friendly if you get to know them, too.Also really great: free lockers and you can bring food inside. Be still my heart.Took 1 star off of my Threshold review because they got rid of the public wifi, there's still no water fountain, and now its over crowded with the other Hangar people (I'll get used to it). But yeah. Okay place for climbing but the mood changed.", "date": "8/6/2014"}, {"review_id": "jJ9tO5i-ZhfG6zDHO59W2Q", "user_id": "KxlB8eT2x5m1opqDkgHhUg", "user_name": "Cadie W.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 2, "useful": 9, "funny": 7, "cool": 4, "text": "So we all know this gym lacks customer service, no doubt about it. I know people are trying to justify why the staff have an attitude with the whole Tresh to Hanger transition. Bottom line customer service is key for any successful business. I agree the staff is unprofessional and act like they own the dang building. From my personal experience  (mind you I've been a customer since 2010) the staff will only help if they have to. Attitude is given from time to time when you actually make them do their job. I've learned just to ignore them and stay out of sight. (Out of sight out of mind, right?) I'm sure youre wondering, if the customer service sucks so much why do you continue to go? Main reason being- I'm not there for the staff, I'm there to climb! The setting at the gym is alright, I wish they had the old setters back from 2010. They were awesome! Long story short- beware of sassy 20 year olds who will be upset when you make them do their job. Don't take it personal, that's just how they are. Make sure to bring water! ( no water fountains at the gym, they do sell water. For a small price: first unborn child! Jk)", "date": "10/29/2015"}, {"review_id": "TTTC9AvOSidzl6AL3Uyj9Q", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love this gym! It's much smaller than the main hangar 18, more bouldering than sport climbing but it's pretty good. There are a lot of different climbs, over hangs, slab, bluff, cove, arch, cave and high ball. Everything is still the same except the color holds, which I personally prefer. The gym upstairs and the yoga classes is INCLUDED in your membership which is the rad part about this gym.The staff are super chill and laid back, it is a climbing gym after all! It's a really good place to climb. For those that never have climbed before it's all about having a fun time and making the best out of it. Ask questions, don't be afraid to ask! Cause sometimes you might be doing something wrong and all the staff wants to do is make sure you have a fun but safe time! They're not mean or trying to intentionally be rude, sometimes it gets busy or hectic and that can be overwhelming. Just relax, and have a great time climbing!", "date": "9/21/2014"}, {"review_id": "989K7bPNuatFURIjemU5nQ", "user_id": "MPnTita7geQM81WaopIi9g", "user_name": "Mostafa N.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 1, "useful": 4, "funny": 38, "cool": 1, "text": "So a couple friends and i decided to go rock climbing instead of hitting back for a change and we go to purchace a day pass when the employee Kevin insited that since it is our first time we cannot purchace a day pass and we need to take the intro class thats almost double the price. Anyways we all decide to go ahead and get the day class since he said \"im not trying to be a dick but you need to take it\" we paid and headed inside to our \"class\" where he seriously walked us to the first wall and told us to climb it. Thats it. No instruction later i asked him for a pully so i can scale a wall with a spotter and he says thats another part of the class that he didnt teach and that he didnt have time to teach because hes about to clock off. So i laid to seriously only use a quarter of the gym. This guy Kevin real scumbag seemed like he really didnt like the place its ok to quit man.", "date": "2/7/2017"}, {"review_id": "9Gv7aQFcsG9ShsfVUDzKRQ", "user_id": "rKCb3BUmpQYk9k_VRkTgJQ", "user_name": "Nick L.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 1, "useful": 3, "funny": 5, "cool": 0, "text": "I've been climbing for 6 years and took a date here. One of the female staff members insisted on giving me a belay lesson (understandable since she hadn't seen me climbing there before) then made myself and my date demonstrate knots. My date had no experience and was struggling with the knots, I had been taking care of all the tie offs but this staffer wouldn't leave us alone. I'm a certified arborist and am more than competent to insure the safety of myself and my date. I became so frustrated with this staff member that I took my date over to the bouldering area to be left alone. It felt like this staffer had an agenda of browbeating my date with what she didn't know and I will not be recommending this climbing gym.", "date": "4/8/2016"}, {"review_id": "4RstaIPYnuvWBGChGu4uYg", "user_id": "5x4T_0UlvIJ0YOZWpO1HzQ", "user_name": "Valerie O.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This is a great place for kids and adults! I've been here many times but never written a review, but I feel like everyone should know about this place! The staff here is young but they are great and know whats going on around the park. One time when I was here the park had a good flow with jumpers and parties, but it did not feel chaotic because the staff knew what they were doing. This is a fairly new park and is located right off day st. in Moreno valley. Great this about this park is that there is a lot of parking space around!!!", "date": "5/16/2016"}, {"review_id": "bbt5NSSBgnQIjonKmVqy3Q", "user_id": "2Og0ElR8keEIE7iPcOnEYg", "user_name": "Victoria B.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 4, "funny": 2, "cool": 0, "text": "This hanger is the best location!! An employee Kevin helped me by explaining the memberships and different day passes they have and costs of everything. Kevin understood I was an unexperienced climber but he took the time to explain and gave tips on how to make the experience better and not \"lost.\" This gym is very welcoming to new climbers and experienced climbers don't feel bothered and are willing to help! Thank you Kevin for the great customer service!! If you are second guessing on going, don't!!! Go and ask Kevin for advice on climbing he is the best!!!", "date": "2/26/2017"}, {"review_id": "1DNJWAwKeCGQKTZZtX2tHQ", "user_id": "Pb5sf0Iq71_V0apExZFLkg", "user_name": "Patrice S.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 3, "funny": 4, "cool": 2, "text": "What a total-body workout!  First I should state that I'm a fan of indoor rock climbing, and really dig it as a great exercise.  As a member of the other Riverside Hangar 18, I was totally thrilled when this gym became one.  When it was Threshold, I wanted to go, but couldn't justify two memberships. The people here have been just as awesome as the other Riverside location, so I'm not sure what some reviewers are expecting. It's a climbing gym; not a restaurant.  They're laid back and easygoing, with Mary being our favorite. She is an excellent belay instructor, and got my partner and I up and running quickly, and answered all our (even stupid) questions with a smile.  You rock, Mary! :-) There's much more bouldering than top-roping, and the routes seem nice and challenging.  The other Riverside Hangar 18 has many more areas for beginners, if you aren't an advanced climber yet.  This location has some good ones though, and we're really enjoying climbing here.We worked up a great sweat climbing, and also used the gym upstairs, which has some weights, machines, and kettle bells, etc. If auto-belay is your thing, there are two here, I believe. Now to work our heavy butts up to good bouldering skills...I hesitated to write this review, as the devil on one shoulder said \"Good, it has a lower rating; you can have the gym all to yourself! Mwahahahaha!!!\" But then the angel on the other shoulder said \"This gym deserves a high rating because it's awesome.  Do your fellow Yelpers a solid and write a real review that does it justice.\"Damn shoulder angels.", "date": "8/31/2014"}, {"review_id": "k8Or1wv7N7yYlieI5MfA_w", "user_id": "Y6_nLpiNvHlJZwhRAp2yXA", "user_name": "Edgar L.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "This place is awesome, best place to climb!The employees are really nice and helpful if you need help learning how to climb on the top-rope wall or on the boulder. The community is great, too. I even made a few friends!Routes are hard but fun. There's a good variety of routes to keep you busy.There's a lounge upstairs with couches, lifting equipment, and a TV.Yoga classes are also available for free to members, and it's really popular because it gets packed quick.It'd be even more amazing if gym hours were longer (or 24/7)!", "date": "4/1/2015"}, {"review_id": "Q51kPy3Mjc_fvpMfXHKdOQ", "user_id": "GngsUr1CLihtaWxeIb9fIw", "user_name": "D H.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Love this place. We go here 2 times a week with our kids. The staff are fantastic, super friendly they have taken the time to get to know us. They are always helpful and friendly. They are continually changing the gym so you have a variety in your workout with top roping and bouldering. We have been to several hangar 18's and this is our favorite. Completely kid friendly. Great atmosphere of other climbers. Everyone is helpful. 4 stars instead of five only because of one thing, no air conditioning which gets hot in the summer months. Other than that I highly recommend this place.", "date": "6/29/2015"}, {"review_id": "ELJLiDh3PQNChPtxaawWiQ", "user_id": "KVGLBRI9TiBl_0FRetACJQ", "user_name": "Shwetha H.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super nice staff. It was our first time. They taught us how to climb and use the equipment. We had a great time. Great work out. Chill atmosphere", "date": "8/31/2016"}, {"review_id": "vDdAbxnUhZdeFq073fDAdA", "user_id": "EczpWYkrlqGvd5UREKqzCA", "user_name": "Alyssa M.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Sooooo much better since the Hangar remodel from Threshold! Definitely recommend! Still crowded because of the new year.. But clears out after 830pm so much easier to get your climbs in. Love the Hangar locations though. Not your typical gym.", "date": "1/15/2015"}, {"review_id": "mJokWFwKP28MtqjeHXmqmQ", "user_id": "BMq12di7NAPr7zJFgxzCxw", "user_name": "Juan M.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Employees are so helpful and instructive. Every single one of them will listen and assist anyone in need! Absolutely love this spot! Routes are unique and challenging. But it would be great if they were opened till midnight!!", "date": "4/1/2015"}, {"review_id": "6wU5zHdfAVRsEeMr4dve6g", "user_id": "vnXNp87PYHZo170ws36kDw", "user_name": "Mike A.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 1, "useful": 4, "funny": 2, "cool": 0, "text": "Do not give them your debit card #!!!! They will charge it even after you requested to cancel your membership. Bad business practice!!!", "date": "10/10/2015"}, {"review_id": "3vdDkVOa67xrQBRGgAyYRQ", "user_id": "moNPX8Oi2KWfOC66hLm0Dg", "user_name": "Christian B.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 1, "useful": 1, "funny": 2, "cool": 0, "text": "Customer service is the worst I've seen in years. My friend and I walked in and stood at the front desk while girl looked at us then walked away. We had to ask the girl to help us with my friends retail gear. When we asked for a grigri she looked at us like we were stupid then said we don't have any at the moment. I been to other rock gyms with the tape system but whoever set theseProblems must have three pairs of legs cause they do not know how to set levels according to what type of rocks are on the route. I did see them starting to change to the color rock system and I might give this hangar a second try when they finish the walls and get rid of these highschool kids at the front desk.", "date": "7/23/2014"}, {"review_id": "iLhuo83LC-ZcmmxI9VltDA", "user_id": "Wl7_RjEV4GlzG47joHHaPw", "user_name": "Doan B.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Used a Groupon here and had a SUPER fun time! Was instructed by Mary on how to top-rope and belay. She was amazing and was really patient with the instruction. I was kind of clumsy with the equipment since it was my first time but she was totally cool with it. After a quick tour and hour instruction my boyfriend and I were all ready to go! She even came back to give us a quick demo on bouldering when we wanted to try it out. It was my first time indoor rock-climbing anywhere so I don't have any other place to compare this one too but all I can say is that I had a great time there. The people there were really considerate and there were all kinds of experience levels. They also have yoga once a day Monday-Thursday. Equipment was also free to rent.I will definitely be coming back for some more rock-climbing fun :)", "date": "8/18/2014"}, {"review_id": "3hFh9Xjc9ECQhiLEsRAXvA", "user_id": "lTsirnbX60rpiXf0IJVPRQ", "user_name": "Vanessa L.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "The gym is kind of small compared to the other gyms so it can get crowded pretty easily. I recommend not going on Tuesdays in the evenings as those days the Youth Team is also there training. The sets are pretty solid for the most part, although I wish their torn up pads were replaced. As for music, I'd say it's really good most of the time, but I'm not a huge fan of their screamo choices.", "date": "11/2/2015"}, {"review_id": "qVx44kcKcLzWFzXcMHu7Yw", "user_id": "A-iNx-ji8SFXABm7Djvz7Q", "user_name": "Morgan P.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went in today with my friend to climb around. William helped us out and he was nothing short of awesome. Super cool workers, the walls are well organized and maintained, and everyone is all around friendly. Great experience. I highly recommend this place. PS bring your own chalk", "date": "9/27/2014"}, {"review_id": "Bk7-jSTT697h4GqhSyzntg", "user_id": "glqVzCSW4mh8NGLwOqUXhg", "user_name": "Ian P.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My go to place to mellow out and get out of my head. Great staff, great experience every time. I really enjoy climbing here and have been climbing here for quite some time. Routes are always being changed and are always interesting. I just wish I had more time to play here. Go climb!", "date": "2/26/2016"}, {"review_id": "1FOWAzIzcWd97-qP-R7jFA", "user_id": "gq83kM9H94MlfPDFOeXjxA", "user_name": "Kayla G.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I love this place! This is where my passion for rock climbing ignited. The environment is very pleasant and the staff  is very knowledgeable, and friendly! This is a very welcoming place and I always recommend this location to people whom seem interested in getting involved in the sport. Ask for William if you are in need of any answers about the gym, he is super friendly and knows a lot about the place/sport.", "date": "10/17/2014"}, {"review_id": "FTFCgyCUKx2PUFdfIQe6qQ", "user_id": "zkhr5t8bbprJ1NzRJZfg3Q", "user_name": "Rey L.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Climbed here many times, this is one of the best climbing gyms I've been, very busy a lot of people going. Vital is closer to Temecula area. But by far hangar will always be my fav! Knew this place since it was called threshold!", "date": "2/26/2015"}, {"review_id": "LZTmN06yWPGJ3gEuDlpnLQ", "user_id": "s5OCEAvJd4ukaXh9UkN65w", "user_name": "Larry B.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place was great Made reservations at Hanger 18 in Rancho Cucamonga, for my 6  rand Kids, when we got there for Rock Climbing, the place had no ropes, he suggested that we go to upland, there the guy said the kids were to young and was rude and didn't even know what their paper work said, but even there, their paperwork said if with adult they were fine, we called the Riverside Hanger 18 and explained what we wanted and he said come on down he was very helpful and the kids had a gread time. DO NOT WASTE YOU TIME AT THE UPLAND BRANCH. GO TO RIVERSIDE ONLY", "date": "3/7/2015"}, {"review_id": "uQ--93UTO3d-LyBR6mv7ag", "user_id": "1W9kWh1yOqeVIdZBYiZE5A", "user_name": "Patrick G.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Its a great gym like all of hangars many gyms, which makes the membership such an awesome deal because you get to go to all of them! This one in particular has an upstairs gym that is great if you want a quick run on a treadmill or hit the weights. Most impressive feature of this gym is the amount of yoga classes it offers, specifically the Friday night class! Valarie is by far the best instructor I've ever had. She's amazingly skilled and her positive energy and knowledge are very inspiring. Even though its on Friday its honesty the best way to spend a Friday night!", "date": "4/3/2015"}, {"review_id": "oO9JF5ZUHYQDFsp_N2MQmw", "user_id": "81RnBDxnlkiWGtmBDCx56A", "user_name": "Paul M.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 1, "useful": 1, "funny": 1, "cool": 0, "text": "This place is a low quality climbing gym with a huge (inconsistent) price tag. Before I got the membership, they charged me $17 for one day. I brought friends with me the next month, and they charged them $5 each. Why the hell should I pay over 3 times the amount other people pay!? When I got a membership, they charged me 7 months after I got tired of their lousy service and cancelled it!! They said their was no way to get a refund, so I had to wait another month. I decided to just use the month since I couldn't get a refund. They reasonably require collatoral for their equipment, but I stood at the counter waiting for someone to give me my car keys back, so I could leave, for over 10 minutes. They got rid of some of their mats, left the old ones out in the parking lot in the way, and when I asked if they were free I was told anyone could grab them. Later when I was leaving I told them I would pick them up the next day, and they said I could buy them for $100 each! It has obviously not been a good experience for me. Giving crappy service and charging way too much isn't going to work for their lazy staff and management much longer. I look forward to one of the nicer climbing gyms expanding into the Riverside area!", "date": "1/22/2016"}, {"review_id": "HWPdzt3qgGKaWpKZAFMFAg", "user_id": "pSUqkLkIBOSplO7b8BVzEw", "user_name": "Mrs.Yelp C.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a member and come about 4 times a week. This gym is very clean and has a wide variety of difficulty levels. The staff for the most part is friendly other than one guy that is never at the desk then walks up and rudely asks if I need something as if I'm disrupting his shift :l BESIDES THAT this is an awesome place it's where I fell in love with climbing. I wish they would extend their hours and install a water fountain. Other than that this place is one to visit :)", "date": "6/1/2015"}, {"review_id": "yyD4iFM0bhDMtg16FjL4Nw", "user_id": "btS9xro34oxE53fDW3h7uw", "user_name": "Robyn M.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 2, "useful": 0, "funny": 1, "cool": 0, "text": "New ownership, More crowded with hanger 18 members now coming here, new employees that don't have the same familyl/friendly feel from Threshold. Bouldering is still great here though, great place to come and have fun for a day or two if you are new to rock climbing and testing the waters but as far as having a membership, no thank you.  Bring your own water.", "date": "8/17/2014"}, {"review_id": "gU6gYZXpfvb7H8EHG7ZAjg", "user_id": "VjNCsbSpTGmEvjueBLiDHA", "user_name": "Morgan D.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Not sure where the complaints about customer service are coming from - I've been going to this gym for nearly three years now and the awesome people who work there are one of the better parts of the experience. I was really glad to see Hangar 18 keep the existing Thresh Hold staff when it took the gym over. Side note, some of the \"high school kids\" another reviewer referred to climb harder (and know more about climbing!) than most adults I know...The gym itself: better bouldering than Hangar (West?) Riverside, imo. The toprope and lead walls are obviously much smaller than the other Riverside location's, so if you're primarily looking for roped climbing, that gym is probably a better fit. Now that membership here gets you into the other Hangars as well, it's no longer an either-or choice. Love this place and happily recommend it!", "date": "10/24/2014"}, {"review_id": "Ix0rtfS0CpIweSE-CRFZrw", "user_id": "x6Z_Yxc6njhKV8zk5LGIzQ", "user_name": "Jeremy S.", "business_id": "oA7eah_MaCQ4PX7XI-IBBg", "stars": 1, "useful": 4, "funny": 2, "cool": 0, "text": "Worst customer service ever.  Bought a groupon for me and a friend and it comes w a training lesson.  Kid behind the counter tells me he is the only one there (besides the girl next to him that he was macking in) and therefore did not have time to help.  Once I got my shoes and harness started climbing.   Ok place, people there climbing not friendly...downright weird.   After using the harness the 17 year old bothered to get off his ass and tell us we were doing it wrong and asked why we didnt use a pulley...he never gave us a pulley.  So he sends another 17 year old out to \"test\" us on if we know how to do it with the pulley.  This was my first time.  A buddy was able to figure it out but I was pissed by then.  I asked the kid if his co-worker had such a problem, why he hadnt come back to \"test\" us...cause hes a little punk and decided to go to lunch with the girl he worked with.  The place is nice but ill go elsewhere where customer service is mpre appreciated.", "date": "7/13/2014"}]