[{"review_id": "8ZaBNrNDvsSXU-_pa7kirQ", "user_id": "pnx8sqH9dsfj3kUCQg92pA", "user_name": "Michelle W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Bought a Groupon and came with my fiancé to try rock climbing for the first time. Benjamin was the one who gave us the lesson and helped us out. He was awesome! Explained everything well, very personable, and made sure we were safe. After the lesson you are able to go around and do it yourself. They have lessons at the top of every hour. With the Groupon we bought we were provided with all the gear we needed but I think you have to rent it usually. Shoes, harness, belay tool, they will ask you for collateral. Highly recommend you come with a partner if you want to learn belaying (climbing with the rope on your waist while someone else is holding it at the bottom). They also have bouldering which is just kind of like free form climbing with no ropes. They had a deal going for Groupon customers that you could pay $5 for the first month of membership and cancel anytime!Can't wait to try out the other Hangar 18s around me!", "date": "2/28/2019"}, {"review_id": "0spPZbIr8PgJVS_T4lIoVA", "user_id": "r77nLa1fT9pGJreGnMZOOw", "user_name": "Russell N.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "You get what you pay for. It is the closest gym to my house so they have me but i do wish it was better. The route setting is okay, the holds should be updated and of course I wish it hard higher walls. With all that said, if you need to climb like me, this is a place that gets the job dow", "date": "1/13/2019"}, {"review_id": "w-zb2mnkVB6Tl8bF_QdWhw", "user_id": "cG1kodPs5fadvKBFHH8zmA", "user_name": "Michelle H.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I admit, the first time I went here I had a horrible time. Their V0/1 was too difficult for me and I couldn't find a VB/V0. I found everything to be too difficult and the facility to be so small, especially compared to Sender One where I usually go. (I like to top rope, I'm not a big fan of bouldering). There are two bathrooms but no water fountain. There is also a small training area with weights and hangboards etc.  Slowly but surely, this place grew on me. I started climbing all the VB/V0 and a few V0/1. I started top roping and tried their auto belay which was scary at first (I was too afraid to let go when I got to the top)...but I'm not as scared anymore and find it very convenient. I think this place is worth it for the price of the monthly membership off of groupon. I will continue going here while I try and grow my strength and skills. Bonus: People bring their dogs here!", "date": "12/18/2018"}, {"review_id": "jSpJTTW10tmmdcOGFYFepA", "user_id": "tcwNlctBhfriTlfR453FhQ", "user_name": "Shelia D.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 12, "funny": 7, "cool": 10, "text": "2 for 1 deal on Tuesday!! What a fun experience. Wow !We were lucky to have taken the intro class with Mark and he was a great instructor. He took his time explaining the safety steps and showing us the ropes - literally! LolHe was fantastic. He was very careful and waited with us until we got a hang of the whole thing. And after 30 minutes we were doing our own buckling and climbings. Having this deal really is a great opportunity, especially for beginnings, to try it out to see if they like it. The day pass is $33 per person, but like I said on Tuesday's its 2 for the price of 1. And the membership is $36, so for $3 more you get to have a whole month pass with unlimited climbers and yoga classes. I highly recommend this place or their many other locations.", "date": "8/1/2018"}, {"review_id": "9QqjKrEK0uDL0Nsdz4tIJw", "user_id": "d020K89o2UnDQHjew702Tw", "user_name": "Nico A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing place. Wow so peaceful and fun. My honey and I had a drink and sat outside. Try Portola Roasters rose Latte. Or a beer.", "date": "4/6/2019"}, {"review_id": "hzygit_UFcq1pI-UvQr2Dw", "user_id": "gL2URbvVBLzlIZcwa3xz6g", "user_name": "Issara W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 7, "funny": 1, "cool": 0, "text": "I was visiting from out of town. Even though we showed up with all our own gear, they required us to use their Belay tool. In order to use their Belay tool, they required me to leave collateral. Fine, whatever. I gave them my drivers license. When I returned my gear, they forgot to return me my ID. Fine accidents happen. Two weeks later, and after losing my mind trying to find my drivers license, I call them up. They have it. As well as ALL my contact info I used when I signed up. Including my phone number. They could have contacted me and did not. The manager lady told me they have a stack of ID's left over and acted insulted when I suggest that since they require people to provide the gym user contact info, they could simply look people up, call them up and get them their ID's back. Nope, not interested. Apparently they simply do not care about helping people out. Then she got bent out of shape at me for calling her out on the fact that they had my ID and my contact info and never called me. I requested they mail my ID back to me. She sounded like she would be doing me a huge favor. Even though they neglected to return my ID to me, or call me when they noticed they had it. The final icing on the cake is that the ID never arrived. They lost it. After repeated calls, not a single employee can even confirm that it was mailed out. The woman manager I spoke to clearly ran out of 'give a f**c' a long time ago, has no interest in providing a service, or even doing the minimum to help people. I would pay money to never use their gym, or interact with her ever again. Don't make the same mistake I did. Other than that, the gym was ok. At 9:00am on a weekday, they played 90's rock at level 9 out of 10 which pretty awful to climb to. The routes were really well worn and had not been changed in a while. We planned to climb longer, but left early because the music was so loud and so terrible. The one guy with the tats was super nice and helpful.", "date": "10/11/2018"}, {"review_id": "dxn8WmwSOotZGwagOYYe1Q", "user_id": "chRkv7s3H1BSPgy7o2FUOA", "user_name": "Simply G.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "Was in the area Friday night and wanted to get some climbing done. Checked the times online and it said closing at 10 but they shut the music at 9pm. Saw people leaving so asked the guy behind the counter If they're closed. He simply nodded.Disappointed on their laziness of having just a paper on door to justify change in business hours. You don't need a yelp profile if you can't maintain such important information as business hoursLiked that they have decent practice walls compared to Arcadia (Arcadia location doesn't have any...) but again, doesn't do any good if instead of getting my climb on, I end up waisting my time writing this review", "date": "11/16/2018"}, {"review_id": "Z8xp3ARNjdiKB6Oj0lWymw", "user_id": "QZFRyUIrECkyfwHkTEhaSQ", "user_name": "Jaid M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "My friends and I usually go to the Hawthorne location but we decided to try something new. When we arrived we realized this location was much smaller than the Hawthorne location. It was extremely hot and stuffy inside and it smelled like garlic. The bouldering routes were odd some had mixed colors (dark purple and brown, black and teal). My friend found many loose holds while bouldering. We also found 2 screws and a metal washer on the ground. The workers didn't seem concerned at all when we turned them in. We are going to stick to the Hawthorne location from now on.", "date": "1/26/2019"}, {"review_id": "ZGOF8iAQc3FJG4Lw1bzY6A", "user_id": "oAxD_sV4Zen3Wlsclk3X0Q", "user_name": "Taylor U.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "We got lucky.First time going to Hanger 18 and the one at long beach is small. My friend said the one in rosecrans is bigger. I walked in and couldn't find the prices anywhere. Since I'm new i had to fill out two forms on the iPad. Then I was charged $18 for the day. But the guy let us borrow equipments for free. (To be honest I didn't know we had to pay to rent out equipments). The shoes is $3 to rent and the harness is also $3 i think. Also in order to balay someone, you have to take a lesson. My idiot friend said he knows how to balay. Then the employee realized that my friend didn't know what balay was. My friend was ignorant but we got free lesson and we were able to rock climb with harness. Me and my friend also did bouldering which requires no harness. We got exhausted real quick and had no gripping strength. We stayed for less than an hour and left.With all the equipments and training, this place gets expensive but if you get the monthly or yearly pass, it's cheaper and worth it.", "date": "8/28/2017"}, {"review_id": "vl1vUnXfv5GsRnHr88-huQ", "user_id": "K16cSWm5GtgnEDScM-plpA", "user_name": "Andres M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super friendly staff, always helpful. Climbing is great, route change often and off hours not too crowded.", "date": "1/31/2019"}, {"review_id": "A0fkVcsMoxmCToPYahoBYw", "user_id": "HtB8-B5tX9MfSoAijx6LUQ", "user_name": "Connie T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We went there for the first time on Saturday! Daisy was great! She was very helpful! The place was very cool! Cant wait to go back!", "date": "1/29/2019"}, {"review_id": "2qWG7ScNwEBLi8MJSTPUtg", "user_id": "UrfhZ4OiayIeeaZYiqVITA", "user_name": "Leana A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "I've driven past this place at least 100 times and have always wanted to try it. Well my son was invited to a birthday party here (kids are 5-6). The staff were sooooo impatient with the kids. For a lot of them it was the first time experiencing rock climbing so naturally the kids were a bit scared. But that didn't seem to matter to them. They yelled at the kids so harshly to let go of the wall when coming down. Now I'm an adult and I've done rock climbing one time. I know first hand how scary it is and how it's not easy to just \"let go of the wall.\" But the staff had no patience and no compassion. They only cares about the fact that \"they didn't pay attention during the rules.\" Won't be returning.", "date": "1/5/2019"}, {"review_id": "Itu8mTxJkKGyi9Te-K-3Bw", "user_id": "QPQxBr8-_gvLLPdK4AHnmQ", "user_name": "Diana T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 1, "funny": 1, "cool": 1, "text": "I've only been bouldering a few times, so I'm definitely an amateur. That being said, this place really needs to have more beginner routes. V0 and V1 were extremely difficult here and I felt extremely limited to only 1 or 2 routes. In addition to that, some V2s were easier than V1, which I don't really understand. The routes are messy and as a beginner, I don't really feel like I'm getting my money's worth my coming here.", "date": "5/22/2018"}, {"review_id": "38I2EB_GU5gTuGT8A8AJ_A", "user_id": "FZG7BH9sBvarn6d6ZArRrw", "user_name": "Kathy V.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "What an awesome experience! Our group bought intro classes off of Groupon which averaged to about 15$ a person. The intro takes about half an hour with demonstration and practice and then you're free to climb all you want for the rest of the day. There are different types of walls with different difficulties so there is enough to please every crowd.  One half of the room has walls that require belaying and the other half has walls for bouldering. My first time up, I panicked with the fear of heights kicking in. My entire body trembled and I was getting sweaty all over. After the second time I got the hang of it and it wasn't so bad. I think it's one of those moments where your mind is playing tricks on you and you think you're falling when in reality, you're pretty secure with the rope. You have to trust the person that is belaying you. They also have two routes where there are auto belays. At first it will seem scary to get off, but once you let go it will ease you down. After a couple of runs, my arms were fatiguing faster and I was losing my upper body strength. I wanted to play more but my body was getting weak. I highly recommend getting the chalk because after awhile your hands can get a little clammy. Our group spent about three hours here until we were exhausted. Bring lots of water! Or they also sell refrigerated drinks here. For you adventurous folks, I think this is a great place for a date!", "date": "3/31/2018"}, {"review_id": "wxwGMoHDniThWLlnJePJWQ", "user_id": "u7FC-1PlKHGtiTD-k4xYuA", "user_name": "Vichea C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Instructor is always friendly and very informative. Clean and organize indoor rock climbing venture. Very accommodating. I came with a group of 10 people for most first time and everyone learned to belay and was very happy to share this experience. Great place and highly recommend for fun and safe activities with family and friends.", "date": "12/13/2018"}, {"review_id": "Z4f6TtAxzQTP8vfvOdgumg", "user_id": "p1WhoHqWVowh21PIOYwDjw", "user_name": "Elaine L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "First time here, bought a Groupon deal for my boys. The guy at the front desk checking us in was very helpful with the check in process. The guy giving the lesson, not so much. He didn't communicate very well, didn't seem like he wanted to give the lesson. He rushed through it, it was at most 15 minutes ( Groupon said 60 minutes). I really didn't expect the full hour but at least take your time to explain to explain the safety procedures/ equipments. The boys did have a good time on their own. Not sure if we'll return.", "date": "3/11/2019"}, {"review_id": "JWT_9DcsTogQruN5DFEa4w", "user_id": "kPBxVNUosDsTL5-wHjrdPA", "user_name": "Diane V.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 3, "funny": 1, "cool": 2, "text": "I really enjoy coming here! Definitely worth the money and they always have deals going on that you can take advantage of. I was able to get a their Tuesday 2 for 1 deal with a friend for a one month membership for only $18 each (which costs the same as a regular adult day pass!). On the same day that I signed up, the front desk staff helped teach me and my boyfriend to belay each other. They were really friendly and informative! I also prefer this Hangar 18 location over the Mission Viejo location. The routes are more interesting here, they've got different overhangs, lots of slanted walls, and several traversing routes. There are plenty of routes for every climbing level. Plus they've got great top rope sections and 2 auto-belays that are super easy to use! It was really nerve-wracking using the auto belay the first time but they always catch you when you fall.  Machines for the win! There's also lead climbing here, most of which are just  to the regular bouldering routes, but I have yet to see anyone utilize that section. The biggest con here is that it can get really crowded here fairly easily. I've been on Sunday afternoons and weekdays evenings and it can get annoying just waiting for others to move away from the routes I want to climb. In situations when it is crowded, I try to utilize the top rope auto-belays until the bouldering section frees up more. I recommend going 1.5 hours prior to closing if you want there to be less crowds.", "date": "1/7/2018"}, {"review_id": "TAkrMhdSe2lIuJKQp_KEew", "user_id": "AOsb45lNP7AzQwwWLUQxEg", "user_name": "Shanon Y.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 8, "funny": 5, "cool": 7, "text": "Awesome staff, fun climbs, and great vibes all around make Hangar 18 Long Beach one of the best Hangar 18 gyms by far! I've been bouldering and top roping for years now and I always find myself going to Hangar 18 because they are one of the most affordable climbing gyms in SoCal. Some of the Hangar locations are better than others due to overall maintenance and staff. This location is definitely a lot more well maintained, and is also one of the newest locations. The crash pads are thick and don't look like they are falling apart. There's an even number of top roping and bouldering areas, and the overall layout of the climbing gym is very welcoming. It feels a lot more open and less claustrophobic when there's more people around. My friend and I came to utilize our monthly membership that was ending and I finally convinced him to take a belaying class, since he's only been doing bouldering. The staff were more than happy to assist us and let us use the rental equipment. They were patient and really helpful in walking us through each step, with adequate time to practice tying the figure 8 knot and appropriate usage of the Grigri top roping device. After top roping for about an hour we did some bouldering and the other members of the gym were so supportive and helpful in helping us through certain routes we were stuck at. Everyone seems to treat each other like family here which is really awesome. If I didn't live so far away I think I'd definitely become a regular here!Tips*-If you love climbing, I'd highly suggest investing in your own shoes, harness, chalk bag, etc. Rentals are available but it adds up each time and who really wants to use rental shoes?!-Gym closes at 10pm M-F and 8pm Sat and Sun, but the staff let members climb well after the closing time and don't rush you out which is extremely awesome!-Two self belaying devices are available if you don't have a belaying partner - Groupons are always available for day passes, lessons, and monthly memberships (wait when they have 20% off and you can apply that on top of the already affordable Groupon prices)", "date": "2/26/2016"}, {"review_id": "0wWY_5o0hlH15P7UZN9PcQ", "user_id": "i0sDB30FPxEFM17blqJliQ", "user_name": "Jennifer G.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with a friend using a Groupon. Easy to find thanks to Google maps and plenty of parking right outside their doors. We were greeted and walked through the waiver process. The guy who helped us was awesome! I could really tell how much he loves rock climbing and his job at Hangar 18. Even though I was the one who purchased the Groupon and dragged her along, I was extremely hesitant and fearful when it came time to climb the rock wall. He was informative, friendly, kind, patient, and prioritized safety (which I definitely appreciate). Being both our first time rock climbing, he took the time to thoroughly explain everything and made us feel comfortable. Just wish it was easier to identify the beginner easy walls and paths. Overall, we were totally outside our comfort zones but had an excellent time!", "date": "7/27/2017"}, {"review_id": "WJfozaHUr8RSp3jXrDZHqQ", "user_id": "86JX_xYfGKXIngxEcDnUog", "user_name": "Morison W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 3, "funny": 2, "cool": 1, "text": "Came here with my friend, Shanon, because we had a groupon deal for a 1 month membership. I've been to the Hangar in Upland twice, and my third time was to this location.I loved this location a lot more than the Upland one. The staff here are all really nice, and I took the Top Roping class. The staff was very patient as they taught every step, from tying the knots to securing the hooks. The bouldering section has a lot more variety too. If you are a beginner like me, you will find this gym to be more exciting than the other one. The beginners section also has inclined walls, so you can already challenge yourself in a variety of different ways. The mats here are also softer, so you don't have to worry about falling for higher heights. They also close at 10pm, but unlike the other one, the staff here don't really rush to kick you out on the dot. They're actually pretty chill and just enjoy their work time there as much as the people who go there to climb. I do recommend checking them out!", "date": "2/24/2016"}, {"review_id": "NFOvg9Bb0-56jKC1P3kT_g", "user_id": "a6T_23AMqgCxrHIWa2lZ8w", "user_name": "Jeremiah H.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 2, "funny": 1, "cool": 0, "text": "I've been climbing here for about a year and a half and have had some good days and climbs here.  But lately this gym is really starting to wear on me; it's close to me so I go here most often.  (I sometimes make the drive to the South Bay location for a much better experience).  The gym is always dirty and grungy with chalk dust on every conceivable surface and dust bunnies, hair, and old tape balls lurking in the corners.  I don't know how often they vacuum or clean but it doesn't seem like very often.  The bathrooms are in dire need of a deep cleaning.  They have been adding some nice posters and decorations lately though to spruce up the place.  The staff is sometimes friendly and sometimes kind of stuck up and acting like a clique chilling behind the counter.  I had one guy get snippy with me when I didn't quite hear what he said.  Totally uncalled for.And then there's the routes... The boulder routes seem to be getting progressively worse.  A lot of boulder problems are too hard for the rating, confusing to follow, or are these power routes for gym rats.  There are sometimes two routes of the same color set too close to each other and you can't tell where each goes.  Or routes that just don't make sense and have you saying \"WTH?\"  One V2+ I tried today had a really high foothold start and these thin holds that felt like V3+ or V4.  Even some of the V0s I've done to warm up have these weird crimpy holds that I usually only see on V2 or V3.  It's V0 for crying out loud, a beginner route!  It's like the setters are stoned or sadistic in setting these routes.  The lighting needs work here also, it's much too dim in some areas and hard to see the hold color.  This is a more affordable gym though, and like other reviewers said you get what you pay for here.  But with just some small tweaks it could be much improved.", "date": "3/17/2018"}, {"review_id": "g9YYEjAG2l8CCIqcRIRBCA", "user_id": "ycT7ou43qJRDI0PHpayRsQ", "user_name": "Minnie L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Came in with a groupon on a weekday. The Instructor for the one hour intro lesson was really nice and helpful. We picked up the basics real quick and climbed for almost 6 hours. The day pass also allow re-entry. It was worth it and fun new experience! Definitely recommend first timers to start there!", "date": "4/3/2018"}, {"review_id": "TY4e1o6bOUR0coX3hStQlg", "user_id": "m1RKxaT3Mhcy4Iae3QwXWg", "user_name": "Megan T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This place is a ton of fun. The rock wall rather than the free climb one since the free climb is pretty difficult for beginners even if you're fit. You can spend a long time here I spent 6 hours here and could've stayed longer.", "date": "9/23/2017"}, {"review_id": "jPA4Jc8dSaPsw2nr3GD5WA", "user_id": "lyejrOLm78TBAOdbAGUNPA", "user_name": "Cathy T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I thought that this gym was a bit smaller than the South Bay location but I guess it still served its purpose.  It was my second time climbing so I didn't have a lot to expect other than wanting to get some good climbs in.  I came here on a Wednesday night and it wasn't too crowded. Had plenty of opportunities to get a lot of climbs in until my arms felt like jello.  Climbed for a good 1.5 hours and never felt rushed...I had a great time.  I'll come back.", "date": "1/24/2017"}, {"review_id": "hnpQK0siwo_iJQcYMQjirw", "user_id": "A-R7a39eJEpI4kkMgW8elw", "user_name": "Bradley J.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Great little gym!It's not as big or flashy as some of the gyms in LA, but they also aren't charging $80 a month or an initiation fee. It's also month to month so you're not locked into a contract. I think most lower reviews on here might be from a while ago, because the gym has changed quite a bit over the past 6 months. They've made a lot of improvement on both the climbing holds and the route setting. They reset a large swath of holds (approx 20-30 ft wide) every Monday so the gym is constantly changing. They're also continually adding new styles of holds. Some of them I've never encountered at any other gym. The grading is on the stiff side. After climbing here for a while I started checking out other gyms, and realized that routes are typically a full grade lower (v4 here is about v5 at most other gyms like Sender, Cliffs, LA Boulders, etc)Weekends can get busy so go early or late afternoon. Staff is friendly, and so are the local climbers. Amenities aside from climbing are pretty minimal, but they do have yoga classes for members. They've started setting a World Cup problem as well for those who want to test their skills against the pros. Good luck!", "date": "8/26/2017"}, {"review_id": "eqhTYeYrQiHLFKJIUwhrXA", "user_id": "fUuejD5XAGvi3enPX-dSyQ", "user_name": "Emily N.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "The employees of this gym are super! Sloane gave us a lesson on the basics of bouldering, Christen gave us an awesome in-depth intro to top rope, and Mark helped us with everything else. The two for Tuesday deal is too great to pass up, so I got a one month membership. Because of the small size, subpar holds and okay routes, I don't know if I will renew my membership. Other than the size of the place, my first experience here was great! Just beware that the first time you visit any Hangar 18 gym you will be required to purchase the $33 Intro session and for $3 you can get a whole month.", "date": "9/27/2018"}, {"review_id": "3ApS5hFPlEeED-0rDImSjQ", "user_id": "oTpRFndW-Q1uuDikSbJ6LQ", "user_name": "Olivia F.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun and great place to learn to climb! Instructors are great and the entire atmosphere is built for independence and stress release", "date": "4/30/2018"}, {"review_id": "lxGj1O7NFu4ixxGSERlfKA", "user_id": "IYI0zhdozc5OhKqaVcGAiw", "user_name": "Melissa W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Membership is affordable and it's the only climbing gym in the Greater Long Beach area. Unfortunately, the facility is dirty, the walls are short and caked with oil, dirt and chalk, and there's no lockerroom or drinking fountain.", "date": "4/6/2018"}, {"review_id": "-tDV6_ZxbCjLmSxqmjC-Rg", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 9, "funny": 2, "cool": 3, "text": "A lot of good reviews are based off of the fact that many first time climbers are using a groupon and it's their first time climbing so they don't have much knowledge in the techniques of climbing, which is fine, but my review will explain why I've changed it twice. After coming here a few more times more than a year later I would say that there are certainly slight improvements.Bouldering sections have definitely improved! A big part is because of the climb it classics they had in summer 2015. However, climbing here at least once a week and getting to try out the new problems every week, I noticed one thing, they don't really know how to grade or set properly here. The setters seem to be strong dudes however you'll find climbing problems that are either way too soft or way too stiff. This can be hard on a lot of new climbers who probably won't understand why a V1 might be harder than a V2. Or a V6 easier than a V4. Sport climbing is still a bummer since not many people lead here or hardly any at all, so a lot of the routes are slippery and not reset as often.There's one guy who works at the front desk that always says hi to me and is super nice. The rest of them kind of just don't bother to care and the setters act as if they're better than you sort of attitude. Definitely a lot more room for improvement, the rock wall at my campus rec center is worse so coming here isn't too bad. But it's a bummer because I'm from the Inland Empire area and spoiled with 4 hangar gyms and much more local outdoor spots than this area. Oh well.", "date": "5/12/2016"}, {"review_id": "uCZ_HZqeLjPyJX2-SlXL-Q", "user_id": "CQ0SbavxipXOkJkA3zDI8Q", "user_name": "Kyla N.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "I really wanted to like this gym because it's the closest gym in Long Beach but I just couldn't. Maybe I've been spoiled by my gym (Cliffs of Id), but I just couldn't bring myself to approve of this one. The bouldering section was pretty small and the mats were of varying softness?? Some were nice and squishy but some were just so hard it made me question whether or not it was okay to even fall on them. Also, the gap between the mat and the wall made me nervous. Most other gyms I've been to, the mats are really soft and safe and there's definitely no huge gap to slip into.My other huge problem with this gym is the route setting. Now maybe I'm still a newbie and I don't know much about it at all so take my word with a grain of salt, but it seemed to me that the grading wasn't...right. It seems like most of their routes rely a lot on strength rather than feet or technique, especially on the \"easier\" grades. I don't know, to me, their routes were just weird. There was a V0 I couldn't do but I could do V1s and a V2? Not sure, but then again, I don't know much about route setting and I'm probably just used to the settings at Touchstone Gyms.All in all, I don't know if I'll come back. I'm moving back to Long Beach from LA in a few months but honestly, I might just keep driving to Culver City for Cliffs of Id.", "date": "7/26/2016"}, {"review_id": "Bbnp2wMcCh2aqHB8tn2Q3g", "user_id": "AP-W6EVRTNHkZ_xyJn-iug", "user_name": "Chris T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I don't like that in order to climb here you have to pay $33 + the fee. In other gyms you pass their test of tying the rope, belaying and safety (takes 5 minutes) without a fee to take the test. The $33 fee is lame!!!!!!!!!", "date": "8/19/2018"}, {"review_id": "Ei6_uxi-Tsh6jWc5mj5SuQ", "user_id": "iErQYAsk_DF5lTZJ7H8F0Q", "user_name": "Sandy F.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "I've been here many times before loved it every time, it had been a few months since I had been but being that it was the day before my bday my friend and I made time to come over here, we were just a tad rusty and needed a little review... Dustin came to test us and that's where our night took a turn. He was the single most rude person I have ever met in my life. He made my friend and I feel like complete idiots, and offered us no assistance. My friend and I left after 15 minutes because of how we were treated. We no longer felt comfortable here and decided the money we had just paid for a membership wasn't worth staying. My friend and I will never be returning here and I am cancelling my pass first chance I get.", "date": "1/4/2018"}, {"review_id": "7-oQpQEF1FerZjR-cAMvKg", "user_id": "a_e57VIS2A2-tqyBbLmKnQ", "user_name": "David D.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Great rock climbing gym. But the front desk needs to work on customer service.  If a family comes in and wants to climb, they need to be more proactive in explaining what is required.  We got all the gear, everybody was ready...  but we needed a gri gri. Seems obvious. How else would we belay?  They are missing out on a large revenue stream of people who want to just climb without joining the gym club.", "date": "3/8/2018"}, {"review_id": "AW8F0kw83MJK-qcwJps3AA", "user_id": "R3E34RCSY3bd-41UB9Wxsg", "user_name": "Tessy M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Excellent! Clean, safe and very well staffed! My son is on the Autism Spectrum and climbing is very challenging for him. We took an introductory lesson from Brennon. He was very patient. He taught me how to Belay my son with hand placement, terminology and plenty of valuable practice. I just wish we were closer. We live in Poway, Ca. But will come to see you when we visit family in L.A. thanks for a great experience!", "date": "1/5/2018"}, {"review_id": "aFRI4NX2iCPfgL9_BEc4zg", "user_id": "nv-8pp0DCuK7POGH8RXkiw", "user_name": "Alyssa H.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 6, "funny": 0, "cool": 1, "text": "STAFF WAS EXTREMELY RUDE AND UNHELPFUL. I stood at the front for at least 5-7 minutes while the college kids hired to check people in sat around and talked to each other, sat ON THE DESK WITH BACK TURNED to me while I waited around until I finally had to say \"Excuse me!\"And then act like I'm bothering them when I asked questions, as I'd never been to a place like this before.My friend was meant to receive a free pass to climb (because she's an instructor) but the people behind the desk tried to tell her she was only going to receive half off, they charged her card incorrectly THREE times before finally realizing they did it wrong and just let her go in for free.My friend climbs regularly and teaches climbing to middle-school aged kids. She guided me through so I had fun, but this place just seems like one of those that only caters to people they see everyday and frequent class-takers/members, and are snooty towards first-timers and don't make an effort to make you feel welcome or comfortable.I gave it stars because I actually had fun thanks to the guidance of my friend.", "date": "3/4/2017"}, {"review_id": "lILnmQLDja8AFm6PJsjwyg", "user_id": "0l1lFhX608B0O_t6cmljwQ", "user_name": "Eugene S.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 7, "funny": 2, "cool": 1, "text": "Not really into this place and I really tried to give it a chance.i usually go to the riverside one since i go to school there, but coming home for winter break i went to this gym for a few weeks, and it's mediocre.The rock climbing center itself is decent. (There's 1 large boulder in the center, and the surrounding walls don't go up too high, This i give a 3 - 3.5/5 stars).It's not the rock climbing center i have a problem with, It's the customer service!Every time i signed in they just stare at me like i don't belong.  Not even a hello or acknowledgement! Being a fairly new climber I want to feel welcomed and safe, and at this place I feel neither.  From what I observe, all they do is hang out behind the counter and talk one another. Occasionally they'll talk to others, but it appears that it's either their friends or seasoned \"cool\" rock climbers.I would stay away from this place, and opt out of the Long Beach Hangar 18. Not my cup of tea.1/5 stars.", "date": "1/23/2017"}, {"review_id": "_uarP6D2JJLovQhii9T2Ww", "user_id": "LVEozeObJM27l5X-pn3lBw", "user_name": "Joanne M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Customer service needs work. My boyfriend and I were so excited to try belaying and asked if there were any classes but the guy at the desk said there weren't anymore for the day. Ten minutes later, we see him helping a new group of beginners who came in after us.  we ended up just free climbing which was fun but I wanted to try belaying.", "date": "1/31/2018"}, {"review_id": "4wuNmZ4ExkZbDISvLsJWCg", "user_id": "066d5iQRmD08eTJu_LzlQQ", "user_name": "Laela D.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Affordable, clean and signing up process was easy. Diane was very nice, knowledgeable and helpful. She gave me plenty of climbing and lifting tips. The place is not huge but enough space to get the job done. I'd definitely recommend this place to anybody who just wants to get a thrill fix.", "date": "12/5/2017"}, {"review_id": "VA9eLr2ieuA4Ron2IojPZQ", "user_id": "OtYyh49RBtHeGQdmZ9p9mA", "user_name": "Sam W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "They're doing a great deal for college students - $28/month for a membership, with all rental gear included & a free guest pass once a month so you can introduce your friends to the world of climbing!Hangar bought this place from The Rock Gym, so a lot of the holds on top-rope section are old and it gets really hard to tell what color is yours when you're climbing. Both the top-rope and bouldering sections are small, but they have good routes and fun boulders where you're sure to find a project to work on. They only have a couple auto-belays set up if you want to top-rope without a partner.They have yoga classes in the evenings, and if you have a membership, you're welcome to check out any of the other Hangar 18 locations for free! TIP: Expedite the process if it's your first time coming in, and fill out the liability waiver online before you come in!", "date": "6/12/2014"}, {"review_id": "QgHg-Gz7L3KBaqtUZOlfYg", "user_id": "BebnysNXU0p_FlfOc8f2VQ", "user_name": "Jamie M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 4, "funny": 1, "cool": 1, "text": "I've come here before and thought it was ok - not great but ok.My lack of stars is more because of their front desk service. We got there a little before 6pm on a saturday night and there was no one at the front desk. We're not members so we were just going to pay for day passes and shoes. We figured someone would help us eventually but it took 20 min for someone to even walk over. The worker was helping a top-roping class and he was the only worker there at the time, it seemed. So it would be understandable if the service was slow. But he leisurely walked over and didn't even apologize for making us wait so damn long and then told us to fill out waivers since ours expired and walked away to help the class again. And after finishing and waiting another 10 min, he looked over and made eye contact with us and went back to WATCHING people top rope. He wasn't helping them. He was just watching. And so finally another girl came cus she had a yoga class to teach or something and helped us before going into her yoga class. But in the middle of helping us, she turned to another customer and started helping him???? (not the other customers fault, at all) and she turned back to us and was like \"did you need anything?\". So dumb. So we said we were in the middle of asking you for some chalk and she was like \"oh, right\" and finally got us some.We ended up starting climbing close to 6:40 when we got there around 5:55/6pm. Worst service ever. There's no excuse for that.", "date": "8/20/2017"}, {"review_id": "Q6zsltz93BBF6CmNBYSH5w", "user_id": "qYugesyoO3sNPflT23A2ow", "user_name": "Jill P.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 0, "funny": 0, "cool": 1, "text": "Like others have stated, it's dirty. They allow rock climbing shoes in the filthy rest rooms. So the dirt is all over the wallsSome employees are very friendly if you ask a question. Most, especially one dude, is rude rude rude. Unfriendly. Many other reviews stated that they continue to charge your credit or debit card even AFTER you request to cancel your membership for the next month. They don't do it and you get charged anyway. And if you do cancel they no longer welcome you. Especially one employee. I'm thinking he's the owner. Also the routes are too easy or too hard. Most are too hard and there aren't a lot of routes. I've been to other hangar 18s and this one is just awful. The only good thing is the low monthly cost but I'd rather spend more money at another gym.", "date": "4/21/2017"}, {"review_id": "iox99IpQ9c7QIuFfmgjxig", "user_id": "a1W85BQLS3HZqjFx2NJbZw", "user_name": "Frank M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Overall a fun place to be and it's adorable. The employee are nice and helpful. A younger crowd", "date": "11/21/2017"}, {"review_id": "5EKaVYVA3LNUEo9h4ZWTJg", "user_id": "HROO8Q4mckCs0PSw5ow4HA", "user_name": "Danny L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Was my first time here. The guys working here were very helpful. The lesson my girlfriend and I was very detailed. They're primary concern is safety. I got a membership here for her and I same day. Love this place", "date": "9/5/2017"}, {"review_id": "GV3Tahdsjw29TRZ0U3R9_Q", "user_id": "8DC6kOTyhnzr6kEpyQ2IZQ", "user_name": "Liz G.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Always have been a go to \"workout\" place. I put workout in qouted because although it does take a LOT of strength.. it is very fun at the same time. They also have great prices that will make you want to go and make use of your membership. They do this thing where they freeze your account if you take a trip somewhere..so thats always nice. Work well with you and super friendly (:", "date": "2/10/2017"}, {"review_id": "wIVwZVTmREUTCY-a2mXJcw", "user_id": "DpFXk1kMQiax2KIN81mAPQ", "user_name": "Sarah W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We had a blast visiting this gym. There are different sections of top roping which makes reviewing the walls difficult. Some have a strange wood wall which takes away good flags/smears. They have two auto-belays which were fine by all means. We found our favorite to be the top rope section with large craters all throughout the walls, with a small hip/ledge which made things fun/challenging. The rocky and walls were fairly dirty which is why I didn't give 5 stars. It made things BEYOND slippery and squeaky! The gym is a GriGri-only which was new to me, but I enjoyed the safety perspective! We did not boulder too much, but they offered TONS of routes and the padding all throughout the bouldering area was extra soft/safe. If you're into lead climbing you should check this place out solely for the full-ceiling routes. Looked crazy cool (and a little wild!). Overall, come try it. Very nice staff as well.", "date": "5/7/2018"}, {"review_id": "RVJy8pe5X0ReKItMoi5iPg", "user_id": "z1ScqxSYa3HRMmxKtlxp_g", "user_name": "Airi T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 5, "funny": 0, "cool": 1, "text": "For a beginner like me, this location is not the best. I was underwhelmed by the size of the bouldering area; it's a lot smaller than the other gyms that I've been to (LAB, Stronghold, Hangar 18 South Bay, some in the OC and Bay Area), and there were only a few routes that I could try. Not complaining here; just want to give an honest review for people who may be of similar level/experience with climbing. I usually expect to only be able to try a few routes since I'm an irregular climber (mainly bouldering) and usually can only do up to V0-V1's, but the LB Hangar 18 was just smaller in size than I expected.The staff was very friendly. The guy at the front offered their membership on a discount after I purchased a day pass. It looked like there was a community of people who attended the gym regularly and the people I spoke to said they liked the gym. I'll probably be back with friends in the future, but I don't think I'll be purchasing a membership for now.", "date": "6/16/2016"}, {"review_id": "ixp6v_tBkNmPXuU4r_R_ug", "user_id": "JHE2ttmRrd8ni2-W4MzdKA", "user_name": "Danny D.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Horrible place... I wasted my money here.   I took my teenager and younger kid here for the first time and my kids were not given any directions on how to safely rock climb.   Your on your own if you come here.  Staff is not helpful at all.", "date": "5/6/2018"}, {"review_id": "Nd12SnXxhJ4uc4IehLRjeg", "user_id": "oSN3M4_WKdlTsnpgqPDiBg", "user_name": "Steph H.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 5, "funny": 3, "cool": 5, "text": "I got their Black Friday deal, which was $5 for one month membership (fyi, you give them a credit card # and they'll start charging you reg monthly membership price after the promo month, unless you cancel in writing). I'd never been to this gym before I got the membership, but since my trusty friend Hannah E said it was all right I decided to give it a try. So far I'd have to say it's not bad. It's close and convenient, which has been motivating me to go 1-2 times a week (something I'd definitely have to keep up to make it worth my while once the regular membership kicks in at $48/month). The facilities are decent and the monthly membership is some of the cheapest around for a climbing gym (compare to the $79 for Sender One in Tustin, which, admittedly, is an amazing place). Plus, I get access to other Hangar 18 facilities, and I've been meeting up with Hannah and some of her other friends at the Hawthorne location, which is better than this one. I have yet to take advantage of their classes or the friend pass, but hopefully all in good time. In the meantime, I've been enjoying the challenge of becoming a better climber and getting a workout that complements my running.Some things to note:- I've learned the basics of top rope climbing at other places so I wasn't a total n00b coming in here, which is good. It seems seriously understaffed here all the time, so depending on how many people are needing instruction/help you might have to wait a while- related to above: they don't require a belay test or anything so they just assume you know what the hell you're doing if you don't ask.STEPH JUDGEMENT: A decent climbing gym if you already know what you're doing.", "date": "1/6/2015"}, {"review_id": "69DqitkqnfDu97wx0JTxGg", "user_id": "aunyiINGdqp_n4HgfiMWmA", "user_name": "Natalie G.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Bought this as a Groupon, and my boyfriend was adamant about coming in although I tainted my own thoughts after reading bad reviews on here. First of all - they now have signs that tell their guests to take off climbing shoes before going into the bathroom. This initially freaked me out so it's great to see they've made changes based on what people have said on here. It gets hot in here! And choose wisely on the times that you come in, it can get so crazy busy! We tried a Friday evening and it was great, barely had anyone there. My only complaint is that after coming in and signing up, we weren't asked if we'd done this before, if we needed help, if we needed any gear, nothing. We were signed up and sent on our way. We looked around before realizing we probably needed to ask for shoes and other equipment. We then learned, after asking, if we could have someone teach us about the belay, turns out they only do it earlier in the day. I think it'd be very beneficial and easy for the staff to sort of give a quick walk through or just ask what skill level or give knowledge about what to do in general. Because of this I can see why others have made comments that they feel ignored or belittled for not being a real climber. We had to make sure we sought them out each time when it could've gone smoother with a quick intro, and it's not always easy knowing which people work here since everyone is dressed casual and many walk behind the counter. Great experience once we knew what we were doing. Friendly staff, just wish they were more proactive with guests. We'll be back!", "date": "8/16/2017"}, {"review_id": "lT0tZT3hnkE5zrdBS6Nsxw", "user_id": "NFpxkGAan-qUmI9kiEHLyw", "user_name": "Janice L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "Yes I'm in love with climbing. A couple days ago, I came to check Hangar 18 out and was whatever about it. Of course this is probably because I have been spoiled by the large amount of open space that Sender One has. We saw that they offered technique classes so we thought that we would try them out! :) They were extremely accommodating that I would not get there in time for the class since I was coming from Irvine. We had Vinny teach us and he taught us about all the different types of holds and how to climb most efficiently and different things to try. He was super nice and informative and made the class fun and time went by quickly. I would definitely take another class from him. He seemed to know a lot of people that were there to climb, so I'm guessing the same people go frequently.The only thing I would say is that I wish that there was more space and that there was air conditioning. There were a lot of people there for a Tuesday night, but once you are climbing I feel like you don't even notice. I will definitely be back since I bought a Groupon for a monthly pass :) so excited to climb more often. It is most definitely more affordable than Sender One, that I can tell you. You'll be seeing me a lot here and I'll be looking forward to improving and being able to take the next class!", "date": "4/13/2016"}, {"review_id": "lKWCzedf-4SRe9tLEPN01g", "user_id": "IYtMkKM830vCg_Yh86Up7g", "user_name": "Christine A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 6, "funny": 2, "cool": 2, "text": "Previously The Rock Gym, it is now an addition to the Hangar 18 family; the newest of four in SoCal.  They don't have their new sign up just yet (maybe they do by now?).I haven't been in here before or any other rock climbing place but I learned that their walls are new.  I also learned that there isn't any air conditioning in these type of places.  They've got a number of fans going in there.  Being that we've still been experiencing the heat of summer I think made it a little extra warm but it wasn't unbearable.  Could the sweat I was producing be just because I was working hard?I took a friend here to redeem a Groupon.  Early in the day in the middle of the week, we pretty much had the walls to ourselves.  Brandon showed us the ropes, literally.  The lesson felt fast.  Sooner than you know it, we were left on our own but he was just a yell away if we needed him.  We tried to take advantage of being able to stay the whole day.  I wish I had taken more snacks so that we'd have more energy to keep going.  We left after a few hours since we were tired and needed real food.  It was a good experience and now I can cross off rock climbing off my list.They have a fridge of cold water or sport drinks to buy should you forget to bring something to quench your thirst.  I think I recall seeing a water fountain too.", "date": "10/25/2012"}, {"review_id": "FPGOWDqWlfsERi6GR4FoRg", "user_id": "uehv9OIZ2uatOCoKQIsBVg", "user_name": "Joe L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I was here about a week ago just to check out the location before making the final decision to buy the Groupon for a month to take the technique class. I wasn't very impressed as the location isn't as big as the other climbing gyms I've been to and is often crowded (just like every climbing gym though :( ).I decided because I've found something I truly enjoyed to take a technique class offered here and I met Vinny. Vinny was very informative and taught all the basic grips/holds and different techniques to approach based on my body type. I wasn't really expecting much from this class so I was amazed with how much it helped. I definitely recommend this class if you are beginner climber just so you don't injure yourself down the road and climb efficiently.Definitely will be here as much as possible to hopefully get better as time progresses. Don't let the smaller size of the gym fool you! This place has it all and for a much more affordable price.", "date": "4/14/2016"}, {"review_id": "AEe4i6uBOvYKZ6rJlRj_BQ", "user_id": "0yxN_CmSotv-t1sUZA1zYg", "user_name": "Maggie C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 5, "funny": 1, "cool": 1, "text": "Hangar 18 is a typical indoor rock climbing gym that offers some lead routes, top rope (some with auto belay), and boulder problems.The gym equipment seems basic, but the bathroom is massive.  Good padding in the boulder area.  The staff offers free belay lessons, which is nice.However, some of the holds were so worn that I couldn't distinguish the color on the route, which may have made the climb harder than it is.  There are some fun features on the wall that you can incorporate on the climb, which is kind of different.  There are 2 auto belays in the gym and usually by the easier routes, good for warm up and waiting for your partner to join you.Not better or worse than other gym, but this gym is pretty spacious and not crowded when I went.  Good deal if you live close and use the groupon.", "date": "11/17/2014"}, {"review_id": "ykjl23M9l_d7Jd7_Njb6Xw", "user_id": "G4TYs1WfaewrSKGZ4GNEpg", "user_name": "Laza L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you are looking for a place that is challenging, fun, and a good place to learn, Hangar 18 Long Beach is the place for you. The routes are more on the harder side but it helps greatly with the learning curve. They play great music, are friendly, and create a great atmosphere for all.", "date": "8/11/2017"}, {"review_id": "pRqczxaTxESc2cOlfexTIQ", "user_id": "nZ30Pzkc6DUHe9y-YZknWA", "user_name": "Trang L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "I've experienced better gyms than this Hanger 18.The employees were not very tentative to my friend and I when we first arrived. The staff left us alone waiting for 10-15 minutes before coming back to tell us we still had more forms to fill out, wasting our time. For students at $33/month and standard membership being $46/month, I find this to be rather pricey as another gym I had been to had its membership for much less than that. Although you are allowed to go to multiple locations t Hangar 18, as a SoCal girl, this doesn't allow me much variety since most of the other locations are more inland instead of down south. I found locating the paths of the climb paths to be difficult many times. Although I am a beginner, I found the V0 climbs difficult to climb. One area of this Hanger 18 is still being renovated when I went last week, which made the bouldering areas pretty crowded on a Tuesday. The top roping walls were mostly free, but I did not get to try out the top roping.I would not come here again if it wasn't for the free pass my friend gets with his membership once a month.", "date": "4/8/2015"}, {"review_id": "sq4JojSFSx9-jitoCWWvag", "user_id": "j9W_jaUMQQNt_AWbvYEW0g", "user_name": "Kevin B.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came in with my nephew with a Groupon deal. Steve was extremely helpful during our orientation and made us feel very comfortable, as it was our first time ever trying to rock climb. Really nice guy. Rock climbing was fun! Really tiring, although it does tear up your hands. but will definitely do it again.", "date": "7/14/2017"}, {"review_id": "jEuWbL4OW5IQ_ZSj7xRR4w", "user_id": "fBlJXWTE0ge7AzwrwPXD_A", "user_name": "Christine A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 5, "funny": 1, "cool": 3, "text": "I've been coming here for over a year now, but this is my first review for them. The staff is great and always answers all my questions. I had a membership before and to cancel all I had to do was call them. Then I got a membership again later for a student discount ($33/monthly with student ID)FIRST TIMERS: - $16 for a day pass + $3 shoe rental= $19/Tuesdays= 2 for 1 deal (mention it!)- come in the morning & afternoon, weekends (less crowded)- its gets real crowded at night, but if you do want help there's climbers to help/show you- bring water and socks- left corner side is the beginner wall for belayBEGINNERS:- buy shoes if you're planning to get a membership (rentals suck!!) I got mine from omcgear.com (oregon website aka no tax!) but there's an Evolve Outlet store in Buena Park- buy chalk too (they sell it for $2/block)- keep going, you'll get better in time!PROS:- nice and friendly staff, good music- memberships include yoga classes, all the gear you need (shoes, harness, grigri), 1 guest pass each month (includes rentals), and includes memberships for other Hangar 18 gymsCONS:- there's no air conditioning so during really hot and humid days, it will get super hot in there even with their fans blasting- at night it gets super crowded, but sometimes I like it since people do routes I have trouble with so watching them helps me lol", "date": "10/20/2015"}, {"review_id": "Tri07GjNRADw1lGuRS07WQ", "user_id": "FOestYcOlI1DCGMXL2_LRw", "user_name": "Tracy B.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 6, "funny": 1, "cool": 0, "text": "My first experience at any sort of rock climbing gym.Went on a Tuesday. It was PACKED.Went with a couple friends, some who had been there before, some who were beginners/first timers like me.Had to fill out consent forms, yadda yadda.Guy at the desk was SO unhelpful.Took our info, asked our shoe size, charged us, then sent us on our merry way.Maybe he thought that my friends who had been there before would just do his job for him and explain what the hell was happening at this place?If it weren't for my one SEMI experienced friend there, I wouldn't know about chalk, why the rocks were all different, psychedelic colors, and what the random tags meant. Oh or which walls I would actually climb on?!?!?! Might have been helpful info to receive from someone who was paid to help me.And don't be mistaken by my description of the place being packed. We were the ONLY ones at the front desk. The \"packed\" part were just climbers.SO after some advice from my friend, we started climbing. It was cool. We had to wait for every wall to become available because so many people were crowding it.Thing about the walls though. Sometimes hard to distinguish colors. A lot are very faded. Some had taken on a new color all together but the original color could still be seen. One appeared to be smeared with bird poop. My friends and I had to tell each other \"That one is white...blue...light purple!\" while we were climbing because there are difficult ones to distinguish.BUT to top it all off, we're about to leave and my friend asks how much we paid, seeing as how Tuesdays are BOGO free. I told him, thinking that what my friend and I had paid together was only the price of one, seeing as how the guy charged my friend the BOGO price a minute before he charged me. NOPE. Mentioned it to the dude man and he says \"Oh that deal happens only if you mentionnnnnn it\". AKA you're new here so I'm taking advantage of you. Well after I MENTIONED it, I got half our money back. Dude. Geez. I'm just new. I'm not stupid.So, the rocks were cool. If you're a beginner you may have to drag a staff member out of their happy place in order to get any direction from them. If you're down then go to this place. And make sure you MENTION the BOGO deal on Tuesdays.Experienced climbers, this place felt very clich-y and \"in-crowd\" ish. So if you're a member i'm sure they'll love you. It seemed like there was a good variety of walls to climb so go for it.", "date": "9/30/2015"}, {"review_id": "S-6WpgbU9b2rf6Dlv_qebA", "user_id": "QG51Dkyl_qZJYj86sgRDtA", "user_name": "Ryan O.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "Hangar 18 is as mediocre as it gets. Been climbing on and off here for the past few months and although the routes are decent, the energy from the staff sucks. I'm never met with a \"Hello,\" or even a \"How are you today.\" Their customer service capacity isn't even sub par. It just isn't there. One thing I loved about my previous climbing gym was that the staff were super friendly and made you feel comfortable and welcome. Only reason I continue to climb at Hangar 18 is because there's just nothing else near by.", "date": "8/10/2017"}, {"review_id": "-kNBBdsiu0_KMLnSJlmpLQ", "user_id": "gGV9VEZBrO2B0B-DMOT5JA", "user_name": "Trevor C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came to Hangar 18 on a Thursday afternoon. I live out of state at the moment but met my mom here to take her on an adventure. Her health hasnt been great for a long time and she gotHerself well enough to want to take on rock climbing. We met AJ at the front and he was very polite and provided excellent customer service. We did a belay lesson with him and he explained and showed us everything In vivid detail. My mom wasn't understand the belaying movement and it actually took a while. I myself was getting impatient with her lol but AJ was very patient and stuck with it and helped my mother. Once I started climbing he stood by my mom to make sure she was getting it. Thank you AJ! The walls itself are great. They were set up with the degree of difficulty matching the colors. Equipment was strong and I felt safe. Overall I had a great experience with Hangar 18 and recommend them if you want to try rock climbing.", "date": "5/22/2016"}, {"review_id": "vlf6BM_jhJArtKoIZ4yy8A", "user_id": "vBDG2krbKcWoyH3eywkbzw", "user_name": "Jeryl B.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 4, "cool": 0, "text": "This place is cool, staff is friendly and warm. A big butt (not a typo, I like puns) though, there's no air conditioning so it gets hotter than halitosis during hot/humid days. I used a Groupon here where they give you an intro lesson for two individuals all for the lovely price of $30. Everything you need to get going is included. However, make no mistake, after one day, you won't look like [Sylvester] Stallone in Cliffhanger, but keep at it and you just might have a sexy back like Justin Timberlake.", "date": "10/5/2015"}, {"review_id": "okAAmYsgU1sACYd2JCOX5Q", "user_id": "VfOjerIjl765YIkydkMWOg", "user_name": "Ron T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 5, "funny": 0, "cool": 0, "text": "Hangar 18 Long Beach is an excellent beginners gym.  I'm trying to get into shape after taking many years off due to a shoulder injury. There are lots of beginners boulder climbs from V0 to V5. There are enough top ropes to get you into shape and learn to climb. There are auto climbers available so you can work on your technique or your endurance without a belay slave.  Yoga classes are offered to improve your body. I do wish for more lead routes and a long traverse to train on. If you are a better climber, there is a system wall, hang boards, and a nice campus board as well as a few boulder problems from V8 to V10 to train on. A set of free weights is available to keep your body balanced.  All the stuff you need to shred the Buttermilks, Gunks and Hueco.  Full Service, I'm coming...back!!!The energy here is great with a laid back vibe. The bathrooms are large and usually clean. There are picnic tables so you can host your kids parties. The staff is really nice and helpful.", "date": "10/3/2013"}, {"review_id": "SLJYswwWIH4RWItTbJifZw", "user_id": "FNXDuzGmSkCk35qrGcPqKA", "user_name": "Michael T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to learn how to climb. They teach you all about the use of the climbing devices and make sure you understand them before you go out on your own or with a partner. They also have a great deal on a one month trial.", "date": "11/6/2017"}, {"review_id": "jnWLc9Wa2t7gkA9UBJF7lA", "user_id": "W3wHytM7HL4BlGivZFrk1g", "user_name": "Neil Y.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 5, "funny": 0, "cool": 0, "text": "Short Sum: Fun but smallPros:- Been to Hangar 18 twice because of the $30 for 2 belaying lesson. Pretty good deal considering it comes with shoe and equipment rental + belaying lesson. Took the lesson a second time for a refresher. - Our instructor, Lynn, was extremely informative and energetic. She was a lot more informative than the previous belaying instructor from my last visit and went through every little detail. There was never a dull or awkward moment with her either. :)Cons:- Bouldering area looks a bit small compared to the one in the Hawthorne location.Go back?- Yep.", "date": "7/14/2015"}, {"review_id": "RaUbkTrkIxnSSxdFtSkb6A", "user_id": "Ks1Cucz8mC3vUnhF56kj0w", "user_name": "Dominic J.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "This place is awesome for many reasons: Cheaper than a regular gym, but 10 times more fun. Free classes, yoga, and free weights for members. Also, a free pass to bring a friend each month. BUt what makes this place the best is the community. I'm brand new to climbing, and to be honest, have no idea what I'm doing. What i've found most amazing is how friendly the climbing community is amongst both experienced and non-experienced climbers. After working on a climb for a while (my first V1) a guy came up to me and suggested pointing my feet differently. THis made all the difference, and by the time I got up that wall a crowd was cheering for me. I thought maybe this was a one time thing, but each time I show up I end up having a great conversation with someone else. I've become so addicted to rock climbing I'm now going 4 times a week. You have to check this place out!", "date": "6/9/2015"}, {"review_id": "5bb46N4HXkReq8Yoxt2UlQ", "user_id": "RdAxTEet_dkz2THC44phww", "user_name": "Bryan L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My wife persuaded me to go to a climbing gym today, we are pretty active but wanted to try something different. The gym staff were very helpful, we paid for an initial training on top roping   And they gave the class as soon as we signed the waiver for danger. They were very patient and the class was one on one. Then we spent the next three or four hours climbing. All in all a great day. We decided on getting the monthly membership. Excited to go back again", "date": "2/27/2016"}, {"review_id": "BiTqcwqk54ixTSU0dB0jRA", "user_id": "-BaMUVvdVM9tOcq3gYMDXA", "user_name": "Ivan L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Very small compared to riverside location.Walls do not go as high. Most of the boulders are hard, so if you are a beginner, you won't be able to do much.", "date": "2/5/2017"}, {"review_id": "TOHDGTz2qvIGWR8o9UI9SA", "user_id": "AGFEXhQ_QftwHUObV7DN1w", "user_name": "Jonathan R.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 1, "funny": 0, "cool": 1, "text": "I wanted to like this place more.  I really did. The main issue I have is that there simply isn't enough space to climb around.  In other words, I am used to more spacious climbing gyms in Virginia.  Additionally, there weren't many people at this establishment and developing a rapport with anyone other than the employees there would have been a trial.  Later after I finish my degree, I will likely find a more stable gym hangout.", "date": "6/1/2015"}, {"review_id": "mZV_baaD6Li2_9l1rgcyTg", "user_id": "-8hnmBOU3e3HfK2QIzsTCA", "user_name": "Chris S.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 6, "funny": 2, "cool": 0, "text": "CEASE & DESIST!  They'll keep charging you after you tell them you quit!They're extremely nice and helpful until you cancel.  I was completely alienated by the employees at this location on multiple occasions and will never step foot in any Hangar 18.   Interesting business model that makes ending your contract impossible over the phone unless you threaten to sue them which I actually did with a notarized cease and desist letter.", "date": "8/18/2014"}, {"review_id": "nY2x5DRe6s1xJ8IMrlb6sg", "user_id": "XaFbERBemwuKkByxWc9dsA", "user_name": "Julia W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 6, "funny": 4, "cool": 4, "text": "I don't get the 2 and 3 star reviews for this place. Hangar 18 is a rock climbing gym, and it delivers just that! If you are expecting a shiny new nicely labeled atmosphere where the holds are easy and clearly marked, and people to wait on you hand and foot, maybe you should try a jungle gym at mommy and me instead. I mean come on people. This place is great! Sure the walls look a bit worn and the pads are kid of old, but it's all perfectly safe and maintained, just follow the rules and don't try anything stupid. The people who work there are great, but overworked and understaffed, so kudos to you guys for being able to handle it all. Just discovered climbing, and becoming a regular here!", "date": "7/19/2014"}, {"review_id": "x1P56OkPbDmCdBzraKFC9Q", "user_id": "Q_lHgjq6uKxkdSCC0t3nNw", "user_name": "Adrian R.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time visit the other day and place seemed just okay. Kind of small, wish it was a little bit bigger. Some of the mats were questionable. Not a lot of intermediate level bouldering offered. Not many great places close by. As the sport grows, hopefully bigger gyms will pop up.", "date": "8/23/2016"}, {"review_id": "oMjTL6GJKPhygION_KqNTA", "user_id": "999nPL5WhRQWzNkb2gv0Cg", "user_name": "Andrew C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am the Youth Pastor at Calvary Chapel Long Beach.  I took my Junior High & High School Students here after Church today and it was a WONDERFUL experience.  We climbed for 2 hours at a reasonable price.  Also, the \"helpers\" who took care for us were absolutely GREAT... outgoing, informative & personable.  We shall return!!!", "date": "8/14/2016"}, {"review_id": "XuWzW-zS-tQikG9NyesVzQ", "user_id": "f0uwLEHPIuNWgFuUNd473Q", "user_name": "Jacelyn K.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is pretty much the cheapest rock gym you can find around LA, especially if you take advantage of their deals. Most gyms membership price are almost twice the price. $33 a month for student is great. This particular Hangar 18 looks kinda old..but it's okay. Everyone's super nice and the routes are reasonable. I got their one month membership for 2 for tuesday. It was worth it. The bouldering sections have super thick padding all over the floor so you don't have to move any pads. The top-roping is good, not too many easy routes for beginners though. Most walls are slanted out, making the climb harder than a straight wall. I like that. There's a few easy walls for beginners, but if you just started...there's not too many top-roping that's easy, just go for bouldering V0. It's not the cleanest gym...it's not the nicest, but it's big enough to get things done. Has a good variety of ropes and bouldering routes, nice padding, nice restroom. You can rent gear (shoes, harness, gri-gri). And there's 2 auto-belay for people who wanna climb tall walls on their own. Worth the price, but you can find better if you're willing to pay 50-60+ for a month of membership.", "date": "5/21/2015"}, {"review_id": "a29r-DysdCKVx1Z7V1Ed7w", "user_id": "1dwSBp4yGzD6XLOGXpPKOA", "user_name": "Tyler C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I come here all the time, cheapest and best climbing gym around. The staff is chill, haven't really talked much with them but they're nice. Some awesome climbers come here and the routes are always great", "date": "8/30/2016"}, {"review_id": "jeEJ17W9zddpQCLNFsJ2pQ", "user_id": "GSs0K5uIMlT7W88sPH3Sxg", "user_name": "Lenore B.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I've been to this place twice. My friend and I used a groupon deal. Initially when we walked in the staff wasn't very attentive. It took a while for them to notice us standing in front of them at the front desk. After a good 5 minutes they had us sign some waivers. My friend and I had a great time trying to conquer these walls! This is such a great workout and it doesn't even feel like it. I'll probably come back sometime again.", "date": "11/26/2014"}, {"review_id": "7UAms4DQsVXUh3wEjlp3wQ", "user_id": "M3pz0fX_lIcTXZ55pEbF_Q", "user_name": "Anto A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Fun place to spend a few hours. I'm a complete beginner and had a great time. It was way harder than I imagined it would be. Parking is tight, the gym gets hot.", "date": "2/13/2015"}, {"review_id": "6ayEEnKQk34Hj2VOJK4Hyg", "user_id": "ZkSdT2ahhH3bST-1svO2rg", "user_name": "Jerry C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for fun climbing and working out. Fun place.  Nice and helpful staff.  Would recommend coming here. Anytime.", "date": "6/30/2015"}, {"review_id": "wkiL0mtUiOGdNNhh25HAzA", "user_id": "QwhpEA9LY0GiORimaDxNDg", "user_name": "Deanna L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Let me preface this: if you're coming from some place like Sender One, which is like the sparkling Equinox of climbing gyms, Hangar 18 might feel a little... homey? The lack of A/C, the fairly straightforward setup of the front desk, the very barebones industrial warehouse setting, the tiny yoga room with dirty hand and footprints decorating it-- yeah, I could see how it could feel like a downgrade from a shining, pristine mecca like Sender One. But listen: I'm here to go up stuff and then come back down, over and over again, until my skin comes off my hands in little bloody sheets and I have to tape it down so I can keep going. We're past the Tinder date spot search here. There's nobody to impress, no nervous insecurities to assuage. I'm addicted to climbing. I live 6 minutes away from this gym, so I can come whenever I want, for like 33 bucks a month (seriously, check their groupon deals and specials, and come in on a Tuesday for their BOGO deal), and climb to my heart's content on bouldering and top-rope routes that are consistently challenging and fun. They change them out regularly, but not so often that I can't have a couple weeks to really work on a tough problem. Not only that, but the gym is functional for a climber's needs, if a little barebones. All the weights are there, people usually re-rack, there's no sharp points and the upholstery is still intact on the benches. What more can a girl want?I've yet to check out their yoga classes, which are free to members, and I know they have a techniques class designed to improve bouldering skills for both intermediate and advanced climbers. Just knowing that they offer it is pretty cool, though. The staff here is pretty friendly and super knowledgeable. They're not falling all over themselves to strap you in your harness and call you ma'am, but if you have a question, they're more than willing to give their best advice, which is usually pretty great. So yeah, it's a little chalky and homey, but for a good place to climb, this is it.", "date": "2/29/2016"}, {"review_id": "oRtYenvggp_1hHHpqQBZdw", "user_id": "JZH2n5WrfPYJPM9MYivSHw", "user_name": "Esther L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 4, "funny": 1, "cool": 2, "text": "Great place to spend a few hours when you're in the area. An awesome work out for your body.", "date": "9/30/2015"}, {"review_id": "e55plv_MFn_emeuEx9wcYA", "user_id": "vnXNp87PYHZo170ws36kDw", "user_name": "Mike A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "*****beware****please****do not give your debit card #**********they will continue to charge it even when you repeatedly request them to cancel your membership**** they were friendly & nice until you want to****", "date": "10/10/2015"}, {"review_id": "mQnon4piy0pThe3Z6fthvA", "user_id": "TmACsZ516-M1McIQjeIgjw", "user_name": "Haylee L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came in here today for the first time and the girl at the front desk was AMAZING! I don't know what her name was (she was an Asian girl) but she was so awesome.  My friend and I were pretty clueless on everything and she was beyond helpful.  She didn't seem annoyed or irritated that we knew nothing and she made our experience fantastic.  Seriously she deserves a raise.  Loved every minute of it and will be coming back! Can't wait!", "date": "5/24/2016"}, {"review_id": "M-aUnGD1FgAtNqexLge-aA", "user_id": "Q25pDAEpDAPpuccgy-d9Tw", "user_name": "Liz G.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Got a groupon for lessons and a day of climbing for 2. It was a lot of fun and a great date idea! The guy who taught us was really friendly, and did all the necessary safety checks. I never felt unsafe using their equipment. For first-timers, you should know this takes a lot of energy. We were tired after an hour of climbing, but I liked how this place lets you come back any time before they close if you buy a full day. Also a great way to work on trust issues while you're belaying your significant other ;-)", "date": "5/18/2014"}, {"review_id": "jqMWIhs9Dfeg0OhyCntDoQ", "user_id": "DKoGMV0TaqRqNEBB4TA_kA", "user_name": "Priscilla F.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My regular gym, friendly staff very helpful, great gear buy with member discount. Gym membership is affordable. Great place and friendly atmosphere, good for.kids too!", "date": "6/5/2016"}, {"review_id": "D-xlltK0QOVgzLYavleCPQ", "user_id": "skkCdJdLlgi062PoYgHEfQ", "user_name": "Pakpoom S.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "Whether you're a veteran or just trying it out, Hangar 18 has a little bit for everyone. Staff is friendly and helpful getting you all set-up. There's top-roping, lead climbing, and bouldering. They have recently put up new crash pads, which is nice compared to what they used to have. However, the pads are already starting to rip :/ This specific location is good for what it is in comparison to other hangar locations. Having a membership to Hangar 18 is nice since it gives you access to other locations as well. Other perks of this location is it has a little free weights area (nothing special, just the basics...it gets the job done) and offers yoga for members.Overall, I love this place. Not the most fancy of rock climbing gym out there, but it's my home gym.", "date": "6/16/2014"}, {"review_id": "hBLApt_IGn6a1xCr6MQIGA", "user_id": "TrKspxKFRzY3kngdxiJuhw", "user_name": "Alyssa V.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I have been going to this gym for about 6 months now, and this gym is the best. The staff is very friendly and the routes are great. I recommend this location.", "date": "12/13/2016"}, {"review_id": "pQyn06U2ZD1GQbDqpdbXtg", "user_id": "zTb1dVErZ2JiuyRYzhzk0w", "user_name": "Peter W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Bought the Groupon and checked the place out last Thursday.  I have never rock-climbed before, but have always wanted to try.  Huge, clean, safe place with a very kind staff, great equipment, and also great music playing in the background!  I know it's a silly thing to notice, but when you're working out, you want to have energetic music going, but nothing loud, poppy, metal, rap, etc.  It's a great balance of classic rock and, this is really embarrassing, but the classic 90's song \"Free Fallin\" came on when I was at the top of my bouldering and I felt so personally empowered. haha!  Anyway, great place.  Check it out.", "date": "1/20/2014"}, {"review_id": "xRjIgwdAMoOPuJ80Rv3Xew", "user_id": "fokdBQp_2vMJWQ_6arDhcQ", "user_name": "Anthony A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Came in with my girlfriend utilizing a Groupon deal. The trainer was very nonchalant at first, and during training this had me worried, but I see now that he wanted to make us feel at ease and not freak out--rock climbing isn't so crazy once you learn and try it yourself. He remembered us on subsequent visits and I truly felt welcomed. Went once during a group party visit and even though it was crowded, still managed to get my climb on.The facilities were clean and the \"beginner\" walls seemed plentiful. There are also \"expert\" areas without ropes that are very popular. There is also a \"gym\" area that is pretty rundown and underutilized: some free weights, pull-up stations and a sit-up station. Definitely not the draw here.Minus-1 star for the nasty-feeling shoes you borrow--very similar to bowling alley experiences.As a beginner I recommend this place wholeheartedly to other beginners.", "date": "3/13/2014"}, {"review_id": "2QLjgiDO6YGQNK8D4FVtOw", "user_id": "cRMOfdX1CEp8H3b225SgAA", "user_name": "Brian Y.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "taking the activity back up. My introduction to Indoor Climbing began here. Formerly the Rock Gym. Instructor at the time was Buddy. He sure was. BELAY", "date": "2/13/2014"}, {"review_id": "lvdEXVWaMoF8Mn8P74k3EA", "user_id": "4tMvm0Dlp-0gh2qsgIohtw", "user_name": "Denise C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "Pros: It's close to my house and it's not expensive.Cons: 1. They allow you to wear your climbing shoes in the bathroom, and the bathrooms are disgusting. Therefore, the disgusting bathroom floor is now all over the climbing wall. 2. The music is so incredibly loud that you can't hear your climbing partner.3. There was no skills test to ensure that I could tie a knot or belay my partner. There seems to be little to no instruction - anyone can just walk in the door and start climbing walls.4. It seems like a lot of parents bring their little kids there to wear them out. Many have no eye for safety - often little kids are bouldering right underneath us lead climbing and the staff doesn't seem to pay any mind. 5. They required me to sign a waiver indicating that the staff instructed me how to use the auto-belay, but no one ever did.6. It's crowded and it seems like few people actually climb outdoors, so there's little sense of safety or etiquette. 7. They won't allow you to use an ATC - only a gris gri, so we can't practice lead climbing with an ATC.", "date": "7/5/2016"}, {"review_id": "AyaTq1M2cQyYSJhdB_X1aw", "user_id": "zLtKbZNLloH445e6eo-deA", "user_name": "Rachel B.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I have had a pass since the beginning of summer and make the college student membership worthwhile. The staff is quick, helpful, and friendly. I have gone back do many belay lessons in the beginning and they helped so much! I also love the fact that I don't have to rent shoes and the equipment every time I go AND I can bring a guest every months. It's just perks on perks on perks. Thank you Hangar 18 for keeping me in shape and letting me bring a friend to show them my rock climbing/bouldering hobbies :)", "date": "9/17/2013"}, {"review_id": "trcQZFkeqLbc5c1CqaDM7g", "user_id": "MQEZ3g4baAzDyG8B3emeHw", "user_name": "Lauren L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Groupon'd. Watch out for it - so affordable, especially for the college student!Came in for a nontraditional, fun and active date. The trainer gave off this nonchalant vibe, which left my very tense and acrophobic self a tad bit worrisome, and unappreciative at first. He moved through the motions rather quickly, but realizing now that maintaining his \"cool\" was the best option. Though he sped through the motions, the instructor made sure we fully understood what we were doing before going off on our own. Keeping those first-timers at ease during this somewhat dangerous activity is key, which really helped me in utilizing my climbing experience.  From then on, practice was all I needed...and maybe some upper body strength.Great variety of climbing walls for the grouponer (inexperienced), the somewhat novice, and the regular climber! Spacious facility and popular, yet soothing songs to ease your climbing experience. Invest in some chalk for all those with nervous hands!Five stars for the discovery of one of my newly favorite workouts!", "date": "4/29/2014"}, {"review_id": "-RQPSPNn227KNuU4sJDyaQ", "user_id": "WKqbdxf3QYSsoXFDnu3cOg", "user_name": "Madeleine M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 11, "funny": 2, "cool": 1, "text": "This is my home gym, and frankly, I'm surprised to see so many beginner climbers rating this gym so highly.I'll break it down:The main appeal to Hangar 18 is that it is CHEAP. Not only is the monthly price less than anywhere else, you get access to 8 or 9 gyms around the Southern California area. And most of those gyms are super nice. Riverside, Upland and Rancho Cucamonga are all great - five stars for them!This specific Hangar is a disaster. The holds are old and most of them are spray painted, which makes them greasy - which only gets worse after every use. It's really bad for you if you're trying to learn how to climb because it's hard to build up the right muscles and learn how to move your body if you spend all your time sliding right off the wall.Second, the setting is really weak. Climbing here just isn't fun, a lot of the climbs just don't make sense, and even the ones that do don't flow. It makes climbing feel like a chore.Third, most of the employees are unfriendly, unhelpful and don't really care about keeping the gym nice, clean and safe. Big ups to the blonde female employee who works during the day and is the exception to this rule. Recently, the crash pads had migrated several feet away from the wall creating a pit of death on the easiest part of the wall, where most beginners would be focusing their attention. It had been that way for months until this female employee organized a group of climbers to help move the whole thing back to where it needed to be.Safety needs to be all the employees first concern, but most of them are too busy trying to act cool and impressive with their Christian rock blasting over the gym's speakers.I wish this gym were better.", "date": "1/7/2015"}, {"review_id": "_g1_xnrQUAjm5l1LBS6LjA", "user_id": "Jv4vFPIzhyzC073RqiqcvQ", "user_name": "Will L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "Had a month pass and it was great, shoes and harness was free. But now they be raising the price.... For the rental. Now they just lost three decent climber. Bye bye hanger 18", "date": "6/28/2016"}, {"review_id": "W6FzjHy2AaSwZzlhSK3W9A", "user_id": "MhJwaEy5n3W5uABUi7Zxxw", "user_name": "Gus C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "First time rock climber. Had no idea what I was getting into. Tried and fell multiple times, but the people there were awesome supportive and filled woth knowledge. So I kept climbing.The place is chill, I got the student discount $20 bucks a month. Not bad, sore. Totally worth it, if you're strong enough. It's harder than it looks but with every climb it gets easier. If you haven't tried it, I recomend it.P.S. Some of that chalk will help when your hands are sweaty.", "date": "12/29/2013"}, {"review_id": "lJqZtDOgeh_uDNEX4VC5ZQ", "user_id": "SIv8yKAogfveyEINxnjaMw", "user_name": "Stephanie M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "We went here on a Wednesday. We were all beginners. We used the groupon deal of two people for the price of one. It is definitely worth the deal! Once we got there, we had to sign liability forms (ppl below 18 need parental consent which can be done online or in person). Prepare to have 15-20 min for that if you have 3-4ppl in your group and if it is busy. Afterwards, we got shoes which we all had to try on and a couple of us switched sizes (~10min). Then we had to wait ~20-30 min to get trained because there was only one person working that shift and he was training a group before us. Our trainer wasn't the most welcoming, but it was probably because he was the only one working and hadn't had his lunch break. But once he gave us all the gear and began our training, he was great! We got to try all the gear and basics of rock climbing as he closely supervised us (20-30min). Once we had the basics down, we got to rock climb freely with our group. There are lots of different walls for rockclimbing (maybe 8-10). Some people were bouldering as well! Overall, great experience and requires strong arms,  so be ready!", "date": "8/9/2015"}, {"review_id": "ZovDIhFrJymM_-JZYTiNVw", "user_id": "MYHtFL4WWK9s36O5pK9zhw", "user_name": "Kimiyo I.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 5, "cool": 0, "text": "I wish this Hangar 18 location would get together with the El Segundo Hangar 18 and make a baby.  Both have great qualities, but apart both have a few things to be desired.  But alas, I'll just comment on this particular location.Pluses: Fresh new mats, plentiful parking, nice open space and clean (in other words it doesn't smell like sweat and feet).  The staff is friendly and environment laid back.  Plus it smells faintly of pizza :) Minuses: Could use a bit more variety in bouldering climbs.  Not a huge fan of the old school wood boards (means no features to cheat with and loud clunking noises when I struggle to smear).  Not sure if it's a plus or minus, but they're women's bathroom is freakishly large...but with only one toilet and sink.", "date": "1/30/2013"}, {"review_id": "pDY5X6FCpbGWmiolsE8JYg", "user_id": "oXagM3lfGiMPtG-jrc3bAQ", "user_name": "Autumn S.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "This gym is not recommended for experienced climbers.My husband and I came here since we were visiting family in town. We normally climb at the Touchstone gyms in Northern California. First of all, the would not allow us to use our own ATCs, since they were not auto-locking. I see why now, since the ropes were not well anchored on top and I very likely would have been taken off the ground if my husband fell and weighted the rope. Secondly, the holds were very slick and I slipped several times, which wrecks my confidence. I'm really not sure who rated these climbs, since they either seemed way too generous or way harder than advertised. Also, they seemed to be made for someone who is at least 6 feet tall.I was really hoping to like this place since it's so close to family and would be a good alternate to driving up to LA Boulders, but I would rather drive up there and use my reciprocal membership there than spend my money ($16 day pass!) at this gym.", "date": "3/21/2015"}, {"review_id": "Lrs4tDFNnwJfKLiXZbRXZA", "user_id": "OT0gQgybnepf17dchPGFBA", "user_name": "Sergio R.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Cool place. hard problems. nice people. students and local older residents frequent.", "date": "8/29/2015"}, {"review_id": "GgeJd08EmG3I9ppeqUrIJA", "user_id": "XB7lvEKQXnUGtd4iR1CxEw", "user_name": "Ryan O.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 3, "funny": 1, "cool": 0, "text": "The setting is ok. The routes are very hard to distinguish from each other. The routes are defined by the color and pattern of the holds. They obvious don't reset very often so most of the features are covered in chalk and rubber. The jibs are all but impossible to distinguish. There is a large window where the sun shines into the bouldering area making it very hot in there. Overall a frustrating experience. I wouldn't go again.", "date": "11/28/2014"}, {"review_id": "47SRQGtQ5kBcx8KpYeZ6ew", "user_id": "DMrdTVjyNUeUETZ8g2D86g", "user_name": "Mimi A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "We bought a Groupon voucher for a lesson for new beginners. This is what was included in the deal: $30 for two intro to rock-climbing packages (a $60 value)    60-minute belaying lesson    Full day of climbing after the lesson    Rental equipment Since it was the day after XMas, I was sure of their hours. I called to verify hours and if we needed an appointment. When I called, I was immediately placed on hold by a female. For several minutes, I was holding while listening to her entire conversation. It wasn't totally related to work.  I figured at least I know they are opened. When we got there, there was a blond female sitting at the counter. We waited for her to acknowledge us. We finally got her attention and she quickly said she wasn't working. So we waited again. A young guy finally came around. His first question was are we Groupon? We said yes. He told us to sign the waivers on the computer. We did. We waited again. We asked him about the shoes. He gave them to us. Then we had to ask about the harness. We put them on and waited again. We finally got his attention and he took us to a wall. He quickly gave us instructions and quickly left. It would have been helpful for him to mention the knobs are color coded for level of difficulty and skill level. We heard someone else say that to their friend.We did it a few times. Then figured we could move on. We got his attention again after a few attempts. He sent us to a wall without ropes for harness. He quickly gave one of us instructions and left.  Here it would have been nice to know that chalk comes in handy. Another patron told us that after seeing us struggle. We did that again a few times.We looked for our instructor. I guess we exhausted our hour of belaying lesson after 40 minutes. He proceeded to ignore us as we tried to get his attention. Very professional of him.We like rock climbing. We will probably do it again but just not there. It was not what we hoped for especially it being our first time. After all, we signed a couple of waiver acknowledging the risk in this sport. Knowing how to prevent injury plus how to climb effectively and properly would have been a huge benefit to all of us. But I guess that must only come from a regular priced intro lesson not one from Groupon.As for the place itself, it is ok. But we didn't expect too much. The equipment were ok too.", "date": "12/31/2014"}, {"review_id": "OcE3J0iy98ni1je2ZcRVig", "user_id": "RFsXoetidq3GwVCcC-aAtQ", "user_name": "Kathleen C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great gym to climb at! Friendly staff and cool atmosphere. I went a few times with my sister and boyfriend and they loved it. They want to start climbing too! The walls were a little shorter than I am used to but it was still a great workout. They had a variety of routes and many walls so there was no crowding. Great bouldering walls too! One thing is that you cannot use an ATC at this gym and I like to. Overall go climb here! It's awesome!", "date": "4/4/2013"}, {"review_id": "wGYl1XkxKNj-xqwFrPYQpQ", "user_id": "16zHT7zp6K9IEQZ1oW6xXg", "user_name": "Jessica R.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 4, "funny": 1, "cool": 1, "text": "I'm going to start by saying how ridiculously spoiled I was at my last climbing gym. I started bouldering at the Seattle Bouldering Project which is ~20,000 square feet of bouldering with routes that are reset weekly. I didn't realize it at the time, as it was the only place I had ever been climbing, but holy cow, it was amazing. If you're ever in Seattle - GO. Anyways, back to the review at hand. I missed climbing since moving home to California and when I saw this place, conveniently located to my house, pop up on Groupon I snagged two one month memberships for me and the dude. We went last night around 8 and quickly filled our our waivers and got checked in. We had no interested in climbing with ropes and had brought our own shoes, so we listening to the quick safety lecture and were released to go climb. The bouldering area is much smaller than what I am used to, but I'm thinking it's actually pretty large for climbing gyms in So Cal. There were quite a few people climbing but it wasn't so busy that it felt over crowded. I haven't climbed in close to a year so my upper body strength is sorely lacking so I did get a bit frustrated that I couldn't climb most of the routes and I definitely think they could use more actual beginner/V0 routes. Much of what was marked as Vb, V0 and V1 may have been technically less challenging in terms of figuring out the problem, but they had been placed in such a way that you still need a decent amount of strength to climb. I guess I understand as when you're working with limited space and you need to cater to a wide range of skill levels you can't have a ton of easier stuff, but I think it would encourage people to take on the activity and work up to the more difficult stuff if it was a little more approachable.We haven't decided yet if we'll continue our memberships after the month is up or if we'll check out some other places first, but I wouldn't have any issues sticking around here as the staff and other patrons were friendly and I love how convenient it is (though I do wish for early morning hours - 6 am climbing is the best!).", "date": "6/3/2014"}, {"review_id": "goJdCtR22apRlt4jlz29qQ", "user_id": "S02tduB61f8Ha8DrjYIMEA", "user_name": "Justine A.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My boyfriend and I recently bought memberships here.The first time we came in with my sister and best friend and we were met by Brandon who was very friendly, open and helpful. The gym was rather busy that night, but he managed to get our memberships taken care of and to teach us the basics of climbing and safety while keeping up with the other patrons of the gym in a timely and easy-to-remember fashion.  We didn't stay long that night, but my boyfriend and I were back two days later and Brandon not only remembered our faces, but also our names (first and last.) We love our memberships and plan to return often.This is an amazing place to learn to climb, and a super fun way to build strength.Just beware of birthday parties. It can be a challenge trying to climb while kids are partying.", "date": "3/25/2013"}, {"review_id": "Vjz5ArZkcXPMVJTy1sHXgA", "user_id": "-uN_cCZ2-5I_vEhUinPF4w", "user_name": "Mark V.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the gym that started it all for me back in April of 2015.  Now I am a decent intermediate boulderer and almost a 5.11 toprope climber as well as a 5.10c/d lead climber.  Hangar has a stiff bouldering setting compared to other expensive gyms but you won't regret learning here.  I love to come back once in a while when I am in the area to see how I stack up on their bouldering.  The staff is always friendly, helpful and great.  This is a low cost gym so don't expect fancy AC and facilities just strong climbing close to outdoor ratings.", "date": "8/10/2016"}, {"review_id": "7o7HJ0WD8-0SK9b-OehUXQ", "user_id": "EicoRjByP40rm0lAcfM1Tg", "user_name": "Kate C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Really convenient location, great layout, not too crowded, good vibe with cool music not too loud.... All the waivers can be done through the website so if you have a big group make sure to get all that out of the way beforehand.", "date": "11/28/2013"}, {"review_id": "TlUfgfn69VknHFWWqHWUuA", "user_id": "96hq6cmLj2lxpzzAO1yo8w", "user_name": "Optimus J.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great rock climbing gym. I'm sure there are bigger and better rock climbing gyms out there, but this is the only one near Long Beach. I started going there when I got a Groupon and had a great time going there with my girlfriend for a couple of months. The staff is cool, there are climbs for all levels, the weight area is small, and it's never really too crowded. I decided to cancel because I was moving and when I did, they kept charging me, but when I spoke to them about it, they cleared it out because I hadn't gone in months (it was quite easy to work with them). Overall, a pretty good experience with them.. I'd definitely keep going if I stayed in the area, and if I had the time.", "date": "12/22/2014"}, {"review_id": "03l96wgGfySSWRsPew9r5g", "user_id": "5avVjDvlYNMVv6dXYLAn6A", "user_name": "Lauren V.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My husband loves climbing hear so I decided to join him.  It was a great experience learning the ropes.  Vinnie was super helpful and the atmosphere is really fun and laid back.  Id definitely recommend it.", "date": "6/30/2015"}, {"review_id": "azTp02005GKOO6I1iNNUFg", "user_id": "_GNN7mfJMe9L-KG1UfdZSg", "user_name": "Gregory B.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I came here a few months ago on a Groupon and have been a happy member ever since.  Since joining I have been to several other rock climbing gyms but this one is still home and still my favorite.  Although this gym is not the largest or has the best equipment, the friendly environment has really set it apart in my mind.The staff often times have to man the front desk and give belay lessons, but nonetheless they are friendly and helpful.  The other climbers are also typically friendly and very helpful to beginning climbers.  If you are thinking about giving rock climbing a try than this the place for you.", "date": "12/22/2014"}, {"review_id": "z-PE-lS6rUzGdEUgukrfug", "user_id": "Rwppi5ut-HXptKz7iaVzBQ", "user_name": "Cait O.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "Convenient location, great layout, not too crowded, good vibe with good music not too loud.  I had never been here before or gone rock climbing.  Note to people who haven't been to a Hanger 18 before....fill out the waivers online, it will save you a ton of time.  The employees were super helpful & nice.  I enjoyed my time there & will probably be back soon.", "date": "1/9/2014"}, {"review_id": "fliY1SceWGIr9Vq4VQ8pTA", "user_id": "Yi6vb7jIL_c3orZWoCHKmw", "user_name": "Paula P.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Still a beginner. Got a refresher course for belaying from Lina/Lynn (sorry, I'm really bad with names) and she rules. She made me feel comfortable and confident.", "date": "3/22/2015"}, {"review_id": "Ya2mg45ujN29AeD4OqQ2lw", "user_id": "1rXmf38TxjzKufOncnAt5w", "user_name": "Tony T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I have been wanting to try climbing for some time, but just haven't gotten around to it.  Lately I've been feeling kind of like a seize the moment mentality so things on my bucket list need to be crossed off...soon! So I got a friend of mine to come with me.  Staff is friendly, there was a young guy named Chris helping us out.  The electronic waiver system on the iPad was a little slow, freezing at some points so that was a little frustrating for my friend, but it worked for me.  Anyway, the lesson itself was helpful.  Chris was friendly, patient and made sure we knew what we were doing.  We got to climb the walls, alternate with our partners and do the belaying portion of it as well with supervision and assist as needed.  The scary part is leaning back and coming down for the first time.  It definitely is an exercise in trust.  The stupid or maybe naïve part for me is I came with my friend, who is about half of my size.  All fine and dandy, but when you're at the top of the wall for the first time and then told to let go, well the fear sets it.  I thought if I let go, then my friend will fly up.  Well she did nearly from our mistakes here and there.  But the instructor was close by, helping out as needed.  There are a variety of walls to try out, we were told which rocks are ideal for beginners and so forth.  There's also two stations with the Auto-Belay which is cool too.  Climbing is fun, coming down is a little harder and nerve-wracking for me.  But I climbed to the top with the Auto-Belay and let go and dropped.  Scary for a second, but it catches you and you come down.  I think once I did that, my fear was not as bad afterwards.  It is a very fun process, exhausting, but fun.  Staff is nice, the people all there (staff and fellow climbers) are nice and patient which helps.  A great start with a mellow atmosphere that makes it fun.  I will go back and practice some more.  A nice rush and a good workout.  Enjoy!", "date": "7/13/2014"}, {"review_id": "zo7RWxQrOmymYLzDhSnn7w", "user_id": "sp6jgMbU8ZWG6uPRTej0mw", "user_name": "Brian L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 4, "funny": 1, "cool": 1, "text": "Great bouldering gym with challenging routes. I'm a novice climber so I'm still trying to get the \"hang\" of it but there are plenty of friendly people here who gives tips and advice. Great music selection too! The only downside is that it can get pretty hot with no ac.", "date": "10/2/2013"}, {"review_id": "DkzEgwpjqod1-fkoYkGvoQ", "user_id": "_LZGvt2s-T49K5d_dvE-Fg", "user_name": "Kreestof J.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Fresh Hanger 18. i like the feel of new unblasted holds at a new climbing gym. (then it becomes covered in other people's dead skin, nails, skin cells, and sweat)Your monthly pass or punch card works with this 4th location. For an area with some night life, wondering if this should be here. Hopefully this will make the more local Hanger 18 less crowded.", "date": "8/30/2012"}, {"review_id": "tsYGrDwNwRxhkI_IzbCWlw", "user_id": "k5xNudesFQyqjWsBwhDiHA", "user_name": "Mysterial S.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 1, "cool": 4, "text": "Omg! Omg!! OMG!! Why I waited so long beats me!!This place is fabulous!!Dale he helped me get started since im a newb and I was by myself got the membership since it was a cheaper way to go and free rental gear and free yoga classes I'm so game!This gym is very very clean pretty easy to get started with the auto belay....better to have a partner unless ur a pro you can go rope free (I think ur nuts but envy you) :-)Dale was just fabulous outstanding and just so sweet and freaking hilarious!!! I'm still cracking up...the rex trying to make a king size bed...I don't think ill ever forget that thanks dale!! You rock!! (HAha get it? Rock...)Anyways Brandon who was also there very nice as well!! Very good at multi tasking ty again for all ur help!!The prices are awesome and affordable if ur looking to try something different with an adrenaline rush!I was the only girl there so I kinda felt like an idiot compared to the other guys all rope free lol oh well I loved it and laughed and danced at myself once I reached the top which was my lil goal...Yelpers go and try this you'll feel like an idiot but amazing and self satisfaction!!Can't wait to go again and I'm dragging one of my friends with me since its free....I personally think instead of only one free pass should be at least five...five is a good number :-) just a recommendation...great rock gym!! Rock it up!", "date": "2/26/2014"}, {"review_id": "mx-LLlDCYm2lhZr1VvF2WQ", "user_id": "v7CisyUMy8k3xUt6wmfYbw", "user_name": "Karen C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The recently revamped Hangar 18 gym is great for beginner climbers and those who want to learn rock climbing techniques. I especially love that it is not overwhelmingly expensive nor jam packed with people, like many other rock climbing gyms in the area where you have to wait in line to boulder for a few minutes and then leave it clear for the next person. The staff is very approachable and down to earth. I was able to practice some belaying with one of the instructors there and was very helpful in introducing me to different techniques and even sharing some climber slang!", "date": "11/15/2012"}, {"review_id": "o1kevxOxaNS_AB23X9G47Q", "user_id": "jnZqF9FP9JLkR3WmmlHvzw", "user_name": "robert s.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice group of beginner bouldering routes and the MWF yoga classes are kicking my beginner butt!", "date": "9/1/2014"}, {"review_id": "D82dmCc_8wSEFia-yABIQg", "user_id": "Rvj2lGmQe3hGmeGfZNO_MQ", "user_name": "Erin M.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Used the groupon to go on a date here. The staff was friendly and the environment was nice and open. Only 4 stars because you have to be trained to lift your own partner. Seems like a high risk and leaves room for an anxious climb. Also needs a water fountain. Other than that, an awesome environment and will return with a groupon!", "date": "8/25/2014"}, {"review_id": "tDfT5J8laRIzT4KWXm7lWA", "user_id": "ioLQrCvCBz3HmlKZeFxbJQ", "user_name": "K W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 20, "funny": 12, "cool": 17, "text": "The following gyms serve as my source of comparison when reviewing Hangar 18's top-rope area: UCI rock wall, Rockreation Costa Mesa, Hangar 18 South Bay, Mesa Rim San Diego, Planet Granite Sunnyvale, Rock City Anaheim.I came here last weekend and was pretty satisfied by the overall size, spaciousness, and cleanliness of the gym. They use Grigris and melons, which are not my favorite, but will work okay. My main complaint is that the holds were ridiculous. They are all these earthy tones that look almost like each other; I really pity anyone climbing here who cannot distinguish between brown, brown with the slightest green tint, and brown with a hint of yellow. Or maybe they would just assume those are the same colors and have an easier time climbing. it was frustrating constantly trying to figure out which holds were on, and what color I was looking at. The staff was really nice and helpful about it though. They explained that some of these holds were over 20-years-old, and that they were working on purchasing legit holds. Apparently this used to be a bouldering gym, so they would just use tape to indicate the routes...and now they were forced to make do with whatever \"colors\" they had. There were also some very interesting features here that I'd never encountered before, such as \"plates\" of fake-rock, and a wall of wavy looking rock features.The walls varied from very short to medium height...I'd say maybe 25 ft to 35 ft. The ratings at this gym, I felt, were incredibly inconsistent. At one area of the walls (the area with strange \"plates\" and earthy-colored holds), the routes were in general much easier than in the other area. I was able to complete almost all the 5.10s and 5.10bs I attempted on my first try, some with little difficulty. These ratings were probably on par with what I am used to. However, in the other area with newer holds, some of the routes were just ridiculous despite being 5.10as. They required some serious dyno-ing (over overhangs no less!), especially for someone of my stature (5'2''). I guess the route-setters were tall? Needless to say, these routes were...literally out-of-reach for me :)However, their Groupon (watch out for it) is a good deal, giving you 2 months of membership for slightly over $50, plus free classes and guests. I can't say that many rock gyms are so affordable.Verdict: Okay gym but the colors of the rocks nearly drove me mad. That coupled with some of the insane reachiness (worse than any other gym I've been too)...I will not be coming back often. Come here if you're tall and excellent at telling colors apart.", "date": "11/5/2012"}, {"review_id": "eIlqIlOtOS2RC_JQCchFiA", "user_id": "Cxx-gsjz16hwafK1cL9Cbw", "user_name": "Gabriel K.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Lots of fun, lots to learn and lots to climb. This was,  I think, my fourth time here and I'm hooked. Such a good workout. Doing it by myself kinda sucks so I recommend going with friends. Cool atmosphere and overall some pretty nice people willing to give tips whenever you ask.", "date": "3/17/2014"}, {"review_id": "PUX0qK2Jz4Lov-hwGNXXNA", "user_id": "3bJjOPSSJ9IDqRZW_Xw-pw", "user_name": "Michael W.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "The facility is small compared to other, more established rock climbing facilities. The bouldering area was not very diverse, and often the routes are indistinguishable because the same color tape is used for paths that criss-cross. The strength training area in the rear looks like a scene at Average Joe's straight out of the movie Dodgeball. I have been an avid rock climber for more than 6 years in other cities and was hoping to call this place home after moving to Long Beach, but alas, I will not be a member of Hangar 18, after all.", "date": "3/28/2013"}, {"review_id": "GYNqFiVzVCRCAPyLkSO-Cg", "user_id": "HUyx3dnf0Y7xv3kSXKBcLA", "user_name": "Amber J.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 4, "funny": 1, "cool": 0, "text": "This review is based on customer service.  This being the first and only climbing gym I've been too, I can say that the environment was not very welcoming.  Pretty much every time I entered the gym, there was no basic acknowledgement or greeting.  Unfriendly and indifferent.  The people behind the counter are young.They would basically just sit behind the counter and stare at the computer in front of them.  I can only imagine that they're checking their email or surfing the web?  Would not throw down money for a membership here.", "date": "10/25/2014"}, {"review_id": "bm5W69sRpP9MktoQS1Ml2g", "user_id": "AQ_aM5ceqwvu1jFSC1VrKg", "user_name": "Jasmin G.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Love this place, went here for my first time climbing and Brandon was a very nice and helpful instructor. Weekdays before 6 pm are best, and college students get a discount with school ID for monthly memberships.", "date": "11/28/2012"}, {"review_id": "RWGCjeqSc2Ms6Hv4x60Low", "user_id": "60Ulg82ifhNiAq-HB4cfSA", "user_name": "Vanessa N.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "I took advantage of the Summer Sale paying $5 for the first month, thereafter it's $33 a month. This is the best deal you'll find in OC/LA area. Plus there are several other locations. I alternate going here and Mission Viejo since I live in the middle. This may not be the best place for a beginner boulderer but there's a lot of options for top rope beginners and 2 auto belays. I really don't understand why some people give this place 3 stars or less. Yes it may not be Ikea catalog looking, especially with all the plastic fold up tables. But so what? The low price makes up for it, which include shoes, harness and McGregor belay device. Plus you can get a belay lesson anytime, provided that you have a partner. I came her on my own and found someone who was willing to be my partner. They don't let you belay with an ATC but they will lend you a McGregor. I took off one star only because they don't have enough V0 grade in their boulder area. Highly recommend, but it may be daunting for a beginner.", "date": "5/9/2015"}, {"review_id": "ncqvLuhYeOV07q9ye1YTtw", "user_id": "bWD6sMw-l7babCMdpJ74CA", "user_name": "Will N.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "First time going had alot of fun. Recommendation is to go during the weekday if you can. No kids what so ever. Brandon taught us everything we needed to know. Super fun.", "date": "9/12/2012"}, {"review_id": "WQhA9gUddKOI1mYRY_2Akw", "user_id": "yFXoklmC1faPYYEZI3DUlQ", "user_name": "Phil L.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Used to be The Rock Gym, but got bought out by Hanger 18 as their second gym. I came here before they got bought and my experiences was poor. At the time I was still a pretty new climber doing v2 at rock city. Came here couldn't climb anything! This place is big, nice and clean, but the routes are just too crazy! Not worth it, but I'll try it one more time because of new management?", "date": "4/21/2013"}, {"review_id": "xn0SrvZ9xezQVV6zI-MVHw", "user_id": "NTBAai8rV2woRPcCpm3YQA", "user_name": "Steph C.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The only reason I didn't give this place five stars was because only one person was helping guests while 4 other employees stood around doing I'm not sure what.  Dale was AMAZING!! Super friendly, knowledgeable, and helpful.  He was doing everything, helping us, other customers, doing computer work, while the other four guys just stood around and talked..made me feel bad but I wanted to write the review to recognize Dale (I'm pretty sure that was his name..haha he said it fast)--I would definitely give him five stars!! The place itself was fun, I went on a Wednesday so there weren't many people there and you get to do your own thing--fun place to try out indoor rock climbing and be left alone to do your own thing!", "date": "3/6/2013"}, {"review_id": "f-9vAFooat2mnJOB51BSPg", "user_id": "I4yAzt-RE96xZ_h00kdcGA", "user_name": "Kelly D.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Came on a weekday afternoon to avoid the crowds. Dale is the one man show. My nine year old is ready to give up gymnastics for this. Place has a slightly better vibe and layout than the Hawthorne location.", "date": "7/21/2014"}, {"review_id": "2UXs8SRPJ5vgShE33uEfBQ", "user_id": "jbt2inLh6cktXaBnvz16PA", "user_name": "S S.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Got a groupon for two intro classes - awesome starter gym. The guy at the desk gave us a quick but thorough tutorial and off we went. It was crowded initially but calmed down after 8 pm. But that might also be because the groupon was expiring. Would def recommend!", "date": "3/6/2013"}, {"review_id": "5dX42NpUvc8hcLtsvMyvNA", "user_id": "4QsH26D-D96QW4phfNjb8A", "user_name": "Rob P.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm not a huge climber, and that's also what makes this place awesome.  It's very welcoming to inexperienced climbers, and also seems to be a favorite with those with more experience as well.  I've been back about 4 times over the past few years, and have seen staff that have been there the whole time as well as staff that is new.  The constant is they are always friendly and always helpful! As I said, if you aren't very inexperienced the staff will help get you started, and there are some easy routes to try out.  I also routinely see a guy or two who are really intense- doing dino routes and sparsely- populated walls. It's a really relaxed environment- not too crowded, and you can usually get the walls you want when you want them.  Also a very fair price- there's nothing really to complain about here.  Climbing is a fun, physical activity that can break up the monotony of other activities, I would definitely recommend finding your way here!", "date": "12/23/2012"}, {"review_id": "EE973kQKRC9wxduiw_Gpzg", "user_id": "z9r9VXTaf_CloYXpOb6N3g", "user_name": "Linh T.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "First time we went, the employee Tom made us waiting around after we finished signing the waivers for 20+min and still didn't tend to us so we ended up leaving. But called Hangar 18 and Brandon very politely said we could come back and climb anytime. Second time we went, the employee walked us through the whole way and informed us about the 4 checks. As a beginner, it was kind of a difficult course but we managed to get to the top.", "date": "4/10/2014"}, {"review_id": "sD6m2ulQnE-jJBckk8CPbA", "user_id": "xbXjw-8bGrQoEfidOfUSjA", "user_name": "Howard J.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great rock gym...with varying levels of difficulty. Fun time and great exercise!", "date": "3/21/2014"}, {"review_id": "6-32uUsUcqWf4ywIObHiSg", "user_id": "QsuWl5KzqtOK-5TMtiRUOQ", "user_name": "Nicholas J.", "business_id": "NdtseuifGWxPmZWLVmI-fA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Pretty cool gym. Really nice employees. Walls are a little short. The lead walls looked pretty fun but I didn't have a chance to climb any. The route ratings seemed generous but there is good diversity and the routes are fun! Overall I would definitely recommend it to anyone.", "date": "1/25/2013"}]