[{"review_id": "ggJIJW0hjPFPTj0S6RLTng", "user_id": "PLj7LTvHy64ZR5W_yXx66w", "user_name": "Katelin P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Such an amazing place!! I love that they have so many courses for beginners and advanced climbers! I'm a huge bouldering fan so their options make me.super happy! I have yet to start climbing with belay but they offer classes every top of the hour. Next time I go in I will definitely be doing that! Such a fun place to come with friends! I also bought my first pair of climbing shoes at their garage sale!! I'm so excited!! Thanks Hanger 18! I've always loved the climbing community and you've elevated that with your help and amazing gym! (Also can't wait to try out Monday night yoga!‍‍", "date": "5/2/2019"}, {"review_id": "QBpOPH-Xpk5wRbxOQhW2_g", "user_id": "6PvjZIoMXpWnkrV3rWJ8_Q", "user_name": "Helen K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I came here about 16 months ago with my bf about two and half years ago with my uncle, had a blast and decided to bring my g-friends.  None of them had indoor rock climbed before so we were so excited!There was literally only one auto belay for true beginners.  The other ones require more practice which we couldn't do because the beginner one was occupied most of the time.When I went two years ago, they taught us to buddy belay and I loved it.  I felt secured and stable compared to the auto ones.  (The rope is very tight and I can hang without it dropping me)This time around they wouldn't let us unless we passed the \"test\".  I couldn't remember how to rope in the climber (tracing the 8) and FAILED.  All they had to do with tell me like before and I would've spent two hours of fun, but instead I did one auto belay, got terrified of the instability coming down that I just couldn't get the nerve to go up again.I asked a random neighbor if he could buddy belay with me (he seemed like member) and I came down like a pro. Because he showed me how to secure the rope onto my harness, I asked them to test me again and they said I couldn't because I failed the first time.  I really wanted the girls to experience the buddy belay because they were having a hard time with the auto belay also.I have done this TWICE before.  Each times two hours each, I just couldn't remember the \"8\" tie in of the climber and if they could gone over with me it would have not been a problem.  And fine, let's say for liabilty reasons they aren't allowed to teach you anymore, but if I got taught by someone else and I knew the material later, why am I not allowed to get tested again? I only needed a recap.  This wasn't new material for me to master. I swear, Hangar 18's new management and their rules are so full of crap.  It is definitely not recommended for beginners.  Back in the day the whole right wall was filled with colorful grips to practice for beginners but now more than half of the rocks were missing.If they are doing so well with advance climbers, they shouldn't advertise this place for beginners.  O and the stingy business won't even let you dip your hand into chalk.  If this was an all included package for beginners, shouldn't that be included as well?I can guarantee you that if we could have done the buddy system, the girls would have had more fun.  I can say this because I am terrified of heights but I could climb to the top with the buddy system.  Literally out of four of us, only one could do the auto belay.  And one can climb so many times on the short walls that doesn't require the harness... I definitely wouldn't recommend this place for indoor rock climbing.  And although I only came like once a year, never would I step foot into this place.  Management is rude, bathrooms are dirty, not friendly for beginners, and it smells.  What a waste of money and a beautiful Saturday", "date": "4/6/2019"}, {"review_id": "gQeQGs0sdgW3daK8cxOZIw", "user_id": "pnx8sqH9dsfj3kUCQg92pA", "user_name": "Michelle W.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "They have more climbing walls when compared to the LB location, but the customer service here is seriously lacking. From the moment we walked in the guy at the front desk was really rude and just put a bad taste in my mouth. Honestly I don't expect much, but compared to the super nice and helpful people in LB this place sucked. If you are trying to learn I suggest you go to LB first. Because the bouldering is in the middle, a lot of people stand around the perimeter and watch so it makes it hard to belay in some areas. There is a big parking lot available. Shoes and a harness are $3 to rent. Canceled my membership.", "date": "3/22/2019"}, {"review_id": "Ma2h_gSBx2yQHbVhXIy-jg", "user_id": "8ujowM46_viHpy2M0F_6vw", "user_name": "Rihana A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Went for a kids birthday party. The sign in process is grueling. They want your life history. The children were guided by patient staff as they climbed up and down up and down up and down. They utilized maybe 3 different ropes for two hours. There was an upstairs seating area for the waiting adults. The party host was able to bring in food from the outside for the guests. It was fun watching the regulars climb and have fun. This was an awesome experience. The facility is very small.", "date": "3/2/2019"}, {"review_id": "mbi4oFZi1-ngO2wD0bQekA", "user_id": "JA_RC4wJv1scnY5vIEhnsQ", "user_name": "Angelia M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went to have drinks last night with my boyfriend and was surprised at the staff and cook. Javier 2 was so great and what a fantastic cook. We had the Phili cheesesteak and it was fabulous. We had a great time and enjoyed some great company. I would highly recommend the food and atmosphere. The music rocked as well. Thank You Javier2 for your conversation and entertaining us with your talent. We will be back soon .", "date": "4/30/2019"}, {"review_id": "DzyX6mT-QCaS7Elsz4RS7Q", "user_id": "OG-jvL-Y9JUZ5_qcWTS1IA", "user_name": "Yoshiko T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Well, you can't beat the price compared to other bouldering slots, but you get what you pay for. They had about as many beginning paths as other places, don't know how the advanced people feel, but my problems with (1) the space is tight so there's not really a place to sit and watch as your take turns with your friends, people are all around you as it fills up, especially with a younger crowd and (2) the rocks were a lot harder on the skin than other places. Two of my friends ripped the skin on their hands and mine tingled (I refused to get to that point). It's perfectly fine for the price, but I'd rather pay more for protecting my hands and having more room and less teens.", "date": "4/20/2019"}, {"review_id": "IFbx9WJbnacM4hXFplNbBQ", "user_id": "yAcHMFVR1ETtC0PaZ6d8ZQ", "user_name": "Tiffany K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 25, "funny": 10, "cool": 21, "text": "So fun! I think this was my second time rock climbing in my life (does ymca rock climbing in middle school count as one? Haha) so I didn't know what to expect. Parking- lots of spaces available, esp if you come on the weekend Location- it's in the back of an industrial plaza. If you're coming from the 405, it's 1-2 plazas after the el Pollo Loco/shopping plaza. I came here with a group of 9 people (we had reservations) and we were all very new to rock climbing. They had two instructors for our group (Kevin and I think her name was kelly... I didn't catch her name bc I went to my car to put my stuff away. I feel bad bc she remembered everyone's name in our group) and they were so nice and supportive! They made rock climbing a lot less scary and helped us on our way up. They also kinda pushed us to try new walls and stuff which was fun. We all got rocked the next day bc we don't do any physical activity haha. We came on a Saturday afternoon and idk if it was considered busy or not. But there were a lot of people that had their own gear and whatnot. I think we were the only group that was new to rock climbing. Everyone else here was clearly experienced haha. Just be careful where you walk bc there can be people jumping from the top and stuff (one of their rules is to always look up). There was also a small group of kids having a birthday party. There's bathrooms in the back which also has a shower in it which is convenient for those who want to take a shower right away after. There is chalk everywhere so expect to get some on your clothes. LADIES, I recommend wearing yoga pants or something bc everyone will end up seeing your undies if you wear reg running shorts as you climb haha. It also smells like sweat once you walk in but you get used to it.", "date": "9/24/2017"}, {"review_id": "owpN-JircGGBnZzJEpPjWw", "user_id": "r77nLa1fT9pGJreGnMZOOw", "user_name": "Russell N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very surprised by this location, my home gym is the lb one and this one is so much better. Really nice route setting on the auto belays and a nice diversity of climbing. I really enjoyed my session here! Will drop in whenever I'm in the hood.", "date": "12/16/2018"}, {"review_id": "WLdznbAAyyppDMwt5cVNZg", "user_id": "Iwa8TJVYmKD_ULfw3gMsHw", "user_name": "Ada L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 8, "funny": 1, "cool": 3, "text": "\"You get what you pay for\"$36/18 Monthly/Daypass vs $125/25 Monthly/Daypass Hanger 18 vs higher quality bouldering gyms (such as Touchstone gyms) Its like 24 hour fitness vs Equinox. The price of Equinox basically weaves out the majority of the people. Soooo.... for $36/month and TWO for 1 Tuesdays = $18/month for you and a friend - get ready to get cozy with other members. If you have a little bit of patience and don't mind that the puzzles aren't changed often, Hangar 18 isn't so shabby. The gym is busiest during the weekday from 5-8PM and the weekend is generally the BEST time to go as you pretty much have the gym to yourself (with the exception of when theres a child's birthday party, then its a zoo).The attendants aren't the most useful and the restrooms can sometimes not be the best well maintained (There is hardly ever hand towel in the dispenser). But again, \"You get what you pay for\"", "date": "1/12/2018"}, {"review_id": "wQl0IaxmRXh4enFkrNaa6g", "user_id": "QXwKeHbkjnw1pfiW5tZm9A", "user_name": "Sarah R.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 4, "funny": 4, "cool": 4, "text": "Decent place to get your climbing fix! You get what you pay for. For $5 the first month then $36 the following months, Hangar is a \"chill\" spot.You definitely meet a TON of folks here -- regular climbers, old & new climbers -- and everyone is friendly. The front desk has rad folks, with different personalities and humor.Personally, I've been spoiled by another rock climbing gym, and prefer the routes there. Hangar has some great routes, some not (they can get confusing when colors coincide for different ratings). The routes are a hit or a miss. Most people boulder here, but I also prefer top rope and lead climbing. So in that sense, Hangar may fall slightly short for me.Apart from that, it's a fantastic community and I love spending time with friends here. Climb on!", "date": "11/30/2017"}, {"review_id": "gXAnMG3YXUEcqRnv9_FxWw", "user_id": "yRsR80KPzb6xWkzTvr76ew", "user_name": "Rosie M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "This was by far the worst experience we had. I purchased a Groupon for an all day pass with belaying lesson but when we arrived the staff was unfriendly and unprofessional. They did not explain anything to us on how to properly climb, it was almost as if we were expected to know how to use the facility. Even after I told them it was our first time there. The staff was eating and having cake and not helpful. Then we began to use the equipment and someone walked up to us to tell us that we were not properly using the climbing gear and when I told him that no one had bothered to help us or tell us how to use the climbing equipment, his response was \"sorry we are busy right now\" I was shocked and extremely upset by then that I decided to just leave. Never again! Staff is ridiculously unfriendly!", "date": "8/18/2018"}, {"review_id": "7bHAePRrnbCggNr2ML65qw", "user_id": "v307ojl2scLxPvZVwpxpXg", "user_name": "Franceska R.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 2, "funny": 2, "cool": 1, "text": "I'm not a bouldering expert so I can't say much about the routes. It was my first experience at this Hangar as my home gym is in Arcadia and I wanted to check this place out. I came during busy hours so take that into consideration when reading this review. The place is small that's a given I get that gyms get busy but what worries me is that kids were running around everywhere and it made me nervous that I might land on one. I was watching someone send a route and one of the holds slipped once she put all her weight on it causing her to fall. We laughed it off (but in the back of my mind I was like sh** girl did your life flash before your eyes?!) and she asked staff if she could get a wrench. The staff was super nonchalant and didn't seem to be surprised, which bothered me. Again I'm new to climbing and idk if this is a normal experience at a gym but I didn't enjoy my experience due to safety. Call me a negative Nancy but I'll look to other gyms and rethink my membership.", "date": "5/29/2018"}, {"review_id": "0dRu4qK1yqFp6BCAcL850A", "user_id": "dD7LfCRuN0EXTmpkocnuaQ", "user_name": "Ilse V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here as a guest with a friend who is a member. He gets one guest-pass per month, which is a pretty cool benefit.We came around 530pm during the week so it wasn't really busy. Some people on the walls and some on the boulders. Upon arrival I had to fill out a few forms on the iPads that are available. While it does save trees, they should probably restart those iPads since some were unresponsive or just super slow. I got a free pair of climbing shoes and they also have harnasses for hire if you want to scale the walls. My buddy explained the different level tags and colors to me and we just stuck to boulders. I had a good time for a quick visit but would probably not come here on my own because it does get really crowded at peek times and there is no AC in the hanger, just open gates. So it gets pretty hot in there. Also, the place smells worse than my boxing gym (which is saying something). Although I did hear that the monthly subscription rate is pretty low, which makes it tempting.", "date": "8/10/2017"}, {"review_id": "zCFe7ThYHONN1JtddrsnwA", "user_id": "0_Z1FYgVIVUhVB0Eggsqmg", "user_name": "Kithumini J.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "WOW this place ROCKS!! Ha ha haDISCLAIMER: I'm not a regular climber or anything. It was just something I'd been wanting to try. One morning, I woke up and decided: WHAT THE HECK today I will go climb rocks. And that's just what I did. As a little kid, I was TERRIFIED of rock climbing walls. You couldn't pay me enough to get on one. But I really wanted to try something new, so I decided to check out Hangar 18!!I got a Groupon for an intro lesson and a day pass. Rental gear was included (shoes and harness). I walked in and told the guy at the front desk that it was my first time. He had me fill out a waiver and look through a checklist. After that, he gave me a pair of climbing shoes and a harness and started the lesson. The guy who was helping me kinda seemed half preoccupied and kept leaving to take a call...maybe it was super important idk. But he was kind and patient when I kept falling LOLI went alone, so I wasn't able to take the belay class, but I did get to try autobelay climbing (climbing with a device that controls your fall/helps you with your descent, as opposed to doing this using another person) and some bouldering (climbing with no harness, shorter routes)! They have quite a few routes, so whether you're a total beginner or you have experience climbing, they're sure to have something for you! They have four autobelaysI have absolutely zero experience climbing. Like none. And I possess no upper body strength...so it was pretty challenging!! But this seems like a really amazing workout and a great community!! If you're in the area and don't want to go to laser tag or Gable House or walk around Del Amo or eat anymore (because that's what we do 99% of the time when we hang out in the South Bay), definitely check this place out!! I'd really like to come back with a friend to take the belay classBottom line: It's located towards the back of an area with a bunch of warehouse buildings. There's plenty of parking!! If you decide that this is up your alley, you can upgrade your lesson/day pass to a membership! They had a promo going on which gave you your first month for an additional $5--pretty rad!! You also get a guest pass if you do this. I almost signed up for the membership, but I'm not going to be in the South Bay for the rest of the month, so I decided against it...but I really did enjoy my climbing experience!! Rocks ain't so scary anymore. Also this place kinda really smells. If you try hard enough, you an ignore it, but there's no doubt that the stench is there...", "date": "1/5/2018"}, {"review_id": "Raf4R61oSKVqpLAOHysZ6Q", "user_id": "Di2EfWXVqGbXS60oIGkrmQ", "user_name": "Michael S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Been going here for a little over a year now and have checked out many of the other gyms in the area to compare it to.Pros:-Many locations. This one is by my house and another one by my work place. Super convenient.-Cheapest price in the area ($36/month). This is really the only reason why I go here. You get what you pay for though.- No issues with parking.Cons:-Maybe the recent rain has something to do with it, but 1/3 of the gym is constantly taped off for no climbing. I guess they can't work outside so they just tape off a huge climbing area and work there. They have also been constantly changing routes. This might sound good, but having so much of the gym constantly not being open to climbing is getting annoying.-This place is absolutely filthy. The restroom is a mess.- Restroom is often out of supplies. Do they even bother replacing the paper towels?- 2 toilets in the men's restroom. At least one has been out of service for months now. I've lost track of how many consecutive months it's been.-Gym/workout area is a joke.-A lot of kids' birthday parties. Not a con on its own, but there can be a lot of unsupervised kids walking under you as you climb.-Poor lighting.-They seem understaffed. This doesn't affect me, but I've seen a lot of new people coming in and having to wait forever.", "date": "3/9/2019"}, {"review_id": "M-VFlVztXcsZD4jjSDAD2g", "user_id": "0Is_qUlk5FPf1pSIFyvAOA", "user_name": "Kelly B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "Beginner rock climber here!I'd been searching for a form of exercise that was different than the gym, running or yoga. I wanted to do something different to motivate myself to work out and care about my body. I bought the groupon on a whim and decided to come in today.The ages of the climbers ranged from little kids and beyond.That was when i decided to stop being a wimp because for real, those kids were going for it.The staff was so friendly, walked me around, showed me the different walls, levels, bouldering, clipping in, etc. I asked about how to get better, how to practice and more. He was encouraging and helpful and told me to start out with a couple times a week and that I would notice a difference if I just kept at it.These guys were great!", "date": "2/11/2018"}, {"review_id": "h2d_sWOQziBweNdxX0x21Q", "user_id": "IBVcDuf0ffAXl6-WPw_16g", "user_name": "Allison D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Went in on a Tuesday morning and there weren't that many people there which was good. We heard about the deal that they were doing with the BOGO free admission but since the desk lady wasn't there we got in for free!!!! With free rental shoes too!!! That was awesome. I've been to a lot of great rock climbing gyms and I have to say this one wasn't as impressive. There is definitely a tight knit community since it's a small gym, but there weren't that many walls to climb and I got bored after a couple hours. Other than that, it was a great experience since it was free!", "date": "4/6/2018"}, {"review_id": "fOpIohZy1iwSOD3iHcDGPg", "user_id": "LBsz2OCanxfw-H1gQw4ilA", "user_name": "Madison M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Pros:- Close to work- Multiple so-cal locations- Easy and free parking- Relatively cheap monthly rateCons:- Poor lighting- No air conditioning and very little airflow- Staff seemed bored and disinterested - CrowdedOh, and finally, a hold literally almost came off the wall while I was climbing.I joined a different climbing gym the next day.At the end of the day, you get what you pay for.", "date": "10/1/2018"}, {"review_id": "2aFw0I-vWu8aclZBIQAxwQ", "user_id": "8xULXqHF8Di6Eq6a_VwQrg", "user_name": "Nick S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A great way to exercise and hang out with friends at the same time. I just got a membership this month but I plan to continue it before I go to college. They have walls for all levels of climbers. Beginners are totally welcome; I know I definitely had little knowledge of the sport going in. It's a fun place with lots of laid back, friendly people.", "date": "7/27/2018"}, {"review_id": "mvzPyFC_zlWY3c0F6Aj0iQ", "user_id": "KbZcN0V60V-JBADO4bv8aA", "user_name": "Neko P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great little gym, learned how to climb here. Staff is laid back and helpful when you need them.", "date": "9/4/2018"}, {"review_id": "k7KoUjzXkKdwTIw3R1wILg", "user_id": "vn106Npk-Wj7x_dgxJpEnA", "user_name": "Sam Y.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I finally bit the bullet and decided to cancel my membership. Even with the reasonable price tag, I couldn't justify paying for another month where the V3 and under routes feel sloppily put together (a hold actually ROTATED while I was climbing, yikes!), there's NO air conditioning, poor lighting, and the staff feel unwelcoming. In a pinch, this place has worked just fine but now that I've found another gym in the area, it's time to say goodbye.", "date": "8/22/2018"}, {"review_id": "suSn704Ge3FF7R-a5n39yA", "user_id": "GmN6Qwo9aK803f7PLH6dVw", "user_name": "Ali B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I love Hangar 18 and have been climbing here for about a year or so. The staff regularly update and change the routes at Hangar. Route staff are very good at what they do. The routes are always challenging and fun to work on. The routes are usually maintained for long enough to give you sufficient time to master them. The climbing culture at Hangar is great. They even offer some classes to help you get into outdoor and lead climbing. Location: Hangar is located on the southern side of Rosecrans, just east of the Home Depot, Michael's and Ross Dress for Less shopping complex. Hangar is a little difficult to find as you cannot see it from Rosecrans. Keep your eyes peeled for the small sign you can see from the road. Hangar is towards the rear of a warehouse complex - the buildings have a light blue trim.  Proceed through the complex and make a left to the end and you will see the Hangar 18 sign on the building. When to Go: It is better to avoid Hangar 18 on the weekends. It is overrun by children and people that have never climbed before/infrequent climbers. Thus, it can be quite dangerous to climb around these people who don't know or follow proper climbing etiquette. Bathrooms/Changing Rooms: There are two ladies stalls and one handicap shower. There are 4 lockers in the ladies room- bring your own lock. There are also 5 or so cubbies to place your belongings in the changing room. While small, the bathroom/changing room does the trick just fine. Of course there is also a men's room.Weights: There are free weights at Hangar in the back corner by the ladies room. While this free weight corner does not match that of Equinox, it certainly is sufficient and offers a great bang for your buck for a climbing gym. Membership: Hangar 18 offers a very competitive rate for monthly membership. I recommend the monthly membership if you plan on climbing more than twice per month. Absolutely worth it.", "date": "2/13/2017"}, {"review_id": "xgrTEHrCK7V_j_n-59zXww", "user_id": "_H0eZAdgwRZglPpMRsUNdw", "user_name": "Elijah M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 2, "cool": 1, "text": "Came here last week for the first time with 3 of my friends (all of us were new to climbing). We ended up getting the intro package which I think every person new to climbing should do. I don't know if we would have had a good time if we didn't get the intro package. Denise was the one who helped us. She was super knowledgeable, kind, and patient. She went through everything we needed to know step by step and made sure we knew what we were doing before she went on. After about an hour of learning the basics, we felt confident on our own and we have Denise to thank for that!The rentals here are $3 for shoes and $3 for harness. If you end up signing up for even a month, you might as well purchase some on your own.I ended up signing up for a membership after my intro class and I've been coming almost everyday since then. It's been a really fun way to get some exercise.There's a lot of reviews that mention the smell and I can't say that they're wrong. This place does smell like sweat when you walk in but you do get used to it (if that makes it any better). This place gets pretty busy around 6 and later. Showers available in the bathroom and water/gatorade available for purchase at the front desk.Overall, my experience here has been pleasant so far.", "date": "1/9/2017"}, {"review_id": "iAPztr59JASmTAjV4IQnQQ", "user_id": "5sBR_UOABwN1vSrN8MhXsA", "user_name": "Laura L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I really enjoy Hangar 18! They have a nice boulder/free climbing area, I personally enjoy that part the most. Hangar also offers yoga, work out classes and have a little work out area with weights which is nice when you want to mix things up.", "date": "6/17/2018"}, {"review_id": "jBeEuftPxeQFyHbLfDHvVg", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "This location like all the hangars are located in between some warehouses that can be a bit tricky to find. Coming from the 405 S freeway going N bound it'll be to your right side. However you can hardly see the Hangar 18 on this list of different companies when you enter in. It is pretty hidden and it'll be to your left side once you turn in right to the area. There's plenty of parking so that's a plus. It's pretty obvious you're by a climbing in the evening when you see a ton of cars parked and only one building that seems to be open. In comparison to Hangar LB, this one is much better IMO. There's a large variety of routes and problems and the sets are done a lot better here in this location. But again, this is just in my perspective.However one huge downside is how tight this entire gym was designed. It was not thoroughly thought through because bouldering and top roping are SUPER tight and close together. It's very easy for someone who is being lowered or coming down from the auto belay to accidentally kick someone who is standing by the bouldering walls. When it's crowded it can get really squished and tight and makes it difficult to want to climb because everyone is such close quarters. Some sides are a bit better than others. The sport climbing cave is pretty open and so is the overhung area for bouldering. Their grades for sport climbing are a bit different. Sometimes it's seemingly soft but there's one or two moves sometimes that are tricky and many times they could add an extra foot chip or a hand hold for shorter people.", "date": "1/26/2017"}, {"review_id": "CoWmR_yj7KItYl0PKIJhjw", "user_id": "op8d9geoz8oeBseVAqiPNg", "user_name": "Veronica Y.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Context: I don't exercise, I'm not very strong, and people can easily make more progress in one month than I can in a year. I was at Hangar 18 for about a year before I moved out of town. I've climbed at Sender One and Cliffs of Id, but this will always be my 'home' gym. I mostly boulder, but top rope or autobelay (there are about 4 of them) when I get tired. Space: This is an old school climbing gym -- the walls look like rocks, and the routes are set really densely together. That means that there are plenty of routes to climb, despite the relatively smaller size of the gym. I just moved to Austin and the newer climbing gym here jus doesn't have enough routes of each ability level. The routes: I've always had plenty to enjoy and to work on -- it never gets boring -- and then by the time I've gotten most of the ones that I am capable of, they change the routes up. Grading seems to be harder than at Cliffs of Id. The routes don't go up nearly as high as Cliffs or Sender One, but to make up for that, the routes are slightly trickier/more technique-y, and IMO, more fun. The only thing that I don't get here that I get at the other climbing gyms are the high top ropes -- there is a certain endurance that doesn't get tried here at Hangar as much. As for the variety of boulder types, they just started putting in volumes and introducing some more balance-y ones (in addition to the slab ones, the overhang-y ones, the dynos and the cave-y ones that they had already). So, as of recently, the boulder problems have become much more varied. The people: This is probably the best thing about the gym. This is BY FAR the friendliest gym I've ever encountered (I've now tried out 5 different gyms -- 3 in LA and 2 in Austin). Some people complain about it being crowded (especially after work on Mondays thru Thursdays). But this is precisely when I come and why I come. I never find that I really have to wait long to climb the route I want to climb (cos hey, we all need breaks), and the dense nature of the routes means that there are always people better and worse than you working on something in that same patch of wall. Everyone is SUPER supportive, cheering each other on regardless of ability level. There's always someone working on the same problem as me, and always someone better willing to give me tips to make me a better climber. Cost: $36/month, but see if you can catch their 3 months for $79 deal -- it happens several times a year, usually around holidays. SO worth it, especially compared to the price of other gyms ($60-$80+/mo). Parking: Easy. Large space. The other locations: One thing that is nice is that there are several Hangar 18 locations and membership in one gets you into all the others. Tip: There's a Monday/Wednesday crowd and a Tuesday/Thursday crowd. There's barely any overlap between the two sets of people. Pick a pair of days, start coming regularly, make lots of friends, and get fit.Ps - I love sender one and cliffs of id; they are objectively awesome, with much nicer facilities. That is without a doubt. Just, much more expensive too.", "date": "9/11/2017"}, {"review_id": "yf2Tjv__am7ZOr83dTkaHQ", "user_id": "XHqFL72BJ1gb8Se65WpWWw", "user_name": "Kris C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 3, "funny": 2, "cool": 0, "text": "I should have posted this a few Weeks ago.  I visited this climbing gym in Hawthorne California in late June, But I wanted to put some time between my experience at this Rock Climbing Gym before I posted.  To insure it was not an emotional response.I have been to indoor climbing gyms around the United States and I am an avid outdoor rock climber.First the Pros:*Its close to where I work*it is indeed an indoor climbing GymThe Cons: (I'll just stop at the top 7)*The management is (that I dealt with at least seemed to be young and more a part of the gyms crowd, than professionals prepared to teach me anything about safety. I value my safety and the safety of other over everything else.  *The Gym was Dirty.  I don't mean your typical climbing gym dirty, I mean crud under your fingernails dirty.  From the Floor, Climbing Walls, Bathrooms and an odd little area with some dirty weights in a corner* The *Old dirty weights in the corner of the Gym but NOT in my opinion far enough from the Falling Mats.  It just seems a recipe for disaster.  *Why are these weights even here? perhaps its me but I have Never been to a climbing gym where there is a work out area inside the climbing area.*I did my best to be the guy who knows nothing about climbing.  I used their shoes though I have my own, used their harness though I have my Own, Etc, and asked question I knew the answers to.  I did this to see if I felt safe sending friends here.  I absolutist 100% do not.*in my personal opinion my 12 year old daughter could have done a better job teaching people new to the sport. she Climbs 5.12s, but is Very humble and wants to make sure everyone around her is safe.*If you are planning to use one of their auto belay Units (rather than Belay your partner) of which there are few, I would think again. They seem old and in need of service.*I feel Like I was getting in the Surf at my local Surfing spot.  Locals Only.  I would Never take my daughter here, Though she may teach them a thing or 2 Manners and how to climb.*Its only 2 stories (it may have have been a bit more but it deems even a bit less)*I don't feel safe to bring anyone new to the sport here.  2 Weeks later I tried out \"Sender One\"  I hate to plug another climbing gym here, but after my experience at this particular Hanger 18 in Hawthorne California, I had to. It was NIGHT & DAY difference!  Safety is their number one concern at all times. I will warn you upfront, it is more expensive.  But the First Rule in Safety is you can't put a Price on Safety!", "date": "7/8/2018"}, {"review_id": "jrxx8ZkzW_rNRppE83kjog", "user_id": "TODM93-iJl7osTabIzgfUw", "user_name": "Tony C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "I heard about this place from a friend that goes to the Long Beach location. My 5 year old loves to climber so I decided to take him as a treat. They lost a star for being unorganized and another one of for not being a real kid friendly place. My son was only able to go so high since the holds were placed at a distance that would require for you to be taller. My suggestion would be for them to create an area that is easier for the little ones to climb. After all they are the future of their business. With all that said, my son did have a great time climbing one area he figured out.I think next time I will try the Long Beach location for kicks.", "date": "8/28/2016"}, {"review_id": "OOLJ6ZqRJvQxhe_zXE0f-g", "user_id": "AcqvFTAPOnloIR5POnWofw", "user_name": "Anthony K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 3, "funny": 1, "cool": 0, "text": "Been here 2 weeks and been having a blast !Seen some bad reviews which kind of through me off But completely disagree The gym it's self is good size padding everywhere And NOOB friendlySaw someone complain that said gym was dirty It's not dirty it's just a GYM Chalk dust everywhere and people working hardAlso staff is great and welcoming not sure why someone would say they weren't If you want to be baby sat at a shinny just go down the street to EquinoxBeen 2 weeks and a total noob been a having a blast ever since", "date": "7/13/2016"}, {"review_id": "I1U3cRsokbMd5yVejS1lbw", "user_id": "s0NBkrdCgbhiF6nA3Vouww", "user_name": "Grace L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 3, "funny": 2, "cool": 0, "text": "I purchased a one month membership from Groupon for 2 people for about $50 something which I think is a good deal. Hangar at this location seems kind of crowded and small. There is definitely a sweat smell since its packed and ventilation isn't that great. I think for how crowded it is, the space that each person needs to climb isn't big enough. They about 3 autobelay spots and a handful of belaying spots and a mostly bouldering walls. It's pretty obvious who's new and who are continuous members and some people can be quite jerks. My bf was climbing from doing the autobelaying wall and wanted to make sure the people below (who were in a circle chit chatting away.. just standing around) didn't get hit by him so I asked them to move a lil in case (they shouldn't be standing around there anyways having casual catch up session because it could be dangerous) he hits them and the eye they have me was like \"eww you guys  are noobs and don't belong here\". Like uhhh okay. And then while my bf was coming down he flinched because for newcomers it could be scary coming down the rope because I just let go of the wall and from up there you feel really high. Anyways, he hit the wall w his foot cuz he flinched and made a thumping sound and the guy next to him was like \"Jesus!\" (with this annoyed tone of voice). Anyways i apologized on behalf of my bf cuz I felt like he got scared.. But later regretted apologizing because he had a very asshole attitude about the small incident. Besides the members that go, I feel like everything else is fine. The staff was really nice & made us feel comfortable. If I decide not to go (it would most likely be because of the regular members). They seem to be nice towards each other and actually very friendly but they were not friendly to by bf & I. The vibe they gave us was no good. Not sure if it's cuz it was obvious that we were boobs or because we were Asian. Lol", "date": "6/8/2017"}, {"review_id": "mu7-UTLd525wBW1FhPwxhA", "user_id": "YQjEbZpRC6DZ-b9UwEj0yA", "user_name": "Diana N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I came to Hangar 18 to spend time with my cousin and left after I found that for a one day pass for first timers would cost $33 / person. I said verbatim, \"I'm not chill with the pricing scheme\", given that the monthly package is $36/month and I was only going to be in the neighborhood for a day not a whole month! I wish they could have told me this earlier before I filled out all the release forms. I might be back but only if the deal on Groupon is still available. FYI. This definitely not a Planet Granite (great ventilation and folks of all types) so keep your expectations moderately low.", "date": "8/3/2017"}, {"review_id": "xqhKPpPwDYNoycz8BOnQeQ", "user_id": "-rJkV-iXpKwyEVtlLI7Z7A", "user_name": "Jane K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "I can't say my very first impression of this place wasn't that great. The moment I stepped in the door I got a good whiff of the scent of sweat, and really badly. I don't know if it's always like that or just that day but it was quite unpleasant. It could be cause there were just so many dudes inside that day. My friend that is a regular said he thinks a frat came for the day. Nonetheless, it was still fun learning to properly knot and pull the rope for your partner and climbing and trying to Boulder haha definitely need to work on my upper body strength. For newbies like me I think it's better to have your friend teach you everything and just borrow their equipment. For entrance and shoes rental I think it was all $20. Don't forget your water!", "date": "4/25/2015"}, {"review_id": "VdTwL8_B4l8tZGDhYG0Qkw", "user_id": "kZBYE5g80KdcAZqxCbn72A", "user_name": "Chris O.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "This place is terrible.  I waited for them to work on my car for over 2 hours then they came over and gave me an absurd estimate.  I thought they were working on my car but nope... just made me sit and wait for over 2 HOURS !!! Then gave me an estimate to do what should be an hours work.DON'T USE THIS PLACE.  Feels like rookies and a very some start up with little competence.", "date": "8/17/2017"}, {"review_id": "_-FHNc6kUAtE4wCw6MhI3A", "user_id": "uY37gbLg8coj2ezxDWDjiw", "user_name": "Chantal L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "A few acquaintances have told me they prefer this location over the one in Signal Hill. Although I had never been to the one in Signal Hill and unable to compare, I do really like this location. There is a lot of space and plenty of walls for both climbing and bouldering (shorter routes/walls without the rope). I've never done bouldering prior to this visit. It's daunting at first, but so much fun! Staff is super cool. One of the employees had her beautiful German Shepherd free to roam around and look cute. There was a guy with a high ponytail working at the front, who nicknamed me Chandelier because he couldn't pronounce my name correctly. I appreciated that. They played classic rock all day (Lynard Skynard, Led Zepplin, Queen, etc.), which put out really chill vibes. I came with my friend who has a membership. I came as his guest. As a guest, entrance, shoes, and harness come free.", "date": "7/8/2015"}, {"review_id": "83q4p-nLml0X99eCmCwlSA", "user_id": "EMMKdK1cGrLSo08wgSYHJQ", "user_name": "Lianna N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "If you're someone with a pretty average to below average fitness level, this will most likely be a very challenging experience for you as it was for me! I enjoyed trying rockclimbing for the first time with my sister and her veteran rockclimbing friends. Although I don't know much about rock climbing I can tell this facility boasts a lot of popularity with their surrounding area and they seem to be well-stocked for all the materials that you would need. There are free climbing walls as well as the ones that use the harness. This place was completely packed on a Thursday night, and I found myself weaving between people for the majority of our visit there. It's definitely harder than it looks and I give a lot of credit to those ninja warriors out there. I believe it's $15 a day if you don't have a pass and somewhere like $50 for a month pass with discounts for various students and jobs. Cool place to check out if you're interested in trying out rock climbing or wanted it to become a more long-term fitness hobby.", "date": "3/20/2015"}, {"review_id": "ut_OC-EPltSAI7RYB0PThg", "user_id": "LI4dc3hxvEWqLaTdjdzzpQ", "user_name": "Diana H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 1, "text": "3.5 ratingI came here with a group of about 5-7 of us. I had so much fun. This was my first time rock climbing and I was a little scared when I started. The staff was really nice on teaching you how to rock climb. We met some people there that go all the time and they were giving us tips on climbing. I had a lot of fun and would definitely come back!", "date": "6/11/2015"}, {"review_id": "REOAdOxBU-D5RRqTsDj2Ew", "user_id": "wDyPRXZw92xDd8evlY7auQ", "user_name": "Kevin H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my very first experience here. The staff is great, very friendly, and very willing to show you whatever you need to see/know.  The atmosphere is really cool and at the same time one can tell that everybody is working hard.  Cold drinks, locker rooms for men and women,  dumbbells, some free weights, and music are some of the amenities.  The groupon is great as well as it comes with a guest pass!  I'm a member as of today for at least a month so I'll see where it goes!", "date": "6/30/2017"}, {"review_id": "KJ3RmY9n_2oNFucT58iEhw", "user_id": "RSYQFwanogpeWezcl-AR9Q", "user_name": "Steve L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "A basic climbing gym.  Nothing too fancy, well priced, and reasonably helpful employees.  Lighting was a bit dim, and bathrooms look a bit dirty/dated, but overall a fun experience for the family.", "date": "5/8/2017"}, {"review_id": "JdCAirwycDHv5jObAdpbEA", "user_id": "z2X43Il6_QxLmPaoV7S9AA", "user_name": "Lauren C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 6, "funny": 5, "cool": 4, "text": "I'm a member of hanger since April 2015. I usually go to climbing after work (after 5pm) and of course, there's always many people climbing around that time. But it's not too bad. Try to avoid weekend or Fridays because there's a higher chance for someone to have a kids birthday party at the place. You can rent shoes, a harness and a blay. There's also autoblay to climb with. If you're a member, you get a free guest pass every month. It's always fun to climb with people.If you're a climber and want to buy climbing shoes, bring a list of shoes you want to buy. They will order the size you asked, one size down and up. And you can try them all three and decide which one you want to take. They will only charge for one you want. If you're a member, you get 10% discount and 20% additional discount if it's first time (not so sure about the additional discount).", "date": "9/20/2015"}, {"review_id": "Y3ccEgTT12iz9NPZGNuErQ", "user_id": "UkR0twpCuFtnqExaohY0Ug", "user_name": "Vanessa H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My first official \"gym\" and I love it! Climbed a wall three times and as someone with 0 upper body strength I felt muscles work that probably never have lol!! Going to make this a new before/after work activity.", "date": "5/30/2017"}, {"review_id": "Fhs-OCYAi5UHL56uXrxGdg", "user_id": "4HWvXwfSC8dgwZ4VoqKT7w", "user_name": "Lucy N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Purchased the living social deal which included a beginners lesson and all day pass. This is probably the third time I've been indoor rock climbing and we had an enjoyable time. There was one person doing lessons and he was overseeing another couple. He gave enough attention to both of us and made sure we understood and practiced the technique. Also the front desk person was knowledgeable and nice. I wish I had gotten both their names. We were comfortable enough to try out of the few walls. We would definitely come back!", "date": "3/20/2016"}, {"review_id": "0UXPykJfm0DAfErScjMnnQ", "user_id": "yKfHRxS6iNZrDL-6rlSV1Q", "user_name": "Janet L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I've been starting to boulder and it's absolutely fantastic. I can feel myself getting stronger and more fit. Note that I'm the worst at exercising, cardio, weight lifting and even stepping into a gym. Rock climbing makes getting healthy fun. You can go with friends, map out your course, use strategies to get better, and challenge yourself at your own pace. It's a great place to meet new people too. I've definitely bumped into old faces and met new people through rock climbing. My first few experiences have been nothing short of awesome. The man at the register was friendly and helpful. He gave me a full day pass for free once and even though my friend who has an annual membership already used her guest pass on someone else for the month, the man at the register let me use it too. The only things I think can improve about this place is:1) It can get crowded at peak hours (after 5 p.m. and weekends) as this place isn't that big.2) No water. There's a vending machine, but it'd be great if they had a water fountain of some sort. The first time, 3 of my friends and I went and none of us brought water. It was terrible. We were thirsty after just one climb.3) Utilize the seating area on top of one of the middle rock. I feel like it can be re-designed to make it more inviting/a good place to relax. No complaints. I think the pricing is reasonable, compared to many other rock climbing locations. I also like how there are multiple locations where you can go to if you have a pass.", "date": "9/21/2015"}, {"review_id": "afUGEqOOMl3yQ85ExixlSA", "user_id": "SvAl-my4Euu6nx95zMzmuw", "user_name": "Snow T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to about a dozen climbing gyms in my life and this one is the worst by far. Lots of time waiting for boulder problems or autobelays. Staff is almost a bit sassy. Whole place is a half finished warehouse. Cheaper than other options but not if they bill you an extra month! Went once. Got charged for a cheap first month and autopaid for a second. Despite that I've now paid for this current month, I'd rather pay $20 per day at the Stronghold than go back to this gym.", "date": "4/8/2018"}, {"review_id": "_lT3DzZ6kfPaNXeuBSqwzQ", "user_id": "W7kH4bcTyoIxy287OG8olA", "user_name": "Ricky C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "Hangar 18, it's the spot that keeps on giving. You like to climb?  They still got it. Now you've got some good burgers here during special events. What more could you want!", "date": "6/8/2016"}, {"review_id": "MckBUrYfdvNOOi5f_TpbdA", "user_id": "y-B0dh89TzityUUm_QdXvQ", "user_name": "Charles V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great facility.  Staff is very patient with first time climbers.  Great instruction for all levels.", "date": "4/9/2018"}, {"review_id": "wpyX8fvCXW539WYnegrlqg", "user_id": "oSN3M4_WKdlTsnpgqPDiBg", "user_name": "Steph H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 5, "funny": 4, "cool": 5, "text": "This place is bigger than the Long Beach gym and has a better variety of walls for top rope climbing as well as bouldering. Plus, more auto belays as well, which I'm a fan of. The few times I've been here have all been around noonish on Saturdays, which meant weekend crowds. While it can get pretty hectic when it's crowded, everyone has always been really chill, and I've never had a problem finding something to do. One of the great things about getting a monthly membership at Hangar 18 has been unlimited access to all of their gyms. I can't comment on what they're like for newcomers since I've always come here with my own gear and working knowledge of climbing and haven't needed lessons or whatever. As with the Long Beach location, it doesn't seem like they require a belay test, so be sure you know what you're doing before you start to climb. STEPH JUDGEMENT: Great facilities, can get really crowded at peak times.", "date": "1/26/2015"}, {"review_id": "EPeL5KA1_NiWmFzdgMKgFA", "user_id": "YTbw-MlWdtABuFBPAbyL8w", "user_name": "Robert K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 2, "funny": 0, "cool": 1, "text": "Overall a fine gym after one session here. $18 for a day pass and a harness. Ratings seem fairly stiff compared to larger commercial gyms. Start and end to some problems are difficult to judge. In some places there are black, purple, and blue routes next to each other which is difficult to navigate.Main issue is that there aren't enough people working to handle signing people in, doing belay tests, and checking out gear. For a while there was one person working and about 30 people in the gym so we had to wait a while.Rating four stars because I expect slightly better for the price.", "date": "4/30/2016"}, {"review_id": "Mo9JAlECYulNzkhAZTBJuQ", "user_id": "TVBI1LYXTlWeHCtqBSt6QA", "user_name": "Christine Y.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "I've been climbing off and on since I was in high school but I never was able to do it consistently until now! It's a lot of fun for me and helps me get over my fear of heights too. Of course there's nothing better than the feeling of getting the to top of the wall and looking down to see how far up you are. It's scary but since I like climbing I get over it for the most part.This is my go to gym for multiple reasons:Affordability - Membership includes rental equipment and is $46 a monthVariety - The top rope and bouldering has a lot of options with different difficult levelsProximity - Last on my list but it's close to me so I come here a lot!This is the easiest rock gym I've been to where you can get a quick belay lesson and get climbing quickly. The people that work here are efficient and friendly enough, but don't expect to have in depth conversations. It's usually pretty busy and they have to keep helping customers as they file in. The belay device they use has it's own anti-locking mechanism which makes it less intimidating to belay here. It makes this gym more family friendly and crowded with more beginners and occasional climbers. There's a platform built up on top of the bouldering areas that they use for birthday parties. If there isn't one going on then it's pretty fun to go up there to rest and just check out the place. The other bouldering area in back you can climb onto also and walk around. Yep the gym is stinky and it's seriously a funk that you'll find at every rock gym. Everything always is covered in a fine layer of chalk because every climber uses it so much. I wouldn't mind if they cleaned up a bit more but I deal. At least here they keep the large garage style door open and fresh air wafts in. Usually it's warm inside but it can be pretty chilly on cold mornings with that huge door open.All in all I have a pretty good time here and get a good workout. It gets pretty crowded in here though and it can be pretty crazy. Since there's more families and beginners here you'll also see a lot of people climbing where they shouldn't be or not paying attention and walking under a climber. Just gotta be more careful coming here during busy times!", "date": "1/19/2015"}, {"review_id": "NS7E6mhUOOiq0Xw0hN-Fyg", "user_id": "JYw4OmQhq33CijEojhK72A", "user_name": "Connie H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm entirely new to the rock climbing world and has only been to this rock climbing gym. However, in the time that I've been here, I have needed the newb course in belaying, and a refresher course after not going for a month+. Our first instructor was indifference and was just happy to be over with the lesson. Our second instructor though, Andre, was AWESOME! Although we were just piggybacking off of another lesson since it was meant to be a refresher for us, it became apparent for all of us that we really did forget everything. He was thorough and patience (despite the busy-ness at that time). After our lesson, my sister was belaying for me, and when it was time for me to rappel down, I didn't feel confident in her abilities since her hands didn't seem to be in the right positions. I stayed on the wall for a bit waiting for her to figure it out, when Andre came to the rescue! A+ for attentiveness! As for the facilities, I personally am satisfied. There are rock climbing with, I think, 3 or 4 auto-belay systems in place, bouldering, and a small area with weight machines (although these guys look dated and very sad). It does get crowded at times, but there are also times in which it's quite empty (my favorite time to be there).", "date": "9/1/2015"}, {"review_id": "1aUuW-EsCXK7dY5yRj3Y6Q", "user_id": "i-EFUjCE0oLKoSKcASYIHQ", "user_name": "John M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 5, "funny": 1, "cool": 1, "text": "If you're looking for an indoor climbing gym in Los Angeles, I cannot recommend Hanger 18 enough!  The staff is nice, the people that climb there are generally friendly, they change the routes often enough to keep climbers challenged and their prices are half of what anyone else is charging.The biggest reason I recommend them is because they stand behind their members - 100%.  Some friends and I had an issue where we weren't given what we'd initially singed up for... and we were rightfully disappointed.  However, once I shared my experience, Dave (Hanger 18's COO) reached out to me personally to right the situation.  It's great knowing you are doing business with a company who will stand behind their products and services!  Hanger 18 is where it's at!", "date": "2/8/2016"}, {"review_id": "EoZuiqORRoavIZ7roBqi4Q", "user_id": "4kBgES1l-l1hIXBNlxB-kQ", "user_name": "Lexi M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "So much fun, and the staff is great and really helpful! Definitely check out this place if you're looking for something new and challenging. Very reasonably priced as well.", "date": "5/12/2016"}, {"review_id": "jYI4AOcZOryAonUpTFTAOQ", "user_id": "wLh4YepDaBzQ1JMrj5fDzQ", "user_name": "Karen C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 5, "funny": 3, "cool": 3, "text": "Friend brought me in for free since members get a pass once a month. A day pass though is $16 though, so not bad at all. But seriously who REALLY climbs all day, they should have a by the hour/minute pass for me and my noodle arms x_X. They waiver sign-in process is quick and done from an iPad. Nifty use of technology to cut down on storage while saving some trees.  Great indoor climbing gym, I live near ARC but see tons of variety in routes here. The middle islands are golden for bouldering practice! Really fun way to mix up your work out, as you'll be using muscles you don't normally use. For example gripping tiny nubs with your fingers, will make you cry out pathetically as you attempt to open a Gatorade bottle at the end of your session!This gym does show concern for safety and covers it's assets well with paperwork. The entire floor is cushioned with additional soft mats you can drag around to break your fall, so I never really had a fear for my life moment at the times where I lost my grip and just had to bail. I didn't use the auto-belay tool but thought that was a nifty option. I have heard complaints from \"real\" climbers that all the mats and safety equipment just trains people to have poor habits, because in the real world there are no mats and to know your limitations.... yada yada. A gym is a gym, running on a treadmill isn't going to be like running on the real world, so as long as you have your expectations in check I think this is good starting place. Recommend you going with experienced buddies not only for safety, but to save time and they can show you the ropes... erm rocks... that are best suited for your level saving time. If you climb enough, I would invest in your own shoes as the ones here look like they have seen better days. Plenty of parking, but the site is easy to miss since it's not visible from the street. Note: Qdoba is nearby and makes a great place to refill all those calories burned. ;)", "date": "7/13/2014"}, {"review_id": "dBt2oojHdNaUGt-NP_YeOQ", "user_id": "9BJ8XP2e0nmT1jf6tjPHEA", "user_name": "Kayla J.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 4, "funny": 1, "cool": 1, "text": "LOVED IT.Boyfriend and I were looking for some unique bonding time and this is exactly what we needed!Something fun, something we could take a lot of cool pictures, and something to coach each other on! The staff was all very very nice. They helped out a ton to make sure we were safe as possible while using the equipment to rock climb.It was also an intense workout. Lol. I didn't expect to sweat so much from rock climbing!!!Definitely coming back here!", "date": "8/7/2014"}, {"review_id": "fT1J12qujGbSJq6jBAldlQ", "user_id": "8R1vWMzjMnEFEo1lWskLjA", "user_name": "Jason S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, lots of bouldering routes with a good share of top rope. Having a ton of fun here, staff is cool too, they took their time teaching us how to belay. Can be very busy at times but everyones nice and respectful so it's not too big of a deal. The majority of the floor is padded so it puts you at ease to just go for it while bouldering. Top rope has a couple auto-belays too.", "date": "8/29/2016"}, {"review_id": "3mrQcW3_l4osCl5G6DOThw", "user_id": "zoyb93pskMhDgXZgv-DKtA", "user_name": "Kaori T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great walls of L.A.! Love this place! It's a great place for beginners and advanced climbers, there are auto-belays and bouldering, and all sorts of goodness. Get ready for a solid workout and spending the day there!", "date": "3/16/2015"}, {"review_id": "gy8yJd1Rx1Q8GCJjii71jA", "user_id": "iVvnvyo2YAqXlLmH6-DSuw", "user_name": "Jenn G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Correction on pricing:Intro package: $30 for adults, $25 for kidsDay pass: $16 for adults, $11 for kids", "date": "7/1/2015"}, {"review_id": "eP38x_QsSl-qqBsL1tEtqA", "user_id": "CImSEjWZ2YxrJWa_uSGPKQ", "user_name": "Jasmine W.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is so amazing. My friends and I had so much fun after one session, we are definitely going to get year memberships. Jeremy was awesome, super funny, kind and patient. This place is a must.", "date": "1/8/2018"}, {"review_id": "z0O8e-ePp0vs7_CdDSIGig", "user_id": "o5eZ4l8gq7pAmj1m0bpoSg", "user_name": "Derek T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place seems to have a bad rap, but it's actually a good climbing gym. Large freestanding bouldering routes with caves and overhangs, and a variety of good too ripe and lead climb routes. Friendly staff (although sometimes the front desk sits vacant) and friendly climbers always willing to provide a little beta. Decent ventilation when it isn't a packed house, and cheap rentals. Get on that groupon to save money.", "date": "3/4/2016"}, {"review_id": "dOynR8XyX8QP93wjOWuYYw", "user_id": "iYeLvhAGiUgKeNkZV19_IQ", "user_name": "Diane T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 6, "funny": 2, "cool": 2, "text": "So you want to learn how to climb or boulder some rocks aye?Came here for the first time with the boy (who's a regular) for the first time as his guest.For a complete noob, hangar 18 was a nice, low key, good vibe, just climb on your own pace and no one would bother you kinda place. The space is not huge, but on a not too crowded night, beginners to season regulars all seem to find a place to climb.If you're new to this.. a few words of advice:-the place smells a bit funky. After learning about the climbing shoes you'll know why. You won't notice after a while-make sure you read the tags attached to certain rocks and follow the colors and codes accordingly. For beginners look for patterns marked with VB or V0. -If you get stuck, don't be afraid to fall (but fall with caution of course). The floors are super padded and have a bouncing quality to ease the fall. There are also extra pads to break your fall. -Watch out for climbers before you walk under a walkway etc, you don't want to break their fall.-Be courteous and don't climb a wall that someone else is on.-no gear? no worries, they'll have all the items for you. A note, the shoes are shared amongst all visitors. Although they spray it with disinfectants, if youre a big germaphob, you might want to invest in your own pair if you plan to come often.-expect to be sore the next day and don't expect to be as graceful and strong as the veterans, it's okay. They've been working on this for a while.-if your friends have chalk, as them for some. It'll make you nervous palms a little less sweaty and have a firmer grip. :) Overall a very nice experience. Can get a bit squished at times and hard to find routes for beginners, but definitely something fun to try out.", "date": "11/23/2013"}, {"review_id": "hy5PI3q9p9p5w7HybOaCsw", "user_id": "ykxWLQvQB0gyxK3l9Tuhig", "user_name": "Anthony N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Im a newbie to Rock Climbing and this place is amazing.  Lots of colors on the wall and ropes hanging up high.  This place a shower if anyone is interested.  Nice people and are willing to help when in need.", "date": "12/9/2016"}, {"review_id": "7oWSvsYXlss2izdGwEnRNA", "user_id": "8cW-bYGkWZgJs4zkLXJLNg", "user_name": "Colleen M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 10, "funny": 2, "cool": 3, "text": "Cheaper than Rockreaction, but lacking in so many ways.My friend and I bought a Groupon 2 for 1 monthly membership, and thought it'd be a good idea. I'm not an experienced climber, but I enjoy bouldering and have some minor experience. My friend... not so much.Upon entering, we realized that you really do get what you pay for.Poorly maintained, not well lit, kids running rampant, unamused/unfriendly staff, shoe rentals with holes galore, and a kind of claustrophobic feel to the place.The grading is poorly labeled, and it was difficult to attempt to properly follow a problem because most of the tape is on the ground and not on the wall. Being our first time here, it was incredibly frustrating.We'll be back, since we have a month pass, but I'm not looking forward to those labels, ugh.", "date": "4/17/2013"}, {"review_id": "qKN_4y32-_3ejdUnEKNZAg", "user_id": "Ocg1Q42K_9mbTxsJFPK7Ow", "user_name": "Tabit B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "This is the third Hangar 18 location I've been to, and quite possibly the worst one yet. I came to this location on a Friday night with a group of three people. The place seemed small and very crowded. There is a wide variety of bouldering routes, but there seems to be no organization. Many of the holds are slippery making it difficult to complete a simple V1 or V0 route. In addition, it seems as though the setters were very careless when setting some of these routes. I saw a lot of routes using red holds placed right next to routes using pink/red holds. It gets difficult to differentiate between where a route starts and where it ends. Also, the difficulty rating did not seem accurate. There were V1s that were easier than V0s and some V0s that had no sense of direction. The facility itself was somewhat clean. But it definitely needs more love and attention. They have a shower and bathrooms that double as changing rooms for the women (not sure if I can say the same for the men). They also have a small fitness area with questionable equipment. Overall I don't get the feeling that this is a safe environment, and I'm sure there are many other climbing/bouldering gyms in LA that are much better than this one.", "date": "8/15/2015"}, {"review_id": "vOkZ_zBVlq1aUwpQ3ccuzg", "user_id": "6dF726y9VJF_HPwbbcnTZw", "user_name": "Earl N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 0, "funny": 4, "cool": 1, "text": "Wow, how rude!!  My 6-year old nephew had to use the restroom, but they wouldn't let us in since we hadn't signed a waiver yet.  Just to use the friggin bathroom??  As a result, he peed in his pants...WTF!!!!  Not only did this place stink like hell, but because of this stupid waiver they just LOST 8 CUSTOMERS!!!", "date": "8/13/2016"}, {"review_id": "ue81R1ADS-sfH9Nie7JKpQ", "user_id": "P_WOAdwujpl9PyIC1CDRQg", "user_name": "Paulina V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 14, "funny": 2, "cool": 1, "text": "To start off, I've been to their Long Beach, Upland, Rancho, and Riverside locations many times and had wonderful experiences. Upon arrival there was a line of 5 people ahead of me, with one employee signing them up for their first visits. I knew it was going to take a while but luckily there was another employee at the counter. Or so I thought... they both fail to acknowledge their growing line of guests although four people queued up after me. The second employee was busy chatting up two climbers so I stepped up and asked if he could check me in. He proceeds to do so. They couldn't find my membership or my friends in their system so they had to call Upland to check us in. We put on our shoes and head to the back room where a group of 4 and all their belongings are sprawled out directly under the bouldering wall making it impossible for others to climb. We head to a second wall and there's two broken holds on the floor with extremely sharp edges. I bring it to the attention of the staff and a third employee just blows it off saying to just leave it on the counter. I inform him where it was, as he didn't ask, because there were a lot of kiddies climbing and I didn't want an accident to happen. Sure enough I head back and there a little girl about to climb it. I warn her and stand by until the guy shows up. We go on climbing but the vibe is just so off at this place. Nobody talks to eachother. Multiple climbers stand cross armed close by and stare you down in silence as you attempt problems. The holds themselves are old, dirty, slick and there are multiple same color problems side by side so they all blur together. The bathrooms were dirty and so was the floor, if the employees are in charge of the cleaning they need to take their jobs seriously. Talk about gross. To be fair, the layout was super cool and I was stoked to be there but the longer I stayed the worse the vibe got. My friend and I left after just 30 mins although we drove an hour to visit this location. While we put on our shoes a group of newbies were having a tough time with their harnesses and the employee said \"it's way too big\" from across the counter. She apologized that it was her first time and he just handed her a different one without explaining or smiling or showing any kindness. Seriously talk to your employees about having standards, friendliness, and actually doing the job they are paid for. Never visiting again and telling my friends.", "date": "3/26/2016"}, {"review_id": "MHptGmafW9rRjJkukk_zFg", "user_id": "WeNFiGdIYMxordjuOQYYlg", "user_name": "Kathie I.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 2, "funny": 2, "cool": 0, "text": "Do you like standing shoulder-to-shoulder with several sweaty twenty-something guys? Do you enjoy the smell of feet and the languid gaze of indifferent employees? Then Hanger 18 is for you!I want to love this gym, especially for the price. But the truth is that it's PACKED on the weeknights and it's a pain in the ass to constantly check to make sure some idiot isn't wandering around underneath you while you're climbing.With that being said, the regulars here are super friendly. The routes are interesting (although not changed very frequently) and I was really into going for a few months. But after getting more into running and wanting to try some weight training, I think I'll be canceling my membership and switching to a regular gym.", "date": "6/8/2015"}, {"review_id": "iEt5f02X9JNdw1BQ41HUzg", "user_id": "C2B5PcCA9TwxwjR6JjZMug", "user_name": "Geoffrey C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "My friend took me here on her guest pass and I was provided free rock climbing shoes and a harness.  The staff seemed chill, but definitely not enthusiastic when explaining climbing procedures.  You can tell in their voice that they've explained it many times.This place is smaller than I thought, but there were a good amount of walls to climb.  You can easily kill a lot of time climbing which my friends me did, spending a few hours here.  This was my first time rock climbing and I had a fun time trying all the challenging climbs.  We went on a Monday evening, and it was busy but not to the point where there were no walls avilable to climb.  You can definitely tell who are regulars and who are first timers, but everyone are minding their own climbs.  The regulars here seem to use this as their \"gym\" and they have a pull up bar and a bench press that people were using, but that makes me wonder if these people workout their legs.  It does tend to smell and that does depend how smelly the climbers are.  People can get extremely sweaty and the smell of feet can linger certain areas such as the bathroom.I don't know how I feel about getting a membership here unless you're really into climbing.  For me, this would get old fast but it was a great thing to try.", "date": "6/12/2013"}, {"review_id": "mVIDMz6NEt2Vq3E4VRUGhA", "user_id": "e3baCt5rjb82dNc1tMgzlw", "user_name": "Bess K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is amazing! I bought the Groupon, which included two introductory belay lessons. As my boyfriend and I waited for our lesson, we decided to Boulder (climb without a harness; don't worry, it's padded). For those of you that have never climbed, it's actually pretty scary/alarming. I fell multiple times and had to keep myself from crying. Elisabeth, the friendly and considerate receptionist (I don't know if that's the right word), saw my frustrations and took it upon herself to make me feel better. She said she wouldn't let me leave feeling so negatively about rock climbing. So I tried again and she helped me reach the top :)", "date": "5/19/2016"}, {"review_id": "Cok-7Y5km5jrhhk9gxlLwQ", "user_id": "JCT2GKdbi_FDoYDfnHLJmA", "user_name": "James C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Very crowded on thursday and friday nights, with far more people sitting around talking than climbing. Short walls, bouldering focused, few autobelays. Still it's the only place to climb indoors in the area and the monthly price is cheap. Everyone I've talked to has been pretty friendly. Some wall sections have bad lighting, I almost feel like bringing a headlamp to distinguish between route colors.You do have to constantly watch out people beneath you. I collided with an unsupervised little kid after a surprise fall who gleefully took the impact of a 150 lb man, and shocked a couple of women getting setup for top roping. Some signs just telling people to LOOK UP might go a long way.", "date": "7/9/2015"}, {"review_id": "SyC0PdFggWBi5sJY-00qSw", "user_id": "oeR2Wozu_2gLZu5Y9lLO3Q", "user_name": "Jessica L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "When we first walked in I was taken back by the strong odor of sweat and feet. It reminded me of Bikram hot yoga in dtla... Of course much lighter and tolerable . About 30 mins into it I forgot all about the funk and I was enjoying myself climbing the easier yellow gums on the wall.Staff was friendly and there is huge parking area so that was a plus from a person living in an area where finding parking may be easier than finding gold. Only down fall is as a beginner I have to go with someone that can belay me or pay for an instructor. There are free climbing walls but the over all area is small and it gets packed (went on a Monday night). The prices are on there website.  There will be entrance fee, equipment rental fee, and shoe rental fee. I strongly advise you to check their website first. Overall I had so much fun I ended up joining the monthly club. Its really a great workout for my back and arms since beginners tend to pull up and not push up.", "date": "6/16/2015"}, {"review_id": "7D90n7FRFWsGVC4U8blU1A", "user_id": "_6AlG1be4f7XjlAXx-Jy7Q", "user_name": "Yewande N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 8, "funny": 3, "cool": 3, "text": "What a joke.My friend and I bought a Groupon for a trial membership and after running into a kiddie party at the Long Beach location backtracked to Hawthorne for a quieter experience.  I've been to the Long Beach Hangar 18 once many years ago and have never rock-climbed since.We walk into the Hawthorne location to the girl behind the counter preoccupied on her phone.  Tell her we're new and have never done this before and she shoos us over the the iPads to sign the waivers and whatnot. Strike one. After we're done, it takes a second to get her attention because, again, she's preoccupied on her phone. Strike two. She's talking fast through all the obstacles they offer like we understand what she's talking about, and tells us that we have the option of taking a lesson for the belay or bouldering. Did she forget that we're new?? Of course we want a lesson! Strike three.She tells us the lesson is 30-45 minutes and we decide to wait. After a self-tour of the facility my friend and I go back to the counter to ask who we'll be taking a lesson with. She tells us it would be with her or her co-worker (who is walking around barefoot, trekking back and forth from his lunch on the counter to the group he's giving a lesson to. Worst yet, he's approaching them with a mouth full of food!). Strike four. It took us all about two minutes after to decide that we didn't feel safe rock climbing at this facility, especially since we're NEW to this whole thing. If you just signed a waiver saying that you could get seriously injured or DIE wouldn't you want to work with staff who understood that and cared???From what I remember, the LB location was much more attentive and had a better understanding of the safety of their patrons so we'll be utilizing our membership there. Oh Hawthorne..", "date": "10/13/2014"}, {"review_id": "TcGJO92bM_AkU4lzjCjXGw", "user_id": "jc4ul6AtQjKs3a9Y4E0nqg", "user_name": "Carla V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 15, "funny": 5, "cool": 2, "text": "Man..... I hate to do this but this gym is UNSAFE. I have been climbing for 15+ years all over the world and never have I felt so unsafe as at hangar 18. The top ropes were not double wrapped at the top so if you are belaying someone heavier than you, if they fall, you will go FLYING. Not to mention that lowering someone off a top rope route means serious burning of your hands even with the required gri gri. I fell once and my partner was sent flying, and I slammed hard right onto my elbow from about 6 feet (normal top ropes shouldn't drop more than 3 feet or UNLESS you're lead climbing which is a whole different beast altogether). This is unacceptable and totally avoidable by double wrapping the top rope for a little more friction. Also, the staff is totally unprepared. The young lady that took care of us was really sweet but definitely sang Disney songs at the top of her lungs for the last 30 mins of our time there (was she trying to get discovered or remind everyone it was almost time to clear out? Her rendition of \"let it go\" got me outta there really fast I'll tell ya). Also, when we were \"tested\" for our belay aptitude a boy no older than 15 came to watch us belay each other. He told my husband he didn't need both the knots as a climber- only one (!!!)After we passed the \"test\" I asked if we needed a certification card and he laughed and said no we don't do that. When I just looked worried and shocked he laughed again and said \"yeah.. we should, but we don't\" and that was that. Meaning do NOT find a top rope partner here at hangar 18 because they will not know what they are doing!On one of the walls there was an open closet jutting out right into 3 of the top rope routes. I tied it closed using another top rope and when one of the staff walked by and we asked him to close it he shrugged and said sorry they lost the key. He left my rope the the way it was and walked away.There were shards of glass in the carpet near the cubby areas and the vending machines.This place is obviously abandoned by whomever owns it, and it is frequented by twenty somethings that either aren't serious about climbing, don't care or don't know any better. Do NOT bring your children here. The climbs do not vary much in difficulty or style even if they are labeled differently so don't expect much there. They are obviously all set up by the same inexperienced climber.Anyway, the gym is cheap, so I guess that's nice. The staff told us people buy groupons indefinitely and never pay the full $50 membership... And it's obvious given the state of the establishment.Climb at your own risk and after they make you sign 10+ pages of liability waivers lol", "date": "8/12/2014"}, {"review_id": "9LkwB08-I-ptK_E9nhPIjw", "user_id": "vURJ8CAMO9Q9Cdm-X0hgkQ", "user_name": "Nina S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Me and my friends went to hangar 18 in Hawthorne yesterday. I have to admit that I did not like it at first because everything looks and was pretty close together, which made me feel uncomfortable. It turned out to be a great gym after spending almost 5 hours there :)The great part about this gym is, that it had padded floors around all climbing spots. We went to the one in long beach 2 week earlier and it only had mats you can pull towards the bouldering spots.Back to Hawthorne. I read previous reviews about the bad service but I can not agree with that! We did have to wait a few minutes but that is normal due to the day of the week ( sunday) we decided to go climbing. We purchased a groupon including a lesson and all rental gear which was a great deal! The instructor we had was very nice and explained everything very well! The great thing about the gym in Hawthorne is that there is a bouldering spot where you can \"top off\" and use a ladder to get down again. It was great to know that you don't have to jump off the top or boulder down. You can simply climb up and walk down!The bathrooms were not very nice though. Even though it had a shower for people who use it as a normal gym, the individual stalls could have been cleaner. The reason why I did not give out 5 stars is because of the bathrooms and that it was extremely crowded around  4pm which made it hard to move around and climb in different spots.Overall it was a great experience, the padded floor and the topping off was definitely worth going there for :)", "date": "4/8/2013"}, {"review_id": "fRXjaIgcF-asNaYoOCs5Jg", "user_id": "dP8O6EFUUtMURC6IDTy1mw", "user_name": "Jay M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I knew I forgot something...well my friend and I got a groupon to come here about 3 weeks ago and it was so fun. The space was nice, Elizabeth was sooo nice and there was a nice dog in the front. I was a little scared because heights arent really my thing but we had a blast. Im def coming back", "date": "9/30/2015"}, {"review_id": "QkGTlPvhVVou2TDfwxP6Kw", "user_id": "EZ5vrvHJlRNw6nfAWGihsg", "user_name": "September V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Came here on my own to challenge myself. The staff was very friendly, helpful, and informative. They showed me the ropes -- literally -- and gave me guidance on how to use the auto belay system and utilize their color mapping to make the most of my climb. Great experience!", "date": "5/28/2016"}, {"review_id": "jQ6ma_zXzXBhvFpW8Jnggw", "user_id": "uRhSynCJ4Hzc6q21Y2_SRA", "user_name": "Loan L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We came with a group for 5...  ( 4 adults and 1 child). We were all beginners. And our instructor was super informative. it took a few tries to properly tie a knot on the rope. If it was incorrect he definitely corrected it. he Double checked how we had the equipment on. As soon as he thought we were confident enough in what we were doing we were left alone. We all learned a lot, had fun and no one got hurt. In the beginning my daughter kind of freak out when she was instructed to push off the wall while hanging on the rope. Luckily, our awesome instructor came up to help her out. Plus he went up with sandals without a rope. He's a cool guy. Definitely, made her feel comfortable and within minutes she was confident going up and down. Awesome atmosphere. Will definitely come back. You should definitely come here.", "date": "7/20/2015"}, {"review_id": "NBU5_VIvIaKT9w8AYpxFgQ", "user_id": "386l1YfJbdvvNv1Y4Ftd9Q", "user_name": "Epifanio G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Dope gym, little circulation.great sweat in 15 min. One top out boulder wall, 3 auto belays.crash pads and soft landing floor. Looking for a quick hour session for pure sweat hit it up. Bath room/Changing room.But I came to climb. Draw backs, I went in middle of day.", "date": "10/8/2014"}, {"review_id": "kKZTdX0_YNs2vuVK8GWUxQ", "user_id": "2Yt_d-KZG6SbqDlpIM6lYQ", "user_name": "Miinkay Y.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 7, "funny": 1, "cool": 0, "text": "My friend and I bought a Groupon for the Belay Lesson, entry fee and rentals. We showed up in the middle of the day on Saturday and immediately got told that we would have to wait two hours to get a Belay Lesson because all the equiment was rented out and there were two groups ahead of us. It felt like they just wanted us to leave so they wouldn't have to deal with us, but we drove 30mins to get there and use the Groupon so we were staying. So whatever, we started bouldering since we were already there and if the lesson happened it happend. The routes are hard to find, a lot of the tape has been kicked off and some were just confusing to start or finish. It was super crowded with kids so we couldn't find many routes to work on. Not to mention worrying that a kid would run under you before you jumped down. Finally after an hour someone says we can have our belay lesson. The whole lesson the instructor was obviously bored. When he gave us a task that would take a minute he pulled out his phone. It made me not really want to climb. This place makes me not want to climb.", "date": "4/3/2014"}, {"review_id": "S62b89Da7HfdguBty2KX4w", "user_id": "K5G7p94Tc81ab15hqfnokg", "user_name": "Michael C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "The good: it's cheap. The bad: basically everything relating to an enjoyable climbing experience. Holds are spray painted (awful!), shiny, and slippery. Route setting is lazy and uninteresting, relying on crimpy holds to add difficulty. Walls are short. Tape is beat up and it's sometimes hard to tell which holds are on your route. Only alpine bod harnesses (uncomfortable, not padded) available for rental. Definitely the worst of the local gyms (Rockreation, Sender One), and I don't think the cheaper price makes up for it. When Sender One opens up its LAX location, I don't see this location staying open for long.", "date": "7/20/2014"}, {"review_id": "E7qlZl15W6HnRUmknteTCw", "user_id": "3LN3jsri1Hz3vQ_0TbUHLA", "user_name": "Joe B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The facility looks great and fun...if you are an adult or have an older child.  Unfortunately for our 5 year old, it was a bust.I called before going and they said kids as young as 1 could participate.  Great.  After we arrived, but before signing in/paying, we looked over the facility and he definitely wanted to do it.  Unfortunately, we wee not allowed to actually go in and touch the climbing walls.  Liability I guess but surely a staff person could have supervised as we walked the four feet to compare his size to the handholds.After 10 minutes of waiving all liability for everything under the sun, they fit him up and gave a brief demo on how the retractable safety line works. Then he tried, and tried, and tried but got no where.  Very frustrating for him and me.  So we left. $13 for a few minutes of anger and disappointment.I'd recommend a few things for this facility -It is clearly made for people of a certain height, be upfront about that.Some younger/shorter kids can probably find success, but with some guidance/help from the staff.  They didn't offer any, which is fine, but again they could be more upfront that the facility is not especially kid-friendly.Finally, if they are going to serve kids, they should get smaller harnesses.  While his fit tightly, the carabiner attached so high that it was jabbing into his chest/throat and hurt.  That was part of the problem. I'd say they should have refunded our money, but I didn't ask for it and, suppose, we did use the facility (for a few minutes). Bottom line, for older kids and adults, I bet it is a lot of fun.  For us, we won't return for a few years.", "date": "7/30/2016"}, {"review_id": "N8uWPljAUItV-rw-Le3BTQ", "user_id": "Jck0TRiXRC3fwT-NcBEolg", "user_name": "Nate W.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 5, "funny": 3, "cool": 0, "text": "If a climbing gym and a crackhouse had a baby, it would be Hangar 18. I was down from SF and figured I'd check it out. Filthy, ancient holds ( some have actually been SPRAY-PAINTED ) that seem like they haven't been changed-out in years. It's great they keep the hold colors consistent through the problems but they are covered in so many layers of chalk and rubber you actually can't tell what color they are once you are up and climbing.      The bathroom reminds me some I've been in on Sunset. If they just added a condom machine and I'd swear I was at a strip club. Awful.     I don't know if MadRock owns this place but it's the only brand they sell or rent.     I guess the only thing that saves this place from one star is that there are some interesting problems, and they are graded properly. But, seriously, this place is so bad that it makes me want to open a real gym like Planet Granite or MetroRock and give Angelenos a place to climb.", "date": "10/30/2015"}, {"review_id": "jNFhkNVnrzqQKmwmQJovfQ", "user_id": "Rwppi5ut-HXptKz7iaVzBQ", "user_name": "Cait O.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 4, "funny": 0, "cool": 1, "text": "Pros:- large gym with a good variety of bouldering/climbing routes- the employees are very friendly and ready to answer any of your questions- the routes are changed up every couple months to keep things fresh- they have a training area/small gym that you can use to strengthen the muscles you use for climbing- they have a lot of good beginner routes, great place to take someone who has never tried climbing before & might be a little nervous at firstCons:- kind of difficult to find the first time.  There is a small sign out on the street and it is way in the back corner.  I got way lost going here for the first time- Unbelievably crowded on weekday evenings.  At 7pm on a Tuesday it was packed to the point of waiting your turn to try most of the bouldering routes.  It's not too bad with the people who know what they are doing but some of the beginners will start climbing a bit too close for safetyIf you're a student it's only $28/month and that includes shoe & harness rental.  If you're not a student, check out groupon, they always have a lot of deals going on.  They have many locations throughout Southern California and if you get one of their memberships you can use it at any gym & you get one guest pass per month so you can bring a friend.", "date": "2/12/2014"}, {"review_id": "yD_PK0eU8FVgXnKdKkupBQ", "user_id": "f0uwLEHPIuNWgFuUNd473Q", "user_name": "Jacelyn K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Pros: -4 auto-belays for people who want to do rope on their own-a good variety of top roping with rating from 5.8 and up-nice selection of bouldering, overhangs, caves etc-one structure of the bouldering allows you to top out -weights in the back, and place to practice your hand grip strengthCons: -pads for bouldering are thinner than expected, because they have padded floor. But be careful, I hurt my ankle when I fell off a bouldering problem, even with a pad below me. -rating system seems kinda off. I can climb 5.8-5.10c in this gym, but everywhere else, I'm around 5.8 and 5.9. Bouldering, I can do V0, V1, and V2 here, but the routes are harder at other gyms. If you're new at this, come here. There will be a lot of stuff you can do, so don't be discouraged. I got membership about a week ago and came 5 times already. You can get better fast if you work on technique and not strength. Climbing is a mental problem lol. If you love it enough, buy shoes, expect to spend around $100 on it. It's worth the money. Buy chalk, especially if you sweat. It's only $2 for a piece of chalk.", "date": "5/21/2015"}, {"review_id": "WaxjLK4ZIeA2VfFLirKujw", "user_id": "1OI6o_bETUJcgOp9K9EGeg", "user_name": "Christen D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first rockclimbing experience, and I can't wait to come back. We bought the climb for one month anytime package. They have all kinds of different colored rock climbing combinations, which makes great use of a smaller space to create many routes to climb. Our instructor, Franz was completely patient, and made us all feel safe throughout the entire experience. And that's saying a lot considering I am somewhat afraid of heights.  If you need a full body work out in a fun way, this is my recommendation for a group of friends or even going for on a date with someone.", "date": "4/12/2015"}, {"review_id": "QI6XOQdWgiYMSjNFtRHpIQ", "user_id": "kznYwLujVmHeWBArYRWpdA", "user_name": "Michael R.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "Do not fall for their scam.  I purchases a Groupon for this location for 2 people. We wanted to try out rock climbing but found that it was just not for us.  The women we spoke to when we signed up assured us we could cancel over the phone as long as we canceled 2 days prior to the expiration of our month passes.  When I called to cancel my membership while I was out of town on business a guy picked up the phone and began telling me I was lying because they do not do that.  He told me I could not cancel my membership over the phone and that unless I can make it back by the 30th that I was shit out of luck because they were going to charge my card.   I came in on October 1st which was my first day back to get refunded due to them initially stating I could cancel my membership over the phone and the guy helping me said nothing he could or would do and if I really needed the 66$ that I could call and bitch to my bank which is exactly what I ended up having to do.  I asked for a manager and he said they are all managers which is absolute horse shit.  This business is just like any other gym.  I will not be back and I will not recommend it.  I have sent a letter to the Better Business Bureau.", "date": "10/4/2016"}, {"review_id": "WpSMKGHW06m84PYJCp9Brw", "user_id": "Ba_cWbzh2Wghm9runQ0WUQ", "user_name": "Lei S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 10, "funny": 7, "cool": 8, "text": "I first came here a couple years ago when it was called Beach City Rocks. Although the name has changed, everything else looks the same. All members are allowed to bring one free guest a month and I was invited by a friend of mine. Shoes and harness were also included free of charge. Another friend and I took a quick belay lesson. The instructor wasn't very friendly and seemed very rushed while explaining how to belay. I didn't feel very confident demonstrating the belay techniques after his brief explanation but took my time and got through it.My friend and I actually ended up climbing the free walls (bouldering) and it was a lot of work. The best technique is to not just use your upper body strength, and I learned that the hard way. There are many different levels to challenge yourself. They also have a couple auto belay climbs if you don't have anyone to belay or if you don't trust anyone.Other than the odd staff this place is good but can get crowded. For now I'll probably just milk my friend's free guest pass until I can build up more upper body and core strength =P", "date": "9/27/2011"}, {"review_id": "ZA-Xxg8MLPHHmpJGzKK-3A", "user_id": "OO5TTEiOZY9v-EbC2s1v4g", "user_name": "Jax M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "God bless the staff. They are incredibly helpful and nice. I just went to a gym in San Francisco and it has shown me why I come to Hanger 18. The staff will help you. They care and they don't want you to fall to your death. One of the front desk chicks spent a ton of time showing my friend how to use his harness and how to belay. She was a great teacher. As for the actual gym. The routes are fun and challenging. The wall shapes and inclines vary. The walls may not be as tall as the other gyms but this is made up by the challenging placement and variation of holds. They change the routes up about every other week which keeps things interesting. There's a good bouldering section. The price is unbeatable. There's not many frills like fancy white towels and work out machines but I come here to climb walls. If I wanted workout equipment I would join a work out gym not a climbing gym. I'm super happy with this place.", "date": "2/10/2016"}, {"review_id": "Jrr4pdE_C-njRfBWXi9Qkw", "user_id": "0jLU__1Uv94-1oaEGsQ7rw", "user_name": "T M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Not worth the hassle. Not a safe environment. No manager or first aid certified person on site at all times", "date": "2/1/2017"}, {"review_id": "hrnj9Ct8frPB6zaYYeOHhg", "user_id": "bOkkm3viM7fpJuydNBUCpA", "user_name": "Jimmy R.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Gave this a try. Got a groupon a couple of friends along with my wife. We camein and were greated by a nice dude. It was 10 am so he was the only one there and was already giving a lesson.we waited a bit as he went back and back again helping us and the climbers in the lesson. Despite that he did a great job in not forgetting we were there. we got our lesson and just had a blast.time flew.so fast  we were there fron 10 to 230pm and by this time it was packed. This place was filled with great helpful people. We would definalty make this trip again. We live in burbank  wish it was closer but it is definatly worth the drive. Alert for firstimers soak your arms in a bath when u get home and pop some motrin befor u go to sleep... lol I guarantee that if u dont you will be hurting very much. :)", "date": "9/8/2014"}, {"review_id": "1xqSLiupUMNKx_qkGMSt1Q", "user_id": "6mgYTBGN1Ig2thDBCjmLwQ", "user_name": "Michael C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 3, "funny": 1, "cool": 3, "text": "My brother who is a huge climber describes Hangar 18 as the dive-bar of rock gyms. The price is right, and people who are in the know find it meets their needs just fine. If you want to class it up, there's always Sender One (which he calls the Equinox of rock gyms). But for me - beginner climber - Hangar 18 does the job spectacularly. This location has friendly staff, plenty of free lot parking. It can get very busy, and kid-filled (they apparently host birthday parties here) on the weekends.", "date": "12/8/2013"}, {"review_id": "1JmerQ81Apr4Otc_KK-nLw", "user_id": "BBE4MFyZ-5ii6-dIJAaFHg", "user_name": "Lauren Y.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "On your first visit here you will definitely get lost. Super hard to find off of Rosecrans and then it's all the way in the back of the lot in a warehouse-looking building. Just spot 10 extra minutes to turn around if you are meeting people.Luckily I was given a ride here with rock climbing pros who had been coming for years so they knew where to go and told me exactly what I needed to do (put my harness on, tie myself in, tie the figure 8 knot,  the rock climbing \"jargon\", use my legs more than my arms...ect)I have rock climbing shoes and used a harness of my friend's so I'm not sure about rentals. I would never come here without some prior knowledge of rock climbing first, or it would be a bit confusing.I used a punch on their card ($80 for 10 punches) but I will either get the student discount (unlimited month for $28) or a punch card of my own next time.Parking is ample and free.", "date": "3/10/2014"}, {"review_id": "LJtT67bPz3bSZsl3SKxlXg", "user_id": "3tCCjRLxIsQB7vdhzBCiXw", "user_name": "J S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 5, "cool": 2, "text": "So my friend asked me to go rockclimbing, I thought...It's just a rock. How hard can it be? ...(pause)Staff was helpful (all 1 of them for the whole gym, so service can be faster, but it was friendly)I tried crawling on the top of the inverted walls - I definitely don't have good rock climbing technique, but did a lot of pullups as a kid. And, my mom put me in Kumon so I know how to play puzzles and do arithmetic.  But when I'm hanging upside down, I'm thinking... I have no clue what to next.  It's like...I'm all brawn, no brains, baby.All this education, learning how to be well put-together. What for?  When really my sole aspiration is to be a cockroach and hang upside down from rocks.", "date": "1/5/2012"}, {"review_id": "LijsDGj0GniWiOC1C4IjNg", "user_id": "jbOV66secENSq6-optuNOA", "user_name": "Yolanda M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Took a trip to Socal earlier this month with my friend, and considering our obsession with bouldering and our desire to become spidermonkies, clearly we scouted a groupon before anything else. Came here at 8pm on a Friday night and it wasn't too crowded and we only had about 2 hours to climb. Filling out the waiver didn't take too long but waiting to get everything set up with the guy at the front desk took a long time. He was slow and unfriendly (looked annoyed and pissed off), made me feel uneasy. This isn't really a place known for bouldering,Their routes don't seem to change often, which doesn't matter too much to me since I don't live in the area. HOWEVER, the holds are very poorly maintained (chalky, slippery, old) and made me feel privileged to climb at my regular gym. I would come back to try their top roping if I was in town but I wouldn't go out of my way for this place. GOOD STUDENT MONTHLY PASS PRICE!", "date": "4/29/2014"}, {"review_id": "RUMct4exFS3cTNvC3VHGQw", "user_id": "p0UbZ13W0IxJUy-hDB_OqA", "user_name": "Kelsey C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "I don't know much about climbing gyms, but I know I enjoy bouldering at this one. Maybe it's just the quality of the company, but either way I'm sold. There are plenty of routes to climb, and though I haven't tried the top roping, but those people look like they're enjoying themselves too. The best part about bouldering here is that there are really soft crash mats and the nicely padded floor is quite forgiving. Good thing or I think I'd be dead by now...", "date": "11/24/2013"}, {"review_id": "dCsEhiXPvzSdR9G3wDWwbQ", "user_id": "OHLr0T6mAF31tcjSskvK4w", "user_name": "Michael A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'll start off by saying that the mission viejo gym has the best vibe out of all the H18's. I came here already as a member so I didn't really need any interaction with the staff but I can definitely see what everyone else is talking about (regarding piss customer service). I walked in and wasn't greeted by anyone... actually tbh I could have just walked on through but I scanned by card anyways. Not one person came by to see how anyone was doing. Whatever.There is a ton of routes to climb, problems to solve, however the heck you want to say it. That is the one really great thing about this location. There is so much more variety compared to my usual location that I'm actually quite a bit jealous! I'll definitely try to come back to this place once a month just for the variation.", "date": "12/15/2014"}, {"review_id": "Pkp3FmrFFX24jn6h9NUvzw", "user_id": "-gdzOY2cCMzfOMejl4Ukng", "user_name": "Pier H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "I had a groupon so my bf and I decided to check this place out one afternoon.  We are both beginners, so we were looking for some easy walls to climb.  When we got there we got some really good instruction from one of the employees on climbing basics, belaying, safety, etc.  After about 30 minutes we were able to climb on our own.  I have been climbing only once before, and the gym I went to had higher walls than Hangar 18 which made for a more enjoyable climbing experience.  Also this gym did not have many beginner walls to climb.  Overall there wasn't a whole lot of space to climb either.Overall I think this was an OK climbing gym.  It would be nice if there was more climbing space inside, but overall I think I might go back.", "date": "12/24/2011"}, {"review_id": "017rzhG-Alu_Ywuwv3nAPg", "user_id": "-y_dCoClMKc8lnRlsfjiYA", "user_name": "Tiffany Y.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Pros:- large gym with a good variety of bouldering walls - plenty of fun challenging routes for all levels (including beginners such as myself!)- they change the routes every few months to mix things up- plenty of mats if you need that extra bit of reassurance - $28/month for students!! Includes shoe and harness rental!! Best deal in the area! Cons:- Unbelievably crowded on weekday evenings. Best times to go are Friday nights and Sundays!! This place is hands down the best bang for your buck. Awesome gym! Check it out! Groupon always has great specials if you need further reason to go!", "date": "12/11/2013"}, {"review_id": "5fEqACg8kE1ISzJtjmsUag", "user_id": "blIRAB_7Vj8LKtFTcft1VA", "user_name": "Danielle K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A little embarrassed to admit it, but my climbing experience has always included a nice gent setting up and checking the ropes for me.  While I have tons of girl friends who also love to climb, not a one of us felt comfortable setting up ropes for ourselves.  On my first visit to Hangar 18, Elizabeth caught my date setting up the ropes and insisted upon giving me a full training and watching me walk-through the process several times.  I am so grateful!  Knowing the ropes meant 1) my date didn't fall to his death, 2) I gained confidence, and 3) Hangar 18 got a new client.  Smart girl - thanks Elizabeth!!", "date": "2/6/2016"}, {"review_id": "vItDriFTisLBdtVpDRtwyQ", "user_id": "GIrJaWsfSArjEYvisPQC4Q", "user_name": "Michael R.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 18, "funny": 2, "cool": 1, "text": "I have been a fan of the Hangar 18 gym in Upland for a few years now and I was in the LA area so I thought I would check out the Hawthorne location. Before going, I purchased a Groupon deal to get belay lessons since my girlfriend has never been before. When we arrived, we were able to check in with the person at the front desk and get our equipment, but he told us to wait for the next available instructor.... that's when it all went downhill.We were told that we could check out the gym and do a little bouldering while we waited. As I was checking out the gym, I noticed that several of the floor pads were ripped and falling apart with pieces of foam scattered everywhere (strike one).My girlfriend and I continued to try a couple of bouldering routes, but we were only able to very few routes that were V-B and V-0, none of which she was able to complete. As we tried to give it a go, we quickly found that these routes were way too difficult for a beginner. In my opinion, their idea of a V-0 should really be a V-2. Their ratings on some of these routes were ridiculous. I was able to complete a V-4 route that  was easier than a V-2 that I found right next to it. Rating for their routes were way off! (Strike two)After about 30 minutes passed, I saw a couple (who had checked in after us) getting their belay lessons. I was quick to follow up with their staff and was told that someone was about to help us in just a moment... back to bouldering we went. About 20 more minutes went by and we saw a large group of kids come in for a birthday party and get checked in right away and were given their equipment and lessons. We were completely forgotten about because the staff was too busy to handle their customers. (Strike three)We packed up our belongings and told the staff that we were unhappy with the service and that we were leaving. The person working the front desk could have cared less about what we thought and gave the sarcastic response \"Sorry!\"Well, here I am to say \"Sorry\" to you for losing a customer... I will NEVER go to the Hawthorne Hangar 18 again. Good thing they didn't actually redeem my Groupon :) These guys should really learn from the Upland location! If you are looking to go to a good rock gym in the LA area, Rockreation in Santa Monica a great place to go.", "date": "2/11/2013"}, {"review_id": "A--1geLd5eMwMIRf3e4JVg", "user_id": "Vp5DzIiP_MmaMZMZVFFltA", "user_name": "Cherie T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 10, "funny": 10, "cool": 10, "text": "THanks to groupon i got to check out this place. I really like it! however i did not like the smell..this places doesnt have that great of air circulation.other than that... i love rock climbing! it's so fun!!! and this place is great, there are different courses and the staffs are awesome - so friendly and cool to talk to. and if you have little kids.. have a bday party here! i saw a group of kids and they all had a blast climbing to the top!! i'd definitely come back and do more rock climbing! perhaps get so in shape that i can boulder (yeah right)", "date": "1/20/2011"}, {"review_id": "XaK2wqGDZtOFrxLKkUdrPA", "user_id": "qopx16Mr61eEwJU-38AuLQ", "user_name": "Brandon H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 3, "funny": 2, "cool": 1, "text": "Let me start by saying that I learned how to rock climb at Sender One in Santa Ana. It's a great gym (see my review on that as well) but it is just such a far drive from Torrance and the rest of the South Bay. Came to Hangar 18 since it's about 20-25 minutes from my house. The price is also approximately half of what it costs at Sender. Price and proximity are the two positives; here is why I rated it with two stars:As other people have stated on Yelp, it smells like a stuffy, dank, and sweaty gym from one of the older locker rooms at Torrance High School. It's relatively dark inside and the walls are not very visually appealing. Now I know that may sound a bit stuck-up and un-pure to a climbing enthusiast that sees these walls as realistic but, what can I say, it's just not as inviting and energetic as some other gyms (including the Hangar 18s in the OC).Also as mentioned by other reviewers, the customer service is nothing to be proud of. Fortunately I didn't experience anyone that was rude. All the employees I've interacted with have been quite nice, it's just that the front desk often sits empty for long periods of time and there doesn't seem to be much urgency if you're waiting there.The routes and problems are all pretty tough. I'm all up for a challenge and I am pretty determined to improve at new hobbies but a V0 at other gyms feels like a V2 at Hangar 18. The routes are color-coded to an extent but some still use old pieces of colored tape to mark the holds of a given route. Oftentimes two problems that sit right next to each other will be very similar in color (like faded orange and orangish-red). It's a bit annoying. The problems also intertwine amongst each other quite a bit. Now, I could see someone arguing that this is more realistic to real bouldering and that problems are not laid out all pretty and easy in nature. That is valid but it doesn't matter much; I prefer the design/layout at Sender One. One Yelper very smartly referred to Sender One as the Equinox (a high-end fitness gym in Manhattan Beach) of climbing gyms. The way I see it, although it's double the price and three-times the distance, I spend 2-4 hours at the gym when I climb and so it is worth it to me.Lastly, the place generally feels cramped. Combine that with the fact that there aren't many V0s, V1s, or V2s and that means you're constantly climbing next to much more experienced climbers. This can feel a bit awkward for a beginner. At the end of the day I thought about keeping my membership and still go to Sender One only once a week or so but I decided to just stick with Sender.", "date": "5/6/2015"}, {"review_id": "nwtrgdS2wpF6-wyFko-w5w", "user_id": "Pd6DaG6-73WTLfgqz3TxNA", "user_name": "Trang V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Well I started going to the one in upland because my College is right next to it. This Hangar 18 has harder routes, perhaps because the walls are shorter. There are always a ton of people there and they even run out of gri Gris some times.But for the unbeatable price of 27/month for College students, it's worth it I guess. This fact also keeps a young crowd here and it's nice because I run into College friends from time to time.In the end, the community here is great and I will definitely stick with hangar 18, especially when I have a job :p", "date": "6/12/2014"}, {"review_id": "zzWf6qQiyQxiMcfLKEqjyw", "user_id": "AHocg8ZU6uYtQ6FmC-Docg", "user_name": "David D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Not the greatest facility really, but the staff is great.  Their little training session for newbies is the best in this area and I've climbed at all of the gyms around.  They have the cheapest memberships and the other climbers are usually friendly.  You can join the meetups there to meet other people too.", "date": "1/8/2016"}, {"review_id": "-J_QoCLMFPs425oqYvDFLw", "user_id": "oXUsOvjVjr71bV2sAxB4Og", "user_name": "Mary D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "I came here twice with a Groupon to learn how to do these things. I went twice because the first time I was scared and my arms were tired so I wanted to do it again so I could get to the top.The class is great, but it would help if they had a reservation system because we waited an hour. It was nice of them to let us boulder around until they were ready, though that is what made my arms tired to begin with. And it kind of changed the schedule of our afternoon. Also, I guess it can't be helped, but it would nice if they had better ventilation. Otherwise, I really liked the experience. The instructors are friendly and I would recommend it to my fellow beginners.", "date": "9/3/2013"}, {"review_id": "5o6c4AVKcRbUVrhBWBHzIA", "user_id": "JI7be9zVGMvYiiP0H2cx-Q", "user_name": "Theo T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here for a slightly more exciting bonding hang with my little brother who was visiting from Georgia. The two of us haven't climbed anything together since getting stuck up in the oak trees by my grandmother's house when we were kids. I found the staff to be welcoming. Andre in particular was very thorough and patient with explaining all the safety rules and giving us the encouragement to make it to the top (in spite of our collective fear of heights.) I highly recommend this location for a play date.", "date": "12/14/2015"}, {"review_id": "B5-1-0J39Qx9VVLczHPC0w", "user_id": "gZ7mbHLlQsLd6S_i5U69tQ", "user_name": "Nicole D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Fun! Had a groupon for intro to climbing class and it was definitely worth it. They take safety seriously here, though it's obviously still a possibility of getting hurt. A friendly guy gave us the rundown, equipment, and an intro lesson. There were some periods of short waiting, but it seemed decently busy at the time. The instructions were thorough, but brief. We were the. Left on our own to have fun and climb around. The instructions were more about safety and procedures than about actual climbing. I think it may be helpful to have tried it a time or two before coming, though I'm sure they would be happy to go more in depth should you have questions or need extra help. A good place to climb on a rainy day.", "date": "12/20/2013"}, {"review_id": "EDQABZDy6auxDxx4J5Tiug", "user_id": "-7cPERHtAupd1Xq53nmhXg", "user_name": "Melissa L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "We had one of those Groupons so we decided to go to the Hawthorne location since it was closer to where we were coming from.   I've been to the Upland location, which I think is much better in so many ways.  First off, the Hawthorne location was super small and really not high at all compared to the other one.  When I first got there, that was the first thing I noticed.  The 2nd thing was they don't have lots of equipment! We got there there weren't even that many people there and had to wait like 30 mins because they were short staffed AND because there weren't enough of the pulley clip thing you use to spot each other with.  The people that did help us out were nice though so at least that helped a little.Other than that, I did get quite a workout with my arms and legs.  It was fun because we had a group of 4 of us but I don't think I'll be back to this location.  Thankfully one groupon can be used with 2 people so we'll probably head to the Upland location next time.", "date": "4/19/2011"}, {"review_id": "h-2XMH_Wf9MC8RqkQrm3Fg", "user_id": "BZfFjiGQsVtURm6jX86j9w", "user_name": "C L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "This is a very small place. The first thing I noticed walking in was the foul smell. The walls and rocks are pretty old and the rocks are extremely slippery. The ropes are attached to the top such that there is not as much friction, making it very difficult to belay someone who is heavier. The weight helps a little but it is a hassle having to lug it around.I think the bouldering routes are fun but the top rope routes are not very accurate in terms of level because I can climb the 10s easily.I do like the slab wall which is very good for footwork training.", "date": "3/22/2014"}, {"review_id": "fmN626SfXZOXQ_j-_ruUcA", "user_id": "qq3u3dfhjXtyKI2d_fB15A", "user_name": "Drea A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 10, "funny": 0, "cool": 2, "text": "2013 UPDATE:Hangar 18 is a smaller gym, but they work with their spacing the best that they can - and for this I am very grateful.With the new additions to the gym,  it is clear that the owner and managers are making efforts to keep their customers satisfied.New additions include:   adding weekly classes,   a beautiful new floor,   a sequestered weights areaThe following issues have been rectified:  1) Floor - Has been completely replaced. It is new and clean.  2) Mats - Are also slowly being replaced.  4) Routes - turnaround is getting better.  5) Ventilation - TBD - summer is coming.  6) Sound system - don't know if they made any repairs to this, but its decent at the moment.~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~1/23/12 UPDATE:DEAR OWNERS: Please tend to this Hangar 18 with the same care and consideration that you do their other Hangar 18 gyms. Hire staff to clean the gym thoroughly once a week (deep clean shampoo of the floors and bathrooms), replace the floor pads and mats, hire route setters for this gym who know how to properly rate routes (there was a V1 route that was actually a V3).~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~2011 UPDATE:The first place I ever started climbing was at Hangar 18 (aka Beach City Rocks), and so this place has a special place in my heart. However, this was over 3 years ago. Since then I have gone out into the world and seen other gyms. I am sad to say that Hangar 18 is a hot, smelly mess.Issues are as follows:1) Floor - is in utter disrepair. There are various tears in the mats, so if you land in them you risk spraining and shattering your ankle or foot simultaneously. In the past three years I can only recall one section of the mat being replaced. So, just think about this: 3 years of feet and sweaty climbing on these floors.2) Mats - lumpy, flat or so stiff that you can sprain your ankle on them.As of 1/23/13, there are at least 6 VERY LARGE tears in the floor. Walking on them alone is bound to twist ones ankle.3) Ropes - old. I have to use a house gri-gri because my Gri-Gri2 cannot accommodate the ropes once they begin breaking down on the inside (which causes lumps in the rope)4) Routes - slow turnaround.There are some routes in the back wall that have been set for over 6 months now.5) Ventilation - on hot days this place is a sauna. They used to have a fan in the back, but it has long since been broken and no one has tried to fix it.6) Sound system - intermittent in the back of the gym. If anything, this is indicative of how management has not taken the time to make repairs.7) Anchors - the floor used to have rope anchors for pairs of climbers that were composed of one large and one small person. Now we have to vie for the single counter-weight, \"Wally\".  8) Bathroom/Locker rooms - are dusty and the floors are filthy.Pros 1) Staff - very friendly and willing to help in any way possible.2) Climbers - very friendly and willing to help in any way possible.The sole reason I keep coming to this gym are the two Pro-reasons (and why I gave this place 1 star). So, if you don't mind poor climbing conditions, then feel free to come here. But, if you do, you will meet some amazing and talented people.I beseech management to please tend to this Hangar 18 with the same care and consideration that they do their other Hangar 18 gyms. Hire staff to clean the gym thoroughly once a week (deep clean shampoo of the floors and bathrooms), replace the floor pads and mats, hire route setters for this gym who know how to properly rate routes (there was a V1 route that was actually a V3).", "date": "10/15/2012"}, {"review_id": "yqbPWfOh3mktxLPo5x-txA", "user_id": "FxkqToJc-xDmzM8I-Xeh7w", "user_name": "Angie J.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I went on a Saturday evening with my brother and two guy friends. The service at the front desk was not great: we filled out the forms when we walked in and then they didn't tell us what to do after. It was our first time there so i assumed they would guide us through, give us our equipment if needed. But we ended up just standing there waiting for fifteen minutes or more until they finally asked us if we'd been helped...so i told them we were waiting and asked them if we needed shoes or anything and the dude's reply was, \"well yeah..you have to pay!\" -.- come on bro..so they didn't really help us at all and we just did our own thing.It cost us 19 dollars just for bouldering and shoes...not terrible.I wish the gym was larger with more walls. I expected a much larger area, but oh well i had funI recommend going in the morning or in the evening so that you don't have to deal with all the bodies.. there are lots of people and it can start to smell like feet haha!", "date": "7/4/2011"}, {"review_id": "1GETejw-faX_TPn6tBn7tQ", "user_id": "OuhfJvuvM9vr6gYuaWkLCQ", "user_name": "John I.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to go and learn the ropes of how to climb. Our instructor was patient with us. Since it was both of are first time. He made sure we got it,  and made sure we understood the importance of the knots in the ropes and effective communication back and forth. They watch from a distance but when they seen us having a difficult time, they were right there to guide us. Give us a few more pointers. Great place to go and it really works out your full body.", "date": "11/12/2015"}, {"review_id": "27wtezTaLDrw9HAjlYefKQ", "user_id": "i1nusbXpAfkH6m5zfH4AFg", "user_name": "Sonali S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Great indoor rock climbing spot near LA. The instructors help you with your harnesses and safety equipment and are very available throughout the day to help whenever you need it. There are a few easy courses and a lot of advanced ones, but I wish there were a few more for mid-level rock climbers. I do like that they have a Bouldering section where you just climb up without a harness and can sit on top and enjoy the view! The location is very near Manhattan Beach, so my friends and I usually go hang out there to relax after a long day of rock climbing.", "date": "8/28/2013"}, {"review_id": "p0Ox4JH_StwAU9iY52t-jQ", "user_id": "NtSt9rE__vmUewf5culDEQ", "user_name": "Gary M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "install a mofockin water fountain please people :)other than that, i realllly dig this spot :)", "date": "9/2/2015"}, {"review_id": "-RFFLzKTmIikIqLuK8Fe-w", "user_id": "YsrpberjSs74sJbeNsGEfA", "user_name": "Alvin P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 3, "funny": 4, "cool": 1, "text": "I'm seeing some negative reviews about this place but most are from whiners so i had to leave my two cents and set the record straight.  I came here with a friend for my first ever climb.  I'm not an expert climber, in fact the only things I've climbed on to in the past decade are my bed and my couch.  I came with a super-sporty friend of mine to pass some time, have some fun and get some exercise; needless to say, we accomplished all three.  I also found the people who attend this gym to be the most friendly, outgoing and helpful folks I've ever met in Los Angeles.  They were so cool in fact, it took me a few minutes to get used to how nice they were.  I've seen people complaining about how small this place is, how it has an offensive odor and how the holds are too old and slippery and even that the floor mats are too old. To them i say: STOP WHINING.  gosh!  If you're really that posh then go climb somewhere else and it'll just be me and the friendly cool people.  It's a gym, built in a warehouse, so it's going to stink a bit, as long as this place has been around you shouldn't be surprised.  The holds are fine, you're going to tell me that if you go climbing out in the real world that all your holds are going to be peachy? They aren't going to be in the least bit slippery or hard to grasp?  SHUT UP!  The floor mats are fine, at least they were when i went there, if you have a problem with them then don't fall on them. This isn't the poshest gym in town, I would admit that, but it's probably the coolest and closest knit bunch of people you'll find. If you're one of those \"professional\" climbers who can't deal with people who don't know what \"crimpy\" means, or can't stand climbing around a few newbies then i'd recommend going pretty much anywhere else.  But if you're looking for a good time at a pretty darn good price then you've come to the right place.", "date": "8/22/2014"}, {"review_id": "zf0y7jO2DaWXTAatMmcV0Q", "user_id": "syrsu7q3DYcZCYKZqRM63w", "user_name": "Eva V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 7, "funny": 4, "cool": 1, "text": "My friend and I used my Groupon for this place this past weekend and while we had a great time and got some laughs out of it, I won't be becoming a regular any time soon. Basically, if you're even a little afraid of rock climbing, don't count of anyone who works here to make you feel safer or more at ease. If, however, you are a total badass who can skitter up the side of a mountain like a possessed spider monkey, then you'll do just fine. Neither myself nor my friend are quite like that, but I definitely saw people here who are.As far as experiences go, this was a fun one, but mostly because of the company (and I provided THAT). I was helped out by two different guys, and both of them had a laid back and (in the case of our instructor) a slightly irritated demeanor. I did get frustrated by some of the mysterious choices my instructor made... like not mentioning that my friend could clip herself into the ground with a strap built into the flooring to keep her from flying up in the air when I was descending (she's about 1/2 my size) until it had already happened... or when he had us start on a 5.10 graded wall instead of the very easiest wall they had. His response was \"I have my reasons\". Well, they are mysterious...", "date": "6/3/2012"}, {"review_id": "Msdzy_-Wqe20NIRFJIAoXg", "user_id": "98fHh8vbemIriKtPypSiVw", "user_name": "Kyil W.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "The establishment itself is awesome. A few friends and I decided to check this place out after coming across the groupon deal. The only issue I have is the customer service. The instructor Corinna is not very friendly and quite condescending. Had it not been for the fact that we were all in a great mood and excited first time climbers we would have definitely escalated a complaint against her. I would recommend this establishment however if you are a novice try not to deal with her.", "date": "12/8/2014"}, {"review_id": "T7XAE2_vgCbL2CKNfgZJ-Q", "user_id": "-cv9PPT7IHux7XUc9dOpkg", "user_name": "bernice c.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 4, "funny": 4, "cool": 4, "text": "Visited Hangar 18 on a free open night.  I was super impressed by the friendly/ enthusiastic staff and the amount of walls they have there.  Jeremy a super experienced worker there who has been there for 6+ years balley-ed us for the night.  Super nice guy and was very helpful.Only complaint is that a lot of people started taking off shirts and socks.  The smell in the warehouse started getting a bit sweaty for my taste.  I wish that they made it a point to tell the climbers to keep their clothes on.  Other then that clean facilities, lots of range for different levels of experience.  Fun for all ages.  I saw little kids climbing up the free climb wall, crazy fast.", "date": "6/7/2010"}, {"review_id": "TPoAdBWoAp687aPWGKtBQg", "user_id": "RPAT4wSOvxdu1Q-Jd72ZBw", "user_name": "Tania x.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "I've been coming here for a while and I love it but to all you noobs....-Top rope climbing is pretty safe in a gym which is why the staff are so non-chalant while you are panicking. Hangar 18 requires an auto locking device so you'll only drop a foot or so if your buddy lets go of the rope.You might bump a knee or scrape yourself but that's it so stop crying. Honestly it just makes the staff more ambivalent and they're ambivalent enough. -PARENTS PLEASE SUPERVISE YOUR SMALL CHILDREN. I almost made a pancake out of a pretty 6 year old. The staff make miserable babysitters and they aren't changing so it's up to you to keep your kid alive. 150+lb humans are dropping from 15' up in the air. -Indoor bouldering is a high-injury sport. Pads add to the danger. Falling incorrectly, not quite on the pad, between seams causes many ankle/leg injuries. -Plenty of (skilled) females climb here so I don't feel outnumbered by the guys. And new guys, don't get all sullen if the 5' skinny girl can outclimb you. She's just better than you.-There is climbing etiquette. Mostly - Don't hog a route/wall. Pay attention to the people around you. Are any of them working on the same wall? If so, you take turns. When it isn't your turn or you are checking out a route step back so that others can climb. If you fall/touch the floor/use the wrong handhold your turn is over. -People are very focused on their training so they aren't as friendly and climbers don't give info unless asked. If you want to know something ask someone who's resting or waiting for their turn.", "date": "7/13/2012"}, {"review_id": "a8QsrxiTxZY2at0AkDSH7A", "user_id": "hCl77Kb1IMUP83L07l1DDg", "user_name": "Kazuaki J.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 7, "funny": 2, "cool": 1, "text": "Let's start off with the good.  $35 a month for membership is hard to beat.  Most of the newer climbing gyms in Socal like Sender 1 charge at least twice as much.  This location caters to boulders so the bouldering routes are decent and get changed fairly regularly.  Now for the bad.  It's a fairly small space and can get uncomfortably packed.  It doesn't help that they regularly do Groupon specials bringing in large groups of newbies with no clue about climbing gym etiquette.  Basic stuff like not walking underneath a climber who may fall on you.  The lead climbing routes infrequently get changed out, were talking months with no new routes.  They also spray paint old holds to put up new routes.  I'm all for recycling, but pulling on slick painted holds is in no way enjoyable.  This may seem harsh, but a number of the more experienced climbers here, especially sport climbers have left for other gyms.  If it weren't for the fact that I have good friends that still climb here I'd leave too.  While Hangar can't match other gyms for sheer size they can compete by offering a more quality experience.  I sincerely hope management will read this and consider stepping up their game.About me: H18 member 2+ years, experienced outdoor climber (trad, sport, bouldering).", "date": "5/13/2014"}, {"review_id": "78KGH0Kw9avaOYwjCdQdEw", "user_id": "CFXhVa-QgOyd-h9a9cErcA", "user_name": "Rachel S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The overall vibe at this gym is grey, dull and the staff is cold and will ridicule you for no real reason. Routes do no feel contemplated or perfected by route setters. Uninspired to say the least. The bouldering is better. It's more of a boulderers gym than a sport climbers gym to be honest. There are some really nice people who go here regularly so there is a very small community to get to know but it sort of gets weighed out by the hounding staffers. Sorry you guys. Some of you are pretty sweet but there are few of your colleagues who get pretty weird with people and feel the need to prove themselves beyond what is appropriate.  I miss my gym back in Arizona. Rocks and Ropes I never knew how good you were until I started training in LA. Bleht.", "date": "11/11/2013"}, {"review_id": "lcj0qUs_GbLsCtS_drYnfA", "user_id": "Jb7tSZ2p8iLGpKcmwP_YGg", "user_name": "Marianne S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Yes I am a fan because this is the only rock gym I have been going to. I'm a glass half full kinda gal so there's really no complaints since becoming a member this past May.  True: it does get packed on a week night especially on Tuesdays and Thursdays.  The smell of feet, sweat, rubber and ego make this place a rockin' party for bacteria and thus would probably help if you carried a sanitizer for your feet IF you're renting shoes.  I get the work out that I need done and have encountered zero problem with people hogging up walls to work on problems.  People are pretty mindful and respectful: if you fall or complete a problem, your turn is over, on to the next person waiting.   I've also found people to be pretty helpful both either asking for pointers or them just lending a hand.  They put up new holds and some new problems around the gym so it's a new challenge.  Coming here, having fun, not being so self conscious about all the muscle staring you in the face and having a workout agenda going is a great start and end to a work out.", "date": "10/15/2012"}, {"review_id": "ChqC0YglaHayM-9p3Ysgvg", "user_id": "dOms7B4CrFjcES6CwvOB5A", "user_name": "Mel B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "Pay VERY close attention to the contract you are signing with this place. I bought a 3 month promotional membership for $69 during the holiday season. I went to the gym and it was small and overcrowded and there were only 2 or 3 auto-belay's and I was by myself since I just moved to the area. The crowdedness made it slow to climb. I should have bought a day-pass before purchasing the membership, but to make things worse, after my 3 month membership was up (and to repeat I only went to the gym once) they automatically charged me a one month membership fee without giving me a reminder notice. The charges were pending on my card so I called right away and asked to cancel my membership and was told I couldn't do it over the phone. I had to email the owner. I emailed the owner and it took him about a week to respond. He told me he would cancel the membership, but would not reimburse me the money even if I was not going to use his gym. He made it sound like he was doing me a favor by offering to put the month membership onto a gift card so I could use it later. That obviously wasn't the point since I just wanted my money refunded. I was really disappointed about the way they do business and I don't recommend going there.", "date": "4/24/2016"}, {"review_id": "R87dpdb2oY5TdQnDLqLImw", "user_id": "5nL1-PTGFGy99Ypr5S_-ug", "user_name": "Ethan N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 5, "funny": 1, "cool": 1, "text": "If you love rock-climbing and are laid back then this place is right in your wheel-house.My lady and I came as guests of two members of the gym and had a fun time, though we had some reservations. We both are moderately experienced with rock climbing, so we knew what we were getting into.::SERVICE::Probably the most troubling aspect of the place so I'll get it out of the way first. The staff seemed REALLY tired or bored or ... something. They were more than willing to get us checked in and get some equipment for us but the enthusiasm was lacking. Maybe they were all at a staff meeting the night before, went out to a bar afterwards, and were really hungover.Not sure if this should be included in this section, but for lack of a better place here it is. It's very easy to climb here compared to other gyms. We just had to sign a waiver and that was it. We didn't need to prove we knew how to belay (we do, in case that frightened you) and we pretty much could walk right in and do whatever we wanted without supervision. It was really convenient for us, but if you're inexperienced then you might be left in the lurch.::FACILITY::If you've been to other rock climbing gyms (Planet Granite or the like) this place might surprise you a bit. This place is JUST rock climbing. They have one, and exactly one pull up bar/dips combo machine and a few free weights that are flippantly left in the corner covered in chalk. If you like going to these places to climb but also do other stuff, you'll be let down.The bathrooms have a shower which gets the job done. They're pretty small but clean overall.::THE ROCKS::The impression I got was that everything was old. The colors of the holds were often faded, making it difficult to tell where your next hold was. The routes on the walls would drift into areas of other paths, making it really likely two climbers would get in each others' way. On two occasions a hold moved in my hand, which probably isn't good (but I am a bigger guy, 230 lbs, so it may not be relevant). The difficulty ratings of the courses seemed a bit off as well. Routes ranked very easy would be rather challenging while others ranked a bit harder were a cinch.The bouldering is definitely the best part of the gym. The routes are fun and dynamic and there are a ton of them. If you're big on bouldering you'll like this place a lot.Overall we DID have a good time here, but this does not strike me as a place to go if it's your first time as there isn't much in the way of coddling. If you're going to go, then get some experienced friends and give it a shot.", "date": "3/11/2012"}, {"review_id": "pX6ewT6RyDUNLLVd9iC8sg", "user_id": "A7ayh-cwJl0OHbF-1EDYVw", "user_name": "Eric A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I have been climbing here for about a month now, and have been having a fantastic time at hangar 18. The employees are extremely helpful to a gumby like me. I would highly recommend the intermediate bouldering class with Justin ($20 with membership). He really took the time to teach me the basics and give me the tools to improve my climbing technique on my own time. If you are looking into getting started climbing in Los Angeles, hangar 18s price point and classes are very hard to beat", "date": "3/24/2016"}, {"review_id": "O1uLUm65kV6zq-nssSBK5w", "user_id": "8Nc3HnszRaEdfD6kJU5_CA", "user_name": "sassy mom g.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "First time here and last! This place smells like dirty socks /gym stuffy . It does not esthetically pleasing either.The upstairs \"party\" area is old and dirty with a step that needs to be clearly marked! I tripped several times. Plus no privacy for u and ur party. This place is not kid friendly either. Guess the folks that work here never were kids!", "date": "12/13/2014"}, {"review_id": "p3G7CaNJYaVT3NXUmmv7mw", "user_id": "zDVzNgt_H3AqJNmQBKGEbw", "user_name": "James B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Brought a date here.  It was her first time rock climbing.  The staff was very helpful and patient with her.  We had a blast!", "date": "8/3/2016"}, {"review_id": "hYt61vTTEtXKhRUsWp_Ulg", "user_id": "LdR2u6iwOD8-0lYX0TGOww", "user_name": "Benjamin B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "okay seriously.  right now i'm locked into 33 bucks a month.  how anyone in my situation could rate this less than five stars is crazy.  to the critics i urge you to take a step back, maybe visit Sender One or another new, state of the art gym.  obviously the big gyms are better overall for lots of reasons, but they also cost 80 buck a month with around a 40 dollar initiation fee....okay thats greedy in my opinion.  so the big gym ends up being 550-600 dollar more expensive than hangar 18.  im not saying i wouldn;t join a bigger gym if it were closer to where i live....the full fitness center and huge walls are tempting, i bet even people that work for hangar 18 will tell you that.  but for what they are, i think hangar 18 does a hell of a job.  i recently tried a couple of the yoga and fitness classes they offer to members free.  both instructors - brianna and ivan were really friendly and professional and held great workouts.  they also seem to have a solid system for putting up new routes and since i go alot i always have the option of going to long beach or another branch to get on all new climbs.  i guess my point is that it is unfair to compare hangar 18 to these big modern gyms, especially if you join at the right time when the price is low.   take the 600 bucks you save and buy a rack or a crashpad or whatever.", "date": "1/12/2016"}, {"review_id": "r3UDpz52S0RDcwE1ejuyiQ", "user_id": "i5Umo3hH7vtaV4Z65CxwkQ", "user_name": "Cait K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "My husband and I were moving to the area and since we love climbing, we wanted to get a membership somewhere nearby. I saw that Hangar 18 had a sweet Groupon deal on memberships and even though I read the reviews, I still bought it. HUGE MISTAKE. I'd read how awful the routes were, how unsafe the facility was, how unhelpful the staff is, but I figured \"it can't really be that bad, and for a membership this cheap, it's worth it!\" How wrong I was. They don't double wrap the top ropes, so good luck belaying anyone heavier than you. If they fall, you're going flying. They spray paint the holds, making them slippery and impossible to grip. The routes themselves are rated completely incorrectly, and must be designed by someone completely inept. I'm a 5'7\" female, and if I can't reach the holds for a basic, beginner level route, something is wrong. The facility is disgusting and is clearly not well maintained. The staff is usually preoccupied with their phones and do nothing about unsafe behavior going on in the gym. The renal equipment is all old and barely functioning. There are so many small things that they could change and it would make the entire experience so much better. But no one at the facility cares enough to make the changes. TL;DR Don't make my mistake. It may be cheap, but it's not worth it.", "date": "12/15/2014"}, {"review_id": "Wd6FhkOUfD0DOMjlbny68A", "user_id": "XhcVyNPKwnlIrOhi-Nw5aQ", "user_name": "Loriann P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Took a group of friends climbing today. The place was packed, but we got help reasonably quick. Their sign up system in the computers is a little slow and annoying, but once you get through that the workers are helpful. Great instruction, lots of different levels Of climbs. A little crazy at times with so many people, but no one got hurt ;) we had a great time!", "date": "9/27/2014"}, {"review_id": "de0zmyr9ppcN2pLocDux0A", "user_id": "wJ3ycpAPMAijwDcsUynYYQ", "user_name": "Richi K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "U see the Groupon affect...can get very crowded and equipment sometimes wet with previous sweat. ..yuk...guys purchase your own rockclimbing shoes bcuz the free rental shoes r nasty  (learned my lesson a few times) got a great deal at 5 10 a rockclimbing store", "date": "3/23/2015"}, {"review_id": "qyaKRRCCSI_JGpITYuwE7A", "user_id": "y3tqAXIUVJEA8TmbSwcC_g", "user_name": "Joanna B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 2, "funny": 1, "cool": 0, "text": "What the hell happened to this place?! Packed, really dirty, the floors are coming out and tripping people, and not enough crash pads/really old crash pads with no cushion. Wheres the safety?! Obviously not here. Yea you may have soft gym floors but I still wouldnt want to land on that if I were in the cave climbing with my back to the floor. Wow. Came here to boulder and it seems like they havent changed the routes in a long time because tapes for routes were either missing or some crap like that. I guess I need to find a different climbing gym in LA.", "date": "3/15/2012"}, {"review_id": "XqS2DjvqLYooaxqNGm144g", "user_id": "25lrlCp87N0jG8XMF75_Rg", "user_name": "Sirinda S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've climbed (recreationally) before, but by the time I showed up at Hangar 18 so many years had passed that I had pretty much forgotten everything I learned.   Hangar 18 makes it really easy to  start climbing right away.  I went with someone who had been climbing regularly, so he got me up to speed really quickly.  They have lots of different courses, although some of the \"easier\" ones seemed harder than the more intermediate ones.  I also like that they have a contraption where you can belay yourself if you're not climbing with someone else.  The bouldering area is pretty big, although it seems like they need a few more big mats under that area.  Yeah, it's a gym and people sweat in it, so of course it doesn't smell like a spa, and it's not pristine clean.  But that just helps weed out the whiners.  Pricing for rentals and climbing are really affordable, and it's nice not to have to worry about finding parking.  The staff was helpful and seemed pretty hands off unless you went up to them and specifically asked for something.  I went on a Saturday during the daytime, and there were lots of kids but their parents seemed to do a good job at keeping them well behaved.", "date": "1/10/2013"}, {"review_id": "FnRczaX_KTaWvcisfGezqg", "user_id": "eKBvck8VK6KPAHZ_kS1dPA", "user_name": "Soo K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Andre was the staff member who was working when my friend and I showed up for my very first session of rock climbing. He was very knowledgeable and didn't speak to me like I was an idiot (even though I really felt like one)  during the lesson. I think it was $30 or something but we nearly spent an hour getting the harness to fit right, learning the verbal commands, set up of the belay, and how to use the belay. He did leave us to practice knots and checking gear but came right back as we thought we were ready to move onto the next step. His timing was impeccable and he was very kind. Once my friend and I began our climbing Andre stood there and helped us until we were comfortable to do it on our own. He also explained why things were done a certain way without me having to ask why.I went back the next week and found that the rental shoes with the velcro weren't as comfortable as the laced ones, they were really slippery. Only to see at the end of my session that there wasn't any grip on the toes and I could see quite a few layers into the shoe. =( Next time I'll have to check the rental shoes before hand and look into investing in some shoes and a harness of my own. Thanks HANGAR18, now you won't be able to get rid of me!", "date": "3/8/2012"}, {"review_id": "AQfGxgT5cjznPzCiQfyB7Q", "user_id": "1URTr5nNCkMpwi-LosxIug", "user_name": "Ces S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "bring a water bottle, get some chalk for your hands (will strongly help), leggings or shorts have fun !", "date": "4/15/2016"}, {"review_id": "UsV4RIFsJqGDh7xWmU_Jkw", "user_id": "g9LcUUnSmJuf4k5vzldcvg", "user_name": "Tati R.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 6, "funny": 6, "cool": 1, "text": "Bought a groupon, even with the discount, I was disappointed.When I was a tween, I went to a summer camp that would take us rock climbing.  It was lead by a bunch of college students and we always had a blast.  In my best effort to re-live those days my girlfriend and I bought a groupon.  We called ahead, and Hanger 18 told us just to show up whenever so we did.  We didn't really except that while we received our lesson from some guy who was extremely short towards us, he would also be walking around giving lessons to several other groups.  He gave us our shoes, 15 minutes later he gave us our harness, 15 minutes later showed us how to use them, each step took forever.  Plus, he wasn't very patience and since I am very stupid, patience would have been helpful.   We finally started climbing, which was fun.  My girlfriend went first and she told the guy, \"I am scared I will fall.\"  He replied, \"Don't worry, everyone falls at some point.\"  That wasn't the reassurance she needed at that moment.   I would only go back if I was going with someone who knew what they were doing and we didn't need any help from people working there.", "date": "9/9/2011"}, {"review_id": "IaTJOMuk-Bm8IS0b1mRmmw", "user_id": "Wi7RRnRiD-KamONxJaDZvQ", "user_name": "Eddie A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 3, "funny": 2, "cool": 2, "text": "STAY AWAY!  You're a broken/twisted ankle/knee away from having a really bad visit to this death trap.Pro Tip! If you bring your kids, keep an eye on them (PRO-pro tip: keep both eyes on them and stay within 10 feet) so they don't get squashed by a climber who is too focused to give a hoot about what's underneath him/her besides a spotter/mat and a safe landing.  This is actually more dangerous for the climber than the child (fun fact: kids are made of rubber and tend to bounce), because it can lead to serious injury if a proper fall is interrupted.Okay, on to the review.  Ahem...This place is getting really run down.  The mats are in laughably bad condition and they refuse to fix them or acknowledge it is a safety hazard.  They even have a spot marked with \"Place Pad Here\" on the floor where it is virtually non-existent.  I landed really hard in* one of those dead spots (read: concrete) on Sunday and I could feel the vibration all the way up to my pelvis.  I was extemely lucky to walk away uninjured, though my hip bothered me a little later that day.  Needless to say I stay away from that section now.Also, they take FOREVER to set new routes.  Get ready to be stuck climbing the same damn climbs over and over and over and over and over....I remember when this place used to be cool and management seemed to care.  Now they can't even take the time to refill the paper towel dispensers in the bathroom, let alone fix/replace the mats.  Shampooing the dirty floor is another great idea.Do not visit this establishment if you want to be safe and/or have a good time.Lastly, I don't feel like I'm asking for much here.  A safe, fun and clean environment that attends to the needs of its clientele is not impossible to achieve.*This is not a grammar mistake nor a typo; I intentionally used \"in\" and not \"on\" because my foot literally sank through the cracks in the mat, landing on the concrete below.  Thankfully I didn't shatter my heel.P.S. I was angrier when I first drafted this.  You're welcome for toning it down.", "date": "11/3/2011"}, {"review_id": "w-jAFqpfrOX8lCbHQejfGA", "user_id": "Mrer19aHWeHB07Rx1x9yvQ", "user_name": "Amy C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Hangar 18 is a great gym. I live in West L.A. just down the street from another rock climbing gym, but I make the trek to Hawthorne to go to this one because I like it much better. The vibe here is low key, not competitive or jockish. The employees are nice, helpful and knowledgeable people. Parking couldn't be easier. I always leave feeling happy that I came and glad that I bought a membership. I've seen beginners and experts, six-year olds and sixty-plus year olds, English speakers and those who don't speak any English here. All seeming to fully enjoy themselves. Hangar 18 doesn't require that you pay for their exclusive classes before they allow you to climb. They offer tons of help and classes if you want, but if you know what you are doing they encourage you to do your thing. Looking forward to going there tomorrow!", "date": "4/16/2012"}, {"review_id": "uSSxtEEB8Yu45R158NGEgg", "user_id": "w5bAI7USuCvyl8kZzj6sQw", "user_name": "Diana W.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 2, "cool": 1, "text": "pretty decent place to play around.... i mean its kinda hard to find some good places in LA right?  theres always UCI's gym or go to Inland Empire to find plenty more.Small Warehouse place but fits the formations inside.  So I saw an schedule, and this place has yoga and other activities too.  Signing up for gym membership is pretty expensive but worth the fun sports addiction than the regular robot treadmill experience.  One whole day of rock climbing I think is like only $16! + $5 for equipment and shoes.  Of course, if you've never gone here before you definitely they to pay for the initial introduction course.... its crucial, its life or death man hahaAlso! You need a partner thats around the same weight as you perferably because they're going to your safety or you're going to be their safety.  Pretty scary because it requires alot of trust, so take the time to learn details.  Other than than its a pretty chill environment.  Hear it gets pretty crowded on weekday nights, so always give them a call.Location: Pretty tricky because its a warehouse looking place hidden inside.  Its around industrial/business area so just look for a section of blue mid-tall buildings and HAVE FUN!!! =)- remember to wear socks haha- this place is better for adults, don't bring your kids... its annoying, unless you're a super great parent then I'm assuming they are as disciplined obedient and respectful as you ;)", "date": "2/5/2010"}, {"review_id": "FylRI-F6-kU9zD2D7zlsZw", "user_id": "9eBr3R4ojLGQV5GtB1xpLA", "user_name": "Michael S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 12, "funny": 3, "cool": 1, "text": "I've been a member here for over a year and I've been a member at gyms in Boston & NJ so I've seen how other gyms do it and I've always respected their systems.Here is my perspective:It's a fun gym with a good vibe and fun routes & problems. That being said, over the last year the user experience has been on the decline.There is no education provided to new climbers. If you don't believe me, go up to someone who is wearing socks under their climbing shoes and ask them if they've been explained climbing rules or etiquette. The gym has become overcrowded with people who don't know the rules. Hangar18 does a Groupon every 3 months and their goal is to get as many people through that door as possible, which I totally understand. The problem is, they do little-nothing to explain the rules to the new clients or educate them about gym etiquette.  Newcomers are climbing everywhere and most don't even understand the concepts of following routes/problems, which is very important for the safety of others. If you're going to scale up your membership, scale up your staff to accommodate.Just yesterday I watched 5 newcomers coming off the rock uncontrolled, at least 4 times, nearly hitting 3 different experienced climbers who I know to be members for longer than me. The new guys didn't even seem to know or care they were putting others at risk.Kids' parties happen all day long on the weekends, which I also understand. And I also understand those kids can't be reasoned with. But the staff needs to take 15 minutes and explain to the ADULTS that these kids need to be supervised and not playing tag as climbers unpredictable fall to the ground around them. It's dangerous to the kids and the climbers. Recently, there have been injuries, prompting management to draw a cartoon stick figure on a dry erase board, depicting what can happen if people don't 'watch out' or spot each other. I would hope management takes a more serious approach than that.", "date": "7/13/2011"}, {"review_id": "Mg8pZ0afns1rStya8whNUw", "user_id": "KxVf5jFIA_1Yk0nnLMq6mA", "user_name": "Lily A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 0, "funny": 2, "cool": 1, "text": "Maybe I overthink it, but I usually find myself in mid-boulder climb thinking \"where the eff is the next hold?!\", look around wildly, arms get tired so I drop down, and lastly think \"I need to better plan my route.. AGAIN\". And this goes with pretty much most routes I try here. Maybe I'm spoiled by Rockreation. Maybe I just suck. Or maybe the people who create these routes suck more. The latter was the consensus my sister and I came to when she visited a couple weekends ago.What makes it confusing first of all is that the color of the tape AND the holds determines the route. This confused the hell out of me my first day when I'm wondering why the hell yellow taped routes were going in every which direction. And then the placement of some of them, well the designer must've had spider limbs. One route my sister was plastered against the wall: legs and arms stretched to capacity with her face pressed up against a hold right in her way (chalk face!) and trying to shimmy her weight to one side which took what felt like forever. The entire time I'm standing there thinking this ain't right!This place also seems overrun by kids and teenagers, maybe it's Groupon and it's overselling membership deal. I came one Friday early afternoon and I literally was the oldest one there.. don't you people have school?! No real workout equipment like the other climbing gyms I've been to and with a crappy run-down locker room.I'll be back unfortunately, darn you Groupon and your 2 month membership.. which I bought 2 of!", "date": "6/6/2012"}, {"review_id": "JtITMg3JfraHXMCRb9WRLg", "user_id": "3XTxAFHA2Tvpx9i6JNtMPg", "user_name": "Nick I.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "LOVE this place! I got a Groupon deal as a gift which you can find easily for Hangar 2 month passes for like $60 which is great! It is somewhat busy of a location but cant blame em. For beginners there arent many paths to climb, maybe two with the assisted pullys, but once you get the hang of it the bouldering, scalling, and free climbing is the best. By the time I was getting near the end of my month pass i had gotten really good! Now im a rock climbing addict and fan and need another pass ASAP.  Shoe rental comes with membership and chalk (useful) is sold there.", "date": "4/2/2013"}, {"review_id": "nGHWh5e2dNvgFNCd_Hj45A", "user_id": "-24Lje2-UIpDhjUEqvkx9A", "user_name": "Debbie C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 5, "funny": 0, "cool": 3, "text": "I've been to this gym several times when it used to be Beach City Rocks.  I came here a few weeks ago for a friend's birthday.  I was excited to go experience the \"new\" Hanger 18 gym, but was somewhat disappointed when I got there and realized that it really didn't change much.  I only had higher expectations because all of the other Hanger 18 gyms (especially the Riverside one) have new, clean holds and well marked climbing problems.  I remember BCR as a gym with very confusing markings and that standard did not really change even when it got converted into a Hanger 18.  On a positive note, the staff at the front desk was very friendly and that always makes a great first impression.  I do not like rope climbing so I can't say much about the party staff, but they seemed knowledgable and helpful.  I stuck with my beloved bouldering and like the fact that they do have problems that allow manteling which does somewhat mimic the outdoors.  All in all, a good day in the climbing gym!  I haven't climbed for many months prior to this, but I still have a lot of climber in me :)", "date": "7/15/2011"}, {"review_id": "uGYTOFiUnlhpDc5bu99sMg", "user_id": "RM82ZQ0SsZL3hrbhmEbk5Q", "user_name": "Harry T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "VERDICT: cost effective local rock gym where the easy routes are hard and the hard climbs are easy; i don't get it either.QUALIFIER: well, the influx of new membership brought on by groupon discounts just feeds the crowds of local occasional wannabe climbers. watch out for those sprawling afterschool day care kids; they get in the way running around in circles. there's less open space than rockreation in LA.SERVICE: no water fountain!?!", "date": "10/6/2011"}, {"review_id": "1zo8Y14wSdjWaNNsDWcmJg", "user_id": "ILvXe0EWKAH45eyUUxlv0g", "user_name": "Emily S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 13, "funny": 10, "cool": 8, "text": "I walked in to Hangar 18 over the weekend with some of my friends thinking rocking climbing would be fun.  I walked out with my tail tucked in between my legs.  Hangar 18 kicked my butt.  When you first go in, you do notice the smell.  But after you've been there for a while you get used to it and don't even notice it.  The rock climbing shoes you get here remind me of the kinds you get at the bowling alley, or the ice skating rink.  Used by millions.  Germy.  But, Hangar 18 does a great job at spraying it to make it smell better.  And the shoes are pretty new.Rock Climbing was fun.  It's actually more fun when you go with someone, instead of going by yourself.  I was even able to belay my friends down the rock wall.  Is that what it's called?  If you go by yourself, there is an auto-belayer.  Or you can just try going up the boulders.How was the rock climbing?  Hard!  And it didn't help that we had to go so high up on the wall. There were many thoughts that would go through my head while I was climbing up.   Things like... 1) So this is what being Spiderman feels like.  2) What happens if I fall?  3) Wow this is very high. And, most reoccurring thought: 4) Oh shit I'm gonna die!!!!! The next couple of days after my forearms were OUT.  They were dead to the world.  You don't realize how much you're using it when you're hanging on for dear life.   Don't worry, you won't fall to your death.  It just feels that way.If you go, I would recommend you bring some chalk because your hands WILL get sweaty... and you don't want to be grabbing onto rocks with sweaty palms.Parking: they have a pretty big parking lot in what looks like an industrial area.", "date": "3/1/2011"}, {"review_id": "VF7wuPfB2-Y98oEaDfpCcQ", "user_id": "UeXMivnFgAPYJUV3UAvoVQ", "user_name": "Nova P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I liked climbing here, I got the groupon - $30 for unlimited climbing for 2. I'd recommend going earlier in the day as the gym fills up around 5pm.", "date": "2/2/2014"}, {"review_id": "i-FkAiwO7DdoAntxsomtIg", "user_id": "OwHwC-0ejI39lYwkg_fn1A", "user_name": "Dustin S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 4, "text": "So far it's the nicest and coolest gym I've ever been to. Mind you that I've only been climbing since March, 2011. It's got a lot of bouldering and top roping. There is a wide range of difficulty as far as the routes go. It's a nice place that usually doesn't smell funky and they also play some music. The people there both that go there to climb and the staff are all friendly and great people. I came here once in late december of 2010 and I was instantly hooked. I immediately bought a groupon for a year and try to go as often as work and life permits.", "date": "8/1/2011"}, {"review_id": "y4D99QlCacPzsODTf6B4BA", "user_id": "8VTKksu7G7AIWlDowh2z2w", "user_name": "Rob T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing here for years. This address and location 4926 Rosecrans was one of the first indoor rock gyms in Los Angeles. Built in 1996, the walls are older and the cement / stucco layer to cover the wood is decent  enough for some smearing if you want to waste good shoes indoors. As you walk in the front door you are immediately faced with the lead climbing cave. Before you can see the remaining lead / top rope walls on the south side of the building you have the two main boulders. On the north side of the building you have more top rope walls. Hangar has 4 True Blue Auto Belays installed for most of the year.If climbing doesn't kill you, the legal work will.Before you can walk deeper into the gym you must sign, or have a legal liability waiver signed for you if you are under the age of 18. If you have a computer, fill it out on the website before you even show up, saves you about 30 minutes. If you don't do the waivers online before you get there you must sign one off the iPad they have set up to use. After the waiver is finished, a quick explanation of indoor climbing is force fed to you either before or after you fill out an \"Orientation Process.\" The things they explain to you are literally written on this second form you must complete. After those are signed all you will need to do is show up wearing clothes, because they have everything else you will need. They will help you size your shoes or harness pretty quick. Did the legal work kill you? Did you read anything?After you hopefully understand what you are about to do, you are asked:\"What would you like to do?\"Membership is on a month to month cycle and you can cancel at anytime. Check their website for a discount, the normal membership is around $50 a month. If you are just visiting for the day it's just $16 admission. Hangar 18 is a chain, so you have your choice of different walls to climb if you want to drive in Southern California traffic for climbing gyms.Maybe you can handle climbing in and around some of the birthday parties / boy scout events they offer. The weekends can be decent if you know what boulder problem you want to fall off of again, or already have your friends to climb with. The staff usually is in survival mode again dealing with these parties or individual Group-On users. But these tend to be on the weekends, and so do you! Good luck. At a certain point the size of a group will just make the gym a very loud room to be in. They can to deal with some bigger group parties from time to time, so for a quiet date maybe ask if there is a boy scout party or something planned at the same time. Avoid those! If you have a day off, and go Mon-Fri anytime before 2pm you have a climbing gym almost to yourself. After work and school the members will mostly come in when the climbing team shows up to practice. Around 5 you will start to see some stronger kids who climb very well when they only weigh about 60 pounds. The team is great and the people are really friendly.The gym is nearby where I live, and if the traffic starts to move it can be a 15 minute drive from the beach down Rosecrans. Surfs up!", "date": "10/22/2014"}, {"review_id": "SSMqg8o2L0u4p7jiZCm9Xg", "user_id": "YyY4jtcPbDHlPj9cm8nnXg", "user_name": "Ariel A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Though I may be a little biased, I love coming to this gym. Anyone that is there to CLIMB instead of SOCIALIZE will find that the facility is exactly what one would need (minus a few minor details here and there as with any other business).Bouldering routes are supposed to be really technical and challenging so when I see reviews on how you have too difficult of a time completing one, it isn't the route, it's your technical skills. Hangar 18 has a staff that REALLY knows how to climb and climb well so of course they're going to challenge you to do your best.As far as the customer service goes, I can agree with the majority when they say that some of the men that work there (one in particular) are extremely short and lack enthusiasm when dealing with customers. But I understand their lack of energy when you see them having to deal with 60 kids at a time trying to teach them how to climb.", "date": "8/15/2012"}, {"review_id": "nlzNvVzqRKxHNw5AjVIxtw", "user_id": "KfDv1srllxnbZ7fF-C52sw", "user_name": "Jason B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 9, "funny": 2, "cool": 2, "text": "Really LA? Really? I came here after reading several reviews that this was one of the best places to rock climb in SoCal. I'm from the North Bay (i.e. San Francisco) and I have to say, we got it WAYYYYY better up north.Hangar 18 is a tiny little rock gym. It is overpriced and fairly dirty. All the mats are worn down, and there isn't much place for them either as everything is very cramped and butted up against each other. In fact, some of the mats were literally torn open and their filling was just all over the place. There isn't a lot of space to walk around without the possibility of someone dropping on top of you. There isn't a lot of seating or cubbies to store your stuff. None of the paths seemed fully finished or properly labeled. I'd read the tape saying to follow yellow rocks with white tape... but there were no yellow rocks with white tape. There didn't seem to be any finish zones either, sometimes the rocks just stopped halfway up with no clear sense of direction. Am I done? Do I dyna up on half these problems? Do i just make my own path?I only went bouldering since I was just myself, but there was some belay action going on, however it didn't look that exciting. Walls were maybe 2 or 3 stories at best? The places I used to go were at least twice as tall as here, and more varied. The bouldering and the belay walls were kept in separate areas where I used to frequent unlike here. Like I said earlier, very cramped, you could probably jump from the bouldering area to the wall if you wanted.The staff was friendly, though I really couldn't tell who was staff and who were just enthusiastic regulars. Maybe I've just been spoiled by the likes of Planet Granite in Sunnyvale and San Francisco, which feel easily 5x larger. But even still, I'd expect more for less. This place needs a complete overhaul, maybe become strictly bouldering and revamp how they label their problems. Drop the day pass price by 5 bucks and maybe I'd consider coming back.If you get a deal, I could see it being okay for a quick fix. Do yourself a favor LA, check out the Planet Granite facilities if you ever travel north, and you will be blown away. Makes Hangar 18 look like a shack. Sorry for all the hate 18, but you just don't scream \"On Belay!\" to me.To those who aren't familar (as I saw these complaints in other reviews), being barefoot and shirtless in a rock climbing gym is very common. Try not to be intimidated by the many lean muscle people displaying their abs and arm muscles, just comes with the territory. There will always be a small hint of stink from sweat and feet, but if the gym takes care of itself, they should be cleaning their floors every night. Dunno if this place does... but certainly looked dirty.", "date": "12/7/2010"}, {"review_id": "LrQK6x8mfpOJyJpOAvt9Eg", "user_id": "eJLfwusbITpOU3CnCRSeng", "user_name": "Jenn Y.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "3.5 Stars...I've been rock climbing before and this was my first time here. For first timers, rock climbing is a fun and definitely challenging workout! It just takes as sec to get going as you fill out waivers, get shoes then sit through a lesson on how not to fall (can be lengthy but pay attention so you don't get hurt!)Can get very busy and cramped on weekends esp. with the GrouponA lot of people mentioned it smells but to me it's like being in a ice skating rink or a bowling alley. Stay away if it's that's not for you! =)The staff... This is an interesting one...the previous reviews hit the nail on the head. During your visit you might feel like you're bothering them or that they want to be ANYWHERE else other than here with you and even unenthusiastic but they kinda warm up and become a little less weird after that. Kinda...They have parties here for all ages! Sounds like funJust an fyi, if you're belaying for someone larger than you on the more difficult climbs, the white cylindrical thing on the floor (Wally Watermelon) is what you're supposed to attach yourself to on the harder climbs so you don't flying into the air if you're starting out  All in all, not for the faint of heart but if you are adventurous I definitely recommend a try and keep in mind the above points :)", "date": "6/12/2011"}, {"review_id": "Ns8sTJ9aTkecH9iZ8JvQSA", "user_id": "yzlNFvzx7x0a81Jm8EICag", "user_name": "Joyce T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "I have a membership here and this is my main climbing gym. My friends and I have been here for me half a year, and for them much longer. For a climbing gym, it really should be unacceptable for the setting to change only once or twice a year. I have had memberships at other gyms in other parts of the country, and nowhere else have the cycling of new climbs been nearly so deplorable. You should be making new sets on any of the walls, at least one of the walls, at least once a month. The stronger climbers regularly complain of how bored and uninspired they are when the same climbs have gone unchanged for so long. How do you not have a water fountain at a gym? The owners need to focus more on maintaining this gym and less on collecting new ones.", "date": "3/5/2013"}, {"review_id": "DmiUBRg41nfEu5vUkSzumA", "user_id": "sYJ8tjrzjW6pqrWaxdJtWw", "user_name": "M M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "My rating is is based on the initial customer service of one of the workers there. Not only is it emphasized that it's dangerous, but the short Asian dude gave zero f**ks about really helping you through the knot tying or harness portion. I don't know if it's a scare tactic or just lack of enthusiasm for his job. I would have appreciated a warmer greeting to this activity as it was my first time. It made it less appealing to try again. Or at least at this location. Maybe if I was the cute blonde he kept wandering to and giggling with when I was practicing, I would have felt better about climbing safely. I was scared to death! The instructor once at the wall was more understanding of a new person, so I give a three rating. The first guy deserves a 0. I only make specific comments on who is n case they ever actually check these and can use it for training purposes. If you want better numbers as far as new business the first impression is key. That guy was terrible and had my date not already paid I would have walked out immediately. No one has time for bs when trying to be active.", "date": "12/13/2016"}, {"review_id": "6CW7LiOD4B5P99Lq0ONgyA", "user_id": "8q7ceN8jbrDEIq3eE-NTEA", "user_name": "Mimi L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 10, "funny": 7, "cool": 11, "text": "I came here for the first time for a friend's birthday and loved it. . This place was great and so was the staff. The instructors were really friendly and gave great directions. There were times where I was stuck and didn't know what direction to go and the instructor screamed out, \"step on the blue one on your bottom left!\" I listened and reached the top.  Lots of fun but the place does get crowded and the walls are filled with climbers. I definitely have to go back for more climbing action.", "date": "9/23/2012"}, {"review_id": "J2L3W4t6Ou_tBfUzd7Hhcg", "user_id": "OOKFKB_HRRzmomMPpD_Uww", "user_name": "David P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I love this place.  I'm addicted to the four autobelays!  I've been climbing for 9 years and have a plethora of climbing partners, but I can't get around how easy it is to pop in for quick runs up and down routes on the autobelays.  Love it.  Plus the routes are fun and the staff is friendly.", "date": "12/7/2013"}, {"review_id": "zbfT_gvKoCmufjs1COUIOA", "user_id": "BGI9sh0604_kDjWMQcgyBw", "user_name": "Luisa J.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 3, "funny": 2, "cool": 0, "text": "couldn't get passed the smell of shoes AND feet! the places are small and overall not a good value for your dollar. The employees look bored and were NOT the slightest bit helpful. Was not impressed at all and probably won't go back.", "date": "1/2/2013"}, {"review_id": "mGz63ZRfjzdDsvO-TMrbfg", "user_id": "e--JMZEydolLYMCY5NdqBg", "user_name": "Sylvia G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I've been climbing here regularly and I love it!Everyone working has actually been really friendly and helpful as are the other climbers who climb here. It can get pretty crowded on weeknights and if there's parties on the weekends but it's never been unbearably crowded for me. Sometimes they run out of shoe sizes when it's busy so if you climb regularly I recommend you get your own shoes!I usually go here to boulder and I'm still pretty new so it will take me a long time to get through all the paths. There are tons of routes for all levels so it keeps it exciting. I know that some routes have had some holds removed to make way for new routes and they have become really awkward because they haven't taken the other holds off and stuff like that so you just have to use your best judgement on what routes are good to take and which ones are just left there just because. I haven't really noticed a super gross smell - it just smells like a rock gym.", "date": "5/3/2011"}, {"review_id": "Eo8X49YoKnLoilarxkJDug", "user_id": "0RSxGspU0yorisywO_Sqdg", "user_name": "Thalita P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "All my fiancée and I wanted was some good afternoon fun when we got to Hangar 18. We both know nothing about rock climbing but we do know about customer service and cleanliness. Rude employees alone was enough for me to safely say I'm never going back. Try to be a bit more excited about your jobs fellas, after all you chose it.", "date": "4/15/2013"}, {"review_id": "qTz6s9LHQMx1y_xsHsYTHg", "user_id": "Dp_lahTz91rl157gZVr7Jg", "user_name": "Robert G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 1, "funny": 1, "cool": 1, "text": "My girlfriend and I have had two bad experiences of the four times we have been here... We are originally from Mission Viejo and LOVE that gym. This gym is quick to point out when you are doing something wrong!! The first time we came here we practically begged this curly haired teen in the front to show us how to belay, but he was busy helping four young girls and never came to help us. The second time we came a nice African American kid showed us how to belay. Then the third time we came a douche white guy (maybe a supervisor) embarrassed my girl and I by yelling out that we were doing it wrong. He just passed us on to another guy by telling us to wait for him to teach us! Even though we were taught how to do it already! He tried to play it off as if though he was concerned but had a horrible douche attitude! I am going to try the long beach gym instead of this one even though it is close to my work!! Treat your members better douche!! I am fed up with this gym!!", "date": "4/27/2015"}, {"review_id": "S_X4llv8nO-oCoO4diL4gg", "user_id": "pCRxXCvnG1WtU7AW5Kd4tQ", "user_name": "Claudia H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love Hangar 18, from the get go I loved the vibes and staff. I love that they give you a monthly free guest pass and offer them shoes and belaying lessons. Favorite rock climbing gym :)", "date": "8/16/2013"}, {"review_id": "v0II2lqBOE2TUidSxV5d6Q", "user_id": "yRXNIUBXcAgTJu3QLnMNFg", "user_name": "AgentxAngel X.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 0, "funny": 3, "cool": 0, "text": "the routes for bordering are way too hard. and why are all the walls for bouldering slanted anyway?", "date": "6/15/2015"}, {"review_id": "stQvMdrlEzOt1nVtPac4yQ", "user_id": "1BuQV4vMW3ZI3ukZUIAGyg", "user_name": "ruby w.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 3, "cool": 2, "text": "It was a fun experience. The lesson they gave was informative and very helpful since this was our first time. Sensing that we were slow to catch on, our instructor kept one eye on us just to make sure we got the moves down.By the end of the day I was able to climb and hit the top of 3 different set of walls and even braved the free-fall wall.It was a fun experience, but this place does have some kinks in it that may bother some people. 1) The staff seems relatively young and they do not seem to know how to manage the floor. Kids run around  and they leave it to the the parents. Feels like an unkempt playground.2) It also smells like sweat in there.3) Shirtless people showing off their muscles from all the rock climbing.", "date": "11/1/2010"}, {"review_id": "apbKfdjovaM8WHqL_YZ25g", "user_id": "QVHwuhXNmUWDLpr-z65syA", "user_name": "Troy S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a relative noob to rock climbing, so take this review with a grain of salt.Hangar 18 is a great alternative to the usual gym experience. The douchey gym rats and meat heads don't exist here. While there are definitely some people here with great physiques, everyone's willing to help you solve a problem with a climb. H-18 has two big bouldering walls, with the perimeter walls set for rope climbs, which double as great traversing climbs. The membership dues are about the same as a typical gym, the staff is really helpful (but you have to ask for it), and there are plenty of challenges for both the noob and the experienced climber. The gym can get kinda busy at times, just like any gym, so if you hate crowds it's best to go during off-peak hours. H-18 doesn't get five stars from me for a couple reasons: 1) Other than a pull-up bar/leg raise machine and a few weights, there isn't any other gym equipment, not even cardio machines. 2) Unlike some other rock gyms, this one doesn't offer classes for yoga/pilates, etc. (though the location in Riverside does offers these classes). 3) last, but not least, they don't have a water fountain! You'd think an establishment designed to make people exert energy, and thus, be thirsty would have a drinking fountain. Nope. Instead they sell cold bottled water for a couple bucks. Nobody's perfect, I guess.Nonetheless, I'm almost certain I'm going to cancel my 24-hour membership and come here instead. Not only will it be cheaper, but also more fun. :)", "date": "11/30/2011"}, {"review_id": "DSKrWciSaSbGWw5uEBI36g", "user_id": "NdHGV2JmZmhYG1tSCRwrBg", "user_name": "Casey C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Went a few weeks back... had lots of fun. Got the starter pkg which included all day pass, gear, and intro class. The instructor was chill... informative... not esp. enthusiastic but we were safe... the class was quick and clear, and we were soon on our way belaying and climbing. The place itself is a little dingy but not bad. The equipment was solid and seemed all in good condition. The staff really chill... at some times ambivalent, but still nice and there when you need them.This was my first time climbing anywhere...but from what i could tell, the few intro climbs I did were ok. There was one climb (when trying to follow the colors) that seemed a bit awkwardly placed... maybe due to my in experience?... but seriously you want me to reach where? when my feet are where?! hehe... Over all I had a great first time experience!", "date": "12/16/2010"}, {"review_id": "VIdjZBWfTwDM-g8L7PtKCA", "user_id": "iRZZCG8WD1Bf0Wbydd6IeA", "user_name": "Jody S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Came here to use an expiring all-inclusive Groupon deal. The lesson was good enough to cover the basics, however none of the call commands were reviewed. I remember these from ice climbing a while back and rock climbing a long time ago..so thought this should be covered especially for newbies.  Luckily for us, we had a friend join us who explained things in more detail which made for a more enjoyable time. Lots of options for climbing, however it was a bit of a surprise to have some guy swing across the rock accidentally getting pretty close to our lesson.  I'm almost wondering if there's not enough space in between people? Or people being more wreckless than I remember?  Most people while I was there took advantage of the bouldering vs. the 2 person rock climbing with rope or the auto belay. Good since more for me for the regular rock climbing. =)   Also...they sell $4 ball of chalk for those who need it...sweaty palms...I definitely could've used it.  Wouldn't mind coming back but best to bring your own equipment.", "date": "9/5/2011"}, {"review_id": "MTDUTGAa8HEJEfFe0BeZYQ", "user_id": "S6SvF-lP1Gdt1jeHpgsrEg", "user_name": "Paula L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "My rock climbing dreams all started with Ace Ventura. That's right....the Ace man.http://youtu.be/63giSgV9Me0Oh yeah. My dream of learning how to rock climb so I wouldn't drop my side kick raccoon was about to come reality...but it turns out Hangar 18 was not the place to fulfill those dreams.Coming here and meeting my instructor was an absolute buzz kill. I've seen happier Wal-Mart employees.Despite that...he did teach me the basics and drilled into my head that if I did something wrong me or my partner could fall and die. Awesome!I have not been to other rock climbing facilities..but this place seemed kind of....aging to me.It would have been nice if they splurged for padded harnesses cause those REALLY hurt!(esp for the fellas).I did notice a musty smell that some reviews have mentioned...but you get used to it and its not that bad.I do agree with some of the reviews that there is not enough staff members here and they kind of let everyone do their own thing so its a little disorganized.I suggest not coming here for your first time...but if you are already well versed in the rock climbing ways then this place might be good for you.", "date": "7/24/2011"}, {"review_id": "Bhibh9UUpu-XPF16EkpcfA", "user_id": "3iocNPlPThAG2ZaNtUo4TQ", "user_name": "John S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 7, "cool": 2, "text": "I bought a Groupon 2 for 1 pass a couple of months ago, and before it expired, I figured it'd be a good experience for my wife to get out and try something different.The gym is well equipped, and the instructor made sure to teach us all the fundamentals of the equipment and technique.  I've tried indoor rock climbing a number of times, so despite being woefully out of shape, I was still able to get up the wall in a respectable amount of time.  I appreciated that they had a variety of walls, even one that was angled at a 50 degree incline for beginners.My wife, who has amazing lower body strength but a surprising lack of upper body strength and a fear of heights was not very enthusiastic at first, but she did a great job on the flatter walls.  We both tried the free climb walls (with protective pads to catch our fall) which were also a nice change of pace.The one thing that I disliked about the gym was the incredibly lackadaisacal attitude the staff had towards the crazy, screaming group of kids celebrating a birthday party.  I couldn't believe how loud and obnoxious some of these kids were:  running around everywhere, wrestling on the mats, shaking ropes and screaming.If I were a personal injury lawyer, I would've been salivating at all the flagrant violations of safety codes the staff was allowing.  Although to be honest, I can't blame the staff completely, as the parents should have started pimp slapping these punk ass kids (I was sorely tempted to do so myself).  Nevertheless, it still took away from the otherwise overwhelmingly positive experience.  Though I should say that not all of the kids were terrors:  one five year old girl was absolutely fearless in scaling the 30 foot wall that a previously rowdy 10 year old boy before her punked out on.  My wife and I stuck around for her descent to give her a round of applause...  I also made sure to make eye contact with the cowardly boy and gave him a scoff that will serve as a slight to his burgeoning manhood for the rest of his formative years.  SCOFF!!!!", "date": "6/14/2010"}, {"review_id": "WiPnAz338Izc57LchvqgKg", "user_id": "2l4nTDAmUHPvkoZNIl2Faw", "user_name": "Lisa M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 2, "text": "LOVE this gym! I'm here often, and it's a great place for me to get my upper-body workout. Unlike some other reviewers, I really don't think this place smells bad at all, but I've probably just gotten used to it. Yes, the place is over-crowded and under-staffed and I was kind of disappointed to see multiple blasts of Groupons go out for this place. I try to go off-hours so I can get some time on the walls. I bring my own gri-gri (yes, I know this isn't an option for everyone) so that makes things easier, too. Just took a great lead class with Andre, who's super helpful and knowledgeable. Looking forward to going back this week...", "date": "5/1/2011"}, {"review_id": "WIiJ1NHt0tpQd0oRfA6sxQ", "user_id": "LK6I0Qlat3_SGk8kLRUsOg", "user_name": "William C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the best rock climbing gym in So Cal. Hangar 18 has everything to offer. There are two boulder caves, auto belay stations, top roping, campus board, and lead climbing. I often climb by myself, so I really appreciate the auto-bely stations. The staff is kick-back, safe, and friendly. The restrooms are well maintained and cleaned regualrly.", "date": "9/29/2013"}, {"review_id": "U6t7rASOGBmpQtS-MT7hFA", "user_id": "57qfUVoU8cJaGSgVH0Z53Q", "user_name": "Peter D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Buddy took me rock climbing here with a guest pass. I thought, sure no problem, but man, it's a workout. They have different levels; some of the people here are amazing. Lots of coordination and dexterity involved. Overall, friendly cool folks that are willing to help you out. Could use a little more circulation though and the locker rooms aren't that big.", "date": "12/30/2012"}, {"review_id": "v1wTd2UTyVQHUjLTmUm3vg", "user_id": "0l1WBKZN_NGwYjQ7BXroeg", "user_name": "Fritz D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 8, "funny": 6, "cool": 3, "text": "i didn't go.  i'm writing this review because of my disappointment with the (lack of) customer service at the hawthorne location.  i was considering purchasing the groupon but changed my mind.  here's the wording on the groupon:   \"For $30, you get a rock-climbing     package for two (a $60 value)      that includes the following items:      * Two 60-minute belaying lessons      * Two full days of climbing after the lessons      * Rental equipment for two\"so i called to ask whether the two days of climbing had to be consecutive to each other.  the guy on the phone said you only get to climb on the same day of your lesson.  i told him the groupon said you get two days of climbing, and he told me that i get to use one \"day\" and the other person uses the other \"day,\" but it all happens in one day.  i started to ask him a question about bringing my daughter, and he cut me off and told me they were really lessons for adults and not children.  when i told him the kid was 11, meeting the minimum age requirement, he said, \"yeah, i guess you could go ahead and bring her.  that's fine.\"sorry to inconvenience you, rude guy.no wonder you have all these reviews about the not-so-friendly service.  this business's only saving grace must be that rock climbing is a fun activity in itself.", "date": "1/19/2012"}, {"review_id": "FckfVHsUB100NK2XH--FqQ", "user_id": "TFGihNNLxqF3hMSAChA2ig", "user_name": "Asa N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "My first time bouldering and balaying. The worker was super nice and helpful. But the place was a bit crowded and there was only one worker. Overall, the activity was fun. A lot of muscle work. Note: DO NOT BUY THE GROUPON - I got the $30 groupon for two classes and later found that the regular student membership is $28 per month unlimited with all the gear and instructions included. Told this difference to the worker and he didnt have a helpful response. Just stayed kind of quiet -_-", "date": "8/30/2014"}, {"review_id": "yAskQ7EN00EtCyNIfa3H7A", "user_id": "-gTz-C55z7gObvo-R5zzZg", "user_name": "Stacey C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "I enjoy doing adventurous & fun things like Rock Climbing so I jumped at the chance to go with my friends.  Good times!  Forgot how hard it was to hang on to the advance level walls.  My arms were shaking!!!The place is not very clean or organized that's why only 3 stars... otherwise great service and good training fun!  Great workout!", "date": "8/24/2010"}, {"review_id": "80E3kJC-ufkqlXEfX6pFNw", "user_id": "dxzsXI1qPZujyl_nMpoAhQ", "user_name": "Tea L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Interesting biz. First timer. i need to work on upper body strength. Definitely not a 1st or 3rd date thing. better with familiar friends.", "date": "7/3/2013"}, {"review_id": "N07I-Iek01E6yWqHooxbFw", "user_id": "M_bqJAEzuka7ZD8Hp7L4GQ", "user_name": "Kelsey T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Hanger is a dirtbag's paradise. The number one thing about Hanger is the community. It's the best group of people you will ever meet, and it's inexpensive to boot. There's a reason that a dinky gym is still doing well in Los Angeles when so many gyms are popping up and competing. It's because this gym has fun people, the chillest culture, and the best vibe. If you want to make friends and find a community, go to Hanger. Having moved away, I haven't found anything like it!", "date": "7/28/2014"}, {"review_id": "WTwiyGUaOpAJuMaNtZKsmQ", "user_id": "TiD1JrLX-LiCdQabMwj4Fg", "user_name": "Donna S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "my friend had a groupon so i tagged along...i would think the rating would be higher if not for that reason...find out why below:preparation//don't go when people have groupons! everyone tries to maximize and the place ends up being overcrowded =/FYI, if you're renting, you will need to leave car keys as a deposit for the gearlessons//***half our group were seasoned wall monkeys....i mean athletes and the other half were n00bs that needed lessonsthe lessons themselves were easy and great, if only there weren't SO MANY PEOPLE that day...the instructor kept running off to give multiple lessons...so what would normally take 20-25 mins ended up taking almost 1 hour to learnfacilities//****the walls are color-coded and easy to understand...there is a wide range in difficulty so there should be fun for alli also like the set up in the middle where the tired people can just hang out up top and watch their friends continue climbing below all around the room~*~it's a fun experience and very easy for the first-timer!", "date": "5/21/2012"}, {"review_id": "9UhPifdIzwbsRl507gNURg", "user_id": "IhiEhti4McxM8Mm7wS85dA", "user_name": "Timmy G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 2, "funny": 3, "cool": 0, "text": "Just my favorite place ever! I try to get here a couple of times a week to stay in solid outdoor form. Watch out Bear Grylls I have got your number!Hangar 18 has tons of top rope climbs and lead climbs for all skill levels rated from 5.3 to 5.14 and bouldering from VB to V14. They also offer belay training, shoe and harness rentals. Make sure to ask for Andre when you get there. He is always happy to assist and will make you want to come back time and time again.Hope you check it out and maybe I'll see you there.", "date": "2/18/2010"}, {"review_id": "zn62UKoFHWZd3hBjZ--7xw", "user_id": "yauSuFScxL-fSsimkoN76Q", "user_name": "Kristen Q.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "$16 for an entire day. $2 for the harness to strap into. Love that thing which makes me feel safe while climbing these high walls. Good activity on a day when you have nothing else to do! I make that statement since I'm not a huge fan of rock climbing but I'd go with a friend, every so often.", "date": "1/12/2013"}, {"review_id": "y21Aq7bjnubfA4e_BUkQYQ", "user_id": "Dd1dgVrK-v4J8vDkKFja1g", "user_name": "Kevin L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I was reasonably impressed with the facility. Lots of climbs with the skill levels clearly marked. The staff is pretty well trained and the equipment is very well maintained. I'm glad they use the Grigri as the only belay device here. It almost idiot proofs the experience for new climbers. It's worth checking out. Bring your own beverages... unless you like the taste of gatorade.", "date": "1/15/2013"}, {"review_id": "UIAe8Yeso_8bnhNHjyIHsg", "user_id": "i2f3sCoc9DHWKeiKhWMapQ", "user_name": "P N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I got myself and my friend E. a pass through groupon - 2 one month memberships for the price of one. I've done plenty of real-life bouldering, but I've never learned to belay and all that, so I figured I should try.The first few times we went we just went bouldering, which is of course really fun. I understand that for more experienced rock-climbers this is not the most challenging gym - but it's a great place to go work out, get some practice in, go with a friend or significant other, etc. Our belay lesson was taught by an exceptionally laconic fellow who warmed up to us after about 30 minutes (before that we got the sense we were bothering him). However, it was a very busy night at the gym, so I can totally understand. Other than that, everyone has been very friendly, and there are some times when it is completely uncrowded (early mornings, mid-day in the week). I recommend it as a decent gym, with friendly folk - the equipment is in good shape, though the floors are a bit in need of repair (but not so much that you feel in danger).", "date": "2/3/2011"}, {"review_id": "hc_SeNy_1ecbNJDhetov3g", "user_id": "dUjt0FYFholFyqCgs4bvaA", "user_name": "Ben D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Took a belay course and bought a day pass, along with rentals for shoes, harness and belay device at the Long Beach location.  This place was clean, but there was only one person working and it took awhile for us to get any desk service.  When we did, he gave us a quick lesson and we were on our own for the rest of the day, which was fine.No chalk provided, so bring your own.  The routes are pretty good, but they don't go up very high -- maybe 30ft?  There's a wide range of difficulties from 5.5 to 5.13.  I stuck to the 5.7-5.9 range and had a good time.  There's a nice wall with some mock-natural holds too.All in all, satisfied -- I will likely get a membership to this gym as there are 4 locations and the Long Beach one is closest to my school.  Enjoy!", "date": "2/17/2013"}, {"review_id": "Vabwy2jQ4DpEVl5T_ONzlA", "user_id": "pTSoFmC2qqF96OLd4x7zYg", "user_name": "Matt I.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place. I went there with my gf for the 1st time. The staff was very friendly and helpful. I like the layout and variety of the walls. Over all great experience.", "date": "4/11/2013"}, {"review_id": "uPR0TpcW6QVceszgJ2Cekg", "user_id": "UB79qeoVJ-3zHhRhvPFCPQ", "user_name": "Emily T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "This is definitely the best rock gym in the South Bay.  A membership isn't terribly expensive (about $30 a month, depending).  If top roping is your thing, you will run out of climbs in a couple of hours.  However considering how short the wall is, they come up with some interesting climbs.  They have a fantastic slab and I wish they set some routes with balance problems instead of designating it the kiddie wall.  In recent months they've done a better job at resetting the routes more frequently.  This gym is best for bouldering.  There are a lot of very, very challenges problems.  However if you are not endowed with fantastic upper body strength you will find it very difficult to climb above a V0.Andre is one cool guy; be sure to chat him up if you come here.  I also happen to like Danny as he is always willing to give hints on bouldering problems.Children can be a problem here.  If they happen to be well-behaved, it's not an issue.  But when it is a particularly rambunctious group, it can be downright dangerous.  I was bouldering once and a kid flopped down on the crash pad beneath me.  If I wasn't keeping an eye out, I definitely could have fallen on top of  him.", "date": "1/31/2010"}, {"review_id": "bUviQVW66YWHrwUCCdLJvA", "user_id": "k0oMSwj9VR-GMjwwkLQhWA", "user_name": "fran d.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 7, "funny": 3, "cool": 5, "text": "my buddy linda n. had a groupon to this place and invited me to try it out with her. having never tried rock climbing this was an eye opening experience.we seemed to have arrived at the right time. we were helped out right away by one of the staff members who proceeded to educate us on the basics of climbing which are quite intricate. but despite the intricacies of rope handling and safety linda and i felt comfortable enough to try it out and try it out we did!the staff member was right there with us for most of the time until we got the hang of it. however, one tip for beginners: you're probably not going to last very long as your hands and arms start feeling like jelly and your body becomes exhausted after a few tries. not to mention there is only so much climbing you can do over a wall. so it does become a little monotone and you realize this is more like a gym than a recreational activity-it helps build up your skills and body but the real adventure is out there in the mountains.with that being said however, i found the experience quite educational. being around that whole climber scene was interesting. seeing all these folks own the walls like monkeys up on trees was something else. the place is well run and organized and the gear seemed to be in condition. wish i had more time to be into this kind of stuff but alas i love the outdoors too much to be cooped up in a large warehouse for long hours.", "date": "7/13/2011"}, {"review_id": "n0aMQSjPKsd37NX9wJlC5g", "user_id": "sHwBXS0trP0CC_f5K_11VA", "user_name": "Tai F.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Bought the Groupon a while ago (as so many did) but last Sunday was the first day Ted and I had both had off in a long time. What better way to enjoy it than to rock climb the crap out of ourselves? I was a little nervous at first but Ted was super encouraging. The staff there was busy, but helpful, and we didn't feel like they left us hanging. I started on the beginners wall and it went swimmingly. Ted and I eventually worked our way to the expert wall. I made it all of a foot off of the ground but Ted was able to almost reach the top. There is a decent amount of variability here so I can see spending a few hours trying to master the walls. Ted and I are contemplating a membership. It was a great workout and we also got to spend time together. I would recommend that they use our membership money to fix the floors. It's pretty questionable. Still, a great time and we will for sure be back.", "date": "9/20/2010"}, {"review_id": "uQg308RiwYu3x1YkkqGFxQ", "user_id": "BMEmpeosi4LfwRlAMgtjbg", "user_name": "Stephanie S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 2, "funny": 2, "cool": 2, "text": "Bought a really great lesson deal on Groupon and had a total blast. My best friend came to town this weekend (YAY) and what better way to show her Los Angeles than to take her rock climbing ?! Exactly. Because that's what Los Angelenos do best. Drove out to Hanger 18 (still marked as Beach City Rocks on the plaza sign) and was a little skeptical at first. It seems like a lot of large warehouses and storage facilities and it is difficult to tell where the gym is, but just turn right into the plaza and drive to the straight back. Now, I have no basis for comparison, but I think our lesson went fairly well. It was a little intimidating at first, there are all these really fit half naked dudes doing free climbs and running up walls. Yes, I said half naked. That might be your incentive right there. But, Andre was very good about being friendly the entire time, teaching us the four point check, and making sure we were pretty well versed in the process. He had us attempt belay climbing which is SUPER fun because you get to have your friend's life in your hands....and then yours in theirs. Luckily, I trust Grace (my bff) with everything in the world. Andre (who speaks fluent French and is very interesting to talk to while you're taking slack away from your friend) taught us how to climb the wall, take slack, and lower the climber. We tried a couple different walls before my friend said it was time to go to the beach (she's from Austin, Texas...low beach accessibility there). The climb is a total rush. I can see why people get into this -- although you are relying on someone else as your sort of buffer, the climb is really all up to you and your endurance. Once you get past the heights thing (which is only somewhat scary) the ability to push yourself up and trust in your abilities is where the real adrenaline comes from. Grace often had to tell me to slow down because I was moving too fast for a little bit there. I just got super excited! I have no idea if I would be capable of doing this either long term or outdoors (where there aren't any pretty rock colors to tell you where you to go!), but I think I would definitely try this again. The price is right even if you don't have a groupon, and it's totally worth the experience.", "date": "9/6/2009"}, {"review_id": "Q25JQgxtHIbVe1sKuDLV4A", "user_id": "bAopnW-L3S82E_HQITSXeQ", "user_name": "Chris W.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Pro:Knowledgeable staffCubbies and lockersGender separate locker rooms w/ showersGood range of difficultiesDecent equipmentOpen lateCon:Smells like feet!!Crowded (many kids)Use carkeys as collateral", "date": "1/2/2012"}, {"review_id": "vr2czMibKWinjm6K6yNOyw", "user_id": "MGdj3ZadOe6JeM_ACHa5Jw", "user_name": "Phillban S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great place, I come here all the time but they keep playing the same ten 80s songs on loop every time I come here. Really weird.", "date": "5/30/2014"}, {"review_id": "6ky6kIRrhN7CY6vA0A6pbw", "user_id": "feUmba511zxVM-qDPP536Q", "user_name": "Diana H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I bought their groupon for a month trial and we went in last night to give it a try. I was pleasantly surprised! I have a slight fear of heights but after climbing the intro wall with a ton of huge grips and reaching the top, I gained the confidence to climb the harder walls. They give you a great class to teach you everything that you know to tie the knots and belay your partner. It's a great all around workout as well and I will definitely be going back and incorporating it in my workout.", "date": "8/14/2010"}, {"review_id": "dayUpe-d65x4dMx9oyS1Gg", "user_id": "hnHSIUy3M6WG4ZMYnejoBA", "user_name": "Audrey L.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "My brother and I climbed here yesterday and it was a pretty solid climbing gym. There are not as many top-roped routes as I would like but since we don't live here and would only climb here when visiting our parents, I'm sure we won't ever be bored on our biannual sojourns. The routes seemed a bit skewed towards routes favoring those with superior upper body strength; there were far more big hand holds/handles than good foot/toe holds on most routes, even going up to 5.10+. Most climbs we saw were 5.8-5.11, but I heard one member of staff ask another to put up some 5.5's for the kids there so I'm sure the staff would be happy to accommodate your level if the walls on any particular day were lacking variety in grade.The people who work here are incredibly nice and when we were there, several groups of kids were climbing and all were well behaved and supervised so I'd recommend this to anyone wishing to unload their brood for a morning or afternoon of agility and confidence building. I had to rent gear and could smell the shoes a mile away so definitely bring socks if you are renting and to anyone working there, you might want to invest in the spray they use at the bowling alley. There is one shower in the women's locker room, not sure about the men's, and it's BYO towel and toiletries.", "date": "8/4/2009"}, {"review_id": "1flxfk5669LvcEoaQl1sGw", "user_id": "jqGhmhgQeoJ3KaDMetA4Iw", "user_name": "Nora N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 1, "funny": 1, "cool": 0, "text": "I was here when visiting LA recently and I agree with many reviewers when they say the place is dirty. It is truly a filthy gym, and there is no need for that. The ones I go to in Toronto are not exactly uppercrust like Sender One, but they are at least clean! This place is also very small, and the top rope wall are rather low, with limited routes, and painted over holds so they are somewhat slippery. We were told that it is a gym without a lot of money, hence no grigris at every station and hence the crappy old painted holds for the top rope stations.. but how does a \"poor\" gym have so many locations? Poor gym or stingy owner(s)? I also find the grading slightly easier than the gyms I am used to (e.g. 5.9 feels like 5.8, 5.10c feels like 5.10a or b). Aside from the filth, the bouldering is probably the best feature here.. except for the small, thin, filthy crash pads that you have to move around as needed (kinda like outside.. and unlike my usual gyms where they have very thick, unmovable padding underneath the entire bouldering areas), and the fact that you cannot always see the colour of the holds because they are so covered in chalk and never seem to get cleaned.", "date": "9/3/2015"}, {"review_id": "mHtHGyB6IMKkOIKWFLm8sg", "user_id": "uktxV6KCNmED8-cH9SNxsA", "user_name": "Angela B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went here last week, my mom had bought my some tickets for xmas. $30 for all day pass, an instructor teaches you the correct ways climbing and using the harness. Pretty cool, good work out", "date": "6/10/2010"}, {"review_id": "OINI-qwRHPqmcix-MbnLtQ", "user_id": "gqGQyy3602cdE36wOm8zzg", "user_name": "Kevin T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "As good as it gets.  September 17  Birthday party for grown ups.  The 9 of us-not a one with climbing experience-had such a fantastic time.  Nathan and Julia were smart, helpful, funny, and full of help. By the end of the day, the most trepidation in our clan were going vertical.  It was awesome.  Thanks,Kevin Tiernan", "date": "9/26/2011"}, {"review_id": "CJ1I34ni7dzum8Wl4Zrnqw", "user_id": "PEZ9RRvUhp8E-d30v2MSLQ", "user_name": "T M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "Went here for free because my friend had a guest pass!  The instructor was very helpful.  I had never done rock climbing before so it was scary.  I have yet to try all of the walls, considering this was my first time and we came one hour before it closed.  Will go back in the future.", "date": "2/12/2012"}, {"review_id": "msJgNNp6y0Ivw5oERV2rhg", "user_id": "PczuDImgD2QHmriaasddkQ", "user_name": "Lea A.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A lot of fun, not too expensive, funny workers, challenging...but you do have to wait quite a bit for gear if you go on a weekend especially a cold, grey, wet one.", "date": "4/23/2012"}, {"review_id": "Fc8rkQ8uFxe7a99aM3bVyw", "user_id": "1gx0kxarxPlBFCJ9ZUK09Q", "user_name": "Austin M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went on a free night last week.  I fell in love with rock climbing and Hangar 18, which I hear is the best rock climbing gym in LA.  I don't have much experience with others, but the staff was very friendly and the walls had a good range of challenges.I can't wait to go back again and I'm giving serious thought to buying a membership!", "date": "5/23/2010"}, {"review_id": "gJFZLzYtMOni1zqJjovlIQ", "user_id": "veYx6H1fEr99NFfg_jdPqA", "user_name": "MsMichele P.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Bouncy mats on the floor, general instruction, tether yourself up and get to climbing. I had never rock climbed and found it challenging and fun- albeit more then scary when I had to let go and free fall once I reached the top. I ass planted more then a couple of times and have since decided that any excursion involving real rocks in the real outdoors would be a big no no for me. I like the ass bone too much. On the general instruction note: There was very little actual instruction given by the people who worked there (aside from showing you how to safely harness yourself 'in'). Thankfully there was a father and daughter team climbing next to us and he gave us step by step instruction on 'how to' come down from the top properly, which were beginner knobs and which were advanced, etc... Good to go with someone who knows what the heck they're doing so you can get schooled properly. Overall a fun experience, I would consider going back. Pearls of wisdom to the newbie: MAKE SURE to bring a pair of socks and a bottle of Lysol. Everyone shares shoes and they're F.u.N.k.Y.", "date": "9/16/2011"}, {"review_id": "xr1_P4sGrte4oySESu-_jA", "user_id": "Yf7X5l1uKqdM5ZMUshBbuA", "user_name": "Johnny B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This place was pretty fun. Lots of space to climb whether you are a beginner (like me) or advance. I came with a friend to try it out since I've been looking to get into rock climbing. Even with an appointment time we had to wait for about 30 minutes until they started showing us what to do as a beginner. Also they were low on rental carabiners. Not such a great thing if you offer a beginner's class at the same time. Granted it was a Saturday morning which I'd imagine is one of their busiest times. All in all I think it is a great place to go if you are more than a beginner with your own gear. I definitely think it is worth a visit if you're into the activity.", "date": "6/9/2010"}, {"review_id": "DDFnIMsUjCHVOE72y86TfQ", "user_id": "P0fx4ACC5Jo70vVDGJJIGA", "user_name": "Raymond Q.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Initially I checked out the pics on the website and the facility looked nice, which it is. We came to the gym to do the adult intro pkg. Upon arriving we were greeted by a smug cashier/ front desk person. After filling out the liability waiver, we were waiting to have everything else done. The smug cashier's friend/ girlfriend came by and brought the guy lunch, all his attention was focused on her. Needless to say, it was annoying and certainly lacking customer service. We didn't let it bother us. The trainer who gave us the mini lesson was lacking any personality and enthusiasm. It was the equivalent to a self service kiosk. I think I'd prefer that instead! At least my expectations would have been met. He also seemed somewhat lackadaisical of safety precautions, which to me should never be taken lightly. His instructions and lessons were fine, however, we certainly felt like a number though.After we finished, we returned everything and as I was waiting to pay, the cashier said thanks and bye. Well, for those who are looking to get a free package, you should go when the guy works the front. I think his name started with a D. My conscience wouldn't let me walk out of there without paying for a service which was rendered. The clerk who took Mr. D's place informed us we should have been asked to pay in the beginning. But somebody was thinking with the wrong head...All in all, nice facility, but poor customer service/ relations. For me, I'd gladly pay more for better service.", "date": "7/18/2011"}, {"review_id": "3ZcmmI19DtjcZ9cvWFqHKQ", "user_id": "b-PxzATc-zHraZ6YHYWASw", "user_name": "Joe I.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going to Hangar 18 now for almost a year and love bouldering and climbing here. The music's always really good too!", "date": "3/18/2012"}, {"review_id": "cRz7fUZvFB7TW2z_Sla7Ug", "user_id": "7gJ2PRrydKVtOexRC-0vbw", "user_name": "Jon G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "A great gym. The regulars are really nice and easy to talk to, which helps when you're just starting out. The staff is nice. It's a little dusty in there and it can get a little stuffy when the gym is packed, but it's usually not a big problem.", "date": "7/25/2011"}, {"review_id": "69-wWdqfHSM2xSTQByrYOQ", "user_id": "Qvo6dV1ROR8MswaMfVLq-g", "user_name": "Perry K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Fuckn' A.  Hangar 18 in LA!  I use to climb at the original Hangar in Upland...that was and still is a great gym to climb at.  Firstly, it's inexpensive!  It's $15 bucks cheaper than the gym I am at right now.  They have auto belay devices, though some are in for servicing right now, I love the ideal that you can go climb on the wall by yourself!  It did take some getting use to though; falling back and trusting that the belay device brings you down slowly.", "date": "9/18/2009"}, {"review_id": "ro5giUgc-S--nTJCk8e5VQ", "user_id": "gbuCEOfhFP8vKbbkxu5mtQ", "user_name": "Matt N.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "This is an awesome rock gym, but they are over-crowded and under-staffed. The day I went, there were only two employees overseeing the 40 (or so) patrons. And to make matters worse (not to mention unsafe), both employees were giving lessons while simultaneously keeping an eye on the front door and cash register/counter.Plus, they ran out of equipment and there was a waiting list for grigri's (which they didn't even bother to tell people until after they paid). I never made it to the top of the waiting list; and the staff were rude about it to boot. One staff member asked my name and then made jokes about how long I'd have to wait and then proceeded to complain to me how long he'd been waiting to go on his lunch break.I was really disappointed and frustrated with my experience there. I really want to go back because it's a really cool gym, but they seriously need to do something about the staff and the availability of equipment (or at the very least, warn people before they pay that there's a wait list). My recommendation: save yourself the headache and go somewhere else.", "date": "4/12/2011"}, {"review_id": "TziYnM7QQO9fuE80f5ioqA", "user_id": "SlER4gaj00gSB9ay2UeJBg", "user_name": "chris a.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 0, "funny": 4, "cool": 0, "text": "Direct quote from one of the staff (11:30am on a Saturday).\"I can't believe I woke up before noon for this...\"That pretty much sums up the place.  Pretty nice experience spoiled by a staff that generally could not care less.", "date": "11/23/2010"}, {"review_id": "FGLWbnHc8ggP98I7pTy3lA", "user_id": "h1q9sVEWjW1TOiG_tdBCYQ", "user_name": "Breanna V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I was very unsatisfied! I am a regular climber and i decided to visit the gym with some friends.. wish i hadn't. two out of my four friends were injured when falling off of bouldering wall. one of them BROKE his ankle and the other sprained a ligament in the right side bone of his leg. both injuries were due to the fact that the padding system is terrible! there are mmany spaces in between pads on of which is three feet down! and to add to that there was a mouse running around in the pads and one of my friends was insulted by an employee! overall, not a good experience! Ps: floors and pads are filthy and setting isn't that great...", "date": "11/7/2011"}, {"review_id": "-40N8FKC7YPcL_Tuz8Uebw", "user_id": "9GZTIyGxnqd63QqIoKyi9g", "user_name": "Isaac G.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent during the day, but a bit crowded late afternoon/evening. Plenty of variety in difficulty. As an experienced climber I like the atmosphere, but may not be as helpful for anyone new to the sport.", "date": "9/24/2011"}, {"review_id": "hN33Fq_jSMvjrc28ZCxs1w", "user_id": "CRlIhFoFQZQPw0GAU65YsQ", "user_name": "Johnny C.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I too got one of those online deals for the wife and I for a month of rock climbing. This was our first adventure for rock climbing and we got everything down from the semi-friendly staff who taught us the basics from putting on the harness making a figure 8 knot and using the belay so that we wouldn't kill each other.For that last three weeks  i've gotten in 4 visits to the gym. The garage doors are typically open allowing lots of natural air constantly flowing keeping the stank down. The place itself i think is pretty small or there are at times too many people. As far as a workout it really tires me out really fast which i figure is a good thing, but makes me feel really weak at the same time.", "date": "2/16/2011"}, {"review_id": "eV2gQg6rW0T5dmVez13VAA", "user_id": "ohYASLQlGQ1BQtnZGSmvZg", "user_name": "Einar E.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I had to reschedule a bachelor party last minute and the staff were extremely helpful and useful and even helped my party by giving us all a discount out of sympathy for our hectic situation! They really made my brother's bachelor party (at least during the day haha). Great place! Great service! Hours of fun!", "date": "10/3/2012"}, {"review_id": "qlFjO3tCOC_U7TIg2yE0gg", "user_id": "jXXY61CrSzXQmDeUG7aA6Q", "user_name": "Kira B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time ever doing any climbing. I was a little intimidated at first but after a few minutes of watching people, I gave it a try. I felt comfortable here.  Only two issues: little kids running around because of bday parties, which is dangerous in this environment... and ventilation could have been a bit better inside.", "date": "2/13/2011"}, {"review_id": "0duEOjeFu98Dza-O95E4wg", "user_id": "87C2TyKmHm5lowDPcRcd-A", "user_name": "Chrystal B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I went here with my nose ready to sniff the stench of feet as others have mentioned, but I didn't catch that in the air that day. Lucky us. We rocked this place out for beginners who shunned lessons! I wish I could remember the blond guy's name who so patiently gave us a quickie tutorial and sweet encouragement before we hoisted ourselves up on the automatic belay. Yes, there were some splattering 'falls' off the wall. Yes, young children scurried up the wall before we even had our harnesses hooked up. And yes. Our limbs were burning and sore the second we sat down in the car to leave. Despite that, we had an awesome time. For about $20, we got a good workout, talked to nice people and found a new activity to do in the South Bay. I'd recommend it for anyone who, like us, just wants to try something new. Take lessons if you want, but honestly, it's kind of fun to wing it.", "date": "5/17/2011"}, {"review_id": "cUu78q5WU9xYFZIm6WXzyQ", "user_id": "yNN0ppsOL1qPBq3e6afEoA", "user_name": "Isabel B.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "This is a rating for someone interested in a kid's birthday party. I visited them today to get info and was really put off by Andre's attitude.  They are used to selling a pre-determined package - 2 hours and that's it.  If you need more than 10 minutes to set up, forget it.  If you want a longer party, he has no idea, \"I guess just double the cost given for a 2 hour party.\"  It's clear that parties are just a sideline they aren't very excited about.  The party space is a narrow area with a table, a picnic table and a couple of chairs thrown around and a filthy carpet.  They're worried about a face painter making a mess on that stained carpet.  You access the space via a tight winding staircase.  Sorry grandma, you'll have to sit in the car.  Other than climbing there's nothing else for kids to do and they're not allowed to climb the other boulders so they just have to stand around waiting for their turn.", "date": "9/7/2010"}, {"review_id": "FtZP4UgM1Dw1xiTpZxUioA", "user_id": "_IQyReEOGLrlOeTOAKki0Q", "user_name": "Sherry J.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I went back to this gym recently (bad life choice) and I have to say it is even worst! customer service horrible, the place is dirty, and the ropes need to be changed out for safety reasons. If  I were you go to the other hanger 18 gyms they are way better! there is now one in Long beach.", "date": "8/12/2012"}, {"review_id": "3Zc4NVKmhsDE0vCC-31HSA", "user_id": "qGlxLxpH1vqijSlI_1durQ", "user_name": "Rachel M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "If you're interested in trying out Rock Climbing, Hanger 18 is a great place to start. They've got a huge area of indoor rock walls, split into free-climbing (bouldering?), lead climbing, and belay climbing. I should start out by saying the only climbing experience I had before heading over to Hanger 18 was a county fair rock-wall. Not the strongest preparation for a full climbing lesson and day of climbing! But we got a great deal - $30 for 2 adult lessons, equipment, and a day pass - so we headed over early on Saturday morning for an adventure. They started out by giving us our equipment and teaching us how to tie the correct figure-8 knot between our harnesses and the lead ropes. They were very focused on safety, so we had to practice the steps several times before we could move on to the next one. After the knots lesson, we moved over to the wall and learned steps 3 and 4 -- how to connect the second person to the ropes and make sure they were tied in (after all, if you're climbing and start to fall, your partner on the ground should be sure your ropes are tight enough so you don't hit the ground!) During all of this, our instructor was carefully watching us and answering my multiple questions. He was incredibly patient and very informative. I was the first to climb, starting out on one of the ~5.5 ranked climbs (all of the belay climbs are on a range). The instructor stayed with us for our first few climbs, telling me where to look for the next hand or footholds if I ever got stuck. After he felt we were safe enough, we were given free reign of the gym. I'm so glad that we tried this place out -- I had a blast and, despite being quite sore today from using shoulder muscles I haven't in quite a while, I can't wait to go back! From what I saw, there are monthly memberships as well as weekend trips to different outdoor climbing areas. I would definitely recommend Hanger 18 if you're looking for a climbing gym or want to try a fun new workout.", "date": "8/23/2009"}, {"review_id": "CvSWTNMAQlTGlidwYrefYQ", "user_id": "r4_pH--CH7_dFpUqD2mvpQ", "user_name": "Rochele K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "I got a groupon for a month pass to go here. I just moved to LA and was stoked to find some good rock climbing gyms, but this place was such a disappointment! The walls were super short for roped climbing, although I didn't really care because I mainly wanted to boulder. So what REALLY irked me was how disorganized the bouldering routes were! All of the gyms that I've gone to mark their bouldering routes very clearly with colored tape. But this place marks their routes according to the color handhold, which is a really flawed system. The holds are all dirty so color varies. An orange hold, depending on how worn or dirty it is, could be mistaken for a pink or red hold. So while you're bouldering on a route you'll look to find the next hold and have to debate whether that hold over there is orange or pink... then you get lost and frustrated. They also didn't seem to plan out their routes very well and the holds were placed really awkwardly. And there was no indication of where the routes ended. And the biggest flaw of all: they are really restricted with the routes they set because they can only set them using the same color holds. That is SO DUMB! If they just used colored tape to mark routes then they could open up a whole new range of possibilities as far as creating original, fun routes. This place blows, I wish I could get a refund. Anyhoo, I'm going to start climbing at Rockreation instead.", "date": "1/19/2012"}, {"review_id": "ZWUTAw2o5UZcmuHdNRQoww", "user_id": "-QxjKpeYSL5nGUGrsZ9Ifg", "user_name": "Byung K.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I am an avid boulderer, climbing shorter but often harder routes with no ropes. I have been to many climbing gyms and at one point I had a membership at both Rockreation and Hangar 18 at the same time. Since Rockreation is the only other gym nearby and I have climbed extensively at both gyms I will be comparing the two.If you are into to bouldering I would recommend Hangar 18 over rockreation. Both have fun interesting routes but Hangar 18's bouldering area is much bigger. Also unlike Rockreation H18 offers boulders that can be topped out. For sport and lead climbing I think Rockreation has a small advantage.H18 also has a systems training wall and Rockreation does not.But Rockreation does have gym equipments(stationary bike and weights) and H18 doesn't have any gym equipments besides a pull up and dip station.H18 also seems to be cheaper than Rockreation. Also unlike Rockreation, H18 does not require a start-up fee or have a cancellation fee for their membership.(Accurate to the best of my knowledge at the time of the review)The staff at H18 is also friendly and helpful.Just remember to bring a water bottle! Unlike Rockreation they do not have a drinking fountain but they do sell water and drinks at the front desk.Both gyms are good in their own way but I personally prefer H18.***I saw one reviewer complaining about the floor condition. In my most recent visit they seemed to be addressing the problem by changing out the flooring.", "date": "9/2/2010"}, {"review_id": "XhfrxHU5AEI5liI5RQZcTA", "user_id": "rceAM_xsrdznN_0kW5ojMg", "user_name": "Diana M.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place was pretty good. My boyfriend brought me here. He was pretty into rock climbing and wanted to get me into it as well. This was my first time joining a gym, so I was pretty excited. My boyfriend said this place wasn't that great, but I really enjoyed it. They had a bunch of bouldering options, and then around the sides there was belaying options too. I wish there were more auto-belays, because my boyfriend enjoyed bouldering more. It would have been nice to do the auto-belay, but there was only one (maybe two?) auto-belays for beginners. I think there were two, but every time I looked, the second one was closed off for some reason. But the people were nice and signing up and the belay lessons were really easy. It's small, which is something I like. I didn't want anything too daunting for my first climbing gym. If you're just starting out, I recommend this place. But apparently if you've been climbing for a while, you may want to look else-where. Like I said, I liked it. I saw plenty of families taking their kids there, which was cute. Although, don't go Monday nights. There's some sort of kids climbing club and it's a pain because the kids just run up and take routes your about to start and they are just crazy running everywhere. It's a pain. Avoid Monday nights if you can!", "date": "7/23/2014"}, {"review_id": "x_O0SgCxrvtnRSSn7f635A", "user_id": "RkgWZR0IJZHI5I7g01nSfA", "user_name": "Emily S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Only came here for bouldering, and it's got lots of it.  However, it's a tight place, so I cannot imagine when it gets busy.  Was great in the morning during the week when there weren't a lot of people.  Easy parking and $16 for the day.", "date": "12/31/2009"}, {"review_id": "jW9l8KR52JB92b0bncSojA", "user_id": "MYHtFL4WWK9s36O5pK9zhw", "user_name": "Kimiyo I.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "My friend is a big time spider monkey climbing fanatic, so when invited to try climbing out as his free guest I threw my phobia of heights to the wind and as the commercialized goddess of war says, decided to \"just do it.\" Climbing is super fun and a great work-out, but alas, I have to remind myself that I write this review not on the sport, but the business. So comments on the oh-so important lesson for the newb. The guy teaching the lesson 1) seemed like he'd much rather be somewhere else and 2) so non-chalantly threw in \"pointers\" on how not to seriously injure or kill myself...I would have missed some had I not seen the wide eyed alarm on my fellow classmates' faces. Can you say YOIKS!? 3) The second time I went, felt like I got duped because I'm still new. I paid to rent a harness, but there were no gri-gri, and being 4th on the wait list was told I probably wouldn't get one at all. Thanks buddy for telling me this after I paid for the rental! Look past the less than enthusiastic staff, this is a decent gym to start off to learn.", "date": "4/20/2011"}, {"review_id": "NzMm4MbJ7Lc16AYmltHovQ", "user_id": "vD-_7J0jDwNY55RWm9FOvw", "user_name": "Mark T.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I joined this gym a few months back and really enjoyed it.  Andre was a great help other climbers for the most part were friendly.  Month to month so if your looking for a test ride here it is.", "date": "4/16/2010"}, {"review_id": "9J3ZCzDdJVyCVVJCF7XKuA", "user_id": "EnarL2WfWyEfCE2HVg_Yrw", "user_name": "Doug V.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going here for about a year and a half now. Its a decent gym with its positives and negatives. I go here because its the closest place and they have a decent membership price if you're a college student. I'm reviewing this from a rock climber's perspective.First, I want to correct a mistake others have mentioned. The routes here are not determined by the color of the holds; they are determined by hold color AND tape color. Its a good idea but poorly executed. The problem is that when they set their routes, they spray paint some of their holds to make sure they are matching colors. This makes some of the holds more slick. Also, the paint on the smaller foot holds will chip and the underlying color will show. A lot of times you don't even know which foot holds to use because of this. Also, because the wall is made of rock and not wood like other gyms, the tape easily comes off. Anyone that climbs here a lot knows tape ALWAYS comes off. Sometimes its not a big deal and you can figure out the route based on hold color, but sometimes they will have 2 separate routes of the same hold color cross each other. When the tape comes off, you don't really know which route that particular hold belongs to.The staff is hit or miss. Some of them seem pretty helpful and nice. Others seem like they are only there because they have to be.Like I said, the wall is made of some kind of fake rock. This is SOOO much better than having wood because the rock has features you can use for your feet. The routes are pretty good, but compared to Rock City which has GREAT routes, most of the climbs seem pretty bland. There are A LOT of climbs with really big moves that seemed like they were made for 6' 2\" climbers. I think most regulars here will agree that the climbs can be really reachy. It can be a bad thing, but then again you start to get really strong.This is a good gym if you're already a decent climber, but could be a bad experience if you're going for the 1st time.", "date": "2/9/2012"}, {"review_id": "XKXRKgfc_lsy2WJo8M1Msw", "user_id": "mJmKHZOSjzqwTww3IFm1Zw", "user_name": "Lauren E.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "+ the cool spiky-haired woman at the front desk was incredibly helpful. we're fairly new to climbing and it was our first time here, and i liked how she stood around to check each of us on our knots/belaying before going on her merry way, answered all our stupid beginner questions, etc. the gym is big and airy, with enough routes in the 5.7-5.9 category and bouldering to keep me occupied and challenged. they also had a bunch of much harder-looking things, none of which i'm going to be tackling any time soon!came on a sunday afternoon, and there were maybe 15 other people there -- not crowded at all. -- pricewise, $16/day pass is ok but i wouldn't mind it being a couple bucks cheaper!", "date": "8/11/2009"}, {"review_id": "9gi3EQ-mjEHJLfqE5EmDIg", "user_id": "IaKNKMClY7HTU5pC1Ur7bw", "user_name": "J D.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Was there with a group all ages mostly beginners. Adrian was sooooooooo helpful and nice.  He gave us an introductory lesson and made sure we had all the safety information clear. Once we got the hang of it, we had a great time. It's a great workout. They offer monthly membership as well as one off use of their facility.", "date": "7/12/2009"}, {"review_id": "8bIbXBqQCMCMitD8_NYhDg", "user_id": "BOFyet4YZY2V2G_wJ8ZdoQ", "user_name": "Alex S.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. I randomly wanted to rock climb and looked for gyms. I wish it was closer to home, though. Stoney point park is fun although not as noobie friendly as the gym.", "date": "2/18/2011"}, {"review_id": "KRJ5mPqWWXjqC-WiIwR3mw", "user_id": "73V1YCGhfb_CvADK0109Nw", "user_name": "Kalvin H.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been climbing at this gym for over two years now.  It is definitely one of the better climbing gyms in socal.  It is a bit small, but the price is also less in comparison to others.  The staff is super chill, and the climbers that frequent the gym are all friendly and helpful.  There's an assortment of top-rope, bouldering, and lead routes for all levels, including a very fun lead cave.", "date": "12/5/2010"}, {"review_id": "tid5y7frpxCf1imAX7kPig", "user_id": "eG5eBBr2Hy8xstmPEayBHw", "user_name": "tina n.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE THIS PLACE.. my bf and i were about to go to the one in riverside but since we were in upland already we dropped my to see how it was like... my bf already rock climbs but never at this gym.. it was cool... they helped me with everything. they explaned everything very well and even help hook some lines up to i can climb different parts of the wall... it wsa cool.. the only thing that i have to say is that there should b more room.. this place is tiny compared to the one in riverside.... but over all i had fun... i would do it again anytime! i still get a kick out of the name \"GREE-GREE\" HAHAH.... LOVE IT!!!", "date": "11/16/2009"}, {"review_id": "zNDdeJRHWrgmYKRufF-36A", "user_id": "uULG7DrJvPiqFpeOyUtC-g", "user_name": "kellee c.", "business_id": "MwSipWpc6RHImWWVzncMYA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "Was at the gym early this morning.  Checked the website before I went and noted a $9 day pass before noon special.  The guy at the front desk did not even acknowledge that the gym was running a special when I asked for a day pass.  Then once I mentioned the special, gave me the correct price of course, but excused himself for poor customer service/climbing etiquette by saying it was gym policy not to offer the \"internet\" special unless the customer mentioned it.  I def got a b.s. corporate vibe, not very friendly climber like, and quite frankly disappointing.  I am from CO and not new to the gym scene and was surprised by his behavior.  I wasn't able to climb/boulder anything super hard due to not climbing in months, but the v5 and under stuff that I did hit was alright.  Nothing that was crazy original or got me psyched to be at the gym.  I am 5'1 so the setting was typical, big and consistent with lock offs, like I said nothing new or original.  They do have a lot of newer holds, which is nice.  The route setting was super weird, no taped routes but color coordinated holds throughout the route.  Overall, this will not be my go to gym, I am closer to the 210 and the arc, so I will check that out next.", "date": "11/12/2010"}]