[{"review_id": "vjBh_fjEE5nY342GPNWBmA", "user_id": "uI5Rve_2YWFrhX2rowdkUg", "user_name": "Jennifer T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 12, "funny": 6, "cool": 9, "text": "Since my review...years ago, I've become a Touchstone member and LA.B has become my second home.  Since then, this gym has up'd their game in not just bouldering, but in fitness classes as well. LA.B facilities are not as advanced as So Cal Touchstone's other bouldering gyms (Hollywood Boulders and Cliffs of Id) as they don't have designated training rooms, top rope area, saunas, and more.  However, the place is intimate and has the friendliest people!They've recently given their yoga room upstairs a little makeover as well!  This room is used for classes such as TRX training, Acro-Yoga, Thai and Fly (Thai massage), Muy Thai and Yoga Anusara.  It's enclosed so people aren't as distracted.  The upstairs workout area, which has a Stair Master, two row machines, ellipticals, and treadmills occasionally serves as a workout area for classes such as Kettle Bell training, Sweat and Shred, and Buns and Guns, and more.  Anyone new to bouldering who is serious about improving and making this a regular activity should consider the bouldering technique classes that LA.B offers as well.  Most classes and fitness classes are free (or at a small fee) for members.  Guests of the gym pay a fee to attend the classes.Day pass prices for bouldering:-$25 for weekdays after 3pm, and weekends.  -$20 for weekdays before 3pm, except holidays-$20 for kids under 12-$4 for shoe rentals-$1 for chalkThere are packages that they offer as well, like a 10-pack or special summer packs, so call ahead to find out!", "date": "12/3/2018"}, {"review_id": "CKwEsuar4LSLn_-mwd0gMw", "user_id": "MEyP4th9ckkz7KtxaRP2Ww", "user_name": "Justin F.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 7, "funny": 5, "cool": 9, "text": "Think you've got what it takes to conquer the routes because you go to the gym regularly and are in decent shape? Well put that pride away and think again! I didn't realize it initially since it was my first time bouldering, but I soon accepted that my strength was not going to be a trump card for routes beyond V3. You have to practice and master good technique and finesse to finish the harder routes. Pace yourself and take breaks because you will tire yourself out quickly in less than 2 hours if you attempt climb after climb. This facility has something for people of all skill levels and interests. Not only are there bootcamp and yoga classes, they also have a strength training area complete with weights. Though they do not have roped climbing, they do have about 200 bouldering routes. These routes are all color coordinated with grips of all sizes and shapes. The floor is well-padded so falls for beginners like myself did not seem so bad. You should consider practicing proper landing/falling techniques that are taught in the introductory class that I did not have a chance to take. Pricing has naturally gone up over the years. It is now $25 for weekdays after 3pm and weekends and $20 for weekdays before 3pm. Members are able to bring a friend for free through a guest pass on the 4th Friday of every month. Parking is probably the only sore spot. When you give up on looking for parking on the small lot shared with the shooting range next door, you'll find a space somewhere eventually on the street. Just be mindful of what the street signs say!", "date": "5/9/2018"}, {"review_id": "yyIUbs2KDcRNcdSlTh2FGw", "user_id": "oXQDiDwKWi1Ad-VTbrs7aw", "user_name": "Brant G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was a great experience, the place was very clean. The little gym setup upstair and downstair was a nice addition. The parking lot can be tough if you go during busy time...The only downside for me was that this wasnt meant for beginner and mainly for bouldering. (The name is LA Boulder) and i expected climbing area for beginner but either way it was a great experience. Just be aware you are going for Bouldering! Haha", "date": "2/19/2019"}, {"review_id": "NV52K9ncWNXq6lQ_P_VfBA", "user_id": "wDQ0BonvgfiGCWRQOkz4Gw", "user_name": "Jason Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 32, "funny": 21, "cool": 31, "text": "Price: $25 for day pass, $4 for shoe rentals and $1 for chalk bag. Came here on the weekend to boulder and there were not that many people. This facility is all bouldering so if you want to belay, this is not for you. They have different levels that you could choose, V0 being the easiest and gets progressively harder as the numbers go up. If this is your first time, V0-2/3 would be your best bet. Anything else would require more technique. They offer a small area with weights to workout on the bottom floor and cardio machines on the second floor. Everything is clean and well kept. I feel that the pricing is a bit high but it is totally worth it. Lots of different areas for you to climb and you could spend a whole day here assuming you have the stamina and your hands are not raw after the first hour. Remember to chalk up and use your legs when to climb otherwise you will skin your hands like me... For parking, they offer a couple spaces in the back shared by LA Gun Club. Otherwise you could park next door which has a sign that says $4 parking (not sure for how long). If you don't mind walking two blocks, you could park on Mateo since there is usually parking.", "date": "8/21/2018"}, {"review_id": "eNLGzkr0Hr8zhPbs9W-wSQ", "user_id": "iBv-WPffIo_6pERUWJlLDQ", "user_name": "Jess Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the first touchstone gym I've been to and it's probably my favorite. It doesn't usually feel as packed when I go there compared to Cliffs or Hollywood Boulders. I really like the setting style as well. My favorite wall is the tall slabby wall in the front. I went this past weekend and had a blast working on the pink V6 set by nano. I loved how unique and different this problem was and I feel that way about this gym every time that I am here.Thanks for being amazing LAb. I always try to visit when I'm in town.", "date": "2/3/2019"}, {"review_id": "f5ycUCkOkcg7hOpc0xLgoA", "user_id": "5WNpVilRzHWPky9uZNsQtw", "user_name": "Coleen J.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "TIPS - parking is pretty hard so try to go at odd hours when the gym won't be too busy (early morning - early afternoon) Out of all the Touchstone climbing gyms, this will always be my home gym! This is the first climbing gym I went to and the intro lesson I got was super useful and my instructor was very helpful and friendly! I have now been a Touchstone member for about four months and I am not turning back! Like all the other Touchstone gyms, LA Boulders also has classes, cardio machines and a weight area for gym goers to use! Out of all the LA Touchstone gyms I have been to (LA Boulders, Hollywood Boulders and Cliffs of Id) I find the bouldering walls at LA Boulders to be my favorite! They have such a huge slab section and no other gym has anything that compares to it. I also think the staff plays the best music out of all the other gyms! I highly recommend checking this gym out! Bring your friends, bring your family, bring everyone!!", "date": "1/18/2018"}, {"review_id": "LFnU0gdbwxtTyMS94ldA3g", "user_id": "3SgArp6Mqu4DGwvxGCdSog", "user_name": "Susan C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The walls here are much higher than at my home gym but I felt comfortable falling. Super spacious and fun, varied routesetting. The staff is super nice and they have stickers at the front desk! The top out zone has chairs and tables which is cute. Everything is super clean and I would definitely come back here again.", "date": "3/25/2019"}, {"review_id": "5crFz3GbkijAP7rYlwhVeA", "user_id": "ZMc68qAU0oKEbJqercHPYA", "user_name": "Greg T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 5, "funny": 2, "cool": 3, "text": "From atop the 17-foot high walls at LA Boulders, a bouldering-only gym with several locations scattered around the LA area, you'll feel like you can do anything!  That is, of course, unless you're afraid of heights and too terrified to shimmy your way down the well-marked exit route. Either way, LA Boulders is definitely worth checking out if you've been meaning to cross bouldering off your bucket list or just looking to kill a few hours with some good ol' exercise.I had the opportunity to visit this plastic playground thanks to a friend with a guest pass, which is typically available to existing members on the fourth Friday of every month.  Even with the extra crowds taking advantage of the fourth Friday free promotion, it wasn't too difficult to stake out a spot.  The gym is large, well padded, and accessible to people of all skill levels, and there are small cardio and strength training areas if you're sticking to a more traditional fitness routine. The bouldering routes are rated V0 to V12+ and are color-coded for simplicity.   As a bouldering newbie, I was proud of myself for successfully navigating several V2 routes.  But, I quickly became aware of the skill and thought required to make it up some of the more difficult routes, especially the ones with inverted inclines or tiny grips. If you don't have a membership, there are several options for visitors.  The day pass costs $25 (weekends and weekdays after 3PM) or $20 (weekdays before 3PM) and gives you access to a \"free\" (i.e. included in the price) intro to bouldering class.  If you don't have an experienced friend to guide you, then it's probably worthwhile to take the class since proper falling techniques are important when you accidentally slip or lose your grip.  It's an additional $4 to rent bouldering shoes and $1 for a chalk bag to keep your hands dry.  You can get your money's worth if you spend a good chunk of time, but keep in mind that your arms will get tired after a few hours of intermittently scrambling up the walls.  Store your belongings in the locker room (upstairs) or one of the cubbies adjacent to the main area.While there are several parking spaces reserved for LAB directly in front of the building, you'll likely have to find street parking, which may or may not be difficult on the day and time you find yourself here.  It might seem sketchy if you're unfamiliar with this area of DTLA, but the area is rapidly gentrifying (for better or for worse).I probably won't be testing my newfound bouldering skills outside anytime soon, but I'd definitely come back to LA Boulders soon!", "date": "2/17/2018"}, {"review_id": "s-gwSeD2xvo7VlSnudFJxg", "user_id": "te5x72yslxUHs4NjGIgQuw", "user_name": "Andrew W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A great climbing community where strangers cheer for each other. Plenty of bouldering options for all skill levels.", "date": "9/29/2018"}, {"review_id": "YQ1Zi4TfzOYsuXWymrlPWw", "user_id": "ePjafhgmrJdmU2ox7b3Amw", "user_name": "Dennis B.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 4, "funny": 5, "cool": 4, "text": "First class bouldering gym. A part of the Touchstone Climbing Gyms. Place is huge with many various challenging routes for any level climber.  Well padded floors in all climbing areas. It is bouldering only so there are no ropes here. LA Boulder has locker rooms (bring your own lock) and showers, bikes, weights and some other exercise equipment.  Parking can be tough at times with a small lot in front.  Park in LAB marked spots and not gun club. Otherwise park against the wall facing the gym or down the street. $25 for a day pass as of July '18. Rental available for shoes and chalk. Some classes offered for climbing and yoga.  Open weekdays til 10pm only until 6pm on weekends. Wish they would be open later on weekends. Started the awesome sport of climbing here. I took the beginners bouldering class.  Short class less than an hour to get you going.. Filled with smiling, friendly people.  The climbing community in general is very welcoming and it's easy to become part of a unique group. Your become part of the family once you get that exhilaration of making to the top. It was easy to get hooked. Bought some shoes ASAP. Checked out other gyms. Started top rope climbing. Now I go once a week. Great exercise. Beginners to expert can all enjoy a visit to LAB. It is highly recommended", "date": "7/17/2018"}, {"review_id": "XVUnQrfVzhuZRyWJ5sqOLg", "user_id": "ZBg3n7ynd-lVnxTwL5vywA", "user_name": "Wali K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "I held a membership for two weeks because it was convenient to my work and I could wait out traffic in the evenings. I ultimately cancelled after weighing the pros and cons for myself.Pros: conveniently located, access to the touchstone gyms is huge. Guest passes twice a month. Decent stuff for sale (though mostly at full retail price). Chill staff with knowledge of local crags (they will let you take pictures of guide books). Music played here was good enough that I didn't ever need to bring my own headphones. Free yoga classes and stuff make the membership much more worth it since you don't also need to go to a separate yoga studio. The bundling of climbing + yoga makes this a compelling deal for anyone who lives in the area.Cons: Parking is really unpleasant if you try coming on a weeknight. They should have arrangements with nearby businesses that gym members can park in certain neighboring spots after 6pm. If you park on 6th street, they start ticketing at 8pm. Factory pl might have an open street parking spot if you're lucky, but you still have to walk kind of far. This is part of the reason I cancelled, because I didn't want to risk parking in neighboring spots and getting in trouble. Maybe I'm just a weenie about it (probably true).This might be a design preference, but I wish that the gym didn't have climbs where you walk off the top. The last couple moves on many climbs are not vertical, and it makes the quality sections of the climb a bit shorter (if the last bit of a climb is just topping out, the sections with the most aesthetic moves will be a lot shorter). I know this replicates many outdoor boulders, but I feel like it shouldn't be the default. Plus if you fall on a climb that is not vertical, you might scrape something. At least in those sections. If the walls were 12ft of very steep sustained climbs I would enjoy that much more.Additionally, I wish the crash pad was only on the areas below particular climbs rather than all over the floor. Plopping down on the middle of the floor after a tough attempt can be kind of awk since you might accidentally get in the way of ppl who are walking. The pit area was nice because there were benches for you to sit.  I wish that was everywhere because sitting on the floor is a bit annoyingThe grip tape walls allow you to cheat a little bit on some climbs by allowing you to paste your feet and create footholds for yourself. However, it is also unpleasant to scrape your elbow or something on the wall for this reason.Many of the climbs felt more focused on finger strength than power. It probably just happened to be the set of climbs up while I was there, but wow I wish everything was a little less crimpy. This can get you gassed very quickly but not necessarily pumped. There were some other real quality routes though that when I first sent them, were evocative of some amazing outdoor lines that I've climbed. I just wish all the routes were a bit more sustained.The grading can feel a little all over the place. But that's probably the result of putting an explicit number on each climb rather than a color tag which corresponds to a range i.e. red tag blue tag etc.", "date": "9/3/2018"}, {"review_id": "D_q6IhFMbj1HSWJqQRmv7A", "user_id": "PtQ8pZvjE5mbAWgJsa_wwQ", "user_name": "Oscar P.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I go twice a week. I climb for an hour and then workout for another. I love this place. Great climbing, pleasant staff, chill atmosphere.", "date": "1/15/2019"}, {"review_id": "EGZPfSGiLKBjWvkhfHEicg", "user_id": "ptAVptn3aj78PRm-4tCqYQ", "user_name": "Jessica T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome and clean climbing gym - especially lovely with the spring LA weather and open window atmosphere. As name would suggest, it's just bouldering at this location, but there's lots of it and the problems are fun! Also loved the section where you can climb up and chill or do some yoga. We were visiting so got the day pass (note that there's an early bird rate if you can go middle of the day on a weekday).", "date": "5/1/2018"}, {"review_id": "PoUjJjEafOy0vJwWxstqlA", "user_id": "ziQ1p_p6wv8r0V9-ioVd6Q", "user_name": "Marion A.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Cool Gym I went for acro-yoga and stayed for rock climbing ‍ afterwards! Very good experience! Prices are low, especially if you are student! Parking is hard, but possible to find... highly recommend", "date": "4/24/2018"}, {"review_id": "OFy6xopCwtsNBzn_pGeFjg", "user_id": "uyAP7keYu1C5nDhdWOF0pw", "user_name": "Sheri W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I recently decided to try this place out after a long hiatus from climbing, and I'm glad I did. After taking their intro to bouldering class as a refresh, I was totally hooked and got a membership. I really like that they make bouldering feel accessible to people who have never done it before. They also have a weight room and various fitness and climbing classes, which I'm excited to check out.Touchstone has several locations, and your membership works with all of them. I happen to have one close to home and one close to work, so I can get a wider variety of routes and classes.", "date": "2/9/2018"}, {"review_id": "3dqf19tF9fnlRRJSM0Yt9w", "user_id": "1MhPtfUC2Uw0bU3ewkb6PQ", "user_name": "Esther K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 4, "funny": 1, "cool": 1, "text": "My friend SZ had this phase where she was really into bouldering and had a membership here, so she brought me here once to use her free guest pass. They have a somewhat small parking lot but we were able to snag the last open parking spot. Since it was my first time here I had to sign a waiver on one of their iPads (so high tech!) and I rented shoes from the guy at the counter. They have lockers upstairs next to the restrooms so we put our stuff in there and came back down to boulder.I have a fear of heights so this was scary... especially since I have no hand/upper body strength and so I was constantly afraid of falling. The floor is like an inflated mattress so it is okay to fall... but who wants to fall?! I managed to climb up two walls following the very basic route (they have different difficulty levels, all marked out)--it was scary and exhilarating! It was scary climbing up... but even scarier climbing back down :PThis gym is not for climbing only though--they also have weights and cardio machines (upstairs). So after we did the bouldering we went and used the weights for a bit before using the ellipticals upstairs. Overall the gym is pretty clean and nice to use. If I lived nearby, I might consider joining this gym since I did have fun while I was here, but since I am not in this neighbourhood I will stick to the occasional visit.", "date": "6/18/2016"}, {"review_id": "HCjpdVM8KSFfkO-UYsCwow", "user_id": "HWzx73JpyMPjL5nyTSB6qg", "user_name": "Alex B.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 9, "funny": 4, "cool": 2, "text": "This place is awesome! Unfortunately the parking sucks! It is shared with the Gunclub next door. Somehow my friend scored a spot right in front though!When you walk in you are greeted by Ipads to sign waivers. After your done with it you approach the front desk and the staff take care of you from there on.  The price to climb was $20 for the whole day, and $4 for shoes. We opt to not get the shoes first and try it with our Nike frees. Bad idea! Ahah. It was our 2nd time climbing and we didn't have much experience so they suggested us to hop in with the class that was being taught!  In the class they teach you how to fall which is SUPER important cause you can break limbs!After learning the basics me and my friends were off, the place was huge! Enough for the amount of people on a Saturday to climb while waiting briefly for others to finish.  I like this place because of the holds are color coordinated making it much easier to locate the next hold to move onto.After climbing for about a hour my hands were shot. But somehow me and my friends continued to go for about 3 more hours. The key is to definitely use your legs to help you move onto the next hold or else you'll burn all your energy!Definitely get some chalk or else you'll be ripping skin, cause thats what happened to me! The staff has bandaids up at the desk, because they know people like me will injury themselves!Rock climbing shoes are TERRIBLY UNCOMFORTABLE! I exchanged them like times, your toes are suppose to be curled!! I had to take them off a few times to relieve my toes, but it is HIGHLY recommend you get them!I would definitely come again, once my hands/arms recover..", "date": "4/29/2016"}, {"review_id": "dO1l_j6tlqF4yK7EJqbTOw", "user_id": "fJ2vJz0Q9GFKhrkaKL0F_Q", "user_name": "monte b.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I like this place a lot. I love the climbing. It is just so expensive!!! Parking is very tough. You either get lucky or you are driving around for a while", "date": "8/25/2018"}, {"review_id": "AcQFeiQdcPEEvLc6AWL7sw", "user_id": "Zw5MvGi7yHnrTAVOJZnJSg", "user_name": "Emily L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I'm new to climbing but the space was nice and the staff was friendly.Good amount of routes. Day pass gives you access to all the amenities as well as any classes they have (if you're there when it's happening). They have a private lot for parking and street parking.P.S.A. I'm not sure if this is something that people forget. Please fall safely. I was taught that when you fall off the wall relax your body and hit the mat towards your heel and roll onto your back. Don't fight the fall. I feel like the crash mats give a false sense of security for falls... Protect those ankles.", "date": "12/21/2017"}, {"review_id": "p8VRNrilLggG7KHwUZ7lzA", "user_id": "v0G-sib5dLbjretRImqwrg", "user_name": "Bryan E.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "First off I love this place. Awesome space. Nice Staff...Always have been kind to my Family, rental shoes and snacks are cheap, etc. What more could you ask for? 1. A sauna. Yes...I know, maybe too much of a request? NO, it would behoove Touchstone Climbing to keep the facilities it sells access too consistent. The reason why I notice was because the Hollywood location has one and it really helps after your work outs and climbing sessions. 2. MORE SIGNAGE. I can't tell you the amount of times I've told people to meet me at this location and they can't find which scary DTLA alley way to drive down with weapon in hand.Speaking of weapon...3. MOST IMPORTANTLY THEY SHARE WALLS WITH THE LA GUN CLUB! Honestly, this wouldn't be such an issue if these gun toting morons weren't such hard asses about parking. In a obviously crowded Downtown LA community parking is hard to find as it is. I'm sure it was there idea to individually try and paint a tore up concrete alley way halfway visible and will TOW YOU at a moments notice. I'm sad to give this place a 3 because of their neighbors. But, I do believe a better parking situation could be put in place.", "date": "11/30/2017"}, {"review_id": "vATOG8X8pl_JCGYoyT9mbw", "user_id": "3PiuCfNSeib3iCbn4eltnQ", "user_name": "Liang T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "Clean facility, friendly staff and FREE PARKING IN LA! What more could you ask for?My friend first introduced me to this place when I was looking for something \"outdoorsy\" to do. Although its all indoor bouldering i decided to come and check it out anyways. When I arrived I was greeted by big smiles and friendly faces. I was directed to a waiver that I had to sign where I forfeited my right to sue them in the event I die...or get injured. When we finished everything and I paid I walked over to their cubby area and gym area. This place is HUGE. Its got a fully stocked gym with a squat rack, pull up bar and barbels. Anything you could think of this place has got. Upstairs they even have lockers and a cardio room. On top of the wall theres a little rest area and yoga studio space for those who enjoy yoga. They have varying difficulties of boulders to climb and its great. I have been back here a few times now with many different people and we enjoy ourselves every time. This is a great place to hang out and have fun!", "date": "4/23/2017"}, {"review_id": "vc1hyGlT6icYG44FTjDstw", "user_id": "onRvg9rLvpPwXHnxtUAv1Q", "user_name": "Mike A.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Challenging climbing gym and good environment to spend a couple of hours trying different walls. They do have a gym too which is cool. I'd say it's a tad on the expensive side for a day session especially if you're going off hoursA suggestion...it be nice if they could include a chalk bag on the house or a general chalk area to dip your hands in", "date": "8/20/2018"}, {"review_id": "B7FPloPZOP5I0WI16tgbIg", "user_id": "W7iP_Ozk3-IWWusxTxa1DQ", "user_name": "Eddie S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 5, "funny": 0, "cool": 1, "text": "LA Boulder is a solid bouldering gym and close to downtown la, so I would come here to get in a decent workout. I don't know when they raised the prices to $25 for a day pass but that is way too expensive for just a bouldering gym...especially since most people only climb for a few hours.. I even thought $20 was expensive when this place first opened since Sender One was also $20 for a day pass. But Sender One has rope climbing in addition to bouldering so you get your money's worth.LAB's ten pass punch card was $180 ($18/pass) so that made it worth it to come here and get in a good bouldering session. But now at $230 for the ten pass, it's just not worth it for me. 3 stars due to the pricing, otherwise I'd give this place a 4.", "date": "9/12/2017"}, {"review_id": "nkE1sItvRTvhkWXrJa9Myw", "user_id": "SPYJt-1XF4SlPaZgd04QRQ", "user_name": "Jessica K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Ive been to all the touchstone gyms in LA and both sender gyms. Of all the bouldering, I think that LAB has the best routes. Always have so much fun climbing their sets here and there is always great climbs for beginners", "date": "6/21/2018"}, {"review_id": "kYZfHBwZPn6edv9hxXlPbg", "user_id": "KyCUpbpJHqS7ZuLg2oAPWg", "user_name": "Ginger G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Five stars for the staff, particularly Jake and Doug, for amazing customer service (a rare thing these days.) Jake is always knowledgeable, personable, helpful, and has the patience of a saint as demonstrated when dealing with - how shall I say it - grumpy patrons as I recently observed. He has great advice on climbing technique, conditioning, equipment, shoes, etc., and I trust his advice and suggestions, and appreciate him taking the time to answer my many questions (I'm a newer climber so need a lot of hand holding at this stage.) I've seen him coaching the youth team and hope to get my nephew involved if scheduling works out around the new school year. Give this young man a raise and/or a promotion as he represents LA Boulders in the best possible light, and seems to genuinely care about the clientele, the company, and the sport in general. Oh - he has great taste in music, too. Doug is also a pleasure to deal with when on duty while I'm there. His pleasant personality and professionalism are truly appreciated and as mentioned earlier, this is becoming more and more rare. Give him a raise, too! They both deserve it!The gym is quite nice although one of the smaller in the Touchstone chain. I like that, though, as it is more intimate and friendly (I think) than the others. Perhaps the parent company could throw a few more $$$ to LA Boulders for promotions, events, etc. It's kind of off the beaten track so unless you're familiar with the Little Tokyo/DTLA Arts District, you might miss out on this great gym. Good things to do come in small(er) packages and I highly recommend LA Boulders if you're thinking of starting to climb.", "date": "9/17/2017"}, {"review_id": "G8n2IH44DoLm2ucKNjPIZA", "user_id": "PTD6ocdGBUa-dcXS3Vr7Xg", "user_name": "Andy O.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 7, "funny": 3, "cool": 4, "text": "Awesome spot. Walls are well organized. Holds (the \"rocks\" you grip to climb) are well-maintained and color-coded by route. Tons of routes to go through. And some weights and treadmills as well, if you get bored and want to burn off just a little more energy because you're in the middle of a beast-mode 'roid rage session. Friendly-ish staff, though like most climbing spots, they've got a slight \"I'm totally a legit climber and better than your casual ass\" vibe to them. Maybe that's just how climbers are. Gets crowded, but the people were mostly manageable and friendly. No unnecessary waiting around for groups to stop camping out routes.", "date": "10/11/2016"}, {"review_id": "fIGQDdoM8faE5vFpHe8lMA", "user_id": "QH2BZkG4oBgZq41IG-l-Vg", "user_name": "Kevin P.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A little bit tricky to get to, especially if you're like me and don't have a good sense of direction at night.  But....once I arrived I LOVED IT!  The people going in were friendly, the staff was friendly and the other climbers were friendly.  Everyone relaxed and easy going.  An enjoyable and fun experience all around!", "date": "12/31/2017"}, {"review_id": "CBGdTeJVI5QNSygL7zkZlw", "user_id": "AOsb45lNP7AzQwwWLUQxEg", "user_name": "Shanon Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 10, "funny": 8, "cool": 8, "text": "Initiating..... BEAST MODE! If you love bouldering then this is THE indoor climbing gym for you! I've been here twice now and I must say it is not only LA's only bouldering gym but it is also one of the nicest in the area. The facility is super clean and well maintained. There are around 200 different bouldering routes and they vary from all levels so even if you are a beginner there's pretty challenging routes for you as well (this is something I find lacking in other gyms).Amenities include locker rooms with showers, lockers, towels, and a whole fitness area upstairs as well. The day passes are $20 after 3PM and $15 before 3PM on weekdays only. Membership prices and punch passes prices are available on their website. There's a waiver that you have to fill out but it takes not more than 5 minutes and you can also sign this waiver online prior to your visit. touchstoneclimbing.com/l…Tip* Parking is really difficult so come during off hours and the main entrance is on Factory Pl.", "date": "9/10/2015"}, {"review_id": "5TmvK3uq2EPfyIjOQYKapA", "user_id": "80sXzCTyLRG21_NX0NpsIw", "user_name": "Michelle L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Love coming here to climb as my favorite style is bouldering. They are always friendly. If ever in LA and love to climb, it's a great place to go!", "date": "3/2/2018"}, {"review_id": "IvXsUArTf_QQDz48lKVQRA", "user_id": "cczCUack5vpprurWhc0ckg", "user_name": "Jessica N.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "I came to LA Boulders the other day for a double-date and it was so much fun! I must say, I was a little worried at first since I'm not too big on rock climbing walls and I didn't know if I would have the upper body strength to climb the wall but it really wasn't that bad! It costs about $24-25 for a day pass which includes the rental shoe and chalk cost. I'd say we spent about 2.5 hours there. After a while your hands get a little tired and muscles a little fatigued if you aren't used to this form of physical activity. It was common to see friends chilling out laying on the SUPER padded floor while watching another friend attempt a path and suggesting footing positions. I found myself watching them too! It's kind of amazing and crazy how much muscle control and body strength they have to maneuver around the wall to get to the top! The different holdings are color coordinated and labeled based on their level of difficulty! They start at V0 and go up to at least V12. I think my friends and I stuck to the V0-V3; anything higher was much too difficult to even make if half-way up the wall! There's also a small gym inside the facility: cardio machines upstairs near the bathrooms and lockers and weights downstairs off to the side of the rock walls. LA Boulders is also friendly for people of all ages, I saw a few kids come with there parents just for fun!I would definitely suggest this place as a fun double-date idea. Bonding over sweat and tired muscles!", "date": "10/3/2016"}, {"review_id": "jj1SI4m_GCmUJGDdTrnrKw", "user_id": "i6pCe_ObrsIniB8n1Dp9pA", "user_name": "Jackson Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 7, "funny": 6, "cool": 8, "text": "Never had so much fun working out.  My arms literately gave out on me after 90 minutes. Then I was told that the secret was to use my legs more. It's super easy to get started. The level 1 and 2s are simple. Get's you warmed up for the harder stuff. It's super addicting and such a great work out for my core and arms. My friend Sam and I were messing around with the tight ropes they have near the lockers(got kinda ridiculous, I couldn't stop laughing, who knew it was so hard to balance). They offer pretty much have all your typical gym amenities as well as shoe rental for bouldering.Without looking at membership prices, the day pass is only 20 bucks. I was like pffft -that's nothing. \"Shut up and take my money!\" Until you realize how much you can save by getting a membership. If I lived closer I'd definitely have an annual membership or something. The rates aren't bad at all.", "date": "7/16/2015"}, {"review_id": "3HyjF9wVmaBG5R5GfYOHoQ", "user_id": "OPnHqVlj77zJXO_509iM8w", "user_name": "Michaela H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "Decent spot, expensive, mostly unfriendly/elitist staff, zero parking.", "date": "3/9/2018"}, {"review_id": "g6i1t9oeloTA5FBfSc0bfA", "user_id": "Tia-89Yus6tnSy-bcZ9t4w", "user_name": "Brandon L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "WhoA. This place is awesome. It's located in some industrial area in los angeles and has some nice restaurants in the area. They do have their own parking lot, and also street parking around the area, but it was hard to find parking. It costs $24 for a day pass, and $1 for a chalk bag that you use to go bouldering. The bouldering courses have several levels of difficultly, so even if you don't work out, you can do some of the routes. :) It is definitely something fun to do with your friends and inviting for everyone.They do have treadmills, and nice equipment to do some lifting. Everyone we encountered was friendly and I would definitely recommend for those who want to do something fun in LA that doesn't include eating. :)", "date": "10/6/2016"}, {"review_id": "9MoqrvyC_qEzY0hranGQEw", "user_id": "Kx53uTaTbf0hAb9eE7ZZqA", "user_name": "A S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty good bouldering. Parking tough, though. Weights and cardio equipment is reasonable, but the few yoga classes I have been to have been just ok. Also, you would think that a monthly membership would mean they wouldn't charge for a small strip of tape when you rip a flapper...", "date": "4/28/2018"}, {"review_id": "qisVegrn41DH4siO5N5Z7Q", "user_id": "4DPeuuSvCwDBJ8uE-AR-gQ", "user_name": "Priya G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love love love coming here!! Staff is good. Can't wait to unhold my membership and get back to it. If you're thinking about coming more than twice, it's better to get the membership!", "date": "10/1/2017"}, {"review_id": "HLJ_C9jbKLQa3gliQJuHfg", "user_id": "3QKSFQMslWZSNb-OVYVcSw", "user_name": "Lisa Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "Parking: there's a small lot next the gym, and there are loads of street parking but MAKE SURE YOU READ THE SIGNS. There's one section on the street that is NO PARKING and it's not marked red.Gym: $20 for a daily pass. This bouldering gym is fun, it's big and has loads of problems. One for everyone! It's also a bonus that it has AC!!! This gym has a weight section and some equipment (treadmills, ellipticals, etc) and with your daily pass you can also take the yoga courses! It's a deal if you go Boulder and also take a acro class.Fun and I would come again!", "date": "8/3/2016"}, {"review_id": "rHgvqHkIthx0YdTZKE-X2Q", "user_id": "dBLuPf-nymEcYk3tEzyZ_g", "user_name": "loren a.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is great. I brought 4 boys here to climb and had no idea there was also a gym. I spent the whole time lifting weights and working out. They have different climbing areas. Free with no ropes. Each wall is different and has different levels of difficulty. There is an upstairs and downstairs gym area. Also a locker room upstairs as well as restrooms up and downstairs. There is diversity here for all of your needs be it rock climbing or working out, or both! I recommend this place. Oh and I forgot to mention the staff is greaaatttttt! So much personality.", "date": "9/14/2015"}, {"review_id": "3qYN5VLPpy4xRi6WWbJLUw", "user_id": "5oeHZy48WNutMowW5ApjfA", "user_name": "William K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Today was my first time bouldering and it was extremely enjoyable. Price was very reasonable. Bouldering are was large with tons of challenging and beginner routes to climb. Staff was incredibly friendly and helpful. Would highly recommend this place to those who are looking for a go to bouldering gym!", "date": "8/17/2017"}, {"review_id": "lhkWcD5E648qw_KXEJ0SCw", "user_id": "VLHxnDUxdcdoGuwHsVC2jw", "user_name": "Zach H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is AMAZING!!!Totally worth the 30 dollars for a day pass and shoe rental. Never been to a indoor climbing gym before and staff was very helpful. Tons of different routes and a good mix of different skill levels. 17 ft walls and 11,500 ft of climbing. Gym area seemed pretty good. Squat rack/Power Rack plus bench and other free weights. Treadmills and cardio upstairs. Yoga classes, Martial Arts, and Bootcamps.  Makes me want to switch to going here instead of my regular gym.", "date": "7/16/2017"}, {"review_id": "DZCFWFo-9TaVMrSm-5gurw", "user_id": "NF4bzSjQN9fXyR4t5XrFjA", "user_name": "Vicki C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've come here with my friend's guest pass and have a lot of fun trying my hand at rockclimbing. At first I was not in the best shape to be climbing. This time, I went after months of doing weights and the experience was so much more fun because I felt like I could hang on and downclimb! I also invested in a pair of climbing shoes after rentals and borrowing didn't work out for me. I find the people who go to this gym motivated and fun to be around. Strangers will sometimes cheer you on or help you get to the next hold. It's also fascinating to watch others solving problems. The gym itself is great, I think they change the problems on a regular basis. It's well-ventilated, has storage cubbies, locker rooms, clean bathrooms, classes, treadmills and other gym equipment.", "date": "7/30/2017"}, {"review_id": "Voi86U3hxCONMhV4ESSpMA", "user_id": "hizGc5W1tBHPghM5YKCAtg", "user_name": "Katie B.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 30, "funny": 19, "cool": 26, "text": "I've been to LA Boulders twice now and while it's definitely one of the more fun activities you can do with your clothes on that doesn't require booze, it's positively one of the most frustrating! Bouldering is not for the easily discouraged. It will break you down faster than a drill sergeant. I consider myself pretty athletic and up for most anything fitness wise, but this is one activity that I just can't figure out.The facility is great, a ton of different courses and a ton of a different routes (varying in difficulty) for each level. As a beginner, there's actually quite a variety of routes to take a stab at, though that doesn't make them any easier to climb! The staff is nice, just make sure to tell them it's your first time and they'll set you up with all the particulars. Definitely opt for renting the shoes. This last time I used my sneakers and I wasn't able to get as good of a grip on the wall as with the rentals. It is brutal on your hands at first and your arms will be sore the next couple of days, but if you stick with it, your most important limbs will adapt. On my most recent visit, I was treated to a bootcamp, courtesy of Darian (offered sporadically throughout the week and is complimentary). She took us through a CrossFit like routine, mixed with stretching, a warmup, and some climbing. I was ecstatic to tack on a workout that my body was good at to the day's festivities, as well as the bouldering. She also took the time to show us how to properly boulder, which made the act even that more tough, but it was awesome to understand the wall a little better and the most efficient way to get up it!A great alternative to hiking when the weather is temperamental or a group activity when you've exhausted all the watering holes in your neighborhood!", "date": "1/2/2015"}, {"review_id": "_E3NBr63zccncbjK4IEG9A", "user_id": "f0uwLEHPIuNWgFuUNd473Q", "user_name": "Jacelyn K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Very nice gym, it's old compared to Hollywood boulder, but still very nice and very clean. The ratings are soft...I usually climb 3s and 4s but here I climb 5s to 7s. Still very nice, has workout area on the side and treadmills upstairs. Showers, lockers, and restroom are upstairs and very clean. I just signed up for membership today, and Jake (I think) provided me with excellent service.", "date": "5/13/2017"}, {"review_id": "ruareKxfTcJlfIuOOauGlw", "user_id": "AT90vXCOoAZ0V-a1MPAuaA", "user_name": "Candace L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 4, "funny": 3, "cool": 2, "text": "LA Boulders is my new playground. At first, the thought of bouldering made me a bit wary (falling from tall heights and all that jazz), but once I got there, it was easy to get a hang of it and have a great time.$20 entry fee + $4 for shoe rentals and I was all set. If you are a first-timer like me, I would recommend buying tape for $1 in order to protect your fingers. Also don't wear shorts! The walls are sandpaper-like and it's not hard to get scraped. Don't worry about where to put your belongings, LA.B has you covered: give them your ID and you receive a lock to use on one of the plentiful lockers located in the upstairs restrooms. Also upstairs is a cardio area with treadmills and other miscellaneous weight machines downstairs. On top of the rock area there's a room for yoga classes and even a couple couches with Jenga for you to play. A challenging workout -- I went two days ago and my arms are still sore -- and a fun way to spend your time. You can sense a sort of community as people cheer one another on and more advanced climbers freely give tips and guidance.", "date": "2/8/2015"}, {"review_id": "s5U2CtvY6qHp95_0K7NKdg", "user_id": "7mEfI2KmQrk_M9I_K-tQfg", "user_name": "Lucine K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very fun and addictive experience! Friendly staff and lots of always changing routes you can climb. I'm no pro but this is my go to indoor climbing gym. If you haven't climbed before GO FOR IT!!! So much fun", "date": "7/5/2017"}, {"review_id": "shHlzkWUSXuo5PmFx0n1Ug", "user_id": "-lfA2Ox-lMGyGzA52fn-AA", "user_name": "Donny G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The day pass (easy to register and signing your life away before paying-in with their iPads as you first walked through the front doors) and shoe rental (+1 shoe sizes higher when giving your normal shoe sizes) is pretty reasonably priced, even though my older cousin pay for our entry, and we stayed for one good hour.  My younger cousin fall in love with it, someone who is more of a insider and a gamer, so was pretty shock to see him introduce rock climbing to all of us for the first time as recreational hang-out.  A lot of people here hanging out, but not too crowded for everyone to have their spaces.We were new to this, but the places have lot of routes ranging from very easy to difficult; looks easy but can be deceiving.  In addition to me being scared of heights but I just have to avoid looking down or backward; thank goodness that the floor is like an inflated mattress to give you comfort and the okay to fall down to, which sometimes I do when I reach to the top, and didn't want to climb back down due to being fear of heights.  Since my younger cousin is experienced, he brought a bag of chalk, which came really handy.  Supposedly and I also recommend to put chalk all over you hand, avoid blisters and give you better grip when rock climbing.  Overall, friendly staff and clean facility while bouldering is a fun experience a I can see myself coming back again, and sharing this experience again with another group of family or friends.", "date": "9/6/2016"}, {"review_id": "zW7bXaxcCSM8MFPAZGMH7A", "user_id": "GkzJfxH27j6glfOqBr-Rlg", "user_name": "Tessa L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Changing my rating to five stars. Originally had it at four because this gym lacks some of the facilities that other touchstone locations offer, but they make up for it with really cool classes, clinics, etc. Also LOVE the staff here. My favorite staff of all the locations. One of them shared some tea with me today after I took a hard fall on my head.", "date": "2/5/2018"}, {"review_id": "xHNvlF8LUecXTQ5I4vSTAA", "user_id": "SLr8uFnGpVSKWkhllLJ-Fw", "user_name": "Mitch M.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Blissful bouldering beacon of the climbing community. More amenities then you can utilize, great staff, dedicated parking, and high bouldering walls.", "date": "1/21/2018"}, {"review_id": "ERNXkpJZfzkh3DMsVCHb1w", "user_id": "5PpB7xXgf9oAAQoEVWfL6g", "user_name": "Young Kyung K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 9, "funny": 4, "cool": 7, "text": "I was SO SORE BUT IT WAS SO MUCH FUN!!! :DIt was my first time and honestly -1 because the staff were of no help what-so-ever and the guy next to me felt bad for me I guess because he ended up teaching me everything to what the stickers on the walls meant, how to get up, what and where to go for easier ones, and how to come down. Thank you friendly guy that doesn't even get paid to sit at the front desk and and do nothing :) Although it really frustrated me that the staff automatically though we'd know what we were doing I had the time of my life. Yes, it was hard but it was totally worth the work out and I'm so excited to go back and try harder levels. For the day pass you sign a waiver through the Ipad when you enter and it's $20 per person for the whole day. You can rent shoes for $4 which I didn't but later regret not doing so, I heard it's so much easier with the shoes. The place was clean and very spacious. Considering that they weren't open for too long I'm crossing my fingers this place won't get too packed .... but surely it will soon happen :( I'd come back and there's a cardio station upstairs and weights down stairs and ...the upstairs bathrooms are so much cleaner and they have lotion (shh it's a secret) hahaa :D", "date": "7/7/2014"}, {"review_id": "FGYRk8buBrH0_NHycB8Ftg", "user_id": "zoyb93pskMhDgXZgv-DKtA", "user_name": "Kaori T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 5, "funny": 5, "cool": 4, "text": "My favorite bouldering gym that I've been to so far. Lots of different walls, made for all levels -- and everyone in here is super friendly, not just the staff but the clientele. This is the only bouldering place I would consider going to on my own, and of course hope to meet new people... But yes I love this place! There's no rock climbing, it's 100% bouldering, but there are treadmills and a locker room, and also classes. It's a nice place to start a bouldering family!", "date": "12/15/2015"}, {"review_id": "BFOV-cgZ_4Ok9KWmzyDtag", "user_id": "6mgYTBGN1Ig2thDBCjmLwQ", "user_name": "Michael C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "My new home base for climbing in LA. Touchstone is a NorCal-based climbing gym company currently expanding down to SoCal. And we're luckier for it! They're actually opening up new locations in Culver City and Hollywood soon, and a LAB membership will give the same access to those gyms.LA Boulders is easily the best bouldering gym in LA. Clean, largely dust-free, well ventilated, air-conditioned -- if you come climb here for the first time you'll be spoiled. Don't get me wrong, other gyms aren't bad, but LAB is a luxurious experience haha.My only gripe is that the community at LAB doesn't feel as warm as other gyms (like Hangar 18) but maybe that's just a matter of time.Somewhat limited lot parking. Or you could bike there like I do! Lock your bike to the railing in front. There's an initiation fee, but sometimes it is waived during promotion periods (call ahead). Or you could just sign up for the annual pass! Say hello if you see me at LAB... I'm there all the time now haha.", "date": "10/27/2014"}, {"review_id": "nbHDLTik9d6wU7ljWAtFuw", "user_id": "-Bmn3rPa-i6okc_5PjB71w", "user_name": "Leo R.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome community of people and overall a great deal for everything including the classes they provide.", "date": "10/15/2017"}, {"review_id": "Woqi7_1u8m94lHSnuaotaA", "user_id": "Q6RiwKuD5b_BMxJTmGVuPA", "user_name": "Rebecca L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "I had a great first time experience bouldering here! I was welcomed by the worker at the counter once I entered the door and after signing the waiver I was given my rentals. After that everything was smooth sailing. I would definitely say this is a place I would come back to because of the reasonable pricing and because of my new found hobby of bouldering!", "date": "9/28/2017"}, {"review_id": "OeNCc0D8JUhag8KBtNlp0w", "user_id": "qkR762nqUTRQJF-L7KCBlw", "user_name": "Eunice J.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 7, "funny": 2, "cool": 3, "text": "Had a blast at LA Boulders.  I've bouldered before, but have never taken a class to properly learn the techniques.  My girlfriends and I took the intro course for $25 with... Jay? (sorry, I'm awful with names), and he was an awesome teacher.  He was very patient, supportive, and encouraging!  We did the course with a total of 9 people, and the lesson ended up being pretty long just because we had to wait for everyone to take his or her turn, which isn't a bad thing, since you need a few minutes between each climb to recover anyway.  We started out with a v0 and then did a v2.  You rent shoes and they tell you it's supposed to fit \"annoyingly\" but not \"uncomfortably,\" and I ended up exchanging my shoes 4 times because they were all uncomfortable.  I can't wait to keep coming back to work up to at least a v5 and do those crazy spider monkey, side-ways climbs!", "date": "10/22/2015"}, {"review_id": "VHOEo6RDC7kxieNnoFt3Vg", "user_id": "86JX_xYfGKXIngxEcDnUog", "user_name": "Morison W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "$20-$25 for a day pass plus another $5 for shoe and chalk rental. Recommend getting their membership if you  come a lot. There are enough challenging ones to keep you occupied.", "date": "2/11/2017"}, {"review_id": "PmPmXzIf7IjR8CgdHTcCgQ", "user_id": "B35JKW8Mrk11S0Y1XEcZOg", "user_name": "Ashley H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "For a $20 day pass and $4 rental shoes, anyone can go bouldering. This was an amazing find via recommendation if you are in the downtown area. I've only gone bouldering one other time and there are a few goods and bads in comparison to my other experience.Since I am a beginner, I noticed that this place is a bit more challenging than the other place that I've been to. And the reason for this is because of its majority in angled climbs (which require a lot more upper body strength than bouldering places that have more vertical climbs.) By the time I was done for the day, I had a bruised knee and a few scraped knuckles. Its definitely more challenging, but still very fun.I really enjoyed how, for some their climb paths, the climbs lead to the top and allow you to take an easier route down. The other bouldering place didn't have that. I thought that climbing to the top was a fun little extra especially after doing a full climb up. Its just nice to take a small break at the top and view the whole gym.The gym also includes a weight and cardio machine area if you get tired of climbing. Their treadmills seem pretty new. Great employees, great facility. I definitely recommend LAB to anyone with at least a good 3 hours to kill.", "date": "11/2/2015"}, {"review_id": "n8aBiHASb-984yaYa4ZkWA", "user_id": "8vNho_9a6crhyVvg4V7lDw", "user_name": "Krista S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "A new bouldering gym in LA! Went to check it out with some friends on a Sunday afternoon. First, this place is located in a dead end and parking is limited so good luck on that. We had to walk a bit since we couldn't find parking right near the gym. It's a pretty sketchy area too so I'd recommend maybe going early if you're not familiar with the area.Entered the gym and it's a decent size. Their waivers are all electronic (you just fill out the form on their iPad) and a day pass is $20 (pretty steep, but its LA and it's new) So if you're a beginner (like me, this was my 3rd time climbing ever) .. this place might be a bit too overwhelming ... granted you can definitely have fun trying to figure out the V0's because that's the lowest they go in this gym. It was a challenge for me, but I loved watching all the experienced people climb and I was able to get half way on some of the V0's. There were a lot of people so you have to share the wall. They closed at 6pm too, not sure if that's their usual Sunday time or not.Overall, this gym was definitely awesome. I love how clean it was, everything was new...the problems were very challenging and the people that go here definitely know how to climb and you can learn a lot from them. The walls are high and the floors are heavily padded (thank goodness). Only reason I gave 4 stars was that their staff wasn't as friendly as other gyms that I've been too (and that could be because so many people go that it's kinda hard to mingle) and the fact that there's so many people it can get kind of intimidating. Otherwise, if you live in the area.... this gym is def. the place to go for bouldering!", "date": "3/7/2014"}, {"review_id": "Geckl_3QnyNXEIy_1s6o-Q", "user_id": "N_SWwvjdM6c3-_g-PuaAfQ", "user_name": "Orville C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time here not as nice as some of their other facilities in the Touchstone family but it's an awesome place to boulder in the middle of this urban jungle we call Downtown Los Angeles. The facilities are clean and in order, the weight room is tidy, and the trek to the yoga studio is certainly an interesting one. There were some fun problems on interesting features, check it out!", "date": "9/25/2017"}, {"review_id": "0RMkK6XaIhPI3bZ2ysQiKg", "user_id": "U1inF2kmrrzAQO3frd0qoA", "user_name": "Noe Z.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Indoor climbing in the big city is a hit! The representative at the desk was professional yet spunky while she repeatedly expressed the need for safety, as I was a first timer.  Check in is a breeze and the facility has a nice airy layout.  There's parking out front, but due to popularity try to get there early.   There's some cardio machines and privacy upstairs which allows newbies like me time to get warmed up and comfortable.  There are groups of regulars and the hipster vibe is splashed on pretty thick but it's open layout and helpful staff make integration a breeze.  Don't be shy in asking for help because everyone there was more then willing. Glad I went and moving forward to going back.", "date": "12/29/2016"}, {"review_id": "EbhhXKQnI6wY1E7tGeVwgA", "user_id": "Gqdykv1mSGCwv8g-AaAytw", "user_name": "Andrew T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I'm updating my review of this place, because in general it's my personal policy to re-review a place if the owner has taken the time to message me and address my concerns, as Remi from LA Boulders has.Like I said in my previous review, I just had a few bad experiences here, but overall love this place and definitely think it's one of the best if not THE best bouldering gym in the Los Angeles area. Hopefully they'll finish up their construction soon and I'll be able to enjoy all their new amenities!", "date": "10/13/2015"}, {"review_id": "Q9uOhULy4oWmHwHAllHLaw", "user_id": "S_HVzTyIyFUnfDcqfOCVhg", "user_name": "Jessica C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Loved it almost as much as my 8 year old.  Dangerous but fun.", "date": "9/14/2017"}, {"review_id": "Z02oEB4c19XEQqmBzhsDLQ", "user_id": "TVBI1LYXTlWeHCtqBSt6QA", "user_name": "Christine Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 6, "funny": 3, "cool": 4, "text": "This rock gym is so good that it really makes all the other gyms I've been to pale in comparison. It's pretty brand spanking new with clean facilities, a lot of different routes, space to climb comfortably,  friendly staff, good fitness equipment,  and nice bathrooms and shower areas! The only drawback to coming here so far is the parking as the lot is tiny and street parking can be packed and gnarly since its in a warehouse area. First of all I just love coming here since they have so many routes to try out! The walls and holds are all new and aren't worn out so it allows you to do harder climbs and have fun without as much worrying about falling. Though if you do fall you have to be more careful since the walls are rough so you could get scraped up. They have a ton of options for every level and for beginners they've even marked off introduction routes to try out first. It's pretty nerve wracking getting to the top and hauling yourself up to the standing area. Then you still need to get down! There's a ton of space so even when it's busy you don't need to worry since everyone gets spread out. Price wise it's $20 for a day pass and additional for rentals. Not bad at all for what you get. The fitness equipment us much better than what you'll find elsewhere and isn't extremely beaten up yet. I also like that they have separate areas for that rather than just squashed into a corner.The staff is pretty nice here and pretty helpful. My friend got injured before even getting into the gym and they helped us out. Being in downtown there was some glass outside that went right through the sole of her shoe and nicked her foot! They gave me some bandages, towel, antiseptic spray and a first aid kit.I really wish this place was close to me as I would love to go more often!", "date": "4/12/2015"}, {"review_id": "6442Ya9eZN_dH5uYmS7mqA", "user_id": "wLh4YepDaBzQ1JMrj5fDzQ", "user_name": "Karen C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 4, "funny": 2, "cool": 2, "text": "Fun routes, as others reviews have mentioned it feels like a playground! Strangers are friendly and even give helpful input on how they were able to complete routes. I really appreciate some of the creativity of routes and the thought put into placement. Bouldering is so addicting because it's not your typical gym with a boring workout, it's a mental puzzle as well!The variety of routes are fantastic, from routes people with zero bouldering experience can do or people who have been climbing for years can still find a challenge. There is also weekend beginner classes you can take with a guided tour around. The only downside is the parking situation. Since it shares a lot with LA Gun Club it's tiny and often on weekends you will often find yourself scoping out sketchy street parking. Carpool please and bring the most compact car you own please.", "date": "3/22/2015"}, {"review_id": "gMUJF02pzEPOfk5pRCTwhw", "user_id": "MMiVCcARVd1IFQiX4IZKaA", "user_name": "Falon W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here on a Sunday morning and had a great time with my friends. Couldn't find a sitter so I brought my daughter along too. It's kid friendly. This was our first time so they gave us a tour and answered all of our questions. The guys at the front desk were super helpful and friendly. We got free shoes! And I didn't have to pay for my daughter (she's 9). Other than the customer service the place is awesome too. The courses range from easy to hard and their categorized by color and number. If my 9 yr old can do it so can you. Great environment. Good music, and a mixed crowd of people. Some dudes came alone. Others like myself came in a group. Everyone cheered each other on and helped guide you if you were stuck.  Fun times. I'll be back.", "date": "12/6/2015"}, {"review_id": "Pybq185bMC053tjipNu6DQ", "user_id": "x8huDYYDWf7IpVqYTTcatw", "user_name": "Juan F.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Showed up a few times BUT $20 for an all day pass when you get tired out in 2 hours is just too much. WOULD BE COOL if they offered a $10 half-day pass !!! But aside from that, very cool gym, friendly staff, very clean. Would def go more often if they would offer a half-day pass. Even a 2-hour pass ! Lol", "date": "5/6/2017"}, {"review_id": "xvC45-HeT7NjdRtj7rQM2A", "user_id": "gWnKCcQiGKoSEkh6DFeNGg", "user_name": "Lauren D.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Been climbing here for a month and love the people that work here. Super friendly and helpful. Gets really busy around 5pm so if you can come during the day, do it.", "date": "6/22/2017"}, {"review_id": "rBu9tgfNTiEEzCYuwXtyvA", "user_id": "5oGReAoRlJTLbz1713f0Ow", "user_name": "Julie K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Likey!! I love how its wide spaced, have locker rooms, showers, and a small gym upstairs. I put minus one star because i don't think they have ropes here. Using ropes at times can be fun. Also another reason for minus one star is because parking can be hard to find so at times you have to go to the other building (back side) and do the paying public parking. Other than that everything is a plus! when you got plans or have a place to go to after climbing you can just shower and get ready here and leave!! I like it so much i've been inviting friends to join!!!", "date": "4/10/2017"}, {"review_id": "qcVPtjTDAQ3FVWEKaJFqwA", "user_id": "3dcFnCZzBZrcKDeIYgiScw", "user_name": "Vicki L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 2, "cool": 3, "text": "Seriously one of the best bouldering gyms I've been to!It's $20 for a day pass and totally worth it. The gym is HUGE! They have tons of V0s and V1s for beginners and even mark out the ones that are best for people who are just new to climbing.They have really fun and reasonable climbs and a huge variety of them too. You can top out here at the gym and walk all the way around the gym and climb back down on the other side.The sick thing is they have a yoga studio at one of the corners where you can top out. They also have cardio machines like treadmills upstairs as well as free weights for you to use downstairs.Definitely one of the most comprehensive climbing gyms I've been to and would def come back. Good date place!", "date": "1/12/2015"}, {"review_id": "sX37EhtuRQ4pxwRaoQXE9Q", "user_id": "k7CjbmFAz43uKKheVMeskQ", "user_name": "Naoko S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 4, "funny": 2, "cool": 2, "text": "This place is really fun. I enjoy the unique climbs that they have but I feel like they should improve on the topping out. If you haven't been to that place a lot then it is a tad sketchy. I really enjoy the staff like Sarah. This place is great all around and anyone who hasn't climbed before should go here.", "date": "2/15/2017"}, {"review_id": "YlxpRya9nSlzs7IQgzSd6w", "user_id": "l3ro_UruNKYzZaUDLgkWyw", "user_name": "Justin O.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "Definitely a solid gym. I have climbed in 6 states and this gym can get busy quick. Like many have mentioned - if you can get out early (before 3) it's going to be better. The other thing to keep in mind is that the routes have a pretty steep grade. I think they set pretty fairly on their ratings but for new climbers it can be a bit tough. It seems like when you first hit the entrance they have the easier routes and you work your way back to harder stuff. The pads here are pretty solid as well. Most gyms have the spring floors with crash pads - this place is one giant crash pad which is pretty cool. They also just re-did the floors in the back gym so that should be pretty nice now. There is also a little normal gym so you can get your last bits of muscle destroyed after climbing. I have seen this usually pretty empty but I'm told it can get busy too. If you want a mix of top rope and Boulder you will need to head to stronghold near Chinatown. For downtown bouldering this is pretty much the only option and it's not a bad one. If you don't want to go alone there are meet-ups as well. My experience is that climbers are always friendly and happy to help you if you ask.", "date": "3/10/2016"}, {"review_id": "xcEQrDjCK-uI8MomjesB1A", "user_id": "mgVXcePWy6zBIXqqDrhzxw", "user_name": "Tim C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 3, "cool": 1, "text": "Damn I just have to give it 5 stars. I finally made it here after ditching my friends so couple times for climbing.First of all I was surprised it is right next to LA Gun Club. Yes now I know where LA Boulders is. It's right next to LA Gun Club! lolI'm positively surprised of the cleanness of this place. No it is really really clean and considering people do physical activities and sweat all the time. Even the restrooms are super clean.The stuff is amazing, fun and friendly. They welcome every new people and first timer (me). And I guess I can say climbing is a culture for itself. Everyone gets along here. They will cheer for you if you're about to fail not making it to the top or give you advises.$20 for a Day Pass. I rather spend it here than going clubbing and wasted. Money is well spent and you get a great body work out. My fingers and arms are still sore. And somehow I feel like if I do it more often I could get a sexy butt.", "date": "2/18/2015"}, {"review_id": "k9qy30KTPrcwqNiJN0a9xQ", "user_id": "le1GRK2G-WrJr5GXFLxSfA", "user_name": "Cindy L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym!  Friendly staff and members - very low-key vibe w/ lots of outdoorsy people.  Fun fact:  lots of tattoos and man-buns.  Looking forward to spending more time here.", "date": "7/10/2017"}, {"review_id": "KlHdNIFVLhTa2pqVga94oA", "user_id": "3_lpzP_RuaAcJCUUcA6fhQ", "user_name": "Andrew D.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Overall, the center is pretty good.  Friendly staff with plenty of space for climbing.  However, it does get a little crowded even on weeknights around 9pm-ish.  $20 for a day pass", "date": "8/12/2016"}, {"review_id": "hoCE4A4e29mFVgixkidKeg", "user_id": "b16ACOfRZoKh2v9raomm9Q", "user_name": "Andrea R.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 11, "funny": 3, "cool": 4, "text": "Best bouldering gym I've ever been too!! This place has so many great things about it, I don't know where to start! Guess the only place to start was right when my friend and I walked in.We could just feel the AC as the coolness hit our faces as we walked in from hot LA. That was a plus since most bouldering gyms that I've been to just keep their doors open. The people working in the front were very friendly and funny. This place I felt was a little expensive though. I paid $24 for a day pass including shoes on a Saturday. As I explored the gym, I understood why. This place was HUGE with so many problems for each type of person whether they were a beginner or expert. If you climb all the way to the top of the problem to the platform, there are couches to hang out which I thought was pretty cool.Machines and weights are also provided at this gym which was very convenient. This place really knows how to break a sweat. Luckily!!..they provide clean towels so you can take a shower which includes it's own body gel, shampoo, and conditioner. While you shower you could put your belongings in the lockers only a few feet away. The showers and bathrooms were so clean and it even provided a blow dryer and lotion. This place seriously knows how to take good care of their customers. I'm so excited to take my boyfriend here on a surprise date very soon. This place deserves nothing but the full five stars! If you love bouldering, this might become your new favorite place.", "date": "6/2/2014"}, {"review_id": "Q776zELZfbYVdC7ABVIfFw", "user_id": "UHdJdmGQCteKI3MVXZTp4w", "user_name": "Guillermo H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The staff often look disinterested and come across as arrogant. Not friendly at all unless you know them personally.  Negative Hipster vibes.", "date": "7/13/2017"}, {"review_id": "egoaNVqNMFTPryuBXq624Q", "user_id": "xhJBOPO5rYnvjhCNce4OHQ", "user_name": "Aidan V.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 3, "funny": 1, "cool": 0, "text": "i was invited here to climb with a group. After everyone showed up, I realized I was the only girl who was climbing with the boys. Guess I'm one of the guys :| never knew that before. Anyhow- there was a really cute guy who works here and was being so nice and helping me calm down because I'm scared of heights. I love the set up. I would definitely come back. I just think it's a bit expensive. However I was only here for 2 hours. I guess if you stay here for a few hours you def get your money's worth. I might just have to bring my son here next time.", "date": "8/27/2014"}, {"review_id": "iN1qoyRg_jXXvc0_eldJbg", "user_id": "iU_oBkPzT8P3SQnpW2yzqw", "user_name": "Peter M.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Went today for the first time! Great gym, tons of creative routes but super soft on the grading. I'm a v4/5 climber and flashed multiple 5's and 6's. Other than that it was a great experience, I'll definitely return next time I'm in LA.", "date": "5/10/2016"}, {"review_id": "h0Z2J60QBVlrfyabOKUsyA", "user_id": "O8eA5xakhjGk55hYhv2v_A", "user_name": "Oscar R.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Love this place. it rocks. they have a yoga studio, weight room and sauna. the climbing rating system is a little different than Cliffs of ID in my opinion. this one is a bit harder. but this place seems to have better variety in terms of bouldering.", "date": "4/9/2017"}, {"review_id": "bzWh06xitzzf7NMPLbaCsg", "user_id": "8cW-bYGkWZgJs4zkLXJLNg", "user_name": "Colleen M.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Stopped by during a trip to LA. If you are a Touchstone member, you're already aware of the quality to expect from another Touchstone gym.LA Boulders fits the bill. Clean locker rooms, towel service, great problems, less-than-hospitable staff the majority of the time, and somewhat difficult parking. ...Just like San Francisco!There was a great variety of problems in this bouldering-only gym, but some of the markings were hard to figure out (some problems crossed paths mid-wall), but I blamed it on my newbness. If you're trying to find parking, come early since you'll be fighting with the gun club for parking.", "date": "12/11/2014"}, {"review_id": "Rd4vcHQVeGEIw8RcK5F3cg", "user_id": "qXHAygN9czCKWfzgLsJR_Q", "user_name": "Young-Han K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "The entire place is dedicated to rock climbing and training. There's a gym and everything is neatly organized. I really appreciated the friendly staff and the walls. There are so many options varying in difficulty. This place is great for anyone from beginner to expert.Early bird prices (weekdays before 3pm) costs $15. The regular day pass is $20. You can also rent gear: shoes ($4) and chalk bag ($1). It's kind of price-y but if you think about it, it's worth it since you have a lot of space and many climbing options and a gym to utilize to your heart's content.I recommend coming with with another person so you're not by yourself, and so that you have someone to spot you. But it's fine and manageable to come alone.What I really like about this place is that around the entire rock climbing area, the floor is entirely cushioned.If you're looking for a cool place to workout or just to do something fun, I recommend coming to this place.I will definitely come back to build experience and try out more options. Maybe even become a member.", "date": "10/7/2014"}, {"review_id": "Jdt9DlyGz0yiOnNtrTC_vg", "user_id": "oI8m444Og2MNiuLeCLnGoA", "user_name": "Chaya M.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went here for the first time yesterday. Good location, seems to be enough parking (but we came early afternoon on a Thursday). Relaxed environment, fun boulders and a good gym to stretch out in when we were done. Clean lockers and bathrooms. Great place to try something new!", "date": "4/8/2016"}, {"review_id": "6EpvQt6fVBQJwk0VJfrw3A", "user_id": "vkOanfRR2xyKlS-4BytXIA", "user_name": "Zach N.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Bit of an unconventional thing to praise them on, but dammit do they deserve it. Via a mixup with one of their employees at a climbing clinic, I enrolled in a membership here unknowingly. After noticing payments coming out of my account, I brought up the issue to their management who refunded me the entire amount. Many places would have the right to tell me off, as it was my mistake to begin with. But they heard what I had to say, and really did me a solid that they frankly weren't obligated to do. The time I did spend climbing there was great, but the service they gave to someone who isn't even a patron really spoke volumes about their character as an overall organization.", "date": "2/20/2017"}, {"review_id": "WUQ6UMvMq6yVS3ZB_FlB8g", "user_id": "Clo-UyNKGxDba1kkpzHF4Q", "user_name": "Billy R.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Tried the $20 day pass on a Saturday afternoon. The place was busy but not packed, you never had to wait for problems to open up. They were a wide range of difficulty but newcomers will be limited. $4 for shoe rental and $1 for chalk (a must). They've also got free weights and a few machines available. Monthly memberships are available. Wish it was a little closer to my home, else I'd probably sign up!", "date": "7/2/2016"}, {"review_id": "8ysVJzW2Dp5V7Fiz99HNFw", "user_id": "DrXAs3alDXIE0qi1MwmTsA", "user_name": "Camille G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Day pass is $20 and $4 for shoes. It was my first time there and I was new in bouldering. There wasn't any instructors there and you had to leant by yourself or see what other climbers did. I was confused about the tag v0 v1under some stones. But I asked the front desk. The lady was nice and told me that the number referred to the easy level and it was a trail with the same color of stones to the top. Had lot of fun there", "date": "3/6/2016"}, {"review_id": "bnlyo1vXwLfpRVABwtE6dQ", "user_id": "M1aP5VQuawbmPUM6Iuwtug", "user_name": "Miki A.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I will be honest. I have never been to other bouldering gyms, so I cannot compere this to others, but I am definitely a fan of this one!I started coming here occasionally last year, and I got a membership this year. A day pass is $20, and a monthly fee is $77, which is not \"cheap\", but their whole community makes it worth it, and you get an access to all locations by Touch Stone Climbing.  Staff and instructors are friendly and motivating, which is why a very beginner like me could decide to get a membership and my own climbing shoes! There are treadmills, cycling machines, and weights to do regular workout other than bouldering. A plenty of Yoga/Fitness classes are available, and you can take it with a day pass.Two cons I can think of.Parking can be very very hard at night.It is addicting!!!", "date": "2/14/2016"}, {"review_id": "jCUAttE9kirbyk7HuvydVg", "user_id": "LPscaTroRt1D_U-9HO36TQ", "user_name": "Billy K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Came here for an event.The location is hard to find depending on which entrance you use.The unit numbers are not easy to read/locate.LA Boulders is right next to the Los Angeles Gun club.Parking:  Free parking lot.  Trying to find a spot is tough. Shared with LA Gun club.Waivers - You can print and your own copy or you can use one of three machines setup by the entrance/front door to electronically fill out the form.Minor annoyance: If the application fails to submit, you might need to re-enter the form.Staff:  They are super friendly and helpful.Ryan gave us an introduction to the facility - explanation of the grading system:0 zero as easiest to 6 being the hardest, padding, and how to fall correctly on their padding.Shoes:  You cannot use regular shoes.  They rent out rock climbing shoes.  Apparently, you need to use rock climbing shoes that are very form fitting.The community is friendly.  Since level are mixed throughout the place, you can have expert level climbers right next to beginners.  I was able to \"borrow\" chalk.I saw a staff member chalking some of the holds.  Since this was my first attempt at bouldering, I spend most of my time on level 0.After several hours, my fingers and forearms finally gave out.I spent too much energy fighting my fear of falling/heights.Pro - tip: Come with some friends.  They can spot you.  You will need someone to help you tell you those holds are.  Looking at the path from the padding is totally different while you climbing and holding on the holds.Overall, this place is a great place to boulder.I would highly recommend.", "date": "2/7/2014"}, {"review_id": "58aE1CbwnYpNAg4XNjwD0g", "user_id": "wTGFI5Mz0hb68Xr22nDWxQ", "user_name": "Miguel G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Nice for LA, but pricey. They had a good summer deal, which is why I finally joined. Staff seems pretty friendly thus far. They have showers, which is impressive even though I never use them. Also appreciate the ample supply of modern cardio equipment and decent amount of free weights.Most of the routes are pretty vertically oriented, which gets annoying when there are a lot of people around. The top-outs where you climb on top of the platform are pretty crazy along the back wall, as the surface is slanted and makes creaking sounds as you walk.", "date": "8/1/2014"}, {"review_id": "3jJojmt_MvQURrMgC4y_gA", "user_id": "NhoeUY5-xMnI_xl9DdNMaA", "user_name": "Chris W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "LA.B is the newest climbing facility in Los Angeles and strictly dedicated to the fine art of bouldering, meaning climbing man made boulders without rope. The members I met on opening night and the amazing staff of LA.B are instant friends and so welcoming. This is probably the most fun you can have while \"working out\".  You work the entire body and have a blast at the same time; Challenging you both physically and mentally. Climbing is my newest addiction and probably the only healthy one I have. Awesome place guys!! I'm proud to be a member.", "date": "12/5/2013"}, {"review_id": "vtf6vZHNP61kl4QcbPQgrQ", "user_id": "RhachS1yTzaK0h2VOLDmZQ", "user_name": "Sam I.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 2, "funny": 1, "cool": 0, "text": "What a fun workout! Popped in with a few friends to experience the Day Pass. Fairly priced! ($20 day pass + $4 Shoe Rental + $1 Chalk Bag-can be shared by an entire group). The staff member at the cash register was very friendly to us while giving an introduction to the gym, the setup, and the general know how newbies might not know. A brief but very helpful and informative tour.Afterwards, we were off to climbing!There are more than enough routes for even a packed gym to enjoy (well atleast it seemed packed to us|| 12:00PM on a Saturday). Difficulty varies from VO to V9. Dont be fooled by low numbers though, I would suggest starting with as many 0s and 1s as possible to get your arms, hands, legs and focus all warmed up. I also strongly recommend stretching beforehand, I noticed halfway through some routes that they were more strenuous than I had expected before starting them. But don't be scared! One of my first timer friends who turned out to be quite the natural made scaling up some V4s look far too easy. Thanks guy.........Thanks for nothingIt's also hard to not just stop and watch some of the experienced climbers attempt the more difficult routes. Some are tall and lanky, some are short and bulky, female and male. It does make you truly appreciate the sport! Respect!For someone who exercises and works out quite often, I found this gym interesting in so many ways! To challenge your body physically and mind mentally in new ways, accompanied by testing your will to climb to the top, made this truly an experience! I think I caught the bug!! Cant wait to be back...", "date": "8/17/2015"}, {"review_id": "KhL2RgRaD8V-HZhearFCEA", "user_id": "0fcb_Cwc9MfAgY3rf0g5Qg", "user_name": "Dina D.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. :(The sad face is because I don't live in LA. haha. I came here twice in one week, it was THAT great. So many walls to choose from, with a variety of styles of bouldering. Some sections you can even top-off, which is great practice for outdoors. The ratings are a bit soft, but no worries, that made me feel so great about myself climbing 4's and 5's, haha. It was great. The prices were reasonable, and everything was clean, including the mats. There were no crazy kids running around. There were multiple bathrooms available, and they were all super clean.My only complaint is that the gym/weights section was a little small. I had to wait 20 minutes for the squat rack to open up, but it's okay, I climbed while I waited! :)", "date": "2/22/2016"}, {"review_id": "_jZoFAwV-2Z3JRwHXMH3Og", "user_id": "L5hwGyicqFPZj2X5PrpHKQ", "user_name": "Sharon J.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "My friends and I really wanted to go indoor rock climbing and we found this place through yelp.Let me just tell you that at the beginning, we had a lot of trouble finding the location. And it's kind of in the sketchy part of DTLA and it was a little creepy walking around the block. Thankfully a nice security guard was able to point out our destination. You'll have to go inside a parking lot and it's located on the back side of a building. I really had a fun experience at the LA boulders. It's very clean and the workers help you a lot, especially if you're a newbie. There are different \"courses\" that you can try out- V1 is the easiest I believe. It's definitely a workout but really really fun!It's a lot of fun when you come with your friends because trust me, your arms will fall out on you super fast. Especially even you're not athletic like me hehe. But coming here with your friends will make your workout a lot more fun since you guys will have fun competing against each other and it's nice to have someone encourage you to keep going.Definitely a great place to check out!", "date": "8/20/2015"}, {"review_id": "es6Vb_WXfowSKKSpoYBRqQ", "user_id": "fTSoxCqftYfnMqxU2lDTJg", "user_name": "San T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Purchased the early bird special before 3pm and really got a whole kick out of it. There are no harnesses, instead the walls are approximately 2 stories in height and a good cushion to fall on. They also had a very nice small gym which I liked a lot. I will definitely visit this place again.", "date": "1/19/2017"}, {"review_id": "LIGLsDDXYzj4qmCOdk5dWw", "user_id": "7Ozec2a_GOq51XosLfmFCw", "user_name": "Ariel Z.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Firstly, staff is Very friendly and will help you with anything from questions to techniques. The facility is clean and well maintained. I was there for my first time today and had a blast. I took the intro to bouldering class, 25$, which included gear and day pass. The instructor was patient and provided constructive input.I highly recommend checking this place out!", "date": "3/6/2016"}, {"review_id": "01zkvdx-cgKLO1Ull0cozw", "user_id": "jc-djmoWBEMZEPnplUzUhA", "user_name": "Travis T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Awesome place to climb. All the staff is very friendly. Clean locker rooms, nice weight room, and challenging problems of all levels here. Parking here can be difficult, but once you find a spot it's worth it.  I'm taking a 4 lesson course on bouldering technique.  So far it is very helpful. My instructor helped me complete a few problems that I never would have been able to do without his input.", "date": "7/13/2016"}, {"review_id": "NInmdTs9i1Aim3CNWkTFfA", "user_id": "MBvC-NkoMUbN5Kh9BWr8NA", "user_name": "nancy r.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "After two preview nights and watching the transformation of LA. Boulders I had to  finally visit the place. I walked in on a Tuesday around noon for the matinee special which is $15 dollars in comparison to the regular $20 bucks which is steep for a day pass but then it is Touchstone. It is a premiere climbing company from up North. :) The staff was super friendly walking in. Filled out the waiver and checked in. Immediately in front of the desk you see the slab wall to the left and one of the major \"boulders\" in front. To the right are the stairs that take you to the locker rooms. Before you walk in you will see a cardio space which only had elliptical machines. The locker rooms still looked unfinished since amenities lacked such as toiletseat covers and shampoo/conditioner in the showers. (Don't know if they will be offering but would be nice!) One major gripe was lack of cubbies. When it got a bit busier later on it was a huge mess of equipment and shoes. I'm sure they will be installed before the major opening tomorrow. Cool thing was the water fountain that dispenses directly into your bottle. Speaking of water, since the entire climbing space is padded they won't allow any liquids onto the space. Which is good, because the padding is the SICKEST part of the space! It's like a mix of tempur-pedic and climb foam. So squishy and I couldn't have myself from making flips and somersaults like I was in the WWF. Now about the walls, I was worried about losing some skin on these \" Walltopia \" walls but surprisingly enough I only had a few souvenirs. I was amazed at how texturized yet still gentle it felt on my feet. My shoes definitely stuck on the walls with minimal effort and can use the wall much more than other walls I've tried. That's the beauty of this wall - curves are streamlined and yet offer a nice challenge with the setting. But be careful of your shoes, the walls will definitely do work on the soles and tops of your shoes. Topping off is one of the most enjoyable parts of this place. Nice practice with what is essential outdoors. Also really liked that they offer down climbing areas. The height with some climbing spots is intimidating yet I didn't seemed too overwhelmed because of how secure I felt with the padding. Holds were good, yet some felt greasy. Also no volumes to be seen? Perhaps the beauty of this place is to emphasize on the boulders themselves with the curves? Setting was soft but then I was climbing with tendonitis so it was nice sending some problems I otherwise wouldn't climb at my home gym. Love the challenge of projecting V3s and V4s.The approach to some problems are interesting and made the trip really worth it. Getting the aesthetic of this place and really was fun. Overall pro/cons. Pros Padding! (best padding I've had the pleasure of falling on!) Water fountain. Towels. Walls are sticky! Little Tokyo around the bend for food. Cons:Lack of parkingLack of ammnenities (unless changed until opening) No cubbies (unless changed until opening) Slackline in the middle of the climbing area (distracting) Mat padding is slightly dirty? For being open for about a month, needs upkeep. Would come back again since the place is reset for the comp/grand opening tomorrow. Also be advised that tons of new climbing places are popping up in the LA area this year! Yayyy.", "date": "1/24/2014"}, {"review_id": "nYY-1f4IA3FH4F32NueNmA", "user_id": "LK6I0Qlat3_SGk8kLRUsOg", "user_name": "William C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is the best bouldering gym in all of So Cal. They have the best holds, the best walls, and the best facility. The only negative to this great gym is that there is no parking during peak hours. Problems are changed every 2-3 weeks. That is awesome for the crazy hard-core pro climber. However, if you are a novice-intermediate cllimber (like myself) then you just become frustrated. The day that you put on your game face and develop the resolve to finish that onnnnneeeee problem you've been working on forever is the day they take it down -_-", "date": "8/15/2015"}, {"review_id": "l0BrkqArF-zJ8AM-pqZjGg", "user_id": "0AP8keIdzR7exbF8lLvufA", "user_name": "Jonathan K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "My first time and I have to say it was a very enjoyable experience.  The sign-in process was very simple and easy.  The rental equipment were in very good condition.There seemed to be a LOT of people but there were equally a LOT of rock climbing real-estate -- enough to have everyone comfortably in their own areas.  You had a range of experienced climbers there from the inexperienced first-timers (like myself) to those who you could tell were seasoned climbers getting some practice in for their weekend climb.I'm new but they seemed to have a lot of routes ranging from very easy to hard.  They also have a small gym on the side if you wanted to sneak in some regular gym work outs.  The gym also has an upstairs section were you can hold special-event gatherings.", "date": "7/9/2015"}, {"review_id": "8FXt2guoZ7eT6gfZxHTgIQ", "user_id": "qwONwL783a0hvPQl2TVWjg", "user_name": "Anthony N.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 18, "funny": 13, "cool": 16, "text": "I just wish the employees were a little more friendly and forth coming with instructions.  I paid and I was abandoned lol I had to ask about everything.  I felt like I was annoying them.  In the end it was fine, but I felt like a general overview would have been nice.  I liked the set up I just wished there was more easier levels cause they were super hard.  Definitely not a lot for beginners.  There's like one or two places to go up and come down for beginners.  So I used them to safely go down, but people there are nice and will help you out.  Chill spot, but my forearms hurt now.", "date": "12/6/2014"}, {"review_id": "SUo0j9VgR1JKnM8w929Ykw", "user_id": "75njdqBf4YFxvDxAeGCUKA", "user_name": "Justin B.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I checked this place out while visiting the LA area over the holiday. It's awesome!First of all: it's huge. There are tons of problems of varying degree with enough variety that I never got bored. I can't speak to how often they change the routes as I only went twice within the same week, but I will say that on my second visit they had somebody up and changing one of the walls.Staff is very helpful and stoked to see you there. Big plus!The locker rooms are really nice. Super clean with a row of private showers and good sized lockers to stow your stuff in.Don't go here expecting top rope or sport climbing routes. There aren't any. But anybody who knows how to use that crazy new invention called \"the internet\" should be able to figure that out on their own by checking the website.  Seriously, if anybody complains that there is only bouldering at L.A. \"Boulders\" then you are a boob. This is a GREAT bouldering gym. I will definitely return when I am back in the area.", "date": "1/3/2014"}, {"review_id": "Vl1VeYWFr2QiqxalJfZVxA", "user_id": "IIFUSAByx3fLmpe4h8tJ4g", "user_name": "Nitar L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 6, "funny": 4, "cool": 5, "text": "2015.. this is the year I get ripped! Katie B and Jennifer T will make sure I hold up to that promise.Us three ladies ended 2014 (yep, NYE) on a high note (literally, the walls are high!!!) being active on this adult playground. We didn't receive much instruction from the guy at the front except for how to fall correctly without injuring ourselves. It helped, but was harder to apply than I thought.It wasn't until the 1-hour bootcamp started did we get some instruction for how to climb. You've got to use your hips and legs! Who knew? I sure didn't, that's why my arms are still very sore from my experience.2 hours of climbing and bootcamp was totally worth the $15 entry and the $5 shoe rental. And the best part? Muscular eye candy galore! I can't help it, I have a thing for strong arms! This place will be seeing more of me this year, for sure!", "date": "1/2/2015"}, {"review_id": "RnvKGnUQWHg94jVOQ6Pu9w", "user_id": "SIZOfo7jTjCXnL8ZtpM2aw", "user_name": "Lucy Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 6, "funny": 5, "cool": 5, "text": "This was my first indoor bouldering experience, and I have to say that I liked it a lot!They share their parking lot with the gun club right next door (note to self: come back to go shooting!), so the lot is big, but it's also pretty full.  When you walk in, you put in your contact info and sign a waiver on an iPad at the door, and then if you need to rent shoes or any equipment, they take care of you at the desk.The girl who helped me was very sweet, and even though my friends were already there, she offered to give me a quick little tour and safety lesson.  Since it was my first time, I appreciated that!  She pointed out the levels of routes, and explained to watch above me so that I wasn't in the fall zone for anyone above.  She also went over the proper way to fall off the wall.  Since the whole floor is super thick padding, it feels super safe!There are bathrooms and cubbies on the first floor, and lockers upstairs in the separate mens' and womens' locker rooms.  I shared a cubby with my friends, and it seemed like that was pretty much what everyone else did there.  There's also an area upstairs with cardio machines, and a weights area downstairs.Climbing even the beginner routes was a bit challenging, mostly because it felt like I was up really high.  It was neato that when you got to the top, there's a couch and table set up in a corner, like a little living room, with board games even!  We were there for only an hour or two, and afterwards I was SO SORE.  I definitely used muscles that I don't usually use!There are people of all different levels climbing, from crazy flexible Spiderman kids to beginners like us, to crazy Spiderman adults.  Really fascinating people watching, that is for sure!For $20 (day pass) plus $4 (shoe rental), this was a great workout, and a lot of fun!  I don't know what other indoor rock climbing gyms are like, but this was a great temperature, and wasn't smelly like other places I've read reviews for, so I'd gladly come back!", "date": "11/30/2014"}, {"review_id": "pjQK5UhnF8yyfn59F9eTUQ", "user_id": "UqbBVEYVKMZkbbDltIGVDg", "user_name": "Elijah W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is literally one of my favorite places on earth. If you have kids that you want to stay active bring them here. If you hate the robotic monotonous vibe of gyms like planet fitness go here. From yoga to a bunch of other classes they have you covered. Also if you still want to get a good ol' fashion work out on they have equipment for you. The music, staff and clients poetically make this place great. So climb away and if you see me we'll climb together.", "date": "9/20/2016"}, {"review_id": "mcfpVmVV5l4QuEpuqelzNA", "user_id": "ZmADVR_SGlj6LtqWrSH2GQ", "user_name": "Stephanie C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter's got me into climbing at LA BOULDER.  Staffs were very professional.  Climbers in different levels are willing to help,  when you get stuck on a certain level.   Over all, it's a great place to get some exercise and fun,  at the same time.", "date": "10/26/2015"}, {"review_id": "uRU3cHUVxh_1_8Q37_h32w", "user_id": "hCl77Kb1IMUP83L07l1DDg", "user_name": "Kazuaki J.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "It's no secret LAB is one of the best bouldering gyms in Southern California.One thing to keep in mind.  It's a good idea to wear pants and not shorts here.  The walls are covered in sandpaper like grip tape.  It will easily scrape skin off if you fall or rub against it.", "date": "1/28/2015"}, {"review_id": "rwuzUe1rV1VQfDgojxaYpA", "user_id": "klnalh5IKTDKMo96S1cYWA", "user_name": "Lex E.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Parking can get super tricky, especially when it gets dark.  Just give ample time to find a spot.  They have two workout areas, pretty sure the upstairs is cardio and the bottom area is for lifting.They also have bathrooms on both levels, with the upstairs with showers too.Absolutely love this place.  Everyone who goes here is super friendly and the staff are very helpful and accommodating.  Might consider buying a membership here because they have intro classes basically every week and I saw a flyer about cliff diving.", "date": "6/26/2015"}, {"review_id": "l9Ifi3mtYMYQyS3ygSqfrg", "user_id": "YiJQSKn5BrtWwRhSLBlw8A", "user_name": "B K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is the Mecca for bouldering in the LA area. Very nice facilities. Well thought out routes. All the training and workout equipment you need (and 10x more you don't). Touchstone masterpiece in DTLA", "date": "7/12/2015"}, {"review_id": "yaNfmp6NAjjKBG1W0qCdwQ", "user_id": "QWfyxUKBXDcUYCjUSbbEVw", "user_name": "Juan B.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I went again today for the first time in many months and I have to say that credit to the settters at this gym for their fun problems. I climb a lot at my local gym (Top Out Climbing) and it's so incredibly refreshing to climb something that is both fun and hard work. It's nice to see the setters for including problems that rely on technical skill and being precise with movement.  So great job guys!Again, I think the holds could be a lot cleaner as sometimes the chalked up holds are difficult to determine if I'm going the proper route.That's all I got to say and I wish I lived closer to LAB. For any experienced climbers, this is a nice gym I would recommend. As my friend would describe, it's like Disneyland for bouldering.", "date": "5/10/2015"}, {"review_id": "UGzecY38gDVDGqeXgAsYyQ", "user_id": "9v83UksZrkThOiE584GRBQ", "user_name": "Oulie T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 6, "funny": 6, "cool": 6, "text": "Great bouldering gym. Awesome Staff! Late one night my friend accidentally left his keys to his ruckus in another friends car and they allowed us to push it inside the building and kept it safe for us until the morning. Thanks for being so cool guys! My only gripe about the gym is that you have to downclimb everything once u get to the top. Sometimes I just want to walk off after exhausting myself up a route and don't want to deal with down climbing something even if it's super easy. I was spoiled by other gyms and their walk offs. I was surprise LAB lacked that feature considering it's a bouldering specific gym.", "date": "5/6/2014"}, {"review_id": "VWVspTS4ATreSTa_TFY_Zg", "user_id": "Yhm_6eQIpvDOhVwFmNX_xg", "user_name": "Eugenia L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "I'm not a pro rock climber but rock climbing is definitely good exercise! This place is only for boulding. They do not have those ones with ropes. I'm still super beginner at rock climbing.. still at V1. There was a lot of people here on a Friday night. It was $20 for a day pass and $4 for shoes and $1 for chalk. Some V1s were more difficult than others. V0 was fairly easy for me. V2 was pretty impossible for me. Need to work on that arm and upper body strength! Everyone that went here the night I went was really good! When I got tired, I was just observing others boulder. There were some upside down ones and I was just watching a group do this particular V7 one that went upside down. It was amazing to see him accomplish it! It looked so difficult. It definitely gives you motivation to try harder. Everyone is very supportive and it is not embarassing if you cannot do something. I also love that they have quite a few gym things in the workout corner. They have a squatting rack which my friend and I used after rock climbing. I was sore for at least 3 days!", "date": "12/15/2015"}, {"review_id": "8_YLhVcOZjocV3Wv6TSHWA", "user_id": "PDkhIaG9ZIWPwUEtRNeXNQ", "user_name": "Johnny H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A really cool place to get a full body workout and to take your lady out on a date! There's some nice restaurants right down the block. But be careful, skid row is right around the corner as well. Overall nice staff and a well maintained facility. Will be back again soon!!! Oh, and make sure to buy chalk!!!", "date": "2/7/2015"}, {"review_id": "E_vRj0sg7I0l0irmc7Wb1w", "user_id": "zDaucGvJCuM3_PsGc1jA2w", "user_name": "Ian A.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym.  Movement is fluid and tricky at times which makes for great problem solving.  I just wish the grading system was more  consistent. I flash v6 sometimes and get stumped on v4. Some v3's are harder than v5. Other than that the gym is great.  The setters set anything from really powerful overhanging problems to delicate and balance style,  beta intensive problems. Parking is crappy. But if you have psychic abilities it shouldn't be a problem.  Unfortunately i don't have that gift and usually end up parking far and walking.If you come after 5, be prepared to find a packed gym. You might have to wait in line for fresh problems.  But the great thing about bouldering is the camaraderie  i guess. The main reason i go to this gym is because of the future plans of touchstone to have multiple gyms in Los Angeles. I used to be a sport climber...not sure what happened.  Waiting patiently for cliffs of id to open.", "date": "7/13/2015"}, {"review_id": "9lbz6d5rhqtMfq4hpi2Rxw", "user_id": "t21GS-Mq9S0H0cvfYUk8xw", "user_name": "Cammie S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 5, "funny": 0, "cool": 0, "text": "LA Boulders is definitely the best climbing gym for bouldering. The facility is clean, well kept, and everyone who goes there is friendly and helpful. I would recommend this gym to anyone who is looking for a great workout and wants to challenge themselves. The gym has a great community feel with people who are ready to help you and encourage you. -Customer service was professional, friendly, and extremely accommodating. Ryan at the front desk helped me to fit my shoes perfectly and get me started. He explained which routes I should try first and gave me some great tips for climbing that helped improve my technique. -Plenty of routes for beginners to extremely experienced climbers. You can find a beginner route on each of the walls and the tape and rocks are easy to follow unlike other gyms I have been to that you struggle to stay on route because the tape and colors aren't clear.  - Facility also has a full gym including free weights, kettle balls, and that stretchy machine thingy that I can't remember the name of. They also have climbing gear that can help you improve your climbing ability and strength. Overall, this is the best gym I have been to and if I lived closer I would definitely get a membership. The day pass for $20 is definitely worth it though and I can get in a great work out and spend a few hours there. -", "date": "7/2/2014"}, {"review_id": "0ETYPDtXaWg2GNcGS53pyA", "user_id": "dqXnIDr6XMr2aMbA02sSRw", "user_name": "William H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "What fun in the heart of LA'a downtown Loft district! Shockingly, it is literally is adjacent and shares walls to an indoor gun shooting range! By the way, you can buy really cheap bottled water ($0.50) at the gun range since the climbing gym doesn't sell water! The climbing gym is a lot of fun, reasonably priced for first timers and could get you hooked if you want to get a great workout while meeting new, like-minded, fitness affectionato friends! It is not the place for the faint hearted or those who may be fearful of heights or suffer acrophobia!", "date": "12/6/2014"}, {"review_id": "kMCDNK2goI102eo_DWjsPg", "user_id": "DGszSnRNWoAOtD8WGf9wpg", "user_name": "Kevin C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "I have been bouldering in gyms for years now and I have to say this is the nicest gym I have been too! I have been to Rockreation, 3 of the Hangar 18 locations, The ARC, one in AZ, and one in WA. What makes a climbing gym good is so much detail but from my two trips here I have seen that these things are covered. Clean gymA/CFriendly StaffInteresting Problems with fair ratingsReasonable PricingClean Bathroom (with soap and stocked towels or drying machine...shame on you ARC)Friendly vibe from membersPro ShopClearly Marked RoutesI have to say the parking was a little challenging on a Sat but other than that I enjoyed it plenty. It's been a while since I'd been climbing because my local gym is just bad and gross. I look forward to them opening their Pasadena Location SOON!!!", "date": "7/16/2014"}, {"review_id": "EgLqdZeWOirjPblpJG9oZA", "user_id": "JQGtwZuIQZuDpHtU8HRPxQ", "user_name": "Cuong T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 5, "funny": 1, "cool": 0, "text": "If you're looking for the only climbing gym...- in the entire county that has A/C...- w/ all sorts of bouldering problems neatly set on Walltopia walls...- that is larger than nearly every other climbing gym in LA, OC and the Inland Empire of just bouldering walls...- that is the largest bouldering gym in SoCal (and second in the state, as their corporate sibling's largest is in SF)...- that has more bouldering problems than anyone else except for SF, with fitness equipment, free wifi, towel service...... then you've come to the right place.I travel 45 miles using public transit in most instances to climb here, as I am a member. Don't get me wrong, I support and also have a membership to Hangar 18 Climbing Gyms too, but I split my time almost equally between H18 and LA Boulders. I like solving all sorts of problems from different setters. LA Boulders is as nice of a bouldering gym that money can buy membership with, in SoCal. Enough said. See you there.", "date": "5/7/2014"}, {"review_id": "l9OJ_7-UNQMBAaF4fkifkg", "user_id": "_Az5OH4GOglEfvNh7FRDqg", "user_name": "Sam H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Of 20 or so gyms Ive been to this was my favorite. Setting was amazing which is my top priority and although it got a bit crowded the layout is great.  Seemed like a good community. Also the life size Atari replica route blew my mind.", "date": "6/14/2017"}, {"review_id": "ZGRdI28PErj9BF9YnKijNQ", "user_id": "WVeUNnFh6tSRMpJelZDVbw", "user_name": "Won K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 7, "funny": 0, "cool": 0, "text": "I shopped around yelp to see where I could go for a light session of climbing/bouldering on a lazy President's Day afternoon. This was the perfect place for an amateur like myself and his overzealous gf who was ready to try some V5s on her first trip. The equipment rental and day pass is super reasonably priced ($15 if before 3PM on wkday, $20 otherwise) and $5 for shoe rental. There is lots of wall space with many different levels of difficulty to keep you challenged and entertained. The people there are super enthusiastic and having a great time so it's a good environment with a positive vibe.In response to some of the other reviews, the facilities are coming along nicely. The locker rooms are super nice with showers, lockers (bring your own lock or borrow one in exchange for your ID). They even have treadmills and ellipticals on the second floor between the men and women's locker rooms. Oh, and they have free parking in the back. The lot gets a touch crowded but the fact that they even have the option of free parking is amazing for DTLA.Loved my experience there, and will definitely be coming back.", "date": "2/17/2014"}, {"review_id": "We4nx7Jf2qm0QG5IljLMkQ", "user_id": "Csp-ElOn-8-fHReYt4KtHg", "user_name": "Maximus S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I really like this climbing gym. it is always clean and well maintained. They change the different climbs regularly as well. I like how their walls are much taller than some other gyms as well. I also like how you can go in the morning and then go again at night, all on the same day pass!! It is the best for Tuesdays and Thursdays. I did not give it 5 stars because they do not have top roping, which is only a minor drawback. If I could give half stars this place would be a 4.5 for sure!", "date": "5/10/2017"}, {"review_id": "FPnaTllC6sf-47SeALrP4A", "user_id": "FPSmLAW14ks_dOukXCqvlA", "user_name": "Jan Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "kinda awesome. my soft, milky hands have finally developed the callousness of work and life and my foot now has some weird fat deposit from being smashed up against the stucco-y, sandpaper-y wall one too many times. that said, hubby and i can't wait to go back on buddy day, and hopefully soon, get our own memberships! parking is free although can be difficult at times, and right next to la gun club!", "date": "12/2/2014"}, {"review_id": "OtrfoVSMRP_KLCF2vxMPgw", "user_id": "hCsXmGkXa6WiUO65VIqJfw", "user_name": "Arin R.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here as a guest and been a member ever since (18 months now). Best workout ever. I've never climbed outside or with a rope, but I am strongly considering it now.", "date": "5/6/2016"}, {"review_id": "FC9MwgqkIl8Fnp6rjM4s6w", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE THIS PLACE. It is the best bouldering gym I've been to by far next to The Factory. I've heard so much about this place and finally being able to go I was definitely not disappointed. The gym is strictly just bouldering. But it offers a massive variety for all ages and for all levels. They have flat, slab and over hang walls with roofs. As well as an enormous arch and other types to provide a better workout. There is also certain areas after you top out and mantle to down climb at so look out for those. They have a good area for a gym and to get a regular workout. The staff is pretty friendly and nice the area is spacious and gives plenty of room for people to climb. I say the only down side is that it can be a bit pricey. My friends and I got there before 3pm and on weekdays it's only $15 if you are there before hand. Shoes cost $4 extra. Fortunately as a climber I already have all my gear so I normally just worry about paying to get in and climb. There's lots of cubbies to put your stuff in and even has lockers upstairs as long as you give them an ID of some sort. I wish I could be there more often but given the drive it can be a hassle. I can't wait to come back again and work and project more climbs!", "date": "12/30/2014"}, {"review_id": "-s2EOGXmPV4S-N1Sga7MwQ", "user_id": "jrcUx5Axb0zIt0Dp6FgmvQ", "user_name": "Ashlee A.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun boulder gym.  Ratings were accurate and problems were set in super fun ways.  A lot of neat features and the local climber scene is way friendly and supportive.  Will be back when I am in town again!", "date": "12/26/2014"}, {"review_id": "eJ-3Nl9lCrh9Ybuuy0Ks8w", "user_id": "SbKA6QmnS_xK5RQLjqbVmQ", "user_name": "Matthew Y.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 5, "funny": 1, "cool": 1, "text": "First time I've reviewed anything. Keep in mind, I visited at 9PM on a Tuesday night and I am not all that good at climbing (I consider myself pretty shitty). First its location - in LA, ease of travel and parking are two musts for success - the gym is not far off the 10 and parking is quite abundant at least when I visited. The gym itself is smaller than Dogpatch but for what it lacks in square footage, it makes up for in pure creativity. With La.B, Touchstone packed an equal if not greater punch to its counterpart in a much smaller space; it uses the entirety of its set up with great efficiency. The gym also does not dwell too long on any one wall type - you don't run into a wave stretching from one end of the gym to the other; the walls pose challenges unto themselves with level changes and progressions that make even a simple problem a bit more technical. The route setting is comparable to Dogpatch of late - challenging sends that do not simply value strength but a proficiency in movement. The setters also give you a lot of variety along the V-scale. The thing I'm most happy about, and this may sound OCD, is that they use tape marking instead of hold color. I know, \"who cares?\" Apparently I do as color holds seemed to have been the norm in Southern California (Sender One, Hangar 18) but that's not the case with La.B. The time I visited was perfect - the gym was practically empty. I expect this to change as it did with Dogpatch once people start to hear more about La.B. Also, they do not have the free weights up and running yet - they do have a nice area set aside against the front windows - plenty of space for a couple racks and dumbbells (it's probably twice the size of Mission Cliffs' workout space). Treadmills and cardio machines are good to go upstairs though. All in all, I look forward to making a weekly excursion to La.B.", "date": "12/19/2013"}, {"review_id": "NbiB2xwYRx_UvdK783lQ9A", "user_id": "Q6kVSyC4jdzkZHkkjTehrQ", "user_name": "Forrest N.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym and tons of problems to try out. Everything you could ever climb is there. Most staff was helpful and friendly. Climbers were also friendly.Great place to get a good session in.", "date": "3/23/2015"}, {"review_id": "M_X2w4I_20APEDiDJKfFAQ", "user_id": "FRGmk2O9S8Fx63JDLZTj_Q", "user_name": "Agustin G.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "If you like bouldering, this is the place for you! It has a bunch of walls where you can climb. There are 8 different difficulty levels (V0 - V7). They are all labeled. This is a great place for both beginners and advanced rock climbers. If you make it to the top of the walls, there's a cool little lounge area with couches, along with an entire yoga areaGood place to go. Try it at least once!", "date": "3/2/2015"}, {"review_id": "5uxMgVB089gJTc5c30QZGQ", "user_id": "lKbujnnvTV3HvLRsBIv4nQ", "user_name": "Germaine T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This was my first time here (and first time bouldering) and I absolutely loved it! The environment and people are so positive. There were both beginners and experts here so there's no need to feel like you're the only one who doesn't know what to do(which I did before entering). Plenty of walls for you to climb and plenty courses for every level. The guy at the front desk (I think his name is Joe) was super cool and helpful, letting us know the basics of it all. FYI, I have never been bouldering before and I have absolutely no arm strength whatsoever. I'm the type who gets so tired and bored after lifting weights & feels somewhat weak and intimidated when I'm struggling with 10 lbs while everyone else is at 30+ lbs (I can't even lift the bar alone) that I don't even bother working on arms at the gym. With that being said, my arms are currently so weak and sore from all that climbing which is GREAT. If you don't like working on arms at the gym, this is a great place to build up some muscle.I will definitely come again! Possibly even considering the membership since it's so close by", "date": "11/18/2015"}, {"review_id": "GvA8yXDCiiUV4JeVYhw7mw", "user_id": "zkRQPMS6DmFsKt9QfaGmlQ", "user_name": "Alejandra F.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is fun. To bring anyone whenever you feel active. The prices are good it's cheaper earlier in the day. The front desk lady is so nice and so polite I don't know her name but the one with short brown hair she's so helpful. The vibe overall here is great.", "date": "1/5/2015"}, {"review_id": "k-KyG5AmmCy0K8DLw2C5Kg", "user_id": "vhxuuI73e6D6uCTHPasW4A", "user_name": "Xander L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to climb - lots of routes, really chill and lots of fun.  Staff is really great (Kevin is very cool) and very helpful.  Really like climbing here!", "date": "4/16/2016"}, {"review_id": "2kG6NT68R3CY8nsxnfDRWQ", "user_id": "8EF7CJJM0kT4r8RtdUao1A", "user_name": "Tatsu I.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time trying our indoor bouldering and now I'm hooked.  I took a beginner's class and Evan the staff taught me everything I needed plus extra to start climbing. Thanks dude!  I would definitely going back there in regular basis.", "date": "12/8/2014"}, {"review_id": "WkveeOG-IB6djVL6Tzlgqg", "user_id": "QAT5_N-lY-_iA7lx3EDtZA", "user_name": "Drew M.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 4, "cool": 0, "text": "Sets the bar for indoor climbing in LA. Tons of terrain and spacious. More climbs than you can possibly approach in one night. Staff members are low-key, share a love for climbing yet with zero of the pretentiousness that plagues other gyms.Key Features:- Lots of varied terrain- Highball climbs- Fresh (new) holdsMinor Gripes: - Membership card is ugly- The logo is poorly designed- Walls seem 1/2 set... could be due to current lack of holds or a lack of regular setters- Parking can get crowded- Membership card is uglyRecommendations:- Create an instagram (or twitter) account that only posts the new sets- Carry 5.10 dragon shoes- Buy chess set and put it atop main boulder for resting chess matches- Create a new membership card that isn't ugly", "date": "1/10/2014"}, {"review_id": "D3GR1FbcuRqB92zc3kcnVQ", "user_id": "fPB-rGvxPgVmX-nml4TCsw", "user_name": "Alex P.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Biggest bouldering gym in all of LA, kind of a big deal. Currently they are working on adding in a full regular gym as well as yoga classes, so stay tuned friendsEveryone I've met here is super friendly, the whole place has a great vibe. Even though there are people here that obviously kick ass at bouldering, I don't feel deterred for being a n00b. A few times other people there gave me all kinds of advice for freeMy only gripe is the price: $20 for a day pass, $100 for a month. If you sign up long term you get something around $66/mo. That being said, the neighborhood is up and coming so I would imagine rent for such a large building is not cheap", "date": "2/19/2014"}, {"review_id": "_1NOHEJQ6tnuCazC9K-2_Q", "user_id": "NgdLEbJhC-xvZEMXpmDDLQ", "user_name": "Akello S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "What a fantastic place!   Me and a couple of my buddies visited just last night.  We had a ball.   The facility is super dope and spacious, the staff is friendly and helpful and everything ran like clockwork getting started    Other members were helpful and encouraging and an overall spirit of being \"active\" and \"encouraging abounded.   There were all kinds of different walls and physical challenges, a locker room and a weight room.   It is truly a great place to get your active on!   Thanks for an awesome experience. (It's right around the corner from Yrth Cafe and Barker Block if you are familiar with DTLA Arts Dist.)", "date": "9/9/2015"}, {"review_id": "ILXJ6QRx9JOBgnj5eBwmpQ", "user_id": "3UaVN3KNVJCMIIfRowawJQ", "user_name": "Brian T.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Man, an AC climbing gym in LA. I know it's spoiled but whatever. And I like that the easy routes have soft grades. I want  non-climbers to think I can climb V4. Very interestingly laid out problems with a variety of styles. Only gripes - they nickel and dime members for shoes and chalk bags. The hold manufacturer they use - not the amount of variety found elsewhere.", "date": "5/12/2014"}, {"review_id": "gUdw1qeTXzcrDRK0fCYK9w", "user_id": "_xlVo9IOSOl-0RarmXp6hQ", "user_name": "Daniel H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Dope rock climbing gym. The facilities are impeccable. Clean and well-maintained. They also have gym equipment that you can use in a side room and upstairs if you are trying to get a well rounded work out overall. Price is $20 for rock climbing, $4 to rent the shoes, and $1 for a chalk bag. The walls have expertly placed hand and foot holds and there is a plethora of walls with varying degrees of difficulty routes you can try. They have the whole floor padded with soft cushions. Decent amount of parking in the lot. If you just want to hang out inside there is no entry fee and you just have to sign an electronic waiver at the front entrance. Another plus is they play great music throughout the gym.", "date": "12/17/2016"}, {"review_id": "wvrCCUPvH5n1nmCT72JTWQ", "user_id": "tMu-ymSmfx1Ef6yjdjRndg", "user_name": "James C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 2, "funny": 0, "cool": 1, "text": "I took my 3 kids to LA Boulders last week when they were on spring break to give them something to do, we arrived at 2pm and were done in an hour.  The fee is $15 per person so for $60, we got something new and it was physical.  The staff is friendly, they give you a 5 minute safety lesson and point out the areas where you can climb.  Other than me being with my chidren, there is no supervision and no safety harness as you watch your kids climb up to the top at about 12'.  12' appears much higher once your up there so it is thrilling when you have to figure out how to come back down.Parking is a bit tight since there are many other businesses that share the same area so going there off peak times is definately to your advantage.  The area itself is not the greatest but hey, you're in the city of angels and this is expected in this industiral zoned area.  I suggest that you wear loose pants, we wore shorts and our legs got scraped up.  The place is not large and there are only about 4 areas for beginners to climb, other areas are for intermediate and advance climbers.  My kids seemed to like the place the day after our outing than the day of, it seems it was so new to them that they did not know what to think until the experience settled in.  If you are looking for something to do with your kids then I would suggest this place.", "date": "3/30/2015"}, {"review_id": "DN26-RpDG1DqFKWkaj2yfw", "user_id": "OhwMAYXEHgSUaCB1stslvg", "user_name": "Jeremy K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "As an experienced climber, I found the setting to be very high quality with natural movement, good/new holds, and an optimal route-per-wall ratio. There is a nice sized wall at every angle with very adequate padding. Get into those place and hone your bouldering technique!", "date": "12/13/2015"}, {"review_id": "4XIKH5T8UNgCPyaHcAFXjQ", "user_id": "6vrClvmFZS5Alc3jDyoaBQ", "user_name": "Brenda V.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to other rock climbing gyms and this is hands down the best. Everyone is friendly and the environment is not intimidating at all", "date": "9/17/2016"}, {"review_id": "goyeUAhYnjLFlZlePRr6pg", "user_id": "Dw67378dtv-wa6B2PI-boQ", "user_name": "Andrew F.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome climbing gym. They change the routes frequently (2 walls per week) to keep it fresh! The staff is always friendly.", "date": "8/29/2015"}, {"review_id": "7l5VR4_-R2FV7tMoz9uScA", "user_id": "438uozi2bxVTBE37Ip3WUw", "user_name": "Emmie S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love LA Boulders! I joined about a month ago, so I'm still starting out. I've been to this gym, along with Hollywood Boulders, and Mission Cliffs in SF. This is by far my favorite location (for bouldering). There are high ceilings and great problems- and the routes are always being updated, so I can always count on new problems to work on every week.  I'm not sure if the grading is easier here, but when I climbed at Mission Cliffs the V1's were way harder.  With that said, I think the problems here are really fun, maybe because how high the walls are and how they are structurally designed. The facility is really clean too. The only time I hate coming here is during peak hours, usually in the evenings after people get off of work. There are times when everyone and their entire social groups take up the walls, and as a solo climber it can be kind of annoying. But honestly there is so much space here, and I love spending hours here climbing. Parking can suck at times- I wish they had a bigger lot. But there's makeshift parking along the alleyway, and street parking around the area- just be mindful of the signs!", "date": "6/16/2017"}, {"review_id": "T9w2B74jqUHWBBJ3FUGi4Q", "user_id": "raOkI8mQdLrvgBgBhej99Q", "user_name": "Nick B.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Greaaaaat spot for bouldering. The climbers are chill, the music selection is choice, and the routes are challenging and diverse. Drop on by for some excellent climbing.", "date": "2/13/2016"}, {"review_id": "ydnDUxvjZtRCyX7HqjcaZQ", "user_id": "RJNE7h7tCkFe-OPmVFrbbA", "user_name": "Ed E.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 6, "funny": 0, "cool": 0, "text": "Gym now has filled in all remaining fitness area with gym equipment.  Excellent array of high quality dumbbells, two benches, misc., gear (swiss balls, ab rollers, ankle weights, etc.) downstairs, upstairs packed with various high end cardio gear (probably a bit overkill).  LaB also installed a campus board, wooden hangboard (\"Beastmaster\"), and another hangboard with uniform edges of increasing depth (never saw one before).The staff has settled into the typical \"aloof if there's no business to take care of\" gym worker  mode.  From years of experience paying to use indoor rock walls (as well as managing one), I  wouldn't expect anything different but it would be nice to see the management of such a new place mix things up and think a bit harder about customer service from the customer's standpoint.", "date": "3/21/2014"}, {"review_id": "CkmFOps0eW_q6R2OxM3TZg", "user_id": "ey_fHbbXGNr6p8btOUWcaw", "user_name": "Michael J.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The ONLY negative thing about this place was the fact that I was charged $4 to rent shoes but after I got the shoes, they were WAY too small. The cashier said that the shoes were the largest they carried and that they were supposed to feel tight but not painful. Didn't get my money back and my toes were in pain while wearing the shoes. Other than that, my wife and I had fun and were very impressed with the atmosphere.", "date": "3/23/2015"}, {"review_id": "jKYr25vsNHoyA5TRfXG35Q", "user_id": "EzqOWwHqBypNuZkGhbxRuA", "user_name": "Caroline W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I really like this bouldering gym for it's facilities, but not for it's hours or prices. The staff are okay, but just seem like they're too busy to talk to people most of the time, especially if you're a beginner. Staff aside, the place is very clean and a lot of fun. They have a lot of events so check out their calendar before you leave to see what's coming up. I just really wish they were open earlier. It's a drag that I had to cancel my membership because of the inability to make it there around my schedule. If they could open like 2 or 3 hours earlier, I think it would be a benefit to a lot of other people and not just me. I would be more comfortable paying what I pay if they were open from 8 or 9 am until 11 pm as opposed to 11am-11pm. They provide showers, a locker room, cubbies near the climbing area, Britta water fountain for water bottles and a regular water fountain, weights, a few Elipticals, two rowing machines, a few treadmills and one stationary bike. They also have yoga and guest passes/free initiation days. I'd give it 5 stars if it were open earlier, basically.", "date": "10/21/2014"}, {"review_id": "2IWQLIneVyqrLoHi8bWK0A", "user_id": "PMSaoh6ej_SzJaCoWgSJLA", "user_name": "Jeeae C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "The bad:You absolutely have to take a picture when you get your membership. I hate taking pictures. Bonus! They let me take a photo of the back of my head with my bicycle gear on. Parking can be a real pain in the ass. And it doesn't seem like there are any viable alternatives when there isn't any parking in the lot. They close at 6pm on the weekends )8 The problems tend more toward the reachy side. I'm small and not very strong, so I really thrive off of crimps and balance problems. A little more diversity in the route setting would be nice, just so I can feel like I can pat my back a bit. On the bright side, I'm forced to work on problems that focus on my weakness.Steep day pass prices ($20) means it's really difficult to bring my n00b friends with me. I use my guest pass when I can, but since we're really only allotted one per month (not including the 4th or last Friday of the month), I end up feeling bad. But not bad enough to pay the $20 for every person I bring. Obviously... Otherwise the membership is $73 I think and that's pretty reasonable considering the quality of the gym. However since the other Touchstone gyms are up north, that cross over membership doesn't seem to be as useful for LA members. To be fair, I think the membership should be adequately cheaper than the norcal gyms until more LA gyms are opened. The routes are rated soft. But I guess I feel better about myself. Or do I... Bouldering only, but this could be a plus for some. (I'd personally like to be more well-rounded than I am)The good- Brand spanking new facility with walls that are still so sticky they scrap your skin and nab the fine seams of your clothing. Sounds bad, but if your clothes can stick to the wall, so can your shoes. Diverse terrain with a consistent rotation of new problems. Since I've been a member (January), I've seen a rotation of about once per month (not including the comp). Welcoming staff members who are very open to helping you with beta or a spot. They'll know you by name after the first few times and you'll never feel pressured into a membership or any other purchase. Laid back but helpful. (Miss you behind the counter, Allen!) Padded floors everywhere. If you want to walk from point A to point B quickly you'll look like Neil Armstrong.It doesn't smell like feet yet, yay! Fellow climbers are all very friendly, non-competitive, helpful and encouraging. I think because it's a newer gym, it took a while for people to start opening up and getting to know each other but it's recently started to get very open and vibrant.Plenty of space to lock up your bicycle, and sometimes even enough space by the front desk-- though recently the gym has been getting more equipment and more members so this probably won't last very long.They close at 11pm on weekdays.They don't seem too class or children's birthday oriented. Which means! More space, no large groups of n00bs (who know little of wall sharing etiquette) and no feeling sorry for accidentally falling on that small child and hearing \"No running!\" every 20 seconds. The awesome-When you ask anyone for help on a problem you're too small or too weak for, request that they pretend they are short and not so muscular and they'll do it. With exactness.", "date": "3/4/2014"}, {"review_id": "kwr7HKci9elSGX1UEM-Psg", "user_id": "akEaZjRQQNJo3BGQVPOTWg", "user_name": "Madeleine H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Went on a Monday night - not too crowded. They didn't explain anything to us when they got there, but the facilities were good. They had a great variety of courses - spent some time struggling through some v3s, which was fun. Courses are marked well and spaced out enough that if someone is in your area you can always find another. Apparently they close a few days out of the month to set up new courses, usually on Tuesdays or Wednesdays. Always be sure to check before you head over!", "date": "7/17/2014"}, {"review_id": "TEoI1-kasCguoZXYBTAwow", "user_id": "stPVJ0vH-nIDmw84L2v71Q", "user_name": "Phil J.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm quite the critic when it comes to climbing gyms and their bouldering areas since i am primarily a boulderer. But with that being said, this gym has definitely been my favorite gym to boulder at so far in CA. I live 45 mins away and i still make the drive at least once a month to check out the awesome problems. Great setting (for all levels)Great MusicGreat StaffGreat place to be when its too hot to climb outdoors :)", "date": "7/28/2014"}, {"review_id": "c8_EpxvS5HwbHZC749CTjw", "user_id": "uF4IOKp_I2TIN5kwmFTbew", "user_name": "Ethan H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "Im rewriting my review after my second visit to lab. I really enjoy the walltopia walls and general terrain here. The gym upstairs and general facilities are pretty awesome. The walls them selves do not lend them selves for the use of large features, which is disappointing. I'm rating this place a three stars because of their employees. A group of us were climbing the other night and witnessed what many people refer to as the \"count down\", where one of their employees yells out how much time before you have to leave! Climbing at my local gym I've never, ever even been asked to leave when closing was approaching. I get the feeling from. These employees that they are too cool, for the likes of us little people. So go in, check it out but remember hipsters have an air about them.", "date": "1/7/2014"}, {"review_id": "cPA6vMdUvDo-1O-o7_IGCg", "user_id": "Y3cWwIQkfyzTRweUOrDLWw", "user_name": "Richard L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great- PHENOMENAL. Great place to climb without any pretensions and fun to watch people. There's a gym, a shower, multiple walls and both street and lot parking. Great Place.", "date": "3/1/2015"}, {"review_id": "OpvHs8TD8-rtFon7RO7Uew", "user_id": "Yz91SSI59TvzO2HnQ_Ka_A", "user_name": "K C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had been going to Touchstone Gyms in the Bay Area since 2005 or so, so I was SOOO psyched when they opened up LA Boulders. I love bouldering and this place delivers. There's always a new route to try and they do a good job of keeping the walls fresh. Super excited for the other gyms they're opening up in the LA area as well (Hollywood and Culver City). Can't wait to get in some top-rope!This particular gym does have a limited weight and cardio/stretch area. But I think they're going to expand these options in the next two gyms they're opening. I also wish the gym opened earlier, since I'm a morning exerciser and prefer to work out on a relatively empty stomach. By the time people get off of work and we go climb, it pushes dinner back to like 9-10pm...It gets super busy on Tuesday and Thursday nights... and parking can be a pain... One night I parked a block away and kept worrying whether my car was going to get broken into.", "date": "4/21/2015"}, {"review_id": "q8DxoaR3D70OOpXUo_n37A", "user_id": "tNyrcbt3ujq4Aff6Bux6Dg", "user_name": "Clara C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Other than the hub in Markham, this is the nicest bouldering gym I have been to. Some of the top out is a bit sketched, but overall super fun, the route seems to change decently often, with different things to work on.", "date": "1/19/2016"}, {"review_id": "1_F6nwcpNP5q4p-1zlpWJw", "user_id": "mbM5D3t1KEnATvSln84C9g", "user_name": "D J.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "first time coming to this place the guy at the front desk was great hooked us up for the first it was fun and i will go back again soon", "date": "9/9/2015"}, {"review_id": "cIISsX0H5oWb7sM7345Odg", "user_id": "2KfGK4NzuAlTQ0FZs16PmA", "user_name": "Abby S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great bouldering gym! Clean holds, well set/ decent variety of routes and friendly crowd. They also have some weight lifting equipment, ellipticals, lockers and showers. The prices are a bit steep and I'd love to see some yoga classes offered but over all I like the place.", "date": "2/23/2014"}, {"review_id": "hbKEbs_4Cvu7tUOWCMfvCA", "user_id": "NKDVHfnnfQLU9GwY__WCvQ", "user_name": "Alyssa W.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the best climbing gyms I've been to! Great routes and great variety in difficulty. Whether you're looking for a V0 or a V7, or even higher, you'll find plenty. Also a great selection of gym equipment. Up to date treadmills, ellipticals, weights, etc. Locker rooms were very clean! Nothing broken, rusty or dirty. Very nice showers. Amazing gym and climbing experience! :)", "date": "12/9/2014"}, {"review_id": "57Sn5C29kUv_0MKCHdh4TA", "user_id": "AAuN0BJBagNYJtBds8Citg", "user_name": "Cara L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is preeeeeeeety cool. Wide open climbing spaces AND small areas upstairs and downstairs to lift weights and warm-up with rowing machines, treadmills, and ellipticals. Climbing here will help improve your upper-body strength in a fun way without you realizing it! Sucks I'm so far away from it, but will definitely be going back.", "date": "4/29/2014"}, {"review_id": "jVtpCBzQDpq86oNPlqMaqA", "user_id": "E9Kp4NB8Yfe84_PZltEudQ", "user_name": "Nate R.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was my first time. Guy up front asked me if I needed any help, but I was waiting for a friend who'd been before. I like the added gym element. Clean bathrooms. I had a great time and am waiting for my body not to be sore so I can go back asap.", "date": "7/31/2014"}, {"review_id": "SKtg6NZNDorX82H3ws2Upg", "user_id": "TIQob7EwM11GTTcCh_8vfQ", "user_name": "Lucas K.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent spot with a great community, I almost don't want to write a review because I want to keep it a secret. There's awesome climbs for someone who's a beginner like me plus a bunch of crazy ish for those more advanced.", "date": "4/5/2014"}, {"review_id": "Wojk3LcnXkrFF2zyG2tRdw", "user_id": "Zn_YkaLKMaPJE9bxBu2BIw", "user_name": "Deven L.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We've been members here for several months now, and we love it! The staff is great, and they switch up the routes pretty regularly. I'm also digging the new pads they put in not too long ago.", "date": "1/10/2016"}, {"review_id": "VEk8894rBiynIb3wHXkwqg", "user_id": "K1xyhbsD-TH3t4xgcukCMA", "user_name": "Mel C.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "It is a great place! very fun. I hope they open at earlier time really soon. The 3stars is just cuz of the business hours, limited parking spots, and also members have to pay for rental shoes! also, the yoga classes or additional workout classes they had promised have not existed yet.Membership is quite pricey, but I think it is worth it. Other than that, coolest bouldering gym in LA area!! woot woot :)", "date": "12/29/2013"}, {"review_id": "kxHwO38sjd07arTj7oy0GA", "user_id": "oHRRsAO0EUPAF2L20_WO0A", "user_name": "Julia M.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "large space, good setting and really great facilities. very helpful staff and never too busy!", "date": "10/10/2016"}, {"review_id": "Jr6PzGEcOAmJeSMOfJXYkA", "user_id": "W4EmAC4qxO-0AFhbiCoUDA", "user_name": "Gev A.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best workout I've had in years...and I lift weights about 3-4 times a week. An awesome way to hang out with friends, solve puzzles and get a kick-ass workout. The only reason anyone ever leaves is pure exhaustion.", "date": "12/26/2013"}, {"review_id": "WXpq9sXbNEKEnHIZxU_oTQ", "user_id": "rh1HfaFLYFRl9P8kL_P7vg", "user_name": "Wil H.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "easily the best bouldering gym in southern california. beautiful and diverse walls, friendly people. landing pads are great unlike sender one for people falling off or people with knee problems.", "date": "5/25/2014"}, {"review_id": "MA1hLPPrdmnUZWI7sIiqeg", "user_id": "4jektikoynhC13AyfS1Eew", "user_name": "Bryan S.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best bouldering in a gym I have seen.  Problems are thoughtful and challenging.   Staff is great.  Air conditioning is huge for me.  And they change the problems frequently.  I absolutely love this LA.B and would recommend it for anyone.", "date": "1/18/2015"}, {"review_id": "qYY2QHvPbeJn2rqgW3CS3w", "user_id": "XhepsM8M2N_8O8xLeN3r5Q", "user_name": "Manny M.", "business_id": "c_kY-WNaL2OGpDryJQ5aHQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Finally we have a real gym that is as good as the european gyms, if not Better.  This place brand new holds!  Also is very kid friendly.  Signing up and registering is high tech.  The staff is super fun and helpful.  Look forward to many visits here.  This is my new hang out home!!!", "date": "1/23/2014"}]