[{"review_id": "yXRCm08XovW4Qu7sRdGtUw", "user_id": "CFG8zbdBDFsMeCAoUhrtfg", "user_name": "Morgan B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Gym is beautiful and my friend and I received exceptional service from Zack and Flynn at the front Sunday afternoon! They were so helpful and honestly created the best rock climbing experience for us. They also played great music in the facility!", "date": "3/12/2019"}, {"review_id": "3kpNR246TJzAH2oYtBIIFw", "user_id": "kREjQvShAKJuFS6yrzr0-w", "user_name": "Alex A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first time bouldering and I was extremely underwhelmed. There was only one v0 course and everything else was set up from levels 1-40? We mentioned that it was our first time and the front desk also seemed to not care and didn't really explain anything to us. It didn't help that more than half of the gym was closed. My girlfriend and I were only able to do 3 courses and for $25, we expected a lot more.", "date": "4/21/2019"}, {"review_id": "1zUCRfVAtec5VTFZtJJiqA", "user_id": "W8XCU8gRndzb8VEVyz1TaA", "user_name": "Johnny T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 4, "funny": 0, "cool": 1, "text": "Great dependable climbing gym with a good community, friendly staff and patrons.The membership price is a little scary but they offer yoga classes, a small weightlifting area, and regularly rotating bouldering and climbing walls. Day pass prices great for drop-ins who want to see what climbing is all about, but with the commitment of going regularly the membership is a good value if you're visiting 2 or more times a week.Their gear shop is pretty competitively priced and the sales staff were very helpful helping me get the right fit of climbing shoes, letting me try on pair after pair until we honed in on what fit my feet best.It can get pretty packed at peak hours but otherwise the gym is spacious and full of great climbing variety.", "date": "2/8/2018"}, {"review_id": "z9SmMRk3Em3dcfa-f46snA", "user_id": "oU6np7PaWriS3fWcL5ehGg", "user_name": "Christina N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This was my first time ever going to a legit climbing gym and I had a really good experience.  As a newbie, I got a belay lesson for $10, which includes learning how to attach a top rope as a belayer and as a climber.  It also includes practice belaying and climbing.  If you pass, you get a yellow card attached to your harness saying you can climb.  I had Ana as my instructor and she was great!  Thanks!  A day pass here is $22, but they do offer student and military discounts.  Gear is available to rent...but...I forgot how much it was...sorry, folks.  It was quite busy when we went, but we still managed to get a decent number of climbs in before we had to cut out for dinner.  My hands got all tingly with nerves with my first climb, but went away with each additional climb.  It was awesome and I loved the challenge!  There's a parking lot that wraps around the building plus street parking.  And apparently, it has more than just climbing walls.  There is yoga, weights, a retail area, etc.  It was quite crowded and there were a lot of kids climbing--seems like a family-friendly place.  Everyone here seemed pretty nice and knowledgeable.  I'd definitely like to come here again.", "date": "4/3/2018"}, {"review_id": "6EJRrn_FJ1QwFiQh1A2-tw", "user_id": "VoDHmJ1ITlZMYtlJoPCaUQ", "user_name": "Lisa M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym! With your climbing membership comes free yoga classes and a workout gym. The staff are super friendly and the routes are changed pretty frequently so you do not get bored. You also get 1 guest pass every month, which allows you to introduce a friend to climbing :)", "date": "4/1/2018"}, {"review_id": "oCYU2vNx0PQYXUZO6dDOQg", "user_id": "xWASTkTn-YLgQpU1fAQdkw", "user_name": "Eunice T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "It's been years since I first came to Mesa Rim. Since then, I've moved between the east coast and SD multiple times, and every time coming back, I reactivate my membership. It's never been cancelled, always just on hold, bc Mesa is basically my home away from home. They now have a Mission Valley location, a training center, a co-working center, & a new location in Reno. Safe to say, Mesa Rim has been growing steadily, and I attribute this to the great team and community this gym builds. Why should you commit one of your possibly multiple gym memberships here? Well, bc it rocks, no pun intended. The staff is friendly, engaging, & helpful. When you go often, they remember you and slowly, you get to know them as more than \"that guy who works the front desk at my gym.\" They have multiple yoga classes throughout the day with special yoga classes, like acro or handstand clinic, monthly. The members are friendly (and such good eye candy!) It's a non judgmental space. They have a slack line. There are tables you can do laptop work on. You get 10% off merchandise as a member. You can do Olympic lifting and drop weights on the ground when your muscles scream failure. The climbing walls are 55ft and the routes are fun, challenging and changes on a schedule. If nothing else, the lighting at this gym is top notch for taking progress photos. #shadows #AbLinesAllDay.", "date": "2/27/2018"}, {"review_id": "BCA3eWWE24Z47QNVb97asQ", "user_id": "w2jaNYJ20RS7_rC1p1hmNQ", "user_name": "Steve S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Good facility, but horrible customer service. I had a poor experience with gear from the lost and found here - trying to get back gear that was labeled with my name was the most painful experience ever. I got the run around repeatedly from employee after employee, and none of them seemed to care. Don't expect much.", "date": "1/2/2019"}, {"review_id": "vevCPpypV0HVcMBIzp1v8A", "user_id": "YK83ZK3nt-bzbNhJWEgHew", "user_name": "Elyse Y.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "It's the only climbing gym I've ever been to, so I can't say how it compares to others. But I've had a great experience here so far!The staff are pretty helpful and nice overall, Rick and Crystal are especially so! Rick once spent at least half an hour helping two of my friends decide on which climbing shoes they wanted to buy, and he gave very comprehensive answers to all of their questions. And one time, I was shy about asking the front desk about their liquid chalk, and Crystal noticed this and introduced herself to me to help me feel more comfortable. Some of the other staff aren't as overtly friendly, but I've never met one who was rude in any way.They have a lot of interesting routes and rotate them pretty often, so there's almost always something new to try (I go 1-2 times a week). There's a good distribution of difficulty and the type of technique that's required, even within the same ratings, so you won't get bored.I don't boulder much, but there's an extensive area for it all along the walls in the back! It's often filled with people and also seems to have a good variety of problems.The gym area isn't bad; there's one area on the first floor and one in the loft. The one on the first floor has weights, treadmills, and a couple of machines, and it also has a wooden climbing board. The one on the loft has ellipticals, not sure what else because I haven't been up there before.I purchased a membership and have been coming back pretty often since I got it!", "date": "6/9/2018"}, {"review_id": "DZ5EiGxOI83wzlkh5vIkbw", "user_id": "lc2bN7I8J83nDrt-iH5zsg", "user_name": "Duncan S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've been climbing at Mesa rim with my Dad since they opened. They have an amazing facility, great route setters and plenty of route styles, bouldering, leading, etc....The only reason that I cannot bring myself to give them 5 stars is that their staff is not exactly the friendliest or most engaging staff I've come across, which is odd for a climbing gym. Other than that, this place is on fire!!!", "date": "3/2/2018"}, {"review_id": "Qf_6TgCXDCNEqo5uCFSshw", "user_id": "3AvLBnBReJQSiJldJgsGdw", "user_name": "Yahnn K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. Everybody is kind and friendly. I will be bringing my son this week end.", "date": "1/24/2019"}, {"review_id": "u4dcp9Op3sCBBP1mDCEA-Q", "user_id": "18QxKuaUCR1Y6dhsbK8JzQ", "user_name": "Tiffany T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 6, "funny": 1, "cool": 3, "text": "Hands down probably the coolest climbing gym (or I'd even say the coolest gym in general) ever. My friend got me into climbing and instead of doing the one day $25 pass, I decided to pay around $60 for a 2 week trial because if I came even 3 times out of the 2 weeks, it's already a way better deal. With that said, within the 2 weeks, I probably went at least 7-8 times. Not only was it worth the $60, but you REALLY see yourself progressing even in that small period of time and you simply get addicted to the art of climbing. After those 2 weeks of seeing gradual progress, I knew I had to get a pass because there was no way I wanted to stop there. A common thing that people are skeptical about is the membership price at Mesa Rim because it's about $75 per month + an initiation fee of $50. HOWEVER, I must tell you, it's completely worth it!! Also, if you find 3-4 (?) people to sign up with, you can get your initiation fee waived and there are also alternative ways to get it waived, such as buying different climbing packages, or paying for the next couple of months upfront. Although pricey, what this gym offers is completely worth it and from my own experiences, coming here has made me feel happier and better as a person - no joke.NOTE: I believe that around May, the membership will jump from $75 to ~$81 sooo... SIGN UP NOW!Firstly, the climbing community is probably the friendliest bunch I've ever encountered. EVERYONE is so encouraging and helpful -they all build you up and want you to succeed, even strangers. The people who work here are all extremely nice and welcoming too. The overall quality of the gym itself is freaking nice. In addition to bouldering and top roping, there is also a weight area with a squat rack, some tread mills, weights, other machinery and some fun aerodynamic ceiling activities. There's also an upstairs portion with a ping pong table, fooz ball, other tools to help you work out your body, & even tables and sofas for you if you'd like to study. There's also FREE & RELIABLE WIFI throughout the venue that is consistent and FAST!! They also provide various classes like yoga and some intense core work out classes that are very fun. There's also a sauna and showers in the bathroom! I feel like I'm going overboard with these \"also's\", but I just can't help it. Last one I promise.. but they also have slack lining where you can practice. Overall, I seriously love this place. I'm still a weak climber, but being able to see my progress as days go by has really boosted me up as a person, both physically and mentally. It's nice to see yourself improving while also meeting great people & having a lot of fun in the process!", "date": "4/11/2017"}, {"review_id": "cBOVJRxS6FDd0l57JMce9g", "user_id": "6XQLzCQnPN9DEsdax8uHJw", "user_name": "Stephanie C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 5, "funny": 2, "cool": 2, "text": "My friends climb. I do not. But one lazy Saturday afternoon, they somehow coerced me into coming with them.If you have a monthly membership, I believe they give you a free guest pass to bring someone each month. Equipment rental is $6-7, I forget how much exactly, and includes shoes, harness for top rope, and a chalk bag.Really challenging, but super fun. Plus the staff was so friendly and helpful in guiding me how to find the right sizing for shoes.Thoroughly enjoyed my first climbing experience and would definitely come here more often if I lived in the area.", "date": "3/25/2016"}, {"review_id": "H3WKRDjT2WB7M6Xk1QxQ7g", "user_id": "5jGPnU7NlGfiD-D09oYwBg", "user_name": "Remi T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Mesa Rim has an amazing facility for climbing, working out, and yoga. Every trip to the gym has been very fun because the staff ensures that their customers are staying safe and are belay checked.", "date": "8/7/2018"}, {"review_id": "tqix8owQ1mQapNI8FPrJCA", "user_id": "qPPa9y-YsK90Qt9hAiTvog", "user_name": "Cathy-Renee D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 7, "funny": 6, "cool": 2, "text": "First of all, I still suck at climbing. I have been a member for about 3 months now. I haven't gone past a  VO-V1.  I fall constantly, grunt, and become extremely frustrated. I don't look like a pretty picture from an outsiders perspective. On the contrary, I may look a mess, but I am having a FREAKING BLAST! Since it gets pretty busy after I get off work, I've started going right when they open at 6 AM before work. My alarm sounds off at 5:45 AM and I seriously jump out of bed (not really, but you get my point) and grab my gym bag and head off. I decide during the walk to my car which Mesa Rim to go to (another plus), and start my morning with a podcast and some hopeful attempts on the bouldering wall. Just like the previous reviews, everyone is pretty chill and nice. The facility is clean. Each location has a variety of routes and levels. They offer yoga and basic gym amenities that you expect. I love the quirks of both locations. I think it's awesome that the Mira Mesa one has a foosball table, and the Mission Valley one has a bookshelf of tradable reads. The membership is pretty pricey, but I think if you use it to your advantage it's worth it. Yes, a lot of people are amazing and intimidating. Yes, everyone is good looking and hip (to add on to the intimidation). But the climbing community is more often than not, some of the friendliest people. I have been a member for almost 3 months and recently I saw a whisper of progress. I still shy around and fall like an incredible fool but that small change in progress made me feel like Rocky Balboa running up the stairs. I am having a great time, and getting a work out at the same time. WORTH IT~*~*~", "date": "8/1/2017"}, {"review_id": "KrHVYeFTnDyP8uLGF_CFUQ", "user_id": "8nUEpBTLdPAwan-RMABm4w", "user_name": "Harsha R.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym in the Mira Mesa / Sorrento Valley area with top-rope, lead and bouldering, a cross-fit style gym and yoga studio. Nice lounge / work area with internet as an added bonus.Some very nice and helpful staff, keeping an eye out for the safety of the climbers and giving helpful climbing technique tips. I also owe them for all the times I left something behind at the gym and they retrieved it from the lost-and-found ...Great community of climbers creating a friendly vibe. If you don't have someone to belay you for the day, you can always have the front desk give a shout out and see if anyone is available to climb with you. Easy parking right in front of the gym on the street (they have a separate spot for motorcycles). Oh, and they also sell climbing gear here. Stop by and check out Mesa yourself!", "date": "5/30/2018"}, {"review_id": "qlE2tsKWE26XD0eNuUGwPw", "user_id": "SBvzGO8OQbGDYT58rogpaQ", "user_name": "Herbert W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 10, "funny": 4, "cool": 0, "text": "My wife and I aren't super experienced climbers - we've been indoor rock climbing maybe a dozen times - but we aren't total novices either.When we came in for rock climbing this evening, we were given two options - sign up for a day pass or sign up for a one-week membership, which would be roughly the same price as the day pass. We signed up for the one-week membership, were fitted for gear, and were ready to start climbing.  So far, so good.But then, we were quizzed about proper belay etiquette.  I get that safety is really important, but literally every other rock climbing facility we've been to has had someone thread the belay for us, remind us how to use it, and we're up climbing in five minutes.Not so at Mesa Rim.  We were told - after we already paid and signed up - that we had to come back in two hours for the belay lesson.  It's incredibly frustrating because:a) there were three - count 'em, three - people behind the front desk, doing nothing, any of whom could have taken a few minutes to help usb) We were told that it \"wouldn't be fair\" (whatever that means) if they gave us a quick belay lesson, andc) We weren't told any of this before signing up for the membershipKeep in mind that my wife and I didn't have two hours to wait around for a belay lesson, as we had a babysitter for the occasion (it was my wife's birthday). And to cap it off, we had to fill out a freaking form on their website to cancel the membership (we weren't able to do so over the phone).Needless to say, we're not happy.  It's like they're trying their hardest to prevent new members from signing up.", "date": "12/8/2017"}, {"review_id": "VPODq0tguQI0JA9Qs6FUOw", "user_id": "pi6TwxZQmrQcaqaPfe0A_g", "user_name": "James D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just started climbing and have been picking things up from friends along the way. I decided to take the lead 101 class with josh here to gain additional knowledge. Josh spent 3 hours with me teaching me many new things including safety, lead technique and dynamic belaying. If your new take his class as he will accelerate your learning curve. Also, great indoor climbing gym!", "date": "10/9/2017"}, {"review_id": "DNvqX0eQOAO6wOzDiskVDA", "user_id": "sjOhXzXxXWsmcSi5kgAA2w", "user_name": "Brad K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 1, "cool": 0, "text": "pros:- excellent bouldering, top roping, and sport climbing- well-set routes- tons of training tools- lounge area- friendly and helpful staff- free belay lessonscons:- packed at peak hours- pricey membership- difficulty entry to sport climbingmesa rim is the best climbing gym in san diego, period, with two (and a half) locations to boot. as a member of ucsd's climbing team, i frequent their mira mesa location several times per week, but often go to mission valley for the massive overhanging wall and fresh routes. they even have a small training center directly adjacent to mira mesa for the more advanced climber. the quality and safety of mesa rim is unparalleled. their bouldering area is much better protected than vertical hold, with thick, uninterrupted mats, and their sport climbing routes have interesting lines and creative sequences. there is a sizable weight training area as well as a variety of hangboards to get stronger. the gym is very clean and they set new climbs every couple months, so you'll never get tired of their routes.my main qualm with mesa rim is the difficulty of obtaining sport climbing certification. my climbing partner can climb in the 5.10 grade, but the lead test is on a huge overhang that is not conducive to her climbing style. as a result, she can only belay me on sport climbs and doesn't get the opportunity to practice leading indoors. to me, it seems like an unnecessary barrier to entry that should be made more user-friendly. with that being said, get a membership if you are at all interested in climbing. you'll be happier, and become a better climber, for it.", "date": "11/22/2017"}, {"review_id": "qUC_SmZ-VuymjFMd4vfTwg", "user_id": "Q4EbTuP3dbBpFaGZ3e7qZA", "user_name": "Renata K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "Just realized I never wrote a review about this place! This is the best climbing gym ever! It's top of the line, new equipment, new routes every few weeks, great setters for both bouldering and top roping and friendly staff! I used to climb here a few times a week until I moved across the country :( when I move back I plan to get a membership there again cause it's awesome! :)", "date": "4/15/2015"}, {"review_id": "81JuCIvGm9SahX4_gGII9A", "user_id": "OKYMuDNLnPfUvOPdEBfEGA", "user_name": "Sireesha R.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "I'm so happy my boyfriend brought me to this place 2 years ago. I was really hesitant to go because I've never climbed before and didn't really want to make a fool of myself. When I finally came here, I was instantly hooked. Seriously, we got our membership the next week.I took a belay class here for $8 and it was really informative. Basically a sure fire way of passing the belaying test to get belay certified. For newcomers who don't have gear, you can rent all the equipment for a small fee and also borrow a belay device for free (just give your keys or ID as a placeholder). The bouldering problems and top rope routes are changed pretty often and it rotates between the different sections of the gym. I haven't tried many other gyms but I think the rating system here is pretty fair. I've recently started going to yoga classes here and they are awesome!! It's an intimate setting without any mirrors in the room which really helps you focus on the practice rather than how you look. This is a great place for a date, family outing, birthday party, and as a regular fitness gym. The staff and members are friendly and helpful. It's just an awesome environment to stay fit and have fun!", "date": "12/25/2014"}, {"review_id": "OA2KDzU6K9fSnAkKh0fbWg", "user_id": "f310XqHZk1vJGC5egrR8Mg", "user_name": "Candice N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 4, "funny": 2, "cool": 2, "text": "This place is beautiful. Brand new and a sister location to the one in Mira Mesa. I wish it wasn't so expensive then I'd go a lot more and invite more people. Definitely an activity for a select group, especially if you're younger. The staff has always been nice and informative. The bouldering section has a good variety of different level routes. You'll find ones you can do and definitely some you can't. The climbing that requires ropes is so intense. Some of the tallest I've seen. Gives me anxiety just looking at it but that's the thrill climbers are always looking for right?The place also has a mini gym that has quality equipment, treadmills and yoga classes. This can definitely be your full time gym.", "date": "2/4/2016"}, {"review_id": "ZUxO7mSqsiWTNax6k1K13Q", "user_id": "HslmVF1pBrbeGHHf5AKAUQ", "user_name": "Melissa A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "Great place to go rock climbing! My husband really wanted to try rock climbing (thanks to 'American Ninja Warrior') & I saw this place offered a \"Climb With Us\" class. I highly recommend starting with this class. We had no idea how to start & this was a great way to jump right into it. They also offer a belay class, but \"Climb With Us\" gives you the opportunity to start climbing the walls right away. The class is intimate with a maximum of 4 people & a staff member that will belay for you. With 3 other people, it gave us the chance to rest between climbs. You'll need it! You can also go bouldering (climb without ropes or harness) in the back while you wait for your turn. The class was an hour & a half & we spent some time bouldering afterwards. They have many walls to choose from. Difficulty level was determined by colors & number posted at the start of the wall climb. They also have a small gym & yoga classes. Kids are welcome too! I saw a few small, fearless kids climbing the walls.FYI to all the ladies! Don't go climbing with long nails. Cut them short beforehand. I may have made that silly mistake.", "date": "2/22/2016"}, {"review_id": "iaKbtKyFMqOP28-zWOwyNA", "user_id": "8vNho_9a6crhyVvg4V7lDw", "user_name": "Krista S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "One of the best gym to go top roping and lead climbing in. Their bouldering section is okay.. Small compared to others but they have some challenging routes and but at the same time fun.I dont really top rope but I tried for the first time here and it was so much fun. These walls must be like 50 ft or so and there are just so many people climbing and its crazy. It does get pretty busy here.. Esp on the one Monday we went...it was hard to boulder and we were sitting a lot watching the more advanced people climb. I would come on  sunday afternoon/night when its less busy. They have ping pong and a cool lounge area upstairs and a pretty extensive store that sells a whole bunch of cool climbing stuff. Small gym on the side with some cool artwork.Def gonna come here as often as I can! Worth te drive from Irvine!", "date": "3/19/2014"}, {"review_id": "DEeoN3yYhbU2zeDKp2AnKg", "user_id": "GjsY0DXjQMgzkk_cGn5aGA", "user_name": "David E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Off the charts fun and so focused on safety and fitness that I can't get enough of this place. Everybody is constantly climbing and working out. The trainers make sure you know your stuff before letting you go climb to avoid injuries. The walls are super high, challenging, and the bouldering is amazing also. Membership includes Yoga so that's a huge plus as you will need to stretch and care for your body after exerting so much energy and strength for a few hours. Pack a few snacks and plan on hanging out for a while. Always a good idea to bring a friend.", "date": "1/5/2017"}, {"review_id": "DVT6ycFimK84Xs3pWQ-xHg", "user_id": "QJUSpTWBvjnak7KERsnqaw", "user_name": "Robert C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I love this gym! It is the largest climbing gym I've ever been to and the routes change often enough so that there is always a challenge. I was introduced to climbing a few months after moving to San Diego and have climbed at least twice a week or so for a few months. I'm sure there are things that I cannot comment on such as the lead climbing experience or the advanced bouldering because I am simply not at the level to try it yet.The top rope routes are generally very good and thought out. Sometimes there are discrepancies where I felt a path was definitely more difficult or more easy than what the difficulty level is displayed, but most of those are judged by the actual gym goers, so it's not exactly something I can complain about.The membership is fairly cheap, it is $75 a month and includes access to the climbing walls, yoga, training center and gym equipment. I've been to a few yoga classes and they have been very good. I haven't used the training center yet but it looks to be full of good equipment and training walls to get you going. I think the cost of membership is well worth what you get.They are opening up a new location in Mission Valley so I am looking forward to going more often since it will be about 15 minutes closer. I hope the new location is just as good as this one!", "date": "8/8/2015"}, {"review_id": "YlkVcjSMkLZk5anJzJI8jg", "user_id": "KAv5Wc9QSS1HlG12t-uJmg", "user_name": "Kenneth Ryan P.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great atmosphere and one of the better rock climbing gyms in the San Diego area, if not, the best. Perfect place for beginners and, of course, it caters to the seasonal rock climber. The boulders are much challenging here. And the staff are very friendly and helpful. They have separate sections for working out. Weighted and cardio machines throughout the establishment for all fitness needs. Belay ready? Belay up!", "date": "11/26/2016"}, {"review_id": "EW1XKREyyqXhUAmXy_P4iw", "user_id": "W_U4oTX8i4oAGUsTyidVcQ", "user_name": "Anthea W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 2, "text": "I'm new to rock climbing.... and usually go to Solid Rock because that's more for beginners. The walls here are high!!! My first wall - about half way - i got super scared and started shaking, but soon got over it. All fun here :) The entrance is very grand... almost like a hotel lobby! Really pretty and you can tell they put a lot of effort into making it feel that way. All of the employees are super cool and friendly!", "date": "11/20/2015"}, {"review_id": "fd85UGdMft5NEbLGrveaOA", "user_id": "gppj9ffUkDiqFEUWsOgbhQ", "user_name": "Dian D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 2, "useful": 3, "funny": 4, "cool": 2, "text": "Update: Went again - pretty much the same deal.  It was really hot that day, so it was more understandable but still, same as before.Yoga Review Only:The rest of facility, including lockers and showers is quite good.I'm only reviewing the Yoga classes I went to at Mesa Rim and I'll admit up front that I'm kind of spoiled.  On the upside, the yoga room is very nice and quite lovely.  I went to the 12:00 level 2/3 class, which is a great workout and I enjoyed that part.  Additionally, the instructors are also very good.However,...I went to 3 classes.  I can't say if it's 'always' this way but  my experience was the same all 3 times.- Each class had 12-14 people (a bit crowded) and each class was 8-9 guys and 4-5 girls.  I'm not completely comfortable with that ratio.  Not a big deal but not my ideal class either (but that's just a personal preference of course)- Also, 4-5 of the guys had their shirts off during the entire workout.  I was not comfortable with that.  The guy next to me was showering me with sweat occasionally and grunting like a rutting moose. Lovely.- All yoga classes have a CYGs (Creepy Yoga Guys) but these classes were worse than other places I've been to.  Like I said, I'm spoiled but within the first few minutes I was fantasizing about a separate girls section and a separate guys section.", "date": "5/17/2016"}, {"review_id": "FhhnqLMxSYIR2Ql37gcXKA", "user_id": "xVWpAIImfZAcaxc8qDRv8w", "user_name": "Sunny S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym and Bill is an amazing instructor. Everyone is super nice and helpful. Wasn't too crowded on a Sunday afternoon.", "date": "8/20/2017"}, {"review_id": "g3GcpPKa4_-5HEtXcNY1Bg", "user_id": "M_IGbWZbhc2qmzZbkn2_cw", "user_name": "Jeremy B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Amazing facility especially for a first timer like me!  I would definitely recommend taking a training session if you've never climbed before. We had Hunter, and he was very knowledgable and a great teacher.Really stellar experience and solid workout! Looking forward to going to the mission valley location once it opens!", "date": "5/15/2015"}, {"review_id": "BgrgrgSS_NptyKbYCFNYzA", "user_id": "M8BOvDlkH3gXpfxrv4ygqg", "user_name": "Patrick E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Awesome place for a good workout. Family friendly facility.Staffs are friendly and helpful. My kids had tons of fun conquering several climbing walls and other interactive activities they had on hand. Never knew this was just near my place and I've been living in the area for a good 6 years now! We'd be back for sure now that we've discovered this  wonderful facility.Would definitely recommend the place to friends.", "date": "5/25/2015"}, {"review_id": "m6MY2CuTH-VWzmEIRLgGvg", "user_id": "sXJwXEHR64393fWO4Qdq6A", "user_name": "Kim P.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The biggest wall Ive seen at a climbing gym! The staff are all young people and super friendly and they offer 6$ gear each time and a belay class to make sure you know your stuff. The shoes they rent are new and in good condition. Use the white and green ones if you can over the black ones. Sometimes it gets a bit crowded and can be a little bit of a wait to get the route you were looking for but there are tons of other options while you wait. They also offer yoga classes and have a locker room complete with showers.", "date": "6/13/2016"}, {"review_id": "ZQjwSdUEIgDapXUHo5X7XQ", "user_id": "RmXIjppHNtVveguN10iO1g", "user_name": "Kevin L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 4, "funny": 3, "cool": 3, "text": "I'm sure that my first visit to Mesa Rim was an anomaly (given that it was Christmas eve), but the joint was stunningly empty for most of the time we were there (late morning). My sister pretty much had her pick of any of the toprope routes and I had nearly uncontested bouldering problem options (not that the bouldering walls are that extensive...).I was impressed enough with the facility to spring for a ten-pack pass. It was slightly more economical, now that my parents are retiring to La Jolla. Considering they never expire and I'm sure to be back out this way to visit the family in the coming years, I figure I'll eventually make use of them. Plus, we were allowed to convert our day passes into the 10-pack and just deduct the day's visits from the number of punches remaining. Good deal!On my second visit to Mesa Rim, the day after Christmas, I had an opportunity to experience the tall wall climbing, and damn are the routes -tall-! Compared to my home gym in NYC (The Cliffs), all of the climbs here are about twice the height of the ones I'm used to. Which means they're both extra fun and doubly exhausting. Additionally, I'm used to much more straightforward route-setting, where I don't spend much time contemplating the specific beta required to climb .10s and .11s. I love that the setters here put in much more technical moves. While it slows down my climbing, the problem-solving required offers much more entertainment value than the pump-fest I'm accustomed to.Now, I just need to come back with a sport leading partner so I can explore some of the overhanging cave routes. They looked incredibly fun, and I love a good roof/overhang to fall into space from!If I were a local, I could totally see making this my home gym. And if it's always as devoid of clientele as what I've seen so far... I might be tempted to move in!", "date": "1/14/2016"}, {"review_id": "lg3-u0H6XYQ25Gu0X9qo3Q", "user_id": "wh7yz5cZKi-nMhyLhUIM0Q", "user_name": "Gwen N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I had gotten two free day passes from the Roadrunner Adventure Run and when my friend and I found out OTL was indeed canceled due to the rain, we decided to have a rainy day attempting to indoor rock climb! With a belay class (offered every hour, on the hour -- plan accordingly -- we didn't know this after speaking to them on the phone and we had to wait 45 minutes), shoe, and harness rental, it was around $16 I think? With the day pass covered (I think that's $20 or so...). While we were waiting we bouldered a little, explored the small gym area (basic machines, climber-based grip station whatnots, and weights), played ping pong on the upper \"mezzanine\" level (nice lounge spot), and, my favorite -- attempted to walk on the slackline. (Okay, waiting 45 minutes wasn't tooooooo bad...)Our class was with a dad and his two kids. The pace was a bit frustrating because we understood and picked up on everything (safety checks, knots, belaying) faster than they did. There was a lot of repetition (which wasn't necessarily a bad thing) and lag time which I could have done without. Our instructor let us go before the others after demonstrating our knowledge. We got a day certification badge (you can take the test the next time to show you remember everything to get a legit cert). Climbing was more work than fun... Not sure if I'll pick it up as my new hobby.  The climbs (runs? Tracks? Lines?) were very tough for beginners like us. Awesome place, lots of amenities. If I like climbing more than I think I do, I would consider getting a membership here.", "date": "7/29/2015"}, {"review_id": "AOPTKWxha35rgThK8FoqYA", "user_id": "_NiZ056mVUuAYCrEoa5qaQ", "user_name": "Amanda F.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love climbing here! Mesa Rim offers different levels for everyone. Whether you are a beginner or you are more advanced, there is always something for you to do! My friends and I went a couple of days ago and the staff was super friendly! I'm sure they could tell we were beginners but didn't make us feel any less! I have had a few bad experiences here because of the staff members but I decided to come back and it seems like there are a few new staff members I haven't seen and they were very nice and kind! I am definitely coming back", "date": "7/23/2017"}, {"review_id": "IIzJTTMhe5_cYEsbr0jCTg", "user_id": "xThiECdF1Q5Hm4EkCwJuUw", "user_name": "Michael L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fact:  this is the best climbing gym in San Diego.  When you're a member here, you get access to TWO world-class gyms (the Mira Mesa location and the Mission Valley location).  The route-setting is arguably the most important aspect of a climbing gym, and this place does it right.  They've got truly professional route-setters that work collaboratively to produce some really fun climbs.  Both the bouldering and routes contain a variety of interesting moves on varied hold types, with no boring \"ladder-like\" climbs that you'll find at most other gyms.  I don't really utilize the other aspects of this gym, like the weights or the yoga classes, I pretty much just climb.  But one day I'll do yoga, I swear!Since I've started coming here, I've actually improved in a few different ways with respect to \"actual\" rock climbing (on real rocks).  I've got more confidence and more endurance, and maybe even a bit more power!  This place does what a climbing gym is supposed to do:  help you get better at climbing while having fun.This place is the best, and I recommend it to anyone whether an experienced climber or not.  It's a lot of fun to play around in Mesa Rim, and you'll get one hell of a workout doing it!", "date": "8/5/2016"}, {"review_id": "OR3wGmdkA8PjwOfW_Wcq4w", "user_id": "xzj90yL7pBmhx1-bQBOe1Q", "user_name": "Jay B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Crystal gave a kick-ass belay lesson! Great energy, friendly/encouraging demeanour and all around easy to follow lesson. Made us feel great about starting a 2 week trial at Mesa rim! Thanks, Crystal!", "date": "5/6/2017"}, {"review_id": "YeODU9wOWifZyUqUmYDxqQ", "user_id": "4bRncLamEGJ_i5fIyuuK2Q", "user_name": "Andee M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 2, "funny": 14, "cool": 1, "text": "Quite disappointed with this place. We we're excited to try this place as this is new and the biggest one in SD but I guess our expectations may have been too high for this place. I'm always fair at giving reviews and look at both the good and bad side of things so let's go for the good one. This place is the biggest among all the other indoor rock climbing in SD. The walls are also higher than the others. The interior design is pretty neat and spacious and there were a couple of iPads to do waivers and signing, which, eliminates wait time... So now, let's talk about why I'm giving this place a 1 star. Right when u walk into the building, it smells like FEET. And I have A very good tolerance with smell but idk if the people inside were just immune to the smell but holy cow, it's like  the building has smelly feet air freshener. So, we go and sign the waivers and had to go thru 2 different iPads because the first two aren't working right, the touchscreen may need to be cleaned or perhaps they need to restart these devices so, yes, they may have plenty of iPads but not all are working as expected. Then, we were told by front desk that we need to take a test to ensure that we know what were doing, otherwise, wait for the next lesson (u must pay for this lesson) which is about an hour later -- that means we'd have to wait for an hour before we can even start climbing . And the funniest part for me was when she said \" u have to rent our shoes for sanitary reasons\" though, I wanted to be blunt and tell her that before she speaks about sanitation, haven't they smelled the place?\" For these reasons, we refuse to rent shoes from a place that's smelled like feet. I didn't want to be rude to the front desk as I understand they were only doing their job so we left and went back to vertical horizon. We've been going to vertical horizon and for all the times we've been there, it has never smelled like feet or even had any stench. For some people who don't care about cleanliness, I'd say try this place. But I would highly recommend VERTICAL HOLDover this place.", "date": "8/7/2017"}, {"review_id": "T6vCKCx7D0KNVvEL95I2iw", "user_id": "7z50dr2py6G8YyFHIn4KFQ", "user_name": "Matt H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I climb all the time at my home gym in OC, but a group of us decided to head south for the day and try something new.  Mesa Rim is quite impressive, with walls ranging up to 55' or so, and with the overhang, it is easy to get routes that are over 60'  The gym utilizes color coded holds with tape for additional identification, but the tape is tough to see from above the holds for foot placements.  Looking down, there were several times where it was very difficult to determine if a hold was on or not, since there was enough tape and/or rubber to hide the color and the tape was shadowed by the hold.  Still, the routes are generally interesting and there is a lot of variation.The way the walls are built, there are a lot of opportunities to climb something that feels much more like natural rock.  There are chimneys and cracks, and there are lots of routes with overhangs.  Some of the walls have autobelay devices, so if you don't have a partner, you are not reduced to bouldering.I have my gear and only needed to be tested for belay, so I can't speak for the gear or the classes.  They let me just do the lead certification instead of top rope and lead, which saved a little time.  My partner was not leading, but they have a lead belay certification as well as the two climbing ones, so he could belay me even though he was not leading, which was cool.Routes felt like they were pretty true to the outdoor grades, and there was everything from routes for the absolute first timers to at least 13s.", "date": "1/3/2015"}, {"review_id": "2vxZPEQYKHz0-zXQlLGDJw", "user_id": "RQBJvFAR4hnYz6ssOZNisA", "user_name": "Fred H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I took our nephew here for a little celebration.  This was the first rock climbing experience for all of us.  And we had a blast!We reserved the date with a trainer.  When we got there, we had to fill out the waiver paperwork which took about 5 minutes.  Then we got into the gear and off to training.  For about 45 minutes we learned to safety and techniques of belaying with the rope.  It went by pretty fast.  Soon after, we were climbing on our own.  My nephew overcame his fear of heights.  Amazing!  Our forearms were really sore, probably from the wrong techniques.  However, we'll be taking a second class on technique next time around.The staff were super nice.  This is a must do whether or not you're an outdoorsy person.  Trust me, you'll be glad you did.", "date": "5/3/2016"}, {"review_id": "AwAjoIziwJ1oOpuv5jE8Fw", "user_id": "uEP-yrzYHa2YUwqAVis4ag", "user_name": "Ame ..", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "I don't rock climb. I have tried it in the past, but it was too much for my scared to death of heights self. I have heard that the fear thing happens each time you take a break from rock climbing but calms down after your body gets used to it again, so maybe you just have to work on it.I do yoga. This place has the best value along with fantastic yoga teachers that I have found around here. Get a few friends to come with you and you get a deal on the sign-up fee. The $75 a month for climbing, fitness and yoga is half of the rate of most yoga studios in town.I have taken classes with Meg, Michelle, Kati, Raine, Nellia and Sarah. They are all good. I particularly like Meg's calming Yin/Yang class. Michelle's class can get tough. The yoga can get crowded on the popular times/classes and on hot days it can be brutally hot if a lot of people are there. They have mats, blocks, straps and bolsters available. The updated yoga schedule is on their website, here it is... mesarim.com/location/mir…You will have to fill out a form at a computer terminal, so get there early if you plan on a certain class time. The front desk is to the right as you walk in, the staff are all really friendly. They also have a fitness area and an area where you can study/work. They sell a lot of climbing/yoga items you might need too.The climbing walls are pretty high and they change the routes frequently. They have bouldering and slack line too.They have a locker/restroom/sauna/shower area in the back right. Good private and street parking. It is quite crowded with people after work. Good place for socializing. People that go here are pretty nice.I am pretty excited about their new location that is opening soon in Mission Valley (at the 163 and the 8.)", "date": "10/15/2015"}, {"review_id": "FwfiHdaS0EuCd4R-YSagPA", "user_id": "PYEeGCuCCiDxvagLq2Pp8A", "user_name": "Larissa M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love Mesa Rim! The one in Mira Mesa is really cool. It looks like you are climbing through caves! The staff is always super chill and really helpful. Mission valley is nice too. The bouldering wall wraps around so it creates this fun little play area. They also have the study area on the 2nd level over looking all the climbing so you never get bored working... and if you do, you can climb! Or you can play ping pong or do yoga. For $75 a month it's a pretty good deal. :)", "date": "5/4/2017"}, {"review_id": "LrE7YCz9HE3emizrhFTZQg", "user_id": "TDHnWUhle96CfJx3RZwA8A", "user_name": "Jessie V.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is the best climbing gym in the SD area! They have a lot of routes, friendly staff, and a great deal if you are a local resident for a trial 2 week period. They also have some exercise equipment and yoga classes, although I never tried the yoga. The gym gets pretty crowded in the evenings so get there earlier if you can!", "date": "4/1/2017"}, {"review_id": "FzOgLxRmSq9FQ3CpUMWGWg", "user_id": "zy5rvDRgPG1JUNbixZxwUQ", "user_name": "Shanel S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "First off, Debbie is most helpful! I called in advance to ask some questions and she was very patient in answering them all and there were no surprises when arriving to the gym.I went online to fill my waiver out and it made the process quick and easy. Debbie gave us our gear, answered a couple more questions, and we were climbing in no time.The day pass included gym use, rock climbing, yoga, bouldering, and slacklining.As far as the rock climbing I set up with the automatic belay. They had four walls with three different routes on each of them. I went with a friend and we were able to enjoy it for a good 2 and a half hours before getting bored. If we took lessons on how to hold each other up then we probably could have been there all day.The walls were very clean which was nice. Not chalky or slimy like some reviews stated about other gyms in the area.The fitness area was nice and clean as well and they had another section with all of their cardio equiptment which was nice.The bouldering area was also really clean and they hold about 5,000 square feet of it. It was a little intense for me, but fun nonetheless.Next time I hope to take lessons and maybe even stay long enough for one of their yoga classes.I do highly recommend this gym for all ages and even big groups.", "date": "3/23/2014"}, {"review_id": "Oz3hNugIA_IQa4Iwp6fQKg", "user_id": "-Xg2wRzr5FrmIC9IlM9xqw", "user_name": "Reynaldo G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "First I have never been rock climbing, bouldering, nothing, and I was here because a date wanted to go.So to impress her with my ridiculous skills I took the belay course before she showed up and Nick was an excellent instructor for me and another person for like an hour on a friday night.Then the climbing, its alot of fun and can get super busy, but I never felt like I was waiting for someone else to finish. If the wall you want is busy, walk around there is another wall just like it around the corner.It was an excellent time, and my experienced date says it easily top 3 in the country, so dont hesitate.", "date": "10/3/2015"}, {"review_id": "uUnluEMqPuIgdbRHW1teHQ", "user_id": "AE8nHSRPFlB4nh7CP8PlGQ", "user_name": "Tiffany Y.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "I recently came here on a Sunday with my friend, it was packed!!I was pretty surprised that there were so many people here on a Sunday. One day pass with gear for student was $21, day passes are $17 and addtl. $6 for all gear. They have yoga & fitness classes here, cardio machines, and weights. They have auto belay here!! They have plenty of different routes to climb, and also have a pretty large bouldering section.  The only thing that I didn't like was how there were so many little kids running around.  They could easily have run underneath a climber that was coming down and been seriously injured.  The people whom work here are very friendly and welcoming, and I can't wait to climb again.", "date": "12/8/2013"}, {"review_id": "iE0zk9NzRdx5ew39G1QkbA", "user_id": "AeAXej4WRpor2g6YNbdOJQ", "user_name": "Jane S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Must be the best indoor rock climbing I've been to. Classes, certification and parties for kids. I'd highly recommend checking it out for a fun and thrilling day to hang loose.", "date": "6/3/2016"}, {"review_id": "6exUtPKIffe4wI3kT8_OlQ", "user_id": "NWn-_SfY8VPR6of3U9jfAQ", "user_name": "Alicia B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Soooooooo much fun we pissed eachother off a few times but in friendly competition.  We took the belayer class which actually teaches you a thing or 2 so you don't look like a complete jackwagon lol all day passes are available, we climbed for about 4 hours straight. Great workout and friendly people all around !", "date": "4/7/2016"}, {"review_id": "kgcNHGZMCrNeZ1eQJXiN9Q", "user_id": "_vUC1P0GfLAD5UrMPAEwjA", "user_name": "Jen R.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Do you enjoy rock climbing and getting your fit on? I do and this place is great for all that and more! There are many walls to challenge yourself on from beginner to advanced and the staff here are very accommodating and personable! I try to make an effort to come here every Saturday with my husband since he's more of an avid climber than me. Kids love this place and we do too! If you are new to climbing, it's a must to be trained on how to belay properly so your climbing partner won't have any issues climbing up or going back down. You can rent gear here as well as shoes for a very reasonable price. On some weekends, there are events here ranging from competitions to birthdays and bachelor parties. There are also yoga classes, an upstairs area to play pool, do cardio as well as a place to put your feet up if you need some rest. The gym is usually where you'll find me here before climbing. Also, an excellent addition to this gym is their filtered water bottle machine/drinking fountain that saves you from having to buy those bottles of water that are harmful to the environment. Overall, Mesa Rim is really a fun environment that caters to all sorts of people into that active lifestyle that love a challenge.", "date": "12/17/2013"}, {"review_id": "_eJu1qSdtcu9I5ZqI-BOCQ", "user_id": "DPpICs-hgl2x0nJx8qNc2A", "user_name": "Cristian A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "My first experience indoor climbing and it was amazing. A playground for adults where you can have a lot of fun. The staff was great and I will definitelly come again!", "date": "9/13/2015"}, {"review_id": "kYy4r9zYQYuWwGk0CQPFQw", "user_id": "hXO60n-blyIPbH7J4SyaUg", "user_name": "Lydia T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "If you have ever squeezed my arm, you would know that I'm not a particularly fit person. Usually the thought of a pull up makes me squeamish. But, rock climbing is fun. Maybe it's all the colors, maybe its the cushions beneath you, maybe its because I saw Meru, maybe it's because of the new terms and new knot I learned to tie, maybe because our instructor Jake made it all easy, maybe it was the fun slack line.Maybe it is fun in of itself.", "date": "9/25/2015"}, {"review_id": "vLdpdejMO1rFYY4ZqJUCxQ", "user_id": "mNrUTQRnbJMJkceVO1tCIw", "user_name": "Joon S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "awesome gym for bouldering. huge gym with new equipment. I haven't been top roping but that also looks great. tons of places to sit and hang out. also has a small weight lifting area and cardio machines scattered throughout the gym.", "date": "1/23/2017"}, {"review_id": "m6vLxdFmrGSCfRU3iflG9w", "user_id": "bYAAVkUlVgVYbK8qKw3j6Q", "user_name": "Kaitlyn W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My friend and I had never tried any form of rock climbing before, but we are very active people. We saw the good reviews online and thought this would be a great place to go. We LOVED it. Matt at the front desk made sure that we had everything that we needed, he signed us up for everything and constantly was answering our questions in a friendly manner. We took a lesson from Chris which was successful. He takes the lessons seriously but still is able to smile and laugh with you. The yoga class that is taught by Steven is great too, I recommend it after a morning of climbing. These employees were all super helpful and made the experience better. We loved the facility and the atmosphere that it had. We have already gone back again for more fun and exercise.", "date": "3/20/2017"}, {"review_id": "sr0GfB95CVJktvD-No8lGQ", "user_id": "4rfMZiC8alYTT7aqRWxPCg", "user_name": "Argel A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "First time Rock Climbing and it was a pretty awesome experience!! Went there for a friend's birthday, went bouldering and by the end of the night I didn't want to go home but you just have so much grip strength before it gives out! Will definitely come through again!", "date": "10/27/2016"}, {"review_id": "QU3HzxTEyguGNT-X7m1wUQ", "user_id": "7WOCtyubxIWvLFHWtN_1WA", "user_name": "Karlee C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is epic. I am an avid climber at a bouldering gym, but a few months ago sport climbing caught my attention and I decided to check out Mesa Rim. One of the most challenging differences between lead climbing and top roping is learning how to belay safely. A lot of people have told me, \"It's like a dance. Don't give too much slack and don't short rope the climber.\"  Sounds easy enough, but it's a different beast compared with what I was used to top roping. One of the instructors, Alex Alberti, did an amazing job working with myself and two others during a private lesson. I left with experience both taking and catching a dozen falls and felt much more comfortable. The lesson was incredibly informative and I highly recommend taking a lesson if you want to learn about lead climbing/belaying in a controlled environment before going outdoors.", "date": "1/5/2017"}, {"review_id": "8CLz9fL_6nzvJTnXzbyjRw", "user_id": "epqRVIsRYJFkU8wS2naSBg", "user_name": "Manny C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 4, "funny": 2, "cool": 0, "text": "This is a perfect place to go climbing. They have great walls.  The only thing I don't like is that the staff seems a little racist. I am a Mexican that looks middle eastern.", "date": "3/11/2015"}, {"review_id": "yPaNBp76Soy6DxDXQ1ASpw", "user_id": "fZgrrh1Y4CHg-3BPxRqEMg", "user_name": "Matthew V.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 4, "funny": 1, "cool": 1, "text": "This is a pretty good climbing gym that is holding fast to the new trend of needing to fit a complete fitness center into their facility. It's clean, generally folks have been friendly, and there are a lot of options in regards to the type of climbing you can do.The only real down side is that their pricing is insane, especially if you just want to come boulder for an hour. $20.00 for a small bouldering area that doesn't offer outstanding routes, is way overpriced. If they are setting new routes and you only plan to boulder for a short period of time, just get back in your car and leave.If you plan to do yoga, a full workout routine, and somehow still mange to send, than this the perfect gym for you. If you are interested in climbing for a bit to stay in shape for hitting real rocks there are better options in SD. Maybe look into mid day or before 5pm pricing that offers affordable climbing options to real climbers that just want to get after some routes and head home.", "date": "3/4/2015"}, {"review_id": "ZuZnxQz-PxdjJyoBP8qS-A", "user_id": "Q1zu3wR8t8XDI60zWvHvzA", "user_name": "Melanie T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym I've been to. Great atmosphere that encourages you to try and doesn't make you feel out of place as a beginner. I recommend both locations highly.", "date": "12/14/2016"}, {"review_id": "6QQ9fyQ9Tcl9uahHyWRceQ", "user_id": "C3dH2B-QClcO9Mqufu3AOA", "user_name": "Matthew T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I just got a membership here and I love it!  The facility is amazing and the staff is awesome.  The climbers here are friendly and helpful.  I look forward to coming here every day.  They have an awesome yoga studio, weigh lifting, and a lounge to relax in also.", "date": "7/26/2016"}, {"review_id": "Ourdj28rsgF4k-KaQPK3tw", "user_id": "66nWrFokAbBaCfgl4nfM8A", "user_name": "Corey G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Best gym in the area. I went to 3 gyms while in town for work and this was by far the best.", "date": "9/7/2016"}, {"review_id": "0mvavKjaTCGdghHnPGWIYg", "user_id": "-tEJd6Xll-EYOcJeL6Wt8g", "user_name": "Kim A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I had my sons 10th birthday party there today and what an awesome party it was.The staff was incredible!!!! So friendly, helpful and couldn't do enough.The kids all had a blast.Highly recommend!", "date": "5/21/2016"}, {"review_id": "NQqESiUsqr1EunhDdDPd_w", "user_id": "SrCWVO_POZNXukYah0DmMw", "user_name": "Beatriz U.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for my fourth or fifth time yesterday.  I normally climb at another gym so this place is a nice to try out different styles of setting.  My friend let me use his day pass.  Check-in at the front desk was easy and quick but the staff isn't super friendly.    First we went to yoga then went climbing.  It was the first time I've tried yoga here.  They have a separate yoga studio.  There are plenty of yoga mats to borrow if don't have one.  There are also blocks, straps, and blankets to borrow.  Colleen, the yoga instructor was awesome and encouraging. I really enjoyed her music (but then again I'm partial to the reggae she played).  The class was challenging yet doable.  The top rope/sport climb area is huge and there are so many problems to choose from.  To me the grades on the problems are easier than the gym I go to, but one could argue the gym I go to sand-bags their problems...It was way less crowded that on a weekday at night. The only downside is that you have to bring your own ATC belay and carabiner.  I had already passed their top-rope belay test.  Pretty basic test, just ask someone at the front to give you the test and then they will give you a laminated green tag that says you are certified.  I also ventured out to the free weights/machines area.  They have a bunch of free weights, a squat rack, campus board, systems board, 2 row machines, and a bunch of other stuff I can't remember.  Whatever your fitness needs are for training or cross-training.  This gym has it.  Definitely recommend this place.  The space is huge and there is everything you need.", "date": "9/6/2015"}, {"review_id": "z8aLmTOe2ob7sQ6sLg967g", "user_id": "pOwxkhTay_H5_T78OrCh9A", "user_name": "Sarah W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "This is such an amazing climbing gym! Huge walls, great vibe, and bouldering fun. Found this place through a Groupon deal about a year ago and it is what got me into climbing. They have so many routes for all levels and such great workshops to get you to grow your skills. Tip: Go on the weekends if you want to climb with ease and have more open routes. On the weeknights, they really get packed!", "date": "1/10/2013"}, {"review_id": "9kAf1ESYf2_iCZmG8Zuvxw", "user_id": "4bracwMwD7NAmjsRuKz0Lg", "user_name": "Steven R.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have climbed at both locations many times and while I ultimately prefer the size, difficulty, and overall vibe at this one more, they're both undoubtedly quality indoor climbing places. Staff are super friendly, equipment is great, music is good, variety is good, and seems to overall attract friendly and talented people. Food and drink choices are great with vegan options. My only quip is the high pricing, but I am fortunate to be able to afford it and it doesn't stop me from coming.", "date": "10/2/2016"}, {"review_id": "_shRYI5On6Lj7gpuEwwnxA", "user_id": "3OZdx3SWw1SIcuwCVgtkIA", "user_name": "Han-Mei C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 6, "funny": 1, "cool": 0, "text": "They are more like a traditional gym than a climbing gym.  I absolutely love how tall the walls are, but generally dislike the ambiance and monotony of routes.  I dislike how everyone blocks out everyone else... it's missing a lot of the typical \"climber's friendliness\" IMO.  The other climbers might as well all have head phones in.  The routes are wonderfully tall and great for training.  However, they lack surprises.  A single route will have only a single type of climb (just crimps, or just slopers).  It's good for training, but isn't challenging.  I personally prefer a climbing route that challenges me and surprises me with say a semi-chimney with sudden crimps that end in a surprising dyno... routes like that feels more like an adventure than a gym day.I almost forgot to mention that they have a sauna and actual gym stuff like treadmills, weights, a full locker, etc.  Truth is that I go to a climbing gym to climb (when I can't go outside :) ), so these things really don't appeal to me... but credit where it's due.", "date": "7/30/2014"}, {"review_id": "uiD5WEdW9lXioubZFkr7Kw", "user_id": "2CW3TlcoG7KxZYsku9nxsQ", "user_name": "Darren T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Being new to climbing, and yoga.. I'm blown away at how this place has changed my life. I wish I had more hours in the day to hang out at the Rim. Weight training, climbing...and the YOGA..TOTAL BONUS. Shout out to Kati, Anna, Sarah, Steve, Ryan, and Michelle.. they are the only ones I've met..lol I like that the classes have a great mix of skill sets, learning technique, and it's a nice balance of guys, and girls..lol", "date": "10/19/2016"}, {"review_id": "IwWmwcTaQPPqKNY_xObk2g", "user_id": "0RjWIwnRJCk5xMt2CgiOow", "user_name": "Brooke B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've climbed at several climbing gyms and my first time at Mesa Rim I was impressed with many aspects, but especially with their concern with safety. They make sure you really know what you're doing before they let you climb, which I LOVE. Their facilities are very clean, organized and updated. Their climbs rotate often and are always great. We love taking our kids to climb here too. With my husband's membership, our kids get free memberships. It's so family friendly!", "date": "5/9/2015"}, {"review_id": "nj2FY0B0VXT1eL0MSm9GSw", "user_id": "6NQbvQ78kkUPPlB5I_e60w", "user_name": "Evan L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "My buddy is a member and I wanted to come In for the day to try it out. The instructors were very nice and helpful. The facility was very clean and huge. There are different difficulty levels for beginners all the way to advanced. There is a separate section for bouldering as well as a full workout area. If I ever really get into climbing, this is where I'll come.", "date": "2/13/2016"}, {"review_id": "G4VF-DPeSqBfIkMYvs1NTg", "user_id": "RhM7uTY_KwlQyq9tzP7GFA", "user_name": "Sean M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 9, "funny": 3, "cool": 4, "text": "Mesa Rim is by far the nicest climbing gym I've ever been to. If I lived in SD I would come here so much they would get sick of me. I have that effect on people.This place has everything: ridiculously tall walls, three or more types of cracks (even an off-width!), free weights and machines, cardio equipment, a training wall, campus wall, super nice locker rooms including saunas. Basically everything you could ever ask for in a climbing gym and more!I really enjoy bouldering so there could always be a bit more bouldering area and variety of bouldering walls but what they have is perfectly fine.It doesn't matter how nice a gym is if the route setting sucks; not a problem at Mesa Rim. The problems and routes I climbed were all great! The other nice thing is that all of the top-rope walls are set up with quick draws so they can be lead climbed.Did I mention the walls are HUGE? Taking a fall from the very top to the last draw for the lead test was freaking scary but also a whole lot of fun!Can somebody please transport this entire facility to NYC for me???", "date": "5/4/2012"}, {"review_id": "n_fdJK2kwZvtCcRNwAoZ7Q", "user_id": "jEUDgqHEdGli8T6CkBsyOw", "user_name": "Dave W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "First timer, weekend warrior, or seasoned pro? Well... this is a good place to hit up for all your needs. This was my first time rock climbing ever and the staff here are awesome. They take really good care of you and they'll teach, motivate, and help you through the course. I believe they have all levels from 5.4-5.14 so you should be able to get a good sense of level difficulties they have here.They also have a gym workout area, ping pong/hangout area upstairs, free climbing, lockers, and other areas. This was an awesome experience to hang out with a few people and to get some rock climbing in.To be honest, I'm afraid of heights and all that. At the end of the day my hands were cramping, arms/legs locked up, and was beat to hell, but I was able to complete a 5.12 course on my first outing. Boom... motivation goes a long ways.", "date": "12/15/2014"}, {"review_id": "4mnlDEeKn-4iitPt9pE6OQ", "user_id": "9CIPSVcHKEke_v90SZKxVg", "user_name": "Emilie L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I freaking LOVE this place!  I've spent hours with girlfriends chalking up and climbing all afternoon.  Definitely the best climbing gym in SD!", "date": "5/13/2016"}, {"review_id": "QFw95l6ktZgHQ--q1R3lCg", "user_id": "MGSK7UONKjkrtev9DDpidQ", "user_name": "Victoria D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 8, "funny": 0, "cool": 1, "text": "I have been a Mesa Rim member for almost two years now.This place has really grown over this time- adding their yoga and climbing membership into one membership for ~$70 (seriously, when just a yoga membership at a yoga place is over $100). They have really changed things around and added more workout equipment and even some other workout classes, so now this is really a full functional gym. They also have a lot of bouldering. This place does get packed right after work, but seeing as how it is open until 11pm on most nights, there's no need to go right after work. If you go at 6:30 or 7pm, a lot more routes are open.They have a variety of routes, short and long routes, flat routes and routes with overhangs, simple  5.5s and crazy hard routes with the tiniest holds (I am definitely not there yet). They also have a few auto belays if you are there alone (and you can usually join a group of really nice random climbers if you don't like the auto belay and are there alone).Overall, the best climbing gym that I have been to in SD. The staff is friendly. They sell gear. Their routes are awesome. They have workout equipment and workout classes.", "date": "5/15/2014"}, {"review_id": "2xyvAbmKP5xbRUufs7TEgQ", "user_id": "_Ni3zwayXs8KzULfIkjrnA", "user_name": "Eric G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This is the best climbing gym in all of San Diego.  It is the example which all other climbing gyms aspire to be. They have everything here in regards to climbing except the ability to climb trad haha. But they do have a decent selection of excellent cracks to make up for that ;)Wish there was a mesa rim in north county!", "date": "12/19/2014"}, {"review_id": "Pf8PJkC5MyNn6nSdCUbWgA", "user_id": "xuW0C4a84yazNGLYthKVgw", "user_name": "Xuehua L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We came here for climbing today.  Oh my god, I can't believe I did great job!!! What a wonderful place!!!Actually this was first climbing for me,but I used to climb the trees when I was a kid. So I have good skills for that. I absolutely come back again because I love this place so much. We had so much fun today!!!", "date": "4/19/2015"}, {"review_id": "b69Cl2jd-KyGTFSmrPka4A", "user_id": "0DnQxBz82tU--KsevUFCTw", "user_name": "Ryan M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 6, "funny": 3, "cool": 6, "text": "Mesa Rim is primarily a climbing gym, HUGE walls, 55 feet; although standing at the bottom it looks much higher.  Highest and largest climbing gym in San Diego.  Very impressive even for a non-climber like myself.They also offer Yoga classes and have free weights and machines which is why i come here.  The yoga classes are taught by a small but talented bunch.  Most of the classes are intermediate (level 2) but i think devoted beginners could do it.What i like most is the vibe you get here.  Yoga is usually an individual thing, you go to a studio, do your thing then go home.  But since this is in a climbing gym, which is something that requires team work and trust, i think some of that spills over into the yoga studio.  Most of the people doing yoga and even some of the instructors are climbers too, so it seems like there is some sort of camaraderie even in something that is as individual as yoga.The studio has a hanging inversion swing, a back bending board to stretch out on, rollers to massage your tired, cramped muscles, and No mat rental fees, and the house mats...  Manduka!  What studio do you know lets you use Mankuda mats?   Monthly membership (climbing or yoga) is $70 which includes access to weights and machines.  Best kept secret in yoga.The climbing walls look truly amazing, i'd like to give climbing a try sometime.I also like that Mesa Rim is Green, sky lights in the climbing area and yoga studio, and waterless urinals in the mens bathroom.", "date": "3/30/2012"}, {"review_id": "yTE6RZJLVF8JORXFpFHrQw", "user_id": "2j9wpj0mr-J7V7kZRwCYdg", "user_name": "Matthew M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing here for about 3 years now. I have a fair bit of experience with other climbing gyms (at least four other gyms over the course of the last 15 years) and this is by far the best. The addition of the Mission Valley location and your ability to use both with your membership only sweetened an already amazing gym experience. The community is great. I've made many friends and been on many outdoor climbing trips as a result. I couldn't recommend it any more highly.", "date": "7/15/2016"}, {"review_id": "fl3z3tk4q4N_lUT86Mk33g", "user_id": "mfdCxWYUZ4QBjhX0JeXjVA", "user_name": "Nate C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "We did an adult group fitness event there. The team who helped us was awesome. We had our own room for when food was delivered plus great instruction and tips. The entire team made sure everyone got climbing time and help every step to improve and learn more about climbing.", "date": "3/20/2016"}, {"review_id": "Znre1g9KDO25WDl5M_AT4g", "user_id": "cNCOoKdfNz3r1i5xuL9bMQ", "user_name": "Charlie C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "This place is fun and everyone is so nice. The whole facility is clean, the equipment is functional, and they have a pro shop so that you can spend your money on dope gear. I'm glad I got a membership here.", "date": "5/13/2015"}, {"review_id": "ggNeBB8sycgkcWRAnu3pQA", "user_id": "651O9OjViLIE8O5aUBxZ7Q", "user_name": "Jessalyn C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 4, "funny": 2, "cool": 2, "text": "This is the only climbing gym I've been to in SD, and I definitely like it! The rock climbing walls are super tall and they have 2 spots to climb that don't require belaying. They change the routes up constantly and it's overall very well maintained. My buddies like attempting the tight rope and there's a gym and a natural wall setup on one side.This is THE spot to people watch (in a non-creepy way) as there are so many talented climbers that come through.", "date": "3/21/2012"}, {"review_id": "YGbL6aiuw_Ow_cXsB9HHBA", "user_id": "spFGFjZ6IugT36hDD4aIfg", "user_name": "Michelle T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 7, "funny": 3, "cool": 5, "text": "Really nice indoor climbing gym.  Their membership includes yoga classes, boot camp, and use of gym equipment and lounge.  My boyfriend and I bought their 2 week trial which included gear rental for everyday of the trial and belay lessons.  What a steal!  If you become a member, you can get 20% off your gear purchase.  The facility is HUGE and it doesn't smell funky like other places.  They have a water fountain which is also able to refill water bottles.  The locker rooms provide a place to put your stuff and has showers.I'm new to climbing so I really can't compare the routes to other climbing gyms.  I have been to some of them though and Mesa Rim is spacious in comparison and seem to offer more amenities.  Their staff is friendly and knowledgeable which makes me feel comfortable asking them a bunch of newbie questions.The only downside to this place is the parking!  There is very limited parking considering how many people go to this gym.  If you're lucky, you'll get to park in the lot, if not you may have to park way down the street.  It's not too far though and I suppose the walk over could warm you up :).", "date": "1/21/2014"}, {"review_id": "cWRXoZkmTQ3Tzkl6kFknaA", "user_id": "ioLQrCvCBz3HmlKZeFxbJQ", "user_name": "K W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 14, "funny": 6, "cool": 13, "text": "Mesa Rim is most likely the best climbing gym in Southern California. I say this with some hesitation because Sender One is pretty awesome too. However, Mesa Rim does have some additional features that give it this title.1. Mesa Rim's walls go up to 55 feet high, which is slightly higher than Sender One (50 feet). The gym is also more spacious, at 30,000 square feet compared to Sender One's 25,000.2. Mesa Rim's routes are amazingly well-organized. The holds are colored and taped to make the routes extra clear. In addition, each route is rated on various different attributes, such as quality, technicality, pumpiness, etc. The rating cards are all printed and laminated. I haven't found this level of organization and professionalism at any other climbing gym.3. There is a large variety of routes and many different wall features that make the climbs more fun and interesting. I climbed the most amusing and bizarre route here. There is a spire that contains many routes. I started one route on there, and got really confused as to where I was supposed to go. I soon realized that I was to spiral around and around the spire...it was definitely a very strenuous route! You won't find that anywhere else.The climbs here are pretty easy compared to most Socal gyms. It's on par with Planet Granite and Sender One. When I climbed here quite a long time ago, I was climbing at mostly around the 5.10d level. 4. The facility is clean and well-ventilated, and the holds are all of high quality. The bathroom even has saunas.5. Mesa Rim boasts some interesting \"extras\" that are not found in many other climbing gyms, such as a slackline and auto-belaying capabilities.6. Mesa Rim even has a fake real rock wall! Yeah that's kind of an oxymoron but it's true too...it's a wall that is made to mimic outdoor rocks. It's a lot shorter but definitely fun, and some of the routes are pretty challenging! This is great because it teaches people who mostly climb indoors to look for holds, rather than always having it \"served\" to you.Verdict: This gym definitely has the WOW factor, at least for top-ropers and lead climbers. It's spacious and well-maintained. The walls are tall, the routes are interesting, and the \"special features\" are amazing. It's a must visit for anyone who likes to climb indoors.", "date": "12/20/2013"}, {"review_id": "aLXKtC1nNMvWF8IQKQwtcQ", "user_id": "43sDbJKXQwCdvjt88TFjJA", "user_name": "Michelle M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This is a pretty awesome place to rock climb, boulder, yoga, and workout.  There are a bunch of routes at many different levels, and these change from time to time for new problems to solve.  There are also several autobelays if you don't have a belayer.  Rock climbing is a great workout and definitely breaks a good sweat.  If you want a break, a ping pong table and table soccer are setup upstairs as well as a lounge area.There are times that this gym gets very busy (weekdays after work/dinner) that you would need to wait to top rope or lead climb.  Just watch out above you as some belayers do not give a heads up that their climber is getting lowered.", "date": "12/8/2014"}, {"review_id": "WXY1G9tYO6E_8mVOHCFWJw", "user_id": "mGpRDDazqTZU1w46vjGNCg", "user_name": "Sara B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 2, "funny": 2, "cool": 1, "text": "Comparison to Vertical Hold and Review: I came here with some friends who are members. They let me and my fiance use a guest pass that they each receive monthly. ( Vertical Hold allows member-guest days, twice per month).The place was PACKED. It was so packed that we had to wait for routes to open up and the WORST part was, while you are climbing, there could be someone climbing the route next to you at the same pace and you would literally be shoulder to shoulder with them. This threw me off a bit, but we would either wait for them to get done or further ahead. The walls are sooooo high up! They are much higher than VH. I noticed that this climbing gym has some bonuses, yoga room and it looked like group exercise area off to the side with weights and workout equipment which is pretty cool. The bouldering area in my opinion is much better at Vertical Hold.", "date": "4/29/2014"}, {"review_id": "rRsn26b-Bk50ngiRLGdzSg", "user_id": "XOD8FnTz8MLDK1mHAWvP-A", "user_name": "Sally C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "I have been a member here almost since it opened. The gym has gotten more and more crowded, yet they are raising the rates for membership for everyone not just new members. I feel like the rate should be honored for current members. It is not like the gym isn't busy. I think they are just being greedy and that makes me mad. I also think they must have made some poor business decisions (spending all that money on the training center that they charge extra for and nobody really uses). It is sad. I wish they would have stayed true to their loyal members.", "date": "3/21/2017"}, {"review_id": "TdEBijXr6x-CXf1l8ZR9gg", "user_id": "iA6YcQ0rSxDGbU55V3Jf2A", "user_name": "Tate J.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 8, "funny": 4, "cool": 1, "text": "PROS:The walls and cracks are great. i love the lead climbing here! the walls are really tall witch makes for a lot of fun. they have a great shop with atc devices food and all you need for indoor. love the yoga hall, campus aria, and the elliptical room is good. can most def get a full body workout here.CONS:staff is always grumpy i saw a kid fall and slam a wall HARD and i hear them laughing \"did you see that fucking kid fall HA HA HA\" don't feel safe with staff like that.Its not funny when a person gets hurt.  I may be back! may not", "date": "10/3/2013"}, {"review_id": "DGpkhwXBMdeSGRUs4xz7LA", "user_id": "cShmR5cveImVu041It8krw", "user_name": "Darren T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "We took my 10 year old for a morning of rock climbing.  He spent 2 hours climbing one wall after another.  The staff was great and extremely helpful.", "date": "3/16/2014"}, {"review_id": "b6mh6JHQ6JM4Lgl-WBQh0Q", "user_id": "n-jyvEQwzH0K7Ovq5jOrMg", "user_name": "Paul B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I took their belay class today. The staff are super nice helpful and friendly. We only had 3 in the class so it was pretty private instructions. It only took about 35 mins. Really good instructions and they made sure not to make us feel self conscience about not knowing. Afterwards, we were give free pass to the climbing walls and instructions to the different system and walls ect.  I didn't have a climbing partner so I left, but was told that next time I show up I'll take a quick test basically repeating everything we did today. Looking forward to getting back, the walls look amazing. The place was pretty busy but still room to find a wall to climb. Sunday afternoon at 1:00.", "date": "10/4/2015"}, {"review_id": "aLTCbeGEO1MSYV3R8y8RBw", "user_id": "HVZ9r0geog8pz5RSgrSGFw", "user_name": "Rob W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 3, "funny": 3, "cool": 1, "text": "As a kid, I was a little monkey.Any excuse I could get, I'd be clambering up trees, pretending I was Spiderman, and freaking the everloving crap out of my mom.To this day, if I see a particularly sexy rock pile, I'm all over it.PRAWRRRRLL.Mesa Rim is a nice outlet for this --- comes equipped with a massive bouldering wall, dizzying three-story belay section, and the obligatory flock of shirtless ponytail climber bros. (Seriously. When did this become a thing?) There's even slackline AND an upstairs area with pool and Foosball in case your arms get burned out. And they WILL get burned out.Bouldering routes are very fun. Feels like they're rated a little low for the challenge they provide.*****************************************Quick Aside: if you're going for the first time, all climbing walls are rated for difficulty. For bouldering it goes Vb, V0, V1, all the way up to the V10 level where you're basically climbing the wall using only your monstrous gorilla fingertips to support the weight of your ENTIRE BODY, while UPSIDEDOWN. Also the wall is made of AFRICANIZED BEES....jk....probably.Each path is labelled with colored tape. The idea is to use ONLY those pieces for hand and foot holds and \"top out\" or reach the top edge of the wall, making each path it's own unique mental and physical puzzle.*****************************************At $17 bucks a pop (without gear) it's a little more expensive than the neighboring Vertical Hold, but the facility is nicer.Recommend.", "date": "11/13/2013"}, {"review_id": "Y0Twi5tf_5R0Tp66gvtDpA", "user_id": "Z3BJsAvJZLjhkD-vF2IxvA", "user_name": "Sean N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "Mesa Rim is a solid rock climbing place. Very clean and they change up the bouldering area often. Only reason for my 4-star and not 5 is they used to have auto-belay walls that for some reason were removed. I really enjoyed those because I could top rope without having to go with a buddy. I go solo a lot and it was a nice change from bouldering every once in awhile.All in all, great place, but please bring back the auto belays!", "date": "9/14/2015"}, {"review_id": "52kq_e0gFP_geHYyTC-v5w", "user_id": "o_3DTkG2j17gysTSDK6iBg", "user_name": "Peter C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 1, "cool": 3, "text": "Great place to climb!  Been indoor gym climbing for a few years now at many different venues and this place is definitely at the top of my list.  Super friendly staff, very clean, and welcoming environment.  Got my lead climbing certification here as well.  Instructors are very experience and knowledgeable.  Always willing to answer any questions and offer tips and tricks on routes.  Patrons of the gym are also all very friendly with good comradery.Love the ambiance.  Very clean, none of that grungy cringe that a lot of other climbing gyms tend to have.  Well lit with natural sky lighta and nice long tall routes.  They offer  very diverse terrain to climb from cracks to overhangs and a massive arch... they have it all.  Their bouldering area offers some nice problems to solve.  Bouldering was never my forte, so these always provide me with some nice challenges.Climbing isn't they only thing to do here!  They have a wide array of yoga classes to choose from, full weight gym, and nice lounge area to hang out.  Once in a while they will set up some special rigs to offer zip lining, repel routes, and big swings!Only down side is this is one of the pricier gyms, but nothing comes free these days.  Buy a multi day card and you can get a slight discount per session.  Of course if you are a committed climber and know you will come on a regular basis, go for the membership.Overall great place, wouldn't choose any other climbing gym over this place.  Five stars in my book.", "date": "11/1/2013"}, {"review_id": "XTXvyKrpuE4hpoXBsnDPcA", "user_id": "-G7kLW1lT7wkqiMB-WEEuQ", "user_name": "Gil D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Big place. Plenty of space work out and relax. Cool bouldering area and high belaying. A little pricey. Bring someone to enjoy this place.", "date": "12/1/2015"}, {"review_id": "mw_aD4pJxCrGtBoO0csR5Q", "user_id": "XIqCmxDcSe32896FPn7uJA", "user_name": "Allen S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 12, "funny": 2, "cool": 0, "text": "The good:This place is a great place to learn to climb. I have nothing negative to say about the climbing experience. As  new climber, the belay lesson was excellent. Me and my climbing partner were confident in our abilities upon completion of the class and spent a couple hours in the gym. Gotta say I'm hooked and I will be back.The bad:I developed athletes foot a few days after using the rental shoes at this gym. Gross! I wore socks, but it did not prevent the condition. I would not recommend using the rental gear, and I am pretty annoyed that I paid for equipment that was not sanitary. Going forward I will not be using rental gear from this gym.", "date": "7/12/2013"}, {"review_id": "0iUa5q-IAq6qt_Rq5AKwPA", "user_id": "50_JUZRXUEGFiZVKoIgxdg", "user_name": "Randy S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 8, "funny": 0, "cool": 5, "text": "I have been rock climbing for over 35 years - before climbing gyms were invented. This gym is one of the best in the country, so you should check it out.They have 50+ foot tall indoor walls, with some great climbing features.Most importantly, the route setting is first class.The staff are friendly and the facility is really nice.", "date": "7/10/2013"}, {"review_id": "kHU3iaWx37bd7qygaDjyFg", "user_id": "r140ueSE5FKT5fbJGlEBFw", "user_name": "Tad C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Mesa Rim has great Rock climbing options for all levels.  They have generously donated their facilities to Outdoor Outreach which is a non profit organization that supports youth leadership for inner city youth in San Diego.Thanks Mesa Rim!", "date": "11/29/2014"}, {"review_id": "x6vx_ruikePrAr0fgXX4xg", "user_id": "2zBE6Sycl_5DlSVd8sXccQ", "user_name": "Sdtjm S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "Since this is the one and only gym I've ever been or belonged to, I can't claim genuine assessment qualifications. All I know is that I am really loving my involvement here. I find the staff super friendly and helpful and my climbing improvement has been drastically noticeable for me and I am very, very happy about that. Currently they have 6 auto belay stations ranging from 5.4 to 5.10's I believe. Since I'm just a 5.8 climber still, I can get plenty of practice and work out if I go alone. I can warm up on the low grades and keep climbing challenged and wiped out by the end of my session. On another excellent note, by two teenage daughters started climbing with me a few months ago and we've taken advantage this summer of their teen club \"Rock Techs.\" Both my kids have been learning techniques and strategies twice per week this entire summer and they have grown immensely. The older is climbing 5.10s now while the younger is quickly approaching 5.9's. I'm very proud of them and the enthusiasm they  have placed into the sport of rock climbing. Joe has been their coach and teaches and motivates them very, very well.As a father, i would highly recommend this climbing gym to any family looking for an outstanding healthy activity. As a beginning climber (starting the sport at age 50) I would highly recommend this gym for its friendly feel, excellent staff, range of routes, cleanliness, challenges, inspiration and opportunity.Thanks Mesa Rim for giving my family a new awesome activity in our lives, both the bonding with teenage daughters and the individual growth that is core of climbing. I am very pleased to be a part of Mesa Rim Climbing Gym.", "date": "8/1/2013"}, {"review_id": "J5SH1m1yefjc91f2-Czzrg", "user_id": "o2Or6xqxeWaE46tdzK0UGg", "user_name": "Lisa W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "Damn, this place is crazy. Love it. There are a lot of walls and bouldering space available. It's a really great exercise...and there are a lot of young people. It's nice to be around people my own age. I'll definitely come back for that great workout.", "date": "8/2/2011"}, {"review_id": "OkdogQ3pK5FcrYcRRrfPsQ", "user_id": "9Jby36JmbC2nM_iSBC-A4w", "user_name": "Alison B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome gym! It's the biggest one I've been to. Possibly the biggest in San Diego. Lounge, weight room, sauna, bouldering and ropes. It's a little pricey $20 a day pass plus equipment but for what you get its decent. You need to know how to put the belays together so you either get a lesson or take a test so I suggest getting there early and be prepared for a 20 min set up.  I prefer the ropes the be ready to go like other gyms but I understand what they're trying to teach you. Ill be back!", "date": "10/29/2015"}, {"review_id": "O-fBsCspPK4j8KcHamrugw", "user_id": "LjZ09JPj3XbNeVt07Pa0DA", "user_name": "Ron C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 4, "funny": 4, "cool": 4, "text": "Great Workout.My first time rock climbing was at six flags which was relatively easy but this place is definitely a challenge. I came here yesterday for their one year anniversary for free.!! All I needed to do was rent the harness and shoes which is only $6. I highly and encourage anyone that wants or needs to work on their upper body strength. I will def come again in the future with friends. Swaggggggg", "date": "5/23/2011"}, {"review_id": "R7RCAlAntH4aq9Mp4b_9qA", "user_id": "Dl79aLIS6GoUHJr9MH54hA", "user_name": "Tika B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Let me start off with the fact that I am not an athletic person at all! My sister forced me, but I ended up having a really great time!I lasted about 2 hours rock climbing with plenty of breaks. They have different types of courses for people who vary from beginners to advanced. It's a great work out! We also did a yoga class (Level 1). The class was great, especially for someone who has also NEEVER done a yoga class before! The instructor was really sweet and patient and didn't make us feel bad for not being able to do some of the moves.They only offer a full day pass for $17 which gives you access to all their facilities. You also have to pay an additional $6 for gear, which is still a pretty good deal!I would recommend this place in a heartbeat. Everyone that works there is really friendly and the equipment is super nice!", "date": "9/12/2014"}, {"review_id": "OH-IKy41UWBY3DyO7t9XaA", "user_id": "NSEeLnO3hnBYSecHOWH1nw", "user_name": "Derrick N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Came here with a friend for the first time this afternoon and it was fantastic. I bouldered for a bit while waiting for my belay lesson so I could climb with my friend later. The staff was super helpful and I loved that they had more than just rock climbing as well. It is quite an impressive facility, I will be back.", "date": "9/19/2015"}, {"review_id": "EzQodueocwg7tHupRv929w", "user_id": "M_DpPbMpAPU9ZCjVImMk4Q", "user_name": "Christy S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Our two daughters (ages 10 and 7, and beginner climbers) did a session of summer camp with Mesa Rim this summer. They loved it! The daily activities were fun, they loved climbing outdoors at Mission Trails on Friday, and they really enjoyed the counselors. From the parent's perspective, it was well run and organized, and I really enjoyed that yummy lunch and snacks were included. The facility is really nice and safety was a top priority. Will definitely be back next summer.I wish we lived a bit closer, as I am sure we would all appreciate coming here more often for exercise and fun.", "date": "9/2/2013"}, {"review_id": "bYgBC1CP2gOgLFnGn7VX_Q", "user_id": "hwKwdY5OZYoP7QozvxCDfg", "user_name": "Joshua K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 2, "funny": 5, "cool": 0, "text": "BIG rock climbing gym ftw, etc.  Like some other reviewers have mentioned, the staff are very strict, serious, formal, and official when it comes belaying/proper instructions.  You must demonstrate you can do it to them.  If you don't know how they will require themselves to teach you for a fee.  NO COMPROMISE. Your buddy doing the teaching does not suffice.  They are the gatekeepers to unlocking this arcane knowledge in this place.   WORKAROUND FOUND!The only caveat is it requires someone who already knows how to belay and is certifiable by the establishment already...and unshakable resolve. Have the belayer guy frequently, incessantly attempt to teach everyone else in plain view of the staff totally blatantly...heed protests, but only move to a new location each time, and do it poorly so they catch you again...and again, and again, and again, and again.  This is pretty natural if your belayer guy really loves the teach and cannot help himself.  The staff will get sick of giving you warnings, start to have a nervous breakdown, appeal to the greater good, forsake the capitalist spirit of commerce, and teach everyone for free lest we all break our necks and die by doing it wrong because we didn't get the official instruction thus becoming ghosts and haunting the staff forever until they are dead, furthermore casting a black shadow of death over this place dooming it for eternity...or until they go out of business.  Your mileage may vary.", "date": "6/6/2013"}, {"review_id": "u2UyFzfv0-S3AhWEUIYu5Q", "user_id": "9v83UksZrkThOiE584GRBQ", "user_name": "Oulie T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 5, "funny": 4, "cool": 4, "text": "Wow!  I love Mesa Rim! It's so well organized and thought out. It's like the JW Marriott's of climbing gyms, not quite the Ritz Carlton but close. It's super posh in terms of climbing. The amenities include showers and a Sauna, what?!! I can't imagine too many dirtbag climbers can afford this place seems like its more for the lululemon crowd which is a good thing for business. I didnt know a climbing gym could be so clean and I really appreciated that.  Layout of the gym is fabulous. The route's are great fun. Kudo's to the setters. With teeny tiny walls for tots to huge towering walls for more spideriffic climbers, something for everyone. There are fitness machines if u want to supplement your climbing workout with a regular workout. The upstairs lounge is great if u want to take a nap, utilize wifi for work/school, eat lunch, play a game of ping pong, pool or foosball. The staff are great too. I love their wall of suggestions and the thoughtful witty responses to them it really shows the owners and management care about the place and are always trying to improve.", "date": "2/24/2013"}, {"review_id": "93clhFWBT-AJYnD6NU5l_g", "user_id": "Z9Vf6iE5wdNIaKm6QJ4DQw", "user_name": "Chris S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "I love coming to this gym.  I opened up a membership 2 weeks ago, and have been coming every other day since.  Indoor rock climbing is a new hobby, and I just recently started up and was a first time climber when I joined.  The staff was was nice.  On your first day, they will check to see if you are certified to climb.  If not they will need to test you to make sure you're qualified to climb.  They offer lessons to first timers, which I needed to take.  The lesson was really good, they were really informative, and broke down each and every step in a manner that was easy to understand.  They were friendly throughout the process.  The test itself was pretty straightforward and not really a test as it is a formality...easy to pass after their instruction, no sweat.  Just remember \"Belay...Belay On\", \"Climb...Climb on!\", hehe.    After the test, you're free to climb away and use their different climbing walls and routes.  They have a great selection of walls and routes to choose from, with varying levels.  I particularly like how high some of the walls go, compared to other gyms I've seen.  I'm sure to the avid climber, its more the difficulty of the routes as opposed to the height that matters, but I just thought it was fun to scale a wall so high.  Like any gym, there are dead times and peak times to go, in terms of crowds.  It can get pretty crowded during after work hours (5-8pm).  Weekends are pretty busy as well.  Overall, even during the busy times, I didn't feel I had to wait too long to wait for an open rope.  The gym is a pretty large space, so there's plenty of room for everyone.  I didn't feel too crammed in.  This gym also has some workout machines and treadmills, so its meant to be complete gym.  I think they also offer yoga classes, etc if you're into that. Overall, my experience so far is positive, and I enjoy coming to this gym.", "date": "5/13/2013"}, {"review_id": "U7QA9JJRee1vg6S26XZ2og", "user_id": "k6VORFJ689uLzOLWfXDlXA", "user_name": "Michael M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been climbing indoors in the Bay Area for a few years. Showed up here for a day while on vacation. Staff was friendly and helpful. Equipment was in great shape -- seems like they probably change the ropes a little more often than my home gym. Grading on the routes was a little tougher than I'm used to, which is a great thing for everybody who calls this gym home, and a humbling experience for me. There are some very long and negative routes here that are not even graded 5.10. Awesome place to visit if you're a serious climber. Even better place to be a regular!", "date": "12/27/2015"}, {"review_id": "QcVJfDqHR_q5WZ4-EMthSA", "user_id": "PRLfGXeWdVFb40AGUZ99-w", "user_name": "Diego M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It really is an excellent gym. The auto-belay system makes it so it's easy to go climb whether or not you have a partner. Often times you'll find partners at the auto-belay stations, or at meetups.This gym is more expensive than the others in town but it really feels like a premium experience.", "date": "10/1/2014"}, {"review_id": "suIrj8shHanWteRCQIBoYg", "user_id": "_Eu5Yq9rQxnPU-VMyfJfTA", "user_name": "Adrienne L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "Fairly big gym for San Diego, moderate amount of bouldering walls. I'd say they grade a little lower than its set, so don't be surprised if you find your usual range harder then you anticipated. They have some fun tricky routes though. Also they have the auto belays set with good routes too, 5.6-5.10s, in case you go solo- otherwise beginners only have a few routes to try before it gets rather hard. FYI* If you've never belayed they require you to take a class (fee, limited offerings) and don't allow friends to teach friends in the gym (you can step outside or teach beforehand).", "date": "6/4/2013"}, {"review_id": "6jFHE-8PXvDED3Qpl4bOgA", "user_id": "gi9eXhza1TXAloo--MOktQ", "user_name": "Joseph A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have a lot thanks for mesarim as lot of my good friends came from meeting them at the gym and going on adventures climbing outside with them as opened my world to climbing. The staff is always helpful and the facility has everything you need to become a better climber. And with two locations now in san diego this place the best.", "date": "1/21/2016"}, {"review_id": "7Lem_ePLRGX0wZu5LTcx5Q", "user_id": "PcYewbW_IXiFPOCb1b_pmg", "user_name": "Lou B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Mesa Rim is the best climbing gym in San Diego.  The facilities are excellent and the staff are knowledgeable, helpful and friendly.", "date": "1/17/2017"}, {"review_id": "YODGhcOP6A2fwJZ6TYDdnA", "user_id": "6GvqYaTSE9Qie9n7A3hsaw", "user_name": "Luisa B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I truly love this place! All the staff are very nice, helpful and very knowledgeable. I used to climb outdoors but stopped for more than 2 years. I just recently came back just about 5 months ago and been trying to climb at least twice a week!The facility is very well maintained, fully equipped gym, yoga and even a sauna! I still have yet to try their sauna!They offer youth groups as well. So nice to see some kids starting at a very young age doing this kind of sport. So parents, take your kids! I always encourage my friends who now have kids to let their kids try this place because i see those kids having tons of fun climbing with their peer. They have plenty of routes starting from very easy to difficult! They just recently added a 5.14b and saw this guy finished it! That's pretty amazing! They also refresh their routes quite often which is nice because it changes things a bit.Their prices are pretty reasonable. You get some discount if you're in the Military, an EMT, student.. i got mine as a student for $63/month and it's unlimited. They also offer yoga classes and other climbing lesson for free or at a discounted rate.", "date": "5/27/2013"}, {"review_id": "T_ssdmpZjkBGtzLBKTGHcw", "user_id": "bB8m3sNCFD_CA2875g4c0w", "user_name": "Nancy W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Love this place! Plenty of different fitness activities, I was sad that the next belay for 3 wasn't till 3PM and we had to be out of there by 2, but its all good! I can't wait to come back. the bouldering section was very nice and the tight rope was a challenge. Also the pingpong upstairs was fun!", "date": "8/28/2015"}, {"review_id": "CGW9vyrUjJ6plif12Qqxww", "user_id": "i0uA4cr4-m39XZZzR3-DWQ", "user_name": "cliff t.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 8, "funny": 5, "cool": 3, "text": "Before I begin my review, let me give you some background on the reviewer so you can better frame my thoughts...My wife and I visited Mesa Rim for the first to visiting vacation in San Diego.  We have been climbing for about 5 years and are members of a gym back home in Colorado Springs.  We currently climb 5.12's (outdoors in Colorado) and project 5.13's indoors so we know what both indoor and outdoor routes \"feel\" like.  With that out of the way, let's begin the review....The first thing we noticed when we walked in was that they appeared severely under-staffed.  On a Sunday afternoon, there were only 2 people at the front desk and I really didn't notice anyone out on the floor.  It took about 10 minutes to get my belay test which I do commend them for getting me through quickly once it started.  We normally lead climb and are used to being able to borrow or at least rent a rope.  This was not the case here.  So if you're visiting and want to lead, bring your own rope.The major gripe we had with this gym is the Poor Route Setting.Even though they boast the tallest walls on the area, it seems that the route setters are intent on maximizing the number of moves on each route?  How you ask?  By making you traverse back and forth across the wall several times on your way to the top!  I know all gym routes are contrived but this was ridiculous.  There was one 5.11b that made you traverse 10ft to the right, up a couple feet, then back left 10ft before continuing up!  C'mon Man!?  When does this happen outdoors?  If you did this outdoors you would get so far off the bolt line you could hardly be considered on route.  Another problem with their routes is that they felt more like long boulder problems than sport routes.  Most of the routes started off really juggy (even the 5.13's) I guess to keep people from decking on lead?  But then it would become continuous the rest of the way.  As a result, the climbs felt under-rated.  On one particular 5.12, there were at least four solid 5.12 moves on the 2nd half of the climb with no rests.  Look, a climb that has one or two 5.12a moves can be graded a 5.12a.  If there are four 5.12 moves all together in one section, it should be rated higher.  One final thing about the routes that did not affect us but would if we lived here and were considering a membership is that they doesn't appear they are changed very often.  I saw climbs that had been up since June of 2011!  Unless that \"6/11\" tag meant June 11th of this year?  The other big thing that detracted from this gym was how F-ing hot it was inside.  I guess being that they are in california they don't believe air conditioning is necessary  But considering they are in a warehouse type building, it is!  The teperature on the floor was just barely tolerable.  But once you start climbing and getting close to the ceiling, the sweat just starts pouring in the sauna-like temps.  I haven't sweat that much while climbing since I was in Thailand!  If they aren't going to air condition the place, the least they could do is put some high volume fans on the floor and on the ceiling to try to make things feel cooler.  OK, I've rambled on long enough.  Check this place out for yourself and see what you think.  For us, our trip gave us a lot of appreciation for how good we have it at our home gym in Colorado.", "date": "8/13/2012"}, {"review_id": "7GaiCodihEWHs2Says75tg", "user_id": "A8RICN1EMjyB6oSt4k_plA", "user_name": "Heidi S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I moved to La Jolla for school a year ago and thought I'd check this gym out since I had been climbing and working at Rockreation in Costa Mesa for the past 7 years. I've been climbing for a long time but am sort of out of shape so I needed a gym that would offer easier routes to allow me to get back into my 'groove.' Anyway...I've been to many gyms all over and this is one of the biggest ones I've ever been too. The walls are super tall as most gyms go up about 30 feet I think this gym goes 50 feet high? maybe more. What I really like too is that they have autobelays for people like myself that don't really like bouldering but also don't have a climbing partner since they are still new to town ;)I really like this gym and am hoping to get a membership sometime in the near future. If anyone out there is looking for a climbing partner...let me know! :)", "date": "7/10/2013"}, {"review_id": "oWvbbA5tQB3TAozQciRVuA", "user_id": "_Ow2qqG9GmrzB7mm2LYh-A", "user_name": "Lace J.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is an awesome gym no matter how experienced or not you are. The rope walls are some of the tallest in the country and the setting is solid but still friendly. The new training center is legit if you're strong and wishing to get stronger. Staff is awesome and they have a great little chill space on the mezzanine. Haven't done a ton of bouldering here because there's just so much tall rope climbing. But everything I've been on was fun. If you want to get an endurance pump, this is the place to go.", "date": "10/18/2015"}, {"review_id": "1Is5PkXQ_jy0c9Kh72P64g", "user_id": "FXgJTjdVotlVSIJQmmhhHg", "user_name": "Rico T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Visiting San Diego and stopped by this gym for a few hours. Love the routes here, very creative and skillful route setting, routes feel harder than the gyms in Vegas where I live. Friendly staff , clean. Huge rest area upstairs with couches and lunge chairs and tables. Free wifi. There are cracks in the wall for crack climbing practice. Wish we have a gym this big and good in Vegas.", "date": "2/1/2015"}, {"review_id": "6vpU6Jiqa3S0GgEF5VUwYg", "user_id": "QaIxnj1gMs6FyoOKB_D9xQ", "user_name": "Olga T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The greatest. The height! The bouldering wall! And amazing youth lessons by coach Kelsey! Just one suggestion: include (or otherwise make available) the use of the fitness gym for parents while the kids are in the lesson (the mashine seem to be underutilized anyway, people are here to climb)", "date": "6/22/2016"}, {"review_id": "j9jGsCDDeG8Ok1Shob9onA", "user_id": "jIZ9hSbuoqJWghsi4XVuzQ", "user_name": "Adam T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "This place rules!I came in with a yelp deal and didn't get any snooty attitude for using a coupon.  In fact, I was personally shown around by a very friendly and helpful front desk staff.  She showed me where all the awesome stuff at the gym was including: free weights, machines, a huge and awesome bouldering wall, campus board, moon board, slack lines, yoga studio, saunas, and the of course stellar top roping/lead routes.  Mesa Rim is a bit of a drive for me but definitely worth it if I put a few hours in.  I unfortunately ripped a big ol' flapper after about 2.5hrs but I'll be back.  Oh yeah, I'm writing this review using their free wifi that is pumping out of the lounge up stairs, complete with pool table.", "date": "10/23/2012"}, {"review_id": "Vb_yICcygVB0M-ActJ0koA", "user_id": "xy1UjyJEkeY5vD5r_S8KdQ", "user_name": "Katherine D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I think Mesa Rim is one of the best gyms to train at. Their top rope/sport climbing walls are 75 ft., and there's also a ton of bouldering to do. The staff is very friendly, and the whole atmosphere of the gym is very mellow. I competed here a few weeks ago, and I totally wish there was a gym like this in the LA area. They can accommodate big groups, and they have all types of climbing - even crack! I'm going to visit this gym every time I'm in San Diego.", "date": "4/26/2013"}, {"review_id": "L_d1eGoUbctU2DsfVJFAVQ", "user_id": "oaMp6ow6SwPe3xzWxBtgsQ", "user_name": "Jason N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym and the new training facility is state of the art and very inspiring.", "date": "8/10/2015"}, {"review_id": "d4kpgDmyRmZ3v4BqGdTN6Q", "user_id": "XfIUZ9XgBZVN0jzojKBvYQ", "user_name": "Cathy N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place is super big! They have hella routes and I really like the self-belay option but they don't change it up that often so I don't get to do as many routes as I want.  They are pretty strict gym when it comes to knowing how to belay, so if you are planning on taking someone who is a novice at belaying make sure they know what to do.  They dont allow you to teach other people how to belay, they require you to know how to belay where you have to be in the break position between each movement.  Monday night is college night, it is $13 including rentals.  It is SUPER crowded! On a regular day you can get a discount if you are a student, EMT, or military (i think). It is $15 for a day pass. They also have a lounge upstairs above the bathroom where you can chill or study.  They also have a ping pong table. They also have gym equipment.", "date": "3/29/2013"}, {"review_id": "8eZDAb3TEZ89fop9SfroGQ", "user_id": "BnZYHUmqIk5V5xuHWkuY6g", "user_name": "Brian C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I came here about 6 months ago for the first time. The employees were extremely helpful and friendly. They were very patient and taught me rock climbing techniques as well as safety. This place is definitely worth a try. I enjoy the different facilities they provide as well as the difficulty and variation in walls to climb. The price for a monthly membership may seem intimidating at first, but it is definitely worth it. A weight lifting gym, rock climbing, bouldering, yoga, and a recreational center all in one! 5 Stars", "date": "1/30/2015"}, {"review_id": "02T5TwVYAQ1gCpI-C9SuCQ", "user_id": "s1dVBB4bLEFlz5iHMcGl5g", "user_name": "Hiro S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have been climbing here for the past year and since I only climb indoors it's nice to be able to test my endurance and challenge myself with the taller walls. The other local gyms can't compete with the height of the walls at Mesa Rim. The routes are setup with varying difficulties evenly dispersed so you don't feel as if there's only 1-2 routes you can climb. I would like to give this place 5-stars but the monthly membership fees are a bit steep. It would be nice if they were more competitive with their pricing.", "date": "10/17/2013"}, {"review_id": "0o-qRDLMEkhqIHcTfCxDKw", "user_id": "eZoPLbIMmgQ04I1KVk5dXQ", "user_name": "Dusty G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 5, "funny": 0, "cool": 0, "text": "second best gym I've ever been to by a pretty long shot. Mesa Rim was very, very impressive. it would definitely be my gym of choice if I lived in San Diego.the place is pretty big (one of the biggest in the country, just behind Earth Treks in Rockville MD and Stone Summit in Atlanta GA, I do believe). the walls are taller than other gyms I've been to (definitely a \"plus\" over Earth Treks - 55ft vs. 40ft). the setting was creative, varied, and fun (though the routes felt a bit easier than the grade, but then again, that's all relative). I really enjoyed the bouldering as well.the staff was super friendly and helpful. the community seemed really strong, which is something I always look for at gyms.the one thing that caught me by surprise was the need to bring your own lead rope. I've never come across this before, and while I was disappointed that I wouldn't be leading (their lead arch looked incredible, and the climbs on it were really, really cool looking), I knew it was just the way the gym operated. not what I'm used to, but certainly not something I'll hold against them.overall, I had a really positive experience here. whenever I'm back in San Diego, I'll be back to Mesa Rim. I would recommend this place without hesitation.oh yeah, and they also have slacklines set up, which is sweet. including a spot to set up a highline 35 feet off the deck. now that's something you won't find at most gyms.", "date": "5/21/2012"}, {"review_id": "SCapjhrQQVLxf8XvqYztaQ", "user_id": "KqbzpMkSZfTNzU25P9WAKA", "user_name": "Phuong T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Pretty awesome first time experience. Would have been even better if we had left the crazy toddler at The Gramps. Huge walls and good padding unlike Vertical Hold. The thought of possibly falling onto gravel just doesn't sit well with me. Super clean. Everything looks like they're in great working condition. I was not quite trustworthy of the auto belay, but it was my fast time and I didn't read much about it until after. We are so spoiled to have such great amenities within minutes from us! Planning on becoming a member as soon as our LA Fitness membership dies. Plus, I plan on hosting my daughter's 6th birthday party here!! Her first time here was a success! What a champ! Anyways, the staff are super informative, easy going, and friendly, which is a plus! Customer service at a place like this definitely deserves extra recognition!", "date": "5/12/2015"}, {"review_id": "hyslSNHJx72dA7h6_PJudA", "user_id": "PD6qoOi7Cfz5GYs1d5CzQQ", "user_name": "Leilani C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I definitely get a good workout here. They change the routes pretty frequently and have a lot of variety of levels. They have routes where you can practicing stemming, and chimney and cracks which is great! If you already know how to belay, you can opt to take the belay test and they give you a laminated belay card. This gym offers longer routes for top rope which is great! I also really liked how there's a small gym area for weights and core. They also have yoga classes if you are interested. The staff is friendly are very helpful. The people who come to Rim, generally are very friendly and normally are a great source of advice for routes or even offer to belay you. Overall great experience!", "date": "5/15/2013"}, {"review_id": "LO2nVwKdoezTBka6ujTgPg", "user_id": "YDmaY2hFNBYrZiNO8xx1Nw", "user_name": "Keith O.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "In my opinion this is one of the best climbing gyms in San Diego! Friendly staff, clean, and they always have new routes for you to try.  They also have many workshops that help aid your climbing skills.I love the bouldering section here when the rock climbing gets hectic. You'll never run out of things to do here. If you get bored you can always try balancing on the slack line.", "date": "9/6/2012"}, {"review_id": "VcvO2tjxH5f4r-lzizf3Yw", "user_id": "J6LcP8UvwpIQOox0VGOLUw", "user_name": "Chris l.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 9, "funny": 1, "cool": 1, "text": "Well me and and a group of friends (4) total called mesa rim to do some climbing they said come on in we will certify you and have you climbing right away.So we drove all the over to there location which is about 30min drive for us.We started by filing out the forms and payed 21$ dollars which took an hour??.Then after we payed and put on all of our gear they then inform us they are short on staff and can not train us for another hour?? Like they couldn't have just told us this before they took our money ?? We said no way as we had already at this time been standing for an hour waiting for them to tell us this in the first place.Now to make things worse the staff is completely Stoned no lie, and completely unprofessional and extremely Rude offered us no apology of any sort.We decided to leave and were refunded our money and were leaving the the building and all the sudden the supervisor or manager shows and up and says sorry that's it.Offered nothing for us to return a second time and give them the chance for wasting our day.We came to mesa so excited to climb as we have been to all the gyms in san diego and waned to start coming here on a weekly basis.But sadly the staff here ruined it for us.Now let me tell you the good things they have to offer..there walls and gym are second to none the gym is amazing this place is alot bigger than anyother indoor climbing gym in san diego.They also have great yoga classes.Im not sure i will ever return due to the lack of the staff being so unprofessional but wont count it entirely out.", "date": "1/24/2012"}, {"review_id": "PqHrlucfO36d-OeGvtVohw", "user_id": "rVxehsr5SRtrXj7i751kRA", "user_name": "james b.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Excellent indoor spot.  Tallest walls in town with plenty of routes and a good variety of difficulty level.  The ropes are in nice new shape compared with some other places in town.  Also, the workout equipment is nice if you want to get a little other workout in before or after a climb.  I've done yoga classes here too that are a good prelude to a climb.  Also, the staff is great here.  Downsides - the bouldering walls are a little limited in variety.  They are really geared toward advanced climbers, so if you are a beginner or intermediate, this isn't the greatest place to boulder.  Other spots in town do better in this regard.  Also, crowds.  It gets really crowded in the evening sometimes.  Try going during the day if you can, you will have a better experience.", "date": "9/3/2012"}, {"review_id": "M_FurqwH9p_lpH0UIx8DXQ", "user_id": "ULUhb_FrcmL0BAp1b34DUA", "user_name": "Darlene B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Whew! Rock climbing is really hard! I've only done it once before, and totally forgot my initial experience. I work fairly close to this place and it's always crowded. Their parking lot isn't ideal, not enough space, parking on the street is probably suggested. Luckily the location had an event going on that day, an All Day Pass was only $15 - but some of the things were closed off, it's usually $20 - then it's an additional $6 for the equipment and chalk. This place does not provide any direction or complimentary lessons, just gives you the stuff to explore on your own. Because of that, we were limited to the few that had a harness, rather than doing the 2-people experienced climbs. I went with my cousin's family, her two kids were really good at climbing up. I didn't realize how much upper body strength you need to do this. We definitely got the work out I didn't expect to have. With the All Day Pass you have access to the other services. We went over to the gym area and tried out their equipment. It's kind of pricey to do this, but I did enjoy it.", "date": "4/21/2015"}, {"review_id": "AKbocF5sCm78F_D7G-xM1A", "user_id": "7jgiCYKjnUKfScD-2beg4Q", "user_name": "Julie B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 5, "funny": 0, "cool": 1, "text": "Well, after seeing all the reviews for this I know Mesa Rim doesn't need another one, but I figured I'd add our experience to the mix. My kids have been climbing here for a couple years now and it's the highlight of their week. The staff are extremely helpful, and there is very low turnover so they see the same people from week to week and get to know them. A big factor for us is the natural light in the facility, it really adds to the experience. Others have hit on many other great features of the gym. Highly recommended.", "date": "1/24/2014"}, {"review_id": "fipfK0B6kwWkjfD20SOfng", "user_id": "diV9ei9o-qFhn42KntKi5A", "user_name": "Josh L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 2, "useful": 7, "funny": 0, "cool": 0, "text": "Poor customer service experience. Example - we were excited to bring my nephews rock climbing, but apparently the waiver we printed was not the 'full waiver' and the staff was unaccommodating to help work around this, regardless if a grandparent or uncle (with the same last name) was there with them. FORTUNATELY we went to a location in poway and had a great easy going time, the way it should have been.Honestly mesa rim, we were considering signing up for the yoga/climbing membership but the experience make us feel like spending money elsewhere. I will give credit however, the facility looks great, but I will never know for sure.", "date": "12/27/2011"}, {"review_id": "HxN8CUhfynqwAKTmg5EWXQ", "user_id": "LJDblZ1ewTG3FfRbF1lmmQ", "user_name": "Zohreh A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Had an awesome experience here. The staff were so friendly and helpful. I took the $8 belay lesson and the instructer was super clear and helpful (also very good looking haha). There was a huge variety of walls and routes you can take. They have some really high walls which allows for you to continue your climb for longer. The routes are color coded really well.. not just with tape but also the stones are somewhat color coded as well. The bouldering area was huge and offered a variety of routes as well. There are some amazing climbers that come here and it is super entertaining to watch them climb.", "date": "4/28/2012"}, {"review_id": "0yJJimriTTpFT_icxYD87w", "user_id": "0vsb0GyMS72cv7-wEpoTqg", "user_name": "Allison C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Mesa Rim is hands down the best climbing gym in San Diego -- and the best I've ever been to. The walls are high and the routes are always changing. I wish it were a little closer to center city, but it is worth the drive to Mira Mesa. I am always challenged when I go there, and any friend I bring is impressed. After going here, other gyms in the area are disappointing!I took a vinyasa yoga class at MR once, and it was also excellent. I bought a pack of 10 passes for $150, which saves a little bit of money. Also, if you join and go with one of the San Diego climbers Meetup groups, on their Meetup nights you can get in for $15.", "date": "3/5/2012"}, {"review_id": "drTuM8wYKVecEFepwFDTJQ", "user_id": "-xKA7InbSLt5jSuHVjXC7Q", "user_name": "Olivia L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Large facility with both rock climbing walls and a bouldering section. I like that the walls were really tall! The bouldering section was decently sized, and the whole entire floor is made up of a cushion material so don't worry about falling or trying to place a mat underneath you! :) This section can get pretty challenging, and they have tape on the handholes to show the level of difficulty as you plan your route. I didn't get to try the normal rock climbing walls this time around, but they looked fun. Just A LOT more crowded and a little more tight and not as open. I also saw they have lockers in the bathroom, and a nice weight room section. I'd like to come back to rock climb some more and see what else the facility has to offer!", "date": "7/10/2014"}, {"review_id": "_ru41Lkcl-6UJRJk9dpbXg", "user_id": "J2A5xGSDgln4_v9xiC-Qwg", "user_name": "Matan S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 27, "funny": 2, "cool": 4, "text": "Between the bad customer service, the lack of knowledge of the staff, and the belay technique they force you to use i can no longer recommend this place.It's silly that i can go to any other gym and am commended on my belay technique but at Mesa Rim I'm unsafe.I'm an experienced climber. I've been climbing for well over a decade. I've managed a rock gym, guided outdoor climbing trips, and am a certified setter. The issue with Mesa is that they cant ever seem to be on top of the ball. Both me and my partner have gotten belay certified for both top ropes and lead climbing multiple times, but every time we come in we are forced to go through the whole testing process again and again and again because they cant seem to keep a straight record of tested belayers. This time was by far the worst test i have taken:First off they force you to use a belay technique called the BUS. I have been tested before at Mesa and commended by their staff on my belay technique. i use the Pinch technique which has been used for over 30 years and is BY FAR the most commonly used belay technique at the moment. But during this test they forced me and my partner to use the BUS and said that they were \"trying to evolve the sport\". Excuse me? You've been around barely a year and you're at \"the forefront of the sport\"??? Never mind the fact that NO OTHER GYM IN THE AREA takes this my-way-or-the-highway attitude when it comes to belay techniques. Before we even began the test the employee who was testing us stood on my rope TWICE. That is rule number one in rope ownership, you dont step on the rope... and you especially dont step one someone else's rope. I started to lead climb. The first clip was set up incorrectly (gate facing the climb) so i back clipped it in a way that made it safer. The tester called me out on a back clip, i explained to him that in fact the draw was set up improperly. So he asked me to play along for the sake of the test. The fall that they had set up was pretty unsafe too: a fairly good whipper on a vertical wall. My partner took the fall without a problem and because of my partner's experience i was not scared, but for less experienced leaders that fall could turn out badly.When we were done with the test we were so frustrated that we didn't even want to climb anymore. My partner got her money back for the 10 visit punch card she got that day. And we went and had a beer to forget the whole ordeal. I will most likely never climb there again. Vertical Hold is far cheaper and friendlier than Mesa. Plus i wont have to deal with being told that im \"unsafe\" for climbing the way me and all of my friends climb, and for that matter most of the sport.------Mesa if you want my business again then stop forcing the new technique and get some employees that know a little more about climbing-----On a side not: i understand the appeal of using the BUS technique: The brake hand is in the brake position far more frequently than the Pinch technique. I understand if Mesa wants to teach this new, dummy proof, method of belaying to the new people coming into the sport. But you cant nullify a technique that has been used and accepted, and still is accepted, the world over. Go climb outside in CA and you will see that the majority of belayers use the Pinch method.", "date": "9/4/2011"}, {"review_id": "eqkcdt94_g2xNFBeiCx7jg", "user_id": "3uR1JrMD6P9ltOx9jLtgcQ", "user_name": "Jenny K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "The walls are so high! It really takes a lot of stamina to climb one route, so I tend to go for the lower level routes at this location. The customer service is stellar, and the staff is very helpful and friendly. They have a very sophisticated sign-in system that utilizes a barcode-scanning mechanism to check in the members. I got the Yelp deal and so I'm only spending $5 per visit including all rentals! That's a really big steal.I had already learned how to belay at Vertical Hold, so all I had to do was pass the belaying test and I didn't have to go through the whole training thing again.Compared to Vertical hold, this place has better top rope but Vertical Hold has better bouldering. I didn't appreciate how much of the walls they blocked off to set new routes, whereas at Vertical hold they tend to alter smaller regions at a time. But then again Mesa Rim is a much bigger facility. They also have cardio machines and weight machines, which I have never used. They also offer Yoga and stuff like that.", "date": "3/22/2012"}, {"review_id": "mdWGCjjs3oz991hEAiKnSQ", "user_id": "44pGoePA4Ku2i9Rwa49jng", "user_name": "Kief Z.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 4, "cool": 0, "text": "Good gym. I went for the first time about 10 years ago, and went again recently with a friend. I would definitely recommend it.", "date": "8/13/2014"}, {"review_id": "nZC_rZdz7P1VLlhM6ctqBA", "user_id": "BtnH3TyOCL-X2YVXd3PWQA", "user_name": "Krystal Q.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Now you know when people tell you to find a hobby?  Yeah, well it's more like find a lifestyle when it comes to what I had the chance to embark upon at Mesa Rim.  I had the opportunity to not only: learn the fundamentals of rock climbing, but I got to belay a man twice my size, boulder like the spider monkey up the ceilings, repell from heights and routes I didn't know I could climb, and even Slackline with a Gibbon Pro between the rock walls of the center floor when taking a breather.  I pretty much did it all and it all rocked my world.  If you have never been to Mesa Rim you need to get up, right now, run, don't walk, and go there; trust me, run, or at least drive fast.  You definitely will not be disappointed!  I spent 10-20 mins learning the do's and don't's and the rest of my 4 hrs climbing.  It is amazing, the amount of athleticism in that place.  Tons of challenging routes to choose from or just watch others do.  It only took one day and I am already addicted.  I workout everyday and climbing definitely gave me a run for my money.  First your hands are challenged, but you fight to hold on. Then your forearms are tested.  How bad do you want it?  Next your toes and calves begin to ache, but your adrenaline won't let you stop.  The sense of accomplishment you get when you complete a challenging route is priceless and will last forever.I recommend Mesa Rim to anyone and everyone, no matter what your age or fitness level.  It is a brand new climbing gym with all the amenities you can ask for.  Make a day of it; take a yoga class to lossen up and find your focus, climb until your limbs give out, watch the pros from the comforts of the lounge area, and wrap it all up with a shower and a steam session in the locker rooms.  Mesa Rim has all you'll want and more.  It is by far the best climbing gym in San Diego!", "date": "1/17/2011"}, {"review_id": "hbacQyKGFlmj8P8Fd08gPw", "user_id": "rBvgZKHchBsZ-70kcFHdTA", "user_name": "Jarrett Q.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 2, "cool": 0, "text": "I'm a newb at climbing and went with my brother.  He's a regular there and he bought me a yelp coupon to check it out with him.The walls are pretty tall(~50ft) which was more than I was expecting.  The people there were nice and the place was clean.  I went through the training and felt prepared to climb without too much worry.  We went on a weekend and it was fairly empty and didn't have to wait to use any of the walls.  My brother said it gets more packed on the weekdays when people come after work and a lot of the hardcore people will go do outdoor climbs on the weekends which is why it frees up.It was pretty fun and it was a pretty great workout.  My hands were pretty worn out afterwards but I'll definitely hit it up again.", "date": "11/25/2012"}, {"review_id": "IFl-SJOjucoYOfTipS7tmg", "user_id": "yn4A9gBqw7juZjt_KYTGsw", "user_name": "Tony T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great for all levels!  I am definitely a beginner and will probably go any higher than that but they are very helpful and you feel safe while there.  They even have foosball & pingpong!", "date": "5/5/2014"}, {"review_id": "px1pcqAFzJCa1LDRQG4I6A", "user_id": "xgczS_OhHrJ6nfvkSfcILg", "user_name": "Alvin B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Everyone from the staff to the climbers here are all fun, easy going friendly and helpful. You never feel intimidated here, in fact you feel inspired and motivated. The walls challenge you in different ways that teach you something new each time. Each time I tackle something I improve or take something from it. It offers more than just climbing, so if you wanna just run, work out, do yoga and then tackle a wall you can. 143 Mesa Rim.", "date": "2/29/2012"}, {"review_id": "PMrw0eRvAlzKC2WLVtkqZA", "user_id": "sQHn5crAb8S3r7d1rBbaPw", "user_name": "Sina T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "First time climbing today, Andy is a supportive, challenging and fun instructor. The climb with us lesson was fantastic!", "date": "10/4/2015"}, {"review_id": "VSUYJJXkkEOagUto9sA_Qw", "user_id": "xaLbuUPdxuzoCXqaqRAIow", "user_name": "Stefani T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "This is the most friendly gym I have ever been at. The staff has a good sense of humor and everyone is very sweet. They truly understand \"the customer is always right\" philosophy and they bend over backwards to make sure you have a great experience. Try to go when Kegan is working he is the best!", "date": "7/8/2014"}, {"review_id": "6NMLBSBDmjOwxqmF-QHIlQ", "user_id": "iAevEfcmtCr2cpd6IRqnTA", "user_name": "Holly C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym!  The boulder problems are pretty solid.  The lead routes and top rope routes are hit and miss.  The roped routes can be a little crazy and sandbagged.  Some of the routes wander quite a bit so look before you climb!  Make sure you read the sign at the bottom of the route to determine if it is lead, top rope or both and also what rope to use. (And if you will cross someone who is already climbing.) The walls are really tall so sometimes it is hard to figure out where the route ends.You can get a multi-pass which gives you 10 visits for $150.  A better deal than paying day by day and the pass never expires.  Plus you can use it for more than just yourself.  Just let the person know at the front desk that you want to use it for 2 or more people when you check in.Sometimes they have good sales on climbing gear so call or ask.  My husband got the Five Ten Rogues for $60 here.", "date": "11/28/2010"}, {"review_id": "kPGSA0DKtDK4aQSfSWWoLg", "user_id": "RVF_tj3BRw5LNP9u6HwNug", "user_name": "Sarra L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 6, "funny": 4, "cool": 1, "text": "This review is for the rental area and customer service. Mainly Jackie and jess that are very rude and unhelpful towards my roomate. I have seen this first hand. I do not go all the time but my roommates all have memberships and bring new people with them every time. We pay for the belay class to learn but we also pay for service. We want to feel comfortable asking for help instead of feeling like we are dumb or a burden. I would understand if one of us was being disrespectful or not paying attention but that was never the case. My roommate is now uncomfortable and doesn't want to rent equipment anymore. It is expensive to buy all your own equipment so renting does Make things easier. It sucks when you pay for a membership and have to deal with this. She comes home often upset because of the way she is treated. We have all seen it. I have seen it, my friends last night saw it and my other roommates with memberships have seen them treat her bad. Everyone should be treated with respect. I hope management sees this and fixes this. I would normally give this place 4 stars because other than this service issue, it is a great place.", "date": "7/1/2015"}, {"review_id": "TahROm_NXUO8-NdsoLojSA", "user_id": "aRN0AZA68GFDaumiLL8nUQ", "user_name": "Danimal D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 2, "cool": 1, "text": "OH F#$% YEAH!That was my first impression of Mesa Rim upon entering the facility.  From the outside you would never guess that what lies inside is one of the best indoor climbing facilities around....Best I have been to for sure.  I hadn't been climbing in a few years, but after a quick course and tests you are ready to rock (climb) & roll.  Don't get too  distracted but the high quantity ...and quality ...of asses in front of you...they have various routes for any level of climber.  I got a killer deal on Yelp for $25...Four climbing sessions...SCORE!  I will keep coming back.  Great staff!", "date": "3/8/2012"}, {"review_id": "-YhcRqOddxTjfeot7XzmGg", "user_id": "V2zjvarMGzeAWDdf9-im-w", "user_name": "Wilson R.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 2, "useful": 0, "funny": 1, "cool": 0, "text": "I get the feeling that the message coming from the mira mesa location is \"Go to Mission Valley, because we are a lame duck.\" This gym has terminated their free fitness classes and added a training center next door at an added rate, both of those i can get at mission valley with my membership. I got the feeling once they stopped advertising the classes that they were going to get cut, and then shortly after folks stopped coming and today I discovered theyre done. Seriously sad day, I made most of my gym friends at those classes and was a great way to meet new people, now that theyre gone, I work out alone and cling to the last few friends I made that still visit the mira mesa location. When the autobelays went down it was no problem, people at the fitness classes shared the same problem of being partnerless and we would climb together. If only they put in as much effort into fitness as they do into yoga thered be something great there, but sadly that is not the case. I hope something changes soon that brings my faith back in this location.", "date": "1/5/2016"}, {"review_id": "wSEienP8oB00KqIIHf-mrg", "user_id": "6QrMg_7u4prLjjTv3SD5pg", "user_name": "Oliver L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 2, "cool": 0, "text": "New, clean, and well maintained facilities with great staff and friendly climbers. The walls for top roping and lead climbing are massive. The bouldering area is huge and the entire floor is a crash pad, so no need to pull 'em around. They also have a natural wall to play on and a permanent slack line set up. The gym set up is respectable and they have a nice lounge area upstairs with extra cardio machines.What I like most is that they do a great job maintaining the routes. They are always changing and they do a good job color coding the routes with tape and color of the rocks themselves. If you've ever been to Climbx in Huntington Beach, you'll understand why...The bathroom/locker room is also pretty nice. I'm poop shy, but I think I could poop here if I really needed to.  The waterless urinals can get pretty stinky though.", "date": "3/12/2012"}, {"review_id": "bXUHf7z6zGsnkh3P-sw6eg", "user_id": "czOhL_7tyhBzBF8X_yZsog", "user_name": "Cheryl E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "This review is for the summer camp.My kids LOVED this camp.  Only 20 campers, lots of counselors.  Even my 7 year old loved climbing the big walls and felt like he accomplished so much each day.  The facilities are awesome.  Wish it was closer - I'd get a membership for myself.Hope my kids get to do this camp again next year!", "date": "8/22/2013"}, {"review_id": "BYrepbqTUbBLjJp69FXzKg", "user_id": "3_TWGYhItHUKEz7p4mLJSw", "user_name": "Ted C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "The overall program they're running seems dynamic.  The P.L.U.S. belay technique is a bit frustrating; you may have learned other technique(s) and gotten used to those.  But, you'll just have to get over yourself, and learn theirs (P.L.U.S.) --- remember, they're the ones who'll have to pony-up millions of $$$ resultant from nefarious lawsuits.  So, you've just got to respect that.  And, know that it's \"their Facility;\" so, they can & should be able to do whatever they (and, their Attorneys) deem appropriate.Back to the review - -The sheer square footage & varying opportunities to scale differing Routes is quite impressive.  -Their (albeit small) ProShop contains all the essentials for Sport/Techno climbing; again, they're the 'essentials,' conveniently on-hand.  But, if you're looking for the very top-of-line gear at more competitive prices, you need to search Amazon; but, of course, then you're stuck waiting-on & paying-for shipping, etc.  -The crowd is very friendly; and, all members of the staff whom I've met are very kind & very courteous.  Of course, you're always going to have those few patrons who relish their celebrity-status (e.g., they're big fish (perhaps an 'almost-Expert' climber) in a very small pond)... yeah, that's fine...Back to the review - -The fact that within the same Facility, climbing, yoga, free-weights & machines, saunas & showers, are all offered and accessible, makes for a VERY family-friendly atmosphere (e.g., children of varying ages can do different things, while Mom climbs, and/or Dad does the elliptical-thingy).  Somebody really thought this whole thing out... and, they invested the right kind of money to make it happen.-Oh yeah, remember to bring some water...-Assessment -- SOLID...!", "date": "12/18/2011"}, {"review_id": "qo3rWiH6X6M7Xl1TLZ228Q", "user_id": "43HoCsEZN6yMTwvDOx0WHg", "user_name": "Rob L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I absolutely love this place. First off, the staff here is incredible. Super helpful, and super friendly. I've climbed at several gyms in the SD area and at some of them the staff acts so \"cool\", like they're so much better than me, and I'm a nuisance for disturbing them. Not here!As far as the facility, it's 10 stars. The routes are all easily marked, pretty much all of the holds are the same color so you don't need to even pay attention to the tape. The holds are not grimy like other gyms in SD.The floor is all padded carpet, so there's no dust in the air like other gyms with gravel floors. They actually care about your safety here too. All of the ropes are clean and taken care of. And you have to pass a fairly comprehensive belay test to be able to belay. But if you don't have anyone to belay you that's fine because there are quite a few auto belays. The bouldering area is 4 out of 5 stars only because they don't have any \"top out\" bouldering. You just down climb it jump off onto the well padded floor. But the problems are creative and well maintained. They have brushes lying around to scrub off holds if they're a little too chalked up. My only complaint, if you can call it that, is that it's a bit more expensive than other gyms. But I'll gladly pay extra to climb at an amazing gym.", "date": "12/5/2013"}, {"review_id": "DEOGBZROQ39a5q5fA6rbwg", "user_id": "k2HqfbI1M2_cSYz5U7t7bg", "user_name": "Leen J.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Best climbing gym around - Mesa Rim has the best quality setting for both ropes and for boulders. I have excelled here! Staff is awesome & the pro shop is very convenient. I stopped going to 24 hour gym because everything I need is at Mesa!", "date": "4/9/2014"}, {"review_id": "Bwka3XfTWMYGYFe7SMAn3Q", "user_id": "DiaqaXo9-g9iRz9lrMBFRg", "user_name": "Chris T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Climbers Paradise. All star features, tons of fun stuff. There's even an off-width crack! Cedar Saunas. Free Wifi. Media Room upstairs. Serious fun.", "date": "1/5/2015"}, {"review_id": "oM2YoTEI1RIV1TEw0_PFng", "user_id": "zciC_QDvjgYcKhHy5yAu_A", "user_name": "Tony S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 4, "text": "The best gym I've climbed in SoCal. I've been to around 8 gyms south of SLO, and this is no doubt the best of them. Great facilities (wall tall enough to feel like outside), great people, great routes", "date": "8/2/2013"}, {"review_id": "2-VPH45FauxiVgfNdb3d5w", "user_id": "SRvL3X-3VQS6kSLNeOdCfQ", "user_name": "Craig E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 3, "cool": 0, "text": "What a great place to climb! I'm pretty much a newbie at climbing but I've been around enough to see other operations. And this place is one of the best. Lots of different routes to climb. Full gym for great all around workouts. The members are friendly and the staff was super friendly even though I had never heard of an ATC. I thought it was a sandwich but come to find out it's what my belay uses to keep me from falling to my death. Sweet!If you're looking for a challenging climbing workout look no further. I definitely recommend this place. On belay!", "date": "1/12/2012"}, {"review_id": "XTToX8j6WYaPqzWrYJYrBQ", "user_id": "sdpMZUPixpl-ePoFIOYB9g", "user_name": "Matthew P.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I guess it's time that I leave a review here.I've been a member at Mesa Rim for about 2 months now and only been climbing for about 3. I can't get enough of it.I first came to Mesa Rim on a recommendation from a friend who is a serious climber. He said it is the best place in San Diego, hands down. I haven't been to any other place in SD, but after my first visit to Mesa Rim, I did not see a reason to. They have everything I could want including a full gym with weights and machines, a locker room, bouldering wall, and Tons of climbing routes. The best part is how frequently they set new routes, always keeping me on something fresh.The staff is wonderfully friendly and super helpful with anything. As a member, I enjoyed a nice discount when buying my shoes and harness package (both of which I love, by the way.)The ONLY negative I have to say about the place is this: The men's bathroom smells pretty awful all of the time. Don't know why they can't fix that, but it certainly does not detract from a 5 star facility.If you wish to climb, workout, do yoga, or just meet some awesome people, Mesa Rim is the best place in San Diego to do so.", "date": "12/15/2012"}, {"review_id": "2j2pG0ESt26UQE4PqjKW0g", "user_id": "pJNbUXnU_WbNaVVRg_AP_g", "user_name": "pesach k.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 1, "cool": 4, "text": "I was introduced to Mesarim by Daton, am employee of Mesarim who visited one of my Jiujitsu classes at another gym. He gave me a pass for a day and suggested I try out the gym.  I had no idea in reality what a rock climbing was at the time as pictures I had seen showed a simple rock face wall with rocks attached for one to hold on to while climbing.  I knew one person in to rock climbing and the strength he had must have partly come from this sport.  Since I had some problems with a pinched nerve limiting my jiujitsu at the time I called Mesarim and spoke with Daton, and to be honest, never looked back(just looked up to the next hold). I came down that weekday afternoon.  Daton asked me to go over to the computer to fill out the waiver which I did. When I saw the word \"belay\" in the waiver I had to figure out what it meant in a rock climbing gym as the only time I heard that word is when Commander Tucker told the bridge crew to belay an order of T'Pal.  After that Daton took me around and showed me the gym and I was simply overwhelmed by two major things. First I never imagined that indoor rock climbing was such an involved sport, and second, that this was such a tremendous facility where it had to take a lot of hours to set up this super realistic climbing experience. I watched people climbing, belaying, and bouldering and was simply overwhelmed. This was for me!  I had scheduled a belay lesson and when I went to take it found out I was the only one. No problem whatsoever. Many other businesses would have said sorry, we don't have enough for a class. Not so here, Bill gave me very detailed hands on instruction on being a climber and belayer. To say I was hooked was an understatement.  Even though I didn't get more than twice my height that first night, it was a totally new experience that I knew I would enjoy.  I joined the following week on their $140 beginner package (which i am on now) which includes one month membership of unlimited gym use, 3 ninety minute classes (footwork, climbing, dynamics), a belay lesson, all equipment rentals for the month, and even a guest pass. If I become a member before the month is out (which I plan to do) no initiation fee to pay, just the regular membership which now includes yoga as well. The facility is open Sunday through Saturday, 7 days a week and never closes before 9pm (11pm Monday through Thursday, 10pm Fridays).  I came back to start this membership June4 and took the first of 2 classes with Brian whose climbing knowledge is excellent, even adapting to my severe hip arthritis when I had to climb.  There are no ego's in this gym; the 5.11 climbers not only do not look down at the 5.4 climbers (unless they are climbing and you are belaying them and they want to be lowered) in any manner, in fact several have offered to belay me on my climbs even though I had never met them before. Staff members have given me beta to assist me, especially when TrueBlu is my belayer. My inquiries thru their website were always answered by the next business day. Unlike many other places, no one was pushy in any way about joining, they let the property speak for itself.  I took my first Yoga class Sunday this week (6/16) and afterwards I made it to the top of my first 5.4 (about 11m - they have walls of 6m to 17m) as well as finally doing the VB in bouldering. Not very much to any seasoned climber but for me I am happy.  I wish I knew the names of all the very helpful staff any time I had a question. Daton, Hunter, Bill, Keegan, Alexandra, Debbie, Peggy, The Sunday Yoga Instructor, forgot her name) , the other front desk staff, and Parker  were all helpful to me. In addition the place is very well organized. I have been the lead hourly employee in charge of a school building and a train station and can easily  tell when things are being done in an orderly manner or being done in a sloppy manner. Mesarim keeps on top of things and maintenance and cleanliness is up to date. Of course no place is perfect, they could use more lockers in the Men's room and an additional wastebasket for the paper  towels there, and a second drinking fountain near the teaching wall would be helpful.  I have used there weight room as well which is clean and adequate. They have an upstairs lounge and wi-fi facilities as well.  The only problem I might encounter is if my old car gives out as transit access is limited (bus 921 to Flanders and Mira Mesa) but even if this happens I will use my meetup groups and find a carpool.  This place has me climbing the walls (literally) and even if I get stuck between a rock and a hard place(this can happen even on a 5.4), I will find a hold or a way to get to the top.  For those of you who want to tell how authentic I am here, just look up (the wall)  for me or better yet, join Mesa Rim and belay me. Thanks", "date": "6/18/2013"}, {"review_id": "AfSUfbnmDP12jdvThMJWVw", "user_id": "3Vissonft2u1jN9Ofqj6oQ", "user_name": "Marie B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My husband and I are recreational climbers, and we enjoy a good challenge from time to time.  This place is awesome!  We really liked that they expect you to know basic knots and techniques (no cheating here!).  The walls are super high so the routes take a while to complete and you definitely have to work.I can't say anything about the rest of the place because I  only go here for the climbing.", "date": "2/25/2012"}, {"review_id": "5M_VBwquUmNiOz2N_cG7TA", "user_id": "b9U7ApcHgaAG47zLTUl1BQ", "user_name": "Momo M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! Staff is super friendly. It's clean and mellow. I've never really seen it crowded where you can't get a good workout in. That was a concern I had when I initially signed up. I just wish I had more time to go more often! Seriously can't say enough good things about the staff though.", "date": "11/2/2014"}, {"review_id": "oi2CsSx5IJXvoXTICJBzfQ", "user_id": "hGng2Oyq8YhS7l8AzUG10Q", "user_name": "Alice A.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 9, "funny": 5, "cool": 9, "text": "This is currently my favorite climbing gym.The bouldering walls: I love, love, love how they are designed.  The routes are numerous, varied, and the walls wrap around on one side of the gym so one can chat with one's buddy sitting in the center surrounded by the climbing wall. The rope climbing walls.  Wow, they are high.  The routes for belay and lead climbing are also numerous and varied.  Awesome!!I am still a beginner and I do mostly bouldering.  You see, I am still afraid of the heights (shhhh!), but I never get bored here.  There are lots of problems to tackle, from easy, intermediate to challenging.  I literally don't mind spending hours at this gym because  climbing is fun here.There is also a small workout area with weights and cardio machines so I have spent some time there, too.  It's still new, so everything looks and feels clean.The fees are a little more than other places, but the quality of the climbing walls are well worth the extra.  My two minor complaints are that  they charge separately for their fitness/yoga classes and they offer no towel service as of yet.This is the place to unleash your inner monkey!!", "date": "1/8/2011"}, {"review_id": "wDjo4Eg5XYxwhG0ordEmsA", "user_id": "OsqB3Dfm6SsjjIsVMcY1fg", "user_name": "Rosita E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I had my first lesson here, I had lots of fun and it was awesome. The only downside I can say if there really is a downside, is the parking lot gets full quickly. So you may be driving around in around to try to find a spot.", "date": "2/12/2014"}, {"review_id": "OX9I5WzBKxTaMAtoW0nC4Q", "user_id": "dV-QUHaORuFHjEaBXg1y4Q", "user_name": "Anthony M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Rock Climbing Review - My experience was pretty amazing, I went and bought only a day pass which was about average price for what most gyms charge but the facilities at Mesa Rim are much nicer than anywhere I've seen.You get what you pay for here, it's pretty amazing, but if you're like me (can't see paying $80+ for a gym membership) this might not be for you. Either way, it's a 5 star experience and you must check it out. I'll be back again, just as a visiting day pass climber, no mesa rim memberships in my future...", "date": "1/5/2012"}, {"review_id": "KUuTgIfkZzKov-dXYdWkiA", "user_id": "6oomcqQoUqGoXkYntkQ7Pw", "user_name": "Sandra O.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "This was the first experience with indoor rock climbing for my husband and I. The facility is clean and the staff were very helpful and friendly. We were able to scale a 35-foot wall with the help of an auto belay. If you are looking for something different to do on a hot weekend day I would highly recommend this place.", "date": "10/7/2013"}, {"review_id": "WMXTdPMufJZfMwfUdq13Lg", "user_id": "z9Om-8ivGoZQv9fOlwstRQ", "user_name": "Mel M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super impressed with the facility and staff, we had a great first experience.", "date": "8/1/2014"}, {"review_id": "e10R2R-pe4LVcTF0FtCrtA", "user_id": "quzaGNzoQ9bn_ESGDYc2MQ", "user_name": "Daniel W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I've been to dozens of climbing gyms across the US from Arizona to South Carolina to Boston to New York and everywhere inbetween. This gym is the best I've seen. Awesome facility, friendly staff and the routes are AMAZING. Pretty inexpensive memberships too.", "date": "3/18/2013"}, {"review_id": "dJnDmQxW31BOleNbMJtjUA", "user_id": "mi57w6KCqycf-1PfjQycpQ", "user_name": "Charlie Q.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 3, "cool": 1, "text": "Anyone who is questioning the setting capabilities of this place is simply uninformed about setting. Some of the best setters in the state set at this place, and have been involved in climbing all their lives. This is especially true for the five year climber who feels they misgrade their routes. This would be similar to a grad student questioning Buffet's investment strategies.", "date": "2/1/2013"}, {"review_id": "m7eMaXfu7qb0cAy2vh8IbA", "user_id": "N-zR5PPnKGpxE67_Cb8rdA", "user_name": "Jay W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place with friendly and knowledgeable staff.  Was fun for the whole family and a good workout.  Seems a little expensive but I have nothing to compare it too.  Overall great experience and will go back.", "date": "4/4/2014"}, {"review_id": "J5uYVZU7RMpJ4_fn1aGbOw", "user_id": "1hzbPz7HV7myDX2HjAOX8Q", "user_name": "D M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This review is for Yoga only.Nice yoga studio, clean and large enough.  And of course great teachers (Raine and Michelle)!!  I will definitely come back.  The staff was very friendly.*I've only been to Solid Rock for climbing but this place looks awesome.", "date": "12/31/2011"}, {"review_id": "Xju4OhwJwbm7MVp5gQEK0Q", "user_id": "zE864dPgdiY_O0NxHHc1lg", "user_name": "Jessica S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 2, "useful": 9, "funny": 0, "cool": 0, "text": "This is a nice gym, it has a lot to offer. My husband especially loves the long routes for leading. The holds are all nice and new, not greased out like at the other nearby climbing gyms. Don't care for the staff though, they're pretty snooty and rude.", "date": "8/7/2012"}, {"review_id": "Fi2LI09rGxzKJ5VMoL7pHg", "user_id": "oinIrzljytrWH-DUWnipNw", "user_name": "Veronica B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Huge walls, patient staff, and clean facilities. I had a blast here on Saturday. Routes are clearly labeled and have useful information. Great bouldering area, too. I can't wait for a reason to be back in San Diego visiting!", "date": "5/13/2013"}, {"review_id": "8jyOnBvlYN6Gwi2fL6B5ww", "user_id": "_LZGvt2s-T49K5d_dvE-Fg", "user_name": "Kreestof J.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 2, "useful": 5, "funny": 0, "cool": 0, "text": "From a first impression point of view, its a massive gym and tricky routes and challenging TR sections.  Since its a new gym, its obviously very clean, and the holds are new, and not yet slicked by usage.They have a full workout gym section, complete with showers, a sauna by gender, and a well ventilated warehouse, that doesnt smell like the usual BO found in gyms.However, as rock climbers, we would like to share the awesomeness of climbing to our fellow man and spread this outdoor activity with our neighbors.  I'm unsure as to whether Mesa Rim shares this philosophy, as it is very close to a neighboring gym, Vertical Holds, a casual climbing gym.  Feels like Walmart taking on local mom and pop stores.Staff. Isnt the same as your basic rock gym (eg The ARC, Hanger 18, Rock Gym..)  Not a smile among their staffers, whats going on? As for fellow paramedics, EMTs, or firemen, this isnt the place to be.  Your skills will be constantly challenged by a Steve Austin looking staffer even if you just started climbing.", "date": "8/15/2010"}, {"review_id": "DG2jlHbHlaTZS5hmPAlWmg", "user_id": "j763s4nxDBg_uNLk3N2WtA", "user_name": "Bill W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hands down, the best climbing wall in San Diego. As mentioned in another review, the belay technique they teach isn't the one I use, but they passed me on the belay test even though I wasn't using their preferred technique (obviously I was still using a safe technique). They have a natural wall which is pretty cool, but very small. However, they have a few great crack routes and a slackline setup. Great place to practice leading and build stamina as the routes are about as long as they get indoors.", "date": "10/10/2011"}, {"review_id": "NnSwxOhc5OQBefd77leMUw", "user_id": "RAixJlxjy7FzuaG-UDCo6A", "user_name": "andrew g.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 17, "funny": 0, "cool": 2, "text": "This review is geared toward experienced climbers looking for a gym to join, not first timers. Nothing against new climbers (everyone should try it out; it's a fantastic hobby), I just found there to be a lack of information on Yelp about the nuances of the climbing gyms when I moved to San Diego, so I'm hoping to fill that void.If you're a climber who just moved to San Diego, particularly the northern part, you're probably choosing between Mesa Rim and Vertical Hold as your climbing gym, so I'm going to offer a lot of comparisons between the two. I haven't heard great things about Solid Rock, but I've also never been there, so I'm not qualified to comment on it. I've been climbing at both Mesa and V-Hold many times. In the interest of full disclosure, I chose V-Hold over Mesa Rim, so I may be slightly biased. Starting with the facts, before moving onto opinions, here's what Mesa Rim has to offer:-Incredibly tall walls. 55 ft, I do believe. The height is downright impressive, and almost double what V-Hold has to offer.-Basically all top-rope routes are leadable as well. This is good in that you get more options, but bad in that there's only a fairly small section dedicated to lead only.-Full coverage padded floors in the bouldering area. No need to drag mats around.-Pro shop for climbing gear (with 10% discount for members).-Very respectable gym (weights, machines, cardio, etc.), at least by climbing gym standards.-An abundance of yoga and other clinics (for an extra charge).-A \"natural feature\" wall that emulates real rock. It's cool, but it's also very short (20 ft maybe?).-A lounge if you want to hang out.Now, here are the drawbacks of Mesa Rim:-It's significantly more expensive than V-Hold, especially if you want the yoga membership as well (V-Hold offers free yoga twice a week, though not the same quality [or quantity] as what Mesa has). You also have to bring your own rope to lead or pay to rent one.-The quantity and quality of bouldering at Mesa is inferior to V-Hold. This is not subjective; it's a fact. How inferior is up for debate, but the bouldering at V-Hold is clearly better.-The parking at Mesa sucks. The lot is smaller and everything is tight and narrow. The V-Hold lot occasionally fills up during peak times too, but the Mesa lot is far worse.-Technically, they have a system board, but it's usually set up as a core board, which is kind of cool, but ummm, there should be a system board at a climbing gym. They do have a campus and finger board though.On to the more subjective matters:-I like the sets at V-Hold way better than Mesa. I think V-Hold compensates for their short walls with more interesting routes whereas it seems like Mesa is content to just have really tall walls with fairly uninspired sets. But I do know climbers who like the sets at Mesa better. From a more objective standpoint, the sets at Mesa tend to be more about sequencing (and are probably more true to outdoor climbing style in that regard) while the sets at V-Hold tend to focus more on the individual moves (I've heard their TR/lead routes described as bouldery, and I think that's a fair description).-I like the staff at V-Hold better. In my opinion, they're more friendly and, more importantly, they seem to be more on their game. Some of the Mesa desk staff comes off as sort of aloof .-I like the clientele at V-Hold better. Now we're delving into the extremely subjective, but I just feel like the regulars who climb at V-Hold are more passionate about climbing, while Mesa seems to be more about being seen. This is absolutely a gross generalization, and clearly does not apply to everyone, but I don't really know how else to describe it. I just like the vibe at V-Hold better.In summary (congrats if you're made it this far): If bouldering is your thing, go to V-Hold. If top-roping is your thing, you're probably going to be happier at Mesa. If sport is your thing, well... you've got a tough decision to make. Mesa does have all the bells and whistles, so if you're looking for the gym equipment and yoga, it has all that, but I like V-Hold better from a pure climbing perspective. Check both gyms out; they both have a lot to offer (how great is it that you get a choice here in San Diego instead of being relegated to the only climbing gym in town???).", "date": "4/7/2012"}, {"review_id": "pblUR8rtJj7fa-EH4B9kiA", "user_id": "pNTAqgkrsW7pLfEf7HIgZg", "user_name": "Shawn H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Wow - What an awesome gym! A couple friends and I had an Intro from GroupOn and went down to Mesa Rim. We were \"shown the ropes\" by Jen (great instructions, thanks!) and climbing in no time. We ended up spending 5 hours there, climbing until we couldn't grip a hold any longer, then slack-lining and climbing again. I will definitely return to this gym and keep climbing. The friendly atmosphere, people and staff made it an awesome experience and we are all hooked! The only drawback for me; there is only one location - please open one in North County!Thanks again Mesa Rim!", "date": "8/4/2011"}, {"review_id": "7g6uyqISXZ0FmFksdVEN2g", "user_id": "wtsdtpn1DwgMCJ0p3InoeA", "user_name": "Pam P.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "Fantastic place. Really nice people, clean and bright. Very friendly staff. They make you feel welcome no matter how hard you climb, or how new you are to the sport. In fact, one staff member gave us a mini-lesson in something because it wasn't busy. He doesn't want me to tell anyone because he couldn't do it for everyone all the time - but it's just a testament to how far these people will go to make your experience enjoyable.  Thank you, Mesa Rim!", "date": "8/1/2012"}, {"review_id": "PKeKtUeRDuTdINkSuYlmPg", "user_id": "cDtM2X2dNrHyKb8cSvChDQ", "user_name": "Laura L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "The staff was friendly and it was easy to sign up for the beginner lesson using my Yelp deal. My friend and I had a short belay lesson from a climber on staff, and then he showed us around the gym before letting us loose on the walls. Really fun way to spend an afternoon.", "date": "12/2/2012"}, {"review_id": "bY4O4KzZIrlwo1JVdIiHEg", "user_id": "jLMkZCPgAcTaxCl85JNJ4Q", "user_name": "Refugio J.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Were you the kid who never came down from the monkey bars or the jungle gym? Do you even know what those things are? I do.So, I'm like a big rock climbing junkie and when I'm looking for fun, I either find an outdoor climbing area near San Diego or further out or I hit the climbing gym. When I first heard of Mesa Rim, it sounded like it was too good to believe. I stayed away believing that I'd be disappointed. Then I got an invite to climb for free. I went and OMG.Me to my friends: \"Kick me because I'm dreaming.\"Friends: \"Gladly!\", \"Sure!\", \"You got it!\" (there were three of them)Me: \"Ow, ow, ow!\" I've got to say it, this is the best rock climbing gym in town. The 55 foot high walls are a lot like climbing outdoors. You even have the option to climb with your own gear. The climbing routes are easier than other places, but that's because the climbs are so long. The floor is soft and bouncy and the boulder area has a pillow soft cushioning on the floor. Awesome.For all this salivating, I have to also speak of the one downside. Anyone who has used other climbing gyms in town knows that they can get a better priced deal elsewhere. A day pass at Mesa Rim runs $17. Not cheap. The do have special deals like free shoe and harness gear rentals on Mondays and a ten pass card for $150.All told, you can find a lower cost climbing gym, but the extra five bucks that you pay here pays off with access to a very class gym with everything you need to learn how to climb.", "date": "1/6/2011"}, {"review_id": "abcyM9oZInbzCc-EHrO6Jw", "user_id": "VDFg1hcM8utlFh-FuAgqRw", "user_name": "J D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Huge, clean, with long and varied routes.Has:-A gym where you can do 95% of your workouts.  Just wish they would add a squat rack.-Campus board, gymnastic rings.-Yoga and that kinda stuff - the classes ARE extra though.-Lots of climbing space, plus a slack line if you ask them to set it up.They have the usual features, plus new ones that I haven't seen in any gym, including a large undercling seam that turns into a hand crack. Awesome.-Chill crowd.I thought it was pricey when I first started going, but I realized this is standard climbing gym prices - I lived in a place with only outdoor climbing and no gyms.  I've been to gyms across the country, and this is definitely one of the best, if not the best.NOTE: To lead, you need to bring your own rope!Yes, it's all the way in Mira Mesa, but worth the drive, especially in the rainy, cold, SD winter.Mesa Rim: For teh win!Vertical Hold: I am disappoint...", "date": "1/8/2011"}, {"review_id": "n8SLV_EvQOvLf2nOBB1QDA", "user_id": "5QXCJbhvmwwK0-K6K57vmQ", "user_name": "Robin D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I first came here using a deal for their yoga classes, but became a member for the climbing. As for yoga, the instructors are willing and also encouraging of customizing the classes if you have any problem areas (tight hips, misaligned back) and also strive to get to know you. The climbing staff is very friendly and are great sources of information and advice. I also signed up for four of the climbing classes and the instructors are very experienced and knowledgeable. I haven't been to many climbing gyms, but I do like this one the best. I like how the holds for routes are fairly consistently color coded and are rotated regularly.", "date": "2/2/2013"}, {"review_id": "UkL8yIkLcKzBp_qHWhS4ww", "user_id": "Z9rTgVpdkrsQFyoZkujr-Q", "user_name": "Karli T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 13, "funny": 0, "cool": 0, "text": "Yes the gym is huge and offers a lot of routes to climb. Unfortunately the staff made my experience at this gym abhorrent. I've been climbing for a couple years outside and in gyms. I took the belay test and the staff member told me I could not be certified but gave zero explanation. I asked what exactly I could improve on and he said \"just keep practicing what you're doing.\" he was incredibly rude to my whole party for no reason. He was pretentious and talked down to us all. We were excited to climb that day and felt completely deflated because of the staff. It was so bad that I'll bet not one of the four people I was with will ever return to that gym.", "date": "1/22/2012"}, {"review_id": "5QPK1PYNP2J1GyhJddniew", "user_id": "t9e9-sMgkg0DhNHzstc1Ww", "user_name": "Aaron B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the gold standard for rock climbing gyms.  Everything about it was perfect for me (except the lack of a bike rack out front, but they let me bring it inside).  The bouldering section was HUGE and the routes were a great mix of levels and skill development.  The floors in this area are extra padded...like a crash pad everywhere.  They not only color-tape the routes, but also do a good job in color-coding the holds...excellent for flashing routes.  The facilities are clean and bright.  The hours are reasonable.  The staff was friendly and helpful.My experience here pushed me over the edge to extend my stay in San Diego an extra week...it's that good.", "date": "7/4/2011"}, {"review_id": "vsCumYLILXTp6INBXdVVKg", "user_id": "AH_FWoMK51iuUE-XW8GfdQ", "user_name": "Raffy Joy B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty fun place, good workout, i like the different difficulties they have for bouldering, i feel like i am in Ninja Warrior when i'm here, even though i suck, they have pretty tall walls too compared to other places i've been to, a little pricey though which is why i like to stay until my body gives out then stay a little longer", "date": "6/21/2011"}, {"review_id": "mgD6MWWRVbar1ANz0nYOAQ", "user_id": "IIgY-ChFRK-B4ocpuQsYoA", "user_name": "Patrick S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Ah, Mesa Rim.Disclosure first: I have been a ,member since their second week. I would suggest this route, as it takes about 4-5 trips a month (once a week) to pay for.I love this gym. Every time I go I discover a new feature (for example -- free body wash and shampoo in the showers...convenient). To call it a climbing gym is almost a disservice, as it has most of the amenities of your typical gym, from workout machines to saunas and yoga.But it is a climbing gym. And a damn good one at that. Mesa Rim does not cheap out on its climbing facilities, and pays a dedicated setting staff lead by a nationally certified route setter. If you go at all during the morning or day you will usually see one or more of them working on a new route or two. And if you happen to be climbing close to them, they are always more than willing to chat and hear opinions about their setting and how it can be improved.The walls themselves are quite nice as well. Most have prominent and usable features, including ledges, underclings, and a few quite good finger, hand, and offwidth cracks (even a chimney!).The owner and all the staff are quite visible and friendly. I will be coming here for a long time.", "date": "6/28/2010"}, {"review_id": "RyP-mnZ3BryMow1sVdb1lg", "user_id": "zAz7iNyEsWOyYAiOi8NhFw", "user_name": "Babette O.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "If you love to climb and you need an indoor climbing option, this is the place to go.I've been climbing at Mesa Rim ever since the grand opening in May 2010.  As soon as I walked in, I was overwhelmed.  The walls are tall, the top-rope and lead climbs are long and challenging, and the boulder area is huge.  There are many routes to choose from, and they change the routes about every other month.  They have weights and cardio equipment, and they offer yoga classes and various climbing clinics.My whole experience at this gym has been positive.  My only negatives are that they don't have enough bench space in the locker room and that the locker room door opens up in direct view of the changing area.  I can't really knock a star off for the negatives, since I'm primarily there for the climbing.", "date": "4/1/2011"}, {"review_id": "2wtila0diDbAkRjaRpTwZA", "user_id": "h25vnXfrFPckqCGqFLe3oQ", "user_name": "Quan D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Wow, I mean wow! This is quickly and easily the best climbing gym in San Diego. The space is huge! The walls are high and the routes are seemingly limitless. They even have a little section where its just a rock wall, no funny colored grips etc, just a wall like you'd see outside. Unfortunately its only like 25 ft high, but its a nice addition. The routes were pretty well rated and were long! Everything about this place was great!", "date": "9/25/2010"}, {"review_id": "RP-8BcAh1VlIGkhZHikRtw", "user_id": "cykRIHBxObmE2BSGL1Y24g", "user_name": "Jason V.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Dope spot for bouldering. Pretty pricey though. They have one day passes for about $20+. You'll need climbing/bouldering shoes of your own or rent some for $5. It smells like a football locker room. They have a small weight lift section as well. Very convenient. If you're in the military or in school, you get a monthly discount for your membership. There is a $50 initiation fee which is pretty ridiculous, but they wave it if you bring in 3 other people to sign up as well. I like the free guest pass that you get to use once a month, wish it was 2-3, that would be worth the pass.", "date": "9/29/2012"}, {"review_id": "BCGR-CT7TNAbEbn8ILAA0Q", "user_id": "FFGaSo2IvJ_A6rp69rdYDQ", "user_name": "Jo C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This gym is AMAZING. Seriously. I started climbing at Vertical Hold, which I loved, and almost bought a climbing pass there-- until Mesa Rim opened up. The walls are higher than any other gym I've been to in San Diego, the bouldering area is not only big but is padded (instead of having to drag a crash pad around) and the staff are super cool and helpful. The manager is especially nice!It's definitely worth checking out if you're looking for somewhere to start climbing indoors in San Diego.", "date": "6/24/2010"}, {"review_id": "VIR_yWk5NqoUTAA9tXAejQ", "user_id": "dL_NiYO3sQ2YWMccbI32-A", "user_name": "Nikki T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Oh Mesa Rim...So I've been rock climbing for about a year now, and I usually climb at Rockreation. Don't get me wrong I LOVE LOVE my gym with a passion...BUT. Mesa Rim....So my sorority sister who lives in Vista just started Rock Climbing, she lost her partner and she also climbs at solid rock (which I have no clue about) so she asked me to come climb with her for the day and teach her a couple of things. She looked up Mesa Rim, and she said she wanted to try it out. I called my climbing partner who also works at a rock climbing company and said that he was there for the grand opening and it was amazing! He did mention that I would crap my pants when I saw how tall it was, and yes I did.The walls are huge, and they have a good amount of lead climbing as well as top roping, and the bouldering area has a pretty good space.The routes are fun, great job to my friend Nicole who is one of their route setters there, she rocks!I tried lead climbing (make sure you take your proficiency test first) and I got up half way up the wall, mind you I'm used to smaller walls like 25feet. But so much fun none the less.I had a chance to meet Mike (owner) and sat and talked with him for awhile and he told me that there are also places that you can set up slacklining there in the gym and rope traversing? He also showed me a route on the bouldering wall that I had problems with. He's super great!My sorority sister is still looking for a partner to climb with, so if anyone is available, shoot me a message!LOVE Mesa Rim, will be definitely make a monthly trip out there when the cold season starts to hit.", "date": "9/9/2010"}, {"review_id": "_yMczNvlvQWShxmUdcuaLw", "user_id": "C8Sq5cIS-u2a5mv-50dL2A", "user_name": "Benjamin M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I love this gym!!!  I'd spend more time here than at home if I had it my way.  Seriously.  Paul and the rest of the staff are rockstars and keep that place charged with good vibe.  Great layout, greater route setting, and greaterer overall impression.  It's a positive environment with fitness freaks and gear geeks.  It keeps me motivated and keeps me healthy.  Climb on, Mesa Rim!!!", "date": "7/15/2012"}, {"review_id": "jQTn3LY9U4LtM65TMNzwdg", "user_id": "MdN40RC5HkbNPlxp4f1N1g", "user_name": "Carjie D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came here with my boyfriend as a first timer. Walking in we were immediately greeted by the staff and the facility seemed pretty peaceful with a few climbers. The price for an all day pass was pretty good and the belay lesson was cheap too. The belay lesson was done by Connor and he did a great job teaching us everything we needed to know. Immediately after the lesson we were on our on and free to climb. There are a few routes for first timers to take and it seriously takes more skill to even maneuver any other route. Overall I'd recommend the place to another friend. Great workout as well, my forearms were burning the next day.", "date": "5/14/2013"}, {"review_id": "VOdnbRHg1gmF3qH1kFbSEQ", "user_id": "1oBslbfD2bMecE12hTUbmw", "user_name": "Revelator T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Still going, Still Awesome!  After two years they've been through their growing pains, but it's a pleasure to grow with them.  The climbing wall is a big part of my life and I enjoy the social and physical benefits of being at Mesa Rim a few times each week.  Kudos guys!", "date": "7/20/2012"}, {"review_id": "XYWJd9ixlcH_4jz44bCZqg", "user_id": "qaiZ6eDNtSY0vo5N-6yp2g", "user_name": "Nick N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I got a great groupon here! $25 for 4 climbing vouchers! I love this place, it's huge! Always great music and lot's of stuff to do!", "date": "11/19/2012"}, {"review_id": "ZmBWeo_-WX8lBwAY0pEzPQ", "user_id": "lNg2yxHaAPht08t7zPnv_g", "user_name": "Ross W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 5, "cool": 3, "text": "As an avid climber from Northern Cali, I felt right at home when I walked in the alternate front door, as the original was under construction due to a car crashing through it (exciting I know,) only to realize I had to boulder up a v3 to reach the front desk. At the summit I was greeted a friendly attendant, Alex. She was helpful and had a good sense of humor to boot. Once she was done nursing a wounded bird back to health she made sure I had the right equipment and was trained in the facility's safety rules (NO PINCH AND PULL!) I was impressed by the sheer size of the walls, most were upwards of 400ft! Once my friend and I were burnt out from the cavernous climbs we were relieved to know there was a full gym for the taking. Once done we ate at the adjoining five star restaurant where we feasted on mantleloaf and shmearcake. The magnesium carbonated beverages they served paired perfectly with our meal. The perfect ending to a perfect day. Once again I felt right at home with the great staff and facility, I highly recommend it.", "date": "1/2/2014"}, {"review_id": "N-219nDgPvnUWMDWaE7v-Q", "user_id": "D0SGqnNQS-O6HJjj0mZNCw", "user_name": "Rhonda j.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great walls, enthusiastic staff.  Fantastic place to learn or hone your skills.  The best place to climb in San Diego, unless you are outside.", "date": "6/18/2014"}, {"review_id": "Hh-05W1M-iA9fu5zJ8tAZw", "user_id": "YBjLXINUpGRHY7RH4kJTaQ", "user_name": "N G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 2, "cool": 2, "text": "Climbed at Mesa Rim for the first time today and am happy to say it far surpassed my expectations. I live in LA and climb the various gyms around here and have a member ship with Hangar 18, which I LOVE.  I was a bit worried after reading other reviews, which complained about the belay technique. Yes, it can be annoying being asked to belay with a different method, however, insurance rules are important in indoor climbing, especially since the gym wouldn't be able to operate without insurance.  Anyway, it was no skin off my back since I learned to belay with the bus method when I first started.The staff was super friendly and accommodating. They tested us on the wall across from the register and we were on our way to climb pretty quickly. Not sure if it is as quick or empty as we experienced, but since it was Superbowl Sunday, it was pretty calm (SCORE!). The walls are TALL FOR DAYYYYS. Hell yes, I loveth. I climb 5.8- 5.9 range and the 5.8s felt less technical than  the gyms I frequent in LA, but then again, it was pretty challenging in regards to endurance since the walls are so tall. I'm sure the routes get more technical with the higher grades. This gym is extremely clean. They have air filters, which make a huge difference if one is sensitive to chalk in the air.  I generally end up having untimely sneeze attacks whilst ascending difficult routes at other gyms. Not fun. The owner, whoever he/she/they is/are takes great pride in what they do. They update new routes frequently on Facebook and share maps, which makes it easier to navigate this behemoth of a gym. It seems as though the setters for this gym are varied in height and sensibility, which creates a nice array of routes that are within reach for a wide audience. I once visited a gym in Philly that was so underrated I could barely climb a 5.6. The holds were spaced super far apart and the moves were extremely reachy.  I had to dyno from one jug to the other on a 5.6! That won't happen here. I like this gym so much that I am going to make another San Diego trip just to climb here. more please.", "date": "2/5/2012"}, {"review_id": "PLmUDL14oSr-tlWnG0OHwg", "user_id": "8JybDy9ba01sXoj3mS9J-A", "user_name": "N h.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 3, "cool": 1, "text": "recently switched memberships from solid rock in old town to here.. and WOW what a difference. this is the best climbing gym i've been to- and i've been to every gym in san diego. they actually teach you how to belay, you have to use real climbing shoes so you dont grease up the walls, the music is ALWAYS good.. and everyone who works there is super nice.. really good, friendly vibe about the place.great assortment of lead, top rope, and bouldering problems. the routes are well maintained and the setters keep routes interesting and challenging.  will update more as time goes on... but you get what you pay for. never going to another gym again.", "date": "12/30/2011"}, {"review_id": "UJmNTGJO7oc793kxVOslLA", "user_id": "xZXbG0ByluEozTFuNKrn0w", "user_name": "Diva B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Warning: do not go here unless you are a professional rock climber who has successfully scaled the Half Dome. All jokes aside, I understand safety first but the employees at Mesa Rim perpetuate a superiority complex in which they fail to welcome beginners. How do they expect anyone to get better unless they provide them with the opportunity to learn in a safe and supervised arena? Of course they offer classes, however on both occasions I visited Mesa Rim I was turned away for the classes were full. On the most recent occasion I arrived at 5 and the next class (full of course) started at 7. However, there were 4 employees lounging behind the counter all of whom are qualified to train newbies. The employees, therefore, not only look on down you if you are a beginner but are too lazy or maybe just too good to take 10 minutes and teach you how to tie a knot and maneuver a belay... Needless to say this is not the environment you should chose to enjoy a good time!", "date": "6/7/2016"}, {"review_id": "k2M6EjAb0d7qQRwO1WNCww", "user_id": "D74QLp1N7WAtFGTFxT3x2A", "user_name": "Coon H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "High walls. Hold/route colors correspond. Friendly staff.", "date": "4/29/2012"}, {"review_id": "thGV8rG2BTMnkb-_AEDbNg", "user_id": "uQ45Qe1LuafoIs0p3OjqJA", "user_name": "Dorothy M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My favorite climbing gym in San Diego. Tall walls, good spread of walls from beginner to intermediate to difficult. Unlike many gyms that have good beginner and difficult walls but lack something in between, I've always been able to find intermediate routes at Mesa Rim. ATC on ropes. And good bouldering walls, too.", "date": "8/17/2012"}, {"review_id": "Xo0PYRAns9wM410Jgk5J-w", "user_id": "1MpiIhk6jJCCf0KdooyLzw", "user_name": "Heather S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I received a Groupon for a daily pass and beginner lesson. I wasn't quite sure what to expect after walking in; the facility was clean, the staff are friendly and after an intoductory lesson, the staff sets youfree to explore and try out your new skills.I would highly recommend this facility to anyone interested in rock climbing. The equipment was clean and well maintained.", "date": "3/15/2011"}, {"review_id": "WQkhk-YWMJBjqJ_jZdM--g", "user_id": "vTkAk-k6CbNks522eTXl0Q", "user_name": "T.J. E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "(Disclaimer, I have been a member for 8 months)I absolutely love mesa rim.  Awesome routes, both variety, quality, and quantity.  Bouldering area leaves little to be desired.  Yeah it's a little pricey compared to some other gyms but you definitely get your money's worth between the roped, boulder, lifting, and campus/moon/hangboard areas.  Plus having showers is nice too.  The staff, in my experience, are all very friendly and helpful.  I typically spend about 8 hours a week here.  Only suggestion for improvement would be to put a second bench in the guy's locker area; the room has enough open space for a second changing bench and another one would definitely help with the post-work rush to get changed and start climbing.  Also, members get I think 20% off in the shop, which does have a pretty decent selection.", "date": "3/30/2011"}, {"review_id": "d_-VUV24b2i-qlVOsqXFug", "user_id": "Urw-9TsXzfclg6gZFVfHRw", "user_name": "will c.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Everyone who says the other climbing gyms are the best in the area haven't been to Mesa Rim.  Enough said.", "date": "8/17/2014"}, {"review_id": "_jsG8qO6Wi1oVee1jBpsEA", "user_id": "NKbVHb94TDcA2SljSMPlSA", "user_name": "Torrey S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My first time here was a success! This was a pretty big place, so even on a more crowded Sunday, there was still ample area to be able climb and not have to wait. There were routes available for every skill level, so even if you are new to climbing, you will still be able to maximize your visit. With that, they offer belay classes for $8 which is reasonable, and takes about 20 minutes or so. I only interacted with one staff member, but she was friendly. The one thing that could have made the experience 5 stars for me was that I would have appreciated a little more explanation of the layout of the place and what to expect. I just felt like we checked in and were on our own. For someone that has never been there, it would have been nice to at least been told about everything that they had to offer/where everything was located since it can be a little intimidating coming into a new climbing gym where everyone already knows the \"ropes\".", "date": "10/20/2014"}, {"review_id": "4mzGqb7ymDJWcOcF5edrUA", "user_id": "0Sk4e3pmSASASHrtm6UmOw", "user_name": "Shane G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 4, "funny": 5, "cool": 1, "text": "This place is so cool and very clean and very awesome. Plus heather is gorgeous and so sweet and informative and helpful  and patient. thanks heather your beautiful btw!!", "date": "7/30/2011"}, {"review_id": "m8GQelnjt3GYA6wOy78_Gg", "user_id": "VZkVthX2Kr-Whaz3jRYyXA", "user_name": "Brian R.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is huge, and the walls are impressively tall!  I've been here twice: once in the after-work rush, and once on a Sunday afternoon.  Both times the place was hopping, but it wasn't hard to find a top rope for the routes I wanted.  I've found the staff to be quite friendly.  I'll definitely be coming back.", "date": "7/1/2012"}, {"review_id": "ibKceXUNhrqF5Sm7fPG1Kw", "user_id": "gRRFsrDmpz1ZFmDaXsTB5w", "user_name": "Bethany W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Mesa Rim is an awesome climbing gym, not only because of the ever changing routes, but the other great benefits they offer like a gym section and yoga centered around flexibility, agility, and strength for becoming a better climber. Any gym can throw some routes up or have a bouldering section, but I feel like the staff at Mesa is constantly evolving, seeking out the opinions of their members, and changing it up so it never becomes \"routine\". I love the free monthly classes/workshops, too. They pick an aspect of climbing for you to focus on each month and that's really helped me center my \"training\" by giving me direction as to where to focus my energy each month. I wish my boyfriend and I would've joined a long time ago! Even though indoor climbing will never be the same as getting outdoors; Mesa Rim does a fantastic job at providing you with a quality and convenient means to preparing for the outdoors!", "date": "4/21/2014"}, {"review_id": "Rh3Guc59HhkW8K0jJc-YSA", "user_id": "dqy2kHTTabiBlqL-pzjw4g", "user_name": "Shteen W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm not an advanced climber by any means. I started climbing about 9 months ago and had been going top roping and bouldering at other indoor gyms in San Diego with an occasional 1 month pass when I had enough time to climb my money's worth.Yesterday was my first time at Mesa Rim, and to be honest, I didn't expect it to be that great. I LOVE this place.I'm a little on the short side (allllllmost 5'3\") and usually have a bit of trouble with some routes at the other gyms, even the easy ones, but not because it's difficult, it's because the next colored tag is half my body's length away! At Mesa Rim, there are SO many routes, so many options at so many levels! Mesa Rim routes are fun, challenging, well diversified and have routes that a shorty like me can do, without sacrificing complexity or skill (I went with my 5'11\" friend and it was nice to see that he couldn't just use his long legs and arms as the only advantage, and the more skill was required of him). I think the routes are a bit more challenging than solid rock and vertical hold (a 5.8 felt like a 5.10a at solid) but they've also got some awesome ones for beginners to work up to the harder ones. Also, the walls are hiiiiiiigh!The staff is also very friendly, attentive and HELPFUL (thanks Leslie!). We did have to wait a little to get tested that we know all the basics before we could start climbing, but I have no problem with them ensuring my knowledge and safety. Also, there was a big group that came in a little before us, and they were getting a little extra attention so that they could climb safely. I appreciate that, but having a little more staff on hand would probably be better for people who aren't as patient as I am.ALSO, they have a SAUNA, exercise bikes, a great lifting area, a lounge upstairs, a child's play area and bean bags.Only thing is, it's a little too pricey for me to get a membership, but considering their awesome facility, my friend and I are thinking of canceling our gym membership and just getting an annual at Mesa Rim. If only they had a treadmill too...", "date": "8/9/2010"}, {"review_id": "KY5s37J_tjfW1IuBIZ9ysw", "user_id": "dPxIrDl0noHYNdoQAZNChw", "user_name": "Charles E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best Deal totally fun expert advice very safe! Clean fun for most ages!", "date": "2/8/2013"}, {"review_id": "-Wj1_qZEsGc1YvAaL7X6wg", "user_id": "O94MERs2F96YIH8I3Yg91A", "user_name": "Valerie G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "I've been here now twice in two days. There are tons of routes, lots of lead climbing options and a good amount of bouldering. I do wish they had a completely horizontal overhang for bouldering (like at Vertical Hold); there's something about hanging upside down knowing that if you fall there's nice cushy flooring to catch you. The staff have been really helpful, and their rating system is consistent (an improvement over Vertical Hold). Would be nice if they had a lunch discount though.", "date": "1/13/2012"}, {"review_id": "A5fkcytaoCttuAWj8pURXQ", "user_id": "LNkidH86hFBd1Wq1Z_cMTQ", "user_name": "John N.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Climbing, yeah they seem to have great big things to climb there, and it looks like fun..  .  But I don't climb, not my thing.  What I do go there for is yoga..  and I will say that the yoga classes at Mesa Rim are probably the best kept secret in San Diego when it comes to yoga studios.  The yoga studio at Mesa Rim is incredible, lots of natural light coming in from overhead windows, just an awesome environment for my practice - the place just feels right.  And the classes and instructors are some the best in the area.   A good mix of different classes (I prefer the ashtanga and there are plenty of those) -  it's definitely a studio for those with a serious yoga practice.    So if I could give the yoga studio there 10 stars on this yelp thing, I would..   a total surprise for me to find this studio, and I have been coming back since.", "date": "11/6/2011"}, {"review_id": "CDNSqqW_ljPJ9BH6tEtvzw", "user_id": "mI-_AaWPZs3TSnaMruyA7w", "user_name": "Josh H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Mesa Rim not only has the nicest indoor climbing facility in So Cal, but they have amazing yoga, a weight room, and more.  They have an unbelievable setting staff who do a spectacular job on a regular basis.  It's definitely the premier gym in SD.  They're supporting local climbing access, and hosting awesome events on a regular basis.  I can't recommend this gym enough.", "date": "9/10/2011"}, {"review_id": "aUlJkcpA2vC1q0DEl6RHVQ", "user_id": "V98fK6LWFvkOFJ89GHlm3w", "user_name": "Dan C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "really nice wall,  friendly climbers and staff.  sensible policy on belay checks.very very tall climbs", "date": "2/12/2012"}, {"review_id": "z4rdH5NQVLihJOgBayECPw", "user_id": "yuKCevfHQAfp1jGxDRR2xg", "user_name": "Chih S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The climbing gym is great with a huge variety of climbs. They also update their climbs very regularly. Definitely one of the best climbing gyms I have been to.", "date": "9/3/2014"}, {"review_id": "RmIlkG--5okCBg-Qc8XBFQ", "user_id": "Z5sW31ytDZPUgp7EY4BdHQ", "user_name": "Chris S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love Mesa Rim, big walls are so much better that Vertical Hold and Solid Rock. Wish the prices were a little lower but that's a common complaint about everything, right?", "date": "9/27/2012"}, {"review_id": "3iDhSKXdNVH2NttgBabf2Q", "user_id": "AKt4u_deE6Dsa9KDGolANQ", "user_name": "Stella's Mama L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This is a beautiful climb gym I'd totally recommend! Memberships are costly, but they do offer yoga and a small shop. I love how high the walls are and their cleanliness overall. I miss climbing!!!", "date": "1/14/2012"}, {"review_id": "xuX4ACb68ueYdgOYGvXZeQ", "user_id": "6BSC_zQoyuhzpUUxzLhspQ", "user_name": "James H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A very very nice climbing gym.  But, it's expensive compared to Vertical Hold, which is just down the street, and the staff is not very personable, unlike Vertical Hold's.  Overall, I like Vertical Hold better.  But, the climbing at Mesa Rim is excellent.", "date": "6/11/2012"}, {"review_id": "SEELHLgk4KZVVFjlcCOUgg", "user_id": "yWBaHythMryi6oPifsRi2w", "user_name": "Shirley D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I like that Mesa Rim caters to climbers of varying levels. It's gotten so popular though that it packs fairly often.", "date": "1/5/2012"}, {"review_id": "8Fo5caw9pO2olj3CC11u8Q", "user_id": "8E5K7QcgfZYZsQSjSMc9pw", "user_name": "Justin J.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Had a great time...instructors and staff were very involved as well as friendly! The atmosphere was comfortable allowing you to climb with ease and concentration. Having a friend visit from Chicago next month and we will be in to enjoy the facility!", "date": "1/23/2012"}, {"review_id": "C_D8JnGuaCE9G66ijqLyTQ", "user_id": "0kzlLimaVmgnuxa_pf6jQg", "user_name": "Cheryl H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym I've been to in San Diego.  Great, creative routes; tall walls (I think they claim 55', which seems right for their tallest wall); both lead and TR routes; a few auto belay routes; bathrooms are beautiful & clean; also offers yoga classes and has weight-lifting and aerobic equipment. Definitely going back!", "date": "6/15/2012"}, {"review_id": "oV85ItLGl4ekIGZJ-w0q4A", "user_id": "PVPm6St72kHKk-9bo3V83Q", "user_name": "Derrik S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best gym I've found while traveling around the nation for work besides The Front in Ogden, Utah.  Great staff, excellent walls, and very well set routes.  Go here if you are looking to climb inside while in the San Diego area!", "date": "4/5/2012"}, {"review_id": "FgyM-krwITBk46mbOFFuqA", "user_id": "KtrViHWh5pBZ8-o67dFCPg", "user_name": "James D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great. My only complaint is it was crowded on a rare rainy day in SD. Once we got certified to belay, the crowds didn't really matter because of how big the place is. Great bouldering, tall walls for top rope and lead, a slack line, ping pong table, and a weight room. I wish I lived closer so I could take advantage of their classes.", "date": "3/8/2012"}, {"review_id": "qeS7X_Zn3KmZXrFtVYjSSQ", "user_id": "qpoGbjusA1FeZZnGyIIs1g", "user_name": "Elizabeth M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I explored Mesa Rim with my children several weeks ago when our son, home from college for the summer, wanted to get more experience climbing. He now has a membership and our youngest is a member of the Rock Monster Club...that's how much they love it! Great staff and super walls.", "date": "6/5/2014"}, {"review_id": "DURI-h_nrzSSCOHkF37zVw", "user_id": "LQM6C8zDFq8C93UqEqIuRA", "user_name": "Sophia G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 2, "funny": 0, "cool": 2, "text": "I know enough people who have memberships here (read: people willing to give me their guest passes every month) that I've only had to pay for a few sessions here.  So I may have a bit of loyalty to this place.  That being said, I come to this gym 4-5x a month and I have to say it's the best rock climbing gym in SD.  I've climbed at Vertical Hold, Solid Rock, and even the Outback Climbing Center at UCSD and this place blows them all away with their two-story walls and number of ropes.  You just can't compare them.  The only downside is the growing number of members at the gym, that can make it seem impossible to find a suitable route at peak hours, and the show-off lead climbers that can take over a few routes over the hours you're at the gym.  However, if you go at a good hour, and if you can avoid the testosterone-fueled aggression in the air (although, to be fair- that's a hallmark of any good gym) you'll have a blast.", "date": "3/6/2013"}, {"review_id": "xxme7DfqKvFUhCeuHafOkQ", "user_id": "Fm9zntNS_6n3j_yL73sbdw", "user_name": "Vinh H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 8, "funny": 7, "cool": 8, "text": "dam. this gym is ridiculously amazing. i haven't been to a lot of rock climbing gyms, but i can confidently say that they all pale in comparison to this gym. let's just say that if vertical hold [yelp.com/biz/vertical-ho…  is your average sized house, mesa rim is the freakin' mansion up the street.anyhow, i've been climbing here for quite some time. the staff is overly friendly, though they can be a bit anal regarding the safety. it's better to be safe than sorry, i guess. since mesa rim is the new kid on the block, everything is still so new, even the dumbbells in the nearby weight room. the bouldering section is huge. a friend observed that it would take weeks/months to try all the problems before they'd even need to switch things up. since i don't do lead climbing i cannot comment much on that. they do have a whole wall, or should i say mountain, dedicated to that.aside from climbing they have your every day workout stations. it's definitely nice that they have top of the line 'new' machines. what's also really nice is that they have a cozy lounge area up on top. though i have yet to use it, you can easily utilize this facility to unwind on your breaks.overall, this is currently the best climbing gym in san diego. note: $17 for a day pass, but if you come on a meetup day, it's $15. and the kids here look like they're pumped up on hgh.  it's rather intimidating.", "date": "8/17/2010"}, {"review_id": "fDcgTqRNhGs7q3I_3teUHg", "user_id": "q67mYlu5YOPUYEgicyAF2w", "user_name": "bonny c.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Make sure you make an appointment for the beginner class! best gym ever. period. the people that run this place love climbing as much as we all do. I met most of them outdoors before rim even existed. no other gym compares", "date": "1/30/2012"}, {"review_id": "Q0ZnD-v_a97TpDwD18VVRQ", "user_id": "_jooCMbtNISAbAQ7oZAfug", "user_name": "Samantha J.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time visiting Mesa Rim Climbing  and my experience was WONDERFUL!  Staff are all friendly, helpful and knowledgeable!  Debbie is a great instructor for first time climbers!  Can't wait to visit again!  It's worth the drive from downtown!  Plenty of walls and space!", "date": "2/18/2012"}, {"review_id": "rJqK03k5JMjcMSlD3HOrJw", "user_id": "X2zR8yd4UuwnLvojd2yTuQ", "user_name": "Sean E.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "i really don't see how there can be a better indoor rock gym.  Routes are constantly changed, the gym is nice and clean and the boulder walls have routes for just about anyone", "date": "1/3/2012"}, {"review_id": "1_sVP3Lvhbjiuuievop5jA", "user_id": "QGjE6PcRd2EowoF1gyMelQ", "user_name": "Patrick T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I really like this place. Great spot to hangout.", "date": "2/13/2012"}, {"review_id": "HBZQeG-Nc3UXoPMSQU5IrQ", "user_id": "LNvTIkTEwx2NIZ7U5dSTkg", "user_name": "Luke B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Clean, professional, and huge. That about sums it up. The walls are so high it gives me vertigo, but in a good way. I've been to a lot of climbing gyms that are pretty loosely organized, and in comparison this place seems really strict, but I suppose when safety is involved that's most likely a good thing. All the equipment and facilities are really new. The bathroom/locker room is very nice. Its expensive compared to some other options, but you can see why when you're there. If you really love climbing its well worth it, but it may be a little much for a more casual climber like me. My one complaint is that there doesn't seem to a monthly climbing only membership, its always tied in with either the use of their gym, or yoga. For people who already have access to a gym, it would be nice to separate the two.The equipment shop is also nice to see what is available.They have a fairly wide range of equipment. Far more than you'd see in a normal sports store.", "date": "5/18/2012"}, {"review_id": "h6skNwegwdSvbFXXxn7ESw", "user_id": "JeSpfxFNP51aYPwICnrvIw", "user_name": "Lyndee B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Mesa Rim was awesome! 1st time there and had a blast.  Our instructor was excellent and taught us everything we needed to know to safely climb.  I was impressed with the height of the walls and the amount of them!  I am excited to go back.  Only complaint is membership is pretty expensive =/ other than that loved it and am happy that I bought the Yelp deal!", "date": "1/3/2012"}, {"review_id": "s-ubGDWoNgXhEQfxTRo4CQ", "user_id": "3N5oVEW0COUF73YSnTIT8g", "user_name": "John H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great Service. Fabulous facility. Highly recommended.", "date": "2/19/2012"}, {"review_id": "ZqoBzXAmXKgHJoPHXb49Fw", "user_id": "1tRNDH-CaAsBKqbJrG_dww", "user_name": "Michael D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is the best rock climbing gym in the area.  I usually come here once a week.  The staff are very friendly people.  Everyone in the gym is pretty friendly in general.  There are always people willing to give me advice when I am stuck on a particular route.  The place is very well maintained (especially compared to other popular gyms in SD).  I pretty much had zero climbing experience when I first came here and now I can proudly call myself a rock climber.  So I encourage you to come here if you are considering picking up a new hobby!  Or if you are new to the area and are looking for THE place to climb, this is the place!", "date": "4/22/2013"}, {"review_id": "F3UL-Ag86X89uzO2RuUjgA", "user_id": "GKR6dhRi_kwyFh2mMakghQ", "user_name": "Dave K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, a good variety of routes.The staff has always been cool to me.  I agree that their belay technique requirements are a little silly, but it's not much of a problem.Great for kids and experienced climbers alike.", "date": "1/27/2012"}, {"review_id": "qrJqZW_T8d8AYLzx7nquhw", "user_id": "SQQecEMq-SNiuJaOs-1Yyw", "user_name": "Jey T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 2, "useful": 7, "funny": 2, "cool": 1, "text": "I had so much fun at this place with one of my client who is a regular there. I went with him a couple of times and I loved it. Today I went back and it was way busier than the two times I went on Saturday with my client. Today I found out how bad the service was when things are under pressure. That's how I measure the quality of the business. When you are at your busiest and you are able to accommodate everyone. You are capable of satisfying your customers! Mesa Rim failed me today. My client and I haven't been in for months so we forgot how to set up the ropes. All we asked for is a quick reminder on how to do it. We paid for a lesson a few months back and it took like 5 min for them to demonstrate it to me. I tend to pick things up quickly. This girl was helping us out after we stood around for 25 min and all we asked was for her to give us a quick refresh crash course. The whole time she was trying to up sale us on another lesson. With all the time she spent trying to up sale us she could've show it to us. I was so pissed off after 20 min I decided to just leave. What a waste of my 50 minutes.", "date": "3/14/2012"}, {"review_id": "3iA9Lbq1_tnJpQiXo5bW8Q", "user_id": "sGlFmlu_chOhhHM61APTwQ", "user_name": "Shaunna K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "We had a birthday party there today for our 6 year old twins. They did a fantastic job with our large group (32!)  Most of the kids had never climbed and they made the experience non-initmidating and by the end of the party had the kids excited to go up the taller walls.  The entire staff was extremely friendly and worked very well with this young group of kids.  I would recommend this facility ot all who want a different birthday party for their kids.", "date": "7/22/2012"}, {"review_id": "PRNbxTgwDeFEXoeme433Eg", "user_id": "SMdmD80Y-ZpyIxm5wdqOKA", "user_name": "Trisha S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am getting back into climbing and the height of the walls in Mesa Rim is unbeatable for endurance training especially for those who aren't into leading.  I appreciate the creative route setting that maximizes the moves per rope.  I also love the holds and actual foot chips! (again this is strictly a San Diego comparison).  The gym is clean and well maintained.  The staff members are friendly and smiley. It's well worth the day pass to visit this gym... even if it's a little out of the way from the major freeways.", "date": "10/10/2011"}, {"review_id": "Mg-9-VWlBb-1YjjuTTNYDA", "user_id": "V6XOsQ2ebdQfcFwdro7RQQ", "user_name": "Chow T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Amazing!  You won't be going back to solid rock or Vertical Hold once you come here.  50 ft climbing walls and tons of bouldering.  The top-roping and sport climbing routes are all combined, so it doesn't create that irritating air of sport climbers here a top ropers over there, and it also opens alot more routes if you are just not up for sport climbing that day, or you would like to try that 11a sport route, but not on lead.The climbing alone is enough to make any other gym owner in the area cry, but to top it off there are yoga, and workout spaces, and hangout location if you want to BS with people about that trad route you hang-dogged but tell people you onsighted.  Going back to VH is going to feel like your elementary school playground after mesarim :)", "date": "5/22/2010"}, {"review_id": "2j_D8JU4hGAmELy3yAWUmw", "user_id": "WD8E5NKEVGX66PAWJdXWzA", "user_name": "Mike D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First impression: Fantastic rock gym with their act together! Many tall climbing routes (60 feet I believe I saw on the website, don't quote me though), really great bouldering, pretty decent gym, and everyone I met there was really chill. I hadn't climbed in over 6 months before I went there so it was a little rough but I got back into the swing and was really impressed with the bouldering routes. The cute girl at the front gave us the low down and answered all of our questions no problems. I was impressed with the suggestion box / board they had. It's very cool that they actually take customer ideas and use them to make the gym a better place! I guess it's the little things that really affect my reviews... Overall: I will more than likely be getting a membership here. Very reasonable price, better than the rest, and I can really see the value when I take into account what I would be doing otherwise (going out and drinking with friends constantly - $$$). I highly recommend you at least come and check it out. You really are not going to find a more complete rock gym than this.", "date": "8/29/2011"}, {"review_id": "5LG7PBgk0cgW1zl5SA8_6w", "user_id": "GGw0J_QQvOpPPwYZjUK1ew", "user_name": "Cee C.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Competitive price with other gyms this size (in Northern California -- I have been spoiled); Mesa Rim has it all for the SoCal climber. Biggest gym in SoCal with a variety of routes and boulder problems. Route setting is great and sustained. And staff is great for the most part.Only downside: can get crowded; some people who are lead certified perhaps shouldn't be...", "date": "8/20/2011"}, {"review_id": "_NQdkJXB-ewqGhN6PxD-ow", "user_id": "-lqarQYFMVgNKc9T_uKV9A", "user_name": "Abe P.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "I climb here about twice a week with the meet up group - San Diego rock climbers. This meet up group has scheduled climbing events at Vertical Hold and Solid Rock, but neither gym compares. The walls are taller, the routes are tougher, and the atmosphere is phenomenal. Not only does this climbing center offer tactical and challenging routes, they also have a separate workout gym and 2 spaces available for hosting a party. They also have a entirely separate wall for kids. I have no problem with younger kids learning to climb on the big walls but it gets a little annoying when you're trying to work on a route and kids are running and screaming all over the place, which is what I've witnessed at solid rock. The staff at mesa rim does an outstanding job upholding safety standards, gym cleanliness, and route adjustments which they frequently do to enhance the climbing experience. As far as prices go, mesa rim is pretty reasonable at $17 daily, compared to solid rock which is $20 daily and vertical hold which $16 daily. Vertical hold offers student and military discounts where mesa rim and vertical hold do not.Mesa rim is worth the drive and the price if you're looking for a new challenge in an indoor climbing center.Also if you would like someone to climb with, show up on Tuesdays and Thursdays and ask for the meet up group discount. The staff will direct you to some meet up members, including me.", "date": "8/18/2010"}, {"review_id": "GmeVPRh6-QEc-FzES42aTw", "user_id": "omAp9oELEWwbp6_RA3Tb5g", "user_name": "Becky T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I love this place! If I didn't work in a gym I would buy a membership! They have everything I like for working out: small group classes, fitness equipment, yoga classes and on top of that amazing climbing! I used the punch card option they have which is perfect since I can't get in more than 2 or 3 times per month at this point in life. I've taken friends a few times and though their day pass is a little pricey their gear rental is very reasonable. I'm looking forward to letting my son start soon.", "date": "7/4/2012"}, {"review_id": "f5mrScE0O26eJpd9yGIEkg", "user_id": "864nL0po2ldN8TPgbSiwOQ", "user_name": "Walter M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Having route set at 2 different gym's at 5 different locations this is a Premier state of the art climbing center with state of the art walls, some of the longest routes I've seen outside of Colorado. Expertly set routes that change due to a full time staff of setters unlike many other gym's where the employee's and local community volunteer time. The padding isgreat and the bouldering is just a little bit taller than most oare used to for gyms which I love. A full weight and exercise area full with finger and strength training. A yoga area and raised platform for lounging and getting away from it all that make this the most complete, fully functioning gym in Southern California. A shower, they don't segregate area's. The pricing is a little steep, but compared to what you get it's worth it. My only real gripe is the airspace. I noticed that when you have a ton of people on ropes the amount of area in, around, behind certain routes is clustered. In other words if you were to have every route in use at the same time there is a very small area for belayers and climbers to maneuver for lowering and pendulums and such. This is minimized by expert setting with brand new holds, color coded as well as taped and expertly rated. Ian McIntosh is the head setter and keeps a tight ship. They are so cool, new and legit they are able to hold comp's which is something that's been missing for years in the San Diego climbing scene. The only thing i can say that's in any way negative is my last outting I pulled a tendon and now have a ganglion cyst that's kept me from really climbing anything juggy or past vertival. The setting of the boulder problems seems a bit sandbagged. After recovering from another injury for many months and gaining 30 pounds I was still able to boulder at V2/V3 range when my peak was V5 outside. Maybe it was muscle memory, but I lost alot more in my lead, trad/sport ratings. Quite a few of my old Orange County climbing friends actually now work here. Take that for what it's worth.", "date": "12/22/2010"}, {"review_id": "j-FEZD2734zKMvyFXFiySg", "user_id": "2mrBeOkb7qg1tWk7G3E5Qg", "user_name": "Nicole S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "There are a lot of climbers in San Diego. I'm not really one of them. I have, however, been dragged to most of the climbing gyms on the western seaboard, so I can say with some authority that this one is my favorite. The walls are HUGE, there are a lot of them, the equipment is clean and extremely well maintained, the staff is nice, and the bouldering \"cave\" has padded floors, so you don't have to drag crash pads around with you everywhere you go. I would probably take some points off just for how expensive it is, but I think it's worth the price for a quality climbing experience. Plus they're a few blocks away from the Green Flash brewery too.", "date": "10/10/2012"}, {"review_id": "bQmkToxhfJg9iAKyptSHvA", "user_id": "dUAchoRUN8A1O013ip37Ag", "user_name": "Marek M.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Walls are very tall, good for people getting into rock climbing to build confidence. They hold competitions once in a while which makes some days absurdly busy. When they do hold competitions i feel like the routs get more challenging. They have a huge bouldering area and a gym. Mesa rim offer classes and really teach some useful stuff. All in all this is a great one stop workout facility and offers a lot. Management listens to the customers by taking suggestions and making changes if they feel the request is worthy. Facility is still very new, offer showers and a sauna to Yoga, rock climbing and just working out. Highly recommend it. It does get busy though. this place gives a sense of community as sometimes people give you beta to the routes.", "date": "4/26/2013"}, {"review_id": "VAsH1wfL4KKPYyvRrprxKw", "user_id": "Y6zLfO3f2-w88Xhopwituw", "user_name": "Cat T.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 1, "useful": 4, "funny": 1, "cool": 0, "text": "UGH! They did it again! They made me belay test AGAIN because they didn't have me on file!!! While redoing my belay test and throwing in a lead climbing test too, the employee made me switch my pinch belay style (widely accepted and safe) to their gym mandated BUS technique. That's funny bc during my Nth time belay tested, an employee told me I have great (pinch) belay technique! I'm completely confident in outdoor lead belaying with my own technique but I understand the gym's need for a consistent and dummy-proof method for noobs. I feel like a gym staffed by skilled climbers should recognize a climber's comfort and safety awareness instead of imposing a blanket rule, but whatever, I went along. I understand BUS keeps you braked more consistently, but there's nothing wrong or impractical about the pinch. In all, it's HOW Mesa handled all this that led me to give them a one star. This is a gym for noobs and gym rats who are impressed by the big and shiny facility, as opposed to a real climber's plastic hangout.While touting Mesa Rim's desire to \"change the face of climbing\" and \"being at the forefront of safety\" (gag, how long have you been around, Mesa Rim?), the employee managed to step on our personal rope TWICE!!! Our brand new, beautiful 70m rope that keeps us alive at the crag. AND during the lead test, the employee told my partner he back clipped. My partner, a certified route setter who helped forerun (rate/critique) Mesa Rim's boulder problems before their grand opening and climbed in their grand opening 5.13 invitational, told him that the draw was set on backwards for their lead test route, which would cause a more dangerous fall. He was essentially anti back clipping! The employee recognized the error but insisted that my partner \"play along\" for the sake of the test anyway. Lastly, the test fall/whipper on lead is set up dangerously, in my opinion. The last draw that you're supposed to fall from is quite run out considering you're falling on a straight vertical wall, meaning it's likely you'll slam into the wall. Luckily, I knew how to fall and kick off the wall and my partner gave me a soft fall, but I don't think it's wise to set up the test route that way. We griped to the manager about all this and while I commend his desire to teach the more dummy-proof belay method to new climbers, we didn't really appreciate the general vibe there. He started name dropping all these Bay Area gyms and what the guiding associations say and all that. That's cute because I've been to NorCal gyms, heck, we've even set routes there, and we've never encoutered such a patronizing attitude in the climbing community as we have at this gym. I understand if you have the corporate policy to follow, but don't act like our climbing experience is beneath you. I've been in gyms in Alaska, NorCal, and SoCal, and nobody has had the \"my way or the highway\" or \"we're trying to change climbing\" attitude. Get off your high horse, Mesa. Maybe this is why Mesa Rim can't adopt the real outdoor climbing community because of the bullshit like this. Oh yeah, and their fabulous BUS belay style is inconsistently taught. Half the time, the employee will teach you the style that requires switching the hands on brake, something the manager insists shouldn't be done. That's funny how they got Nazi on our belay style while the noobs next to us were letting go of their brake hands all the time! Yet they're \"certified\" to belay! After 2 hrs of driving from OC to Mesa Rim and just 1 hr of climbing, we basically said \"screw this\" and I asked for my money back on my multi-visit card. Such a waste of time! At least we had enough time to visit Green Flash brewery as a result of the extra time. Vertical Hold, here I come!!!", "date": "9/4/2011"}, {"review_id": "pm4brjREJ2cBQe14u3Y7bg", "user_id": "xyEyYaY5aUk6XS-XSaaSeQ", "user_name": "Benjamin H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great, can't say enough good about it. I moved to the area and was looking for a climbing gym that I would enjoy as much as my previous one, and I found it here. Good setting, friendly employees, a decent gym (more than I would expect of your average climbing gym, lots of stuff if you like crossfit-type workouts), friendly people, reasonably priced, good good good. This is my local climbing gym because its the best in the area. Period.", "date": "2/9/2013"}, {"review_id": "ColvzbSAQ01EQnAo4KgkZQ", "user_id": "u7KauCFGVqN6FCZ-EXhUvg", "user_name": "Royce K.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Attention to detail! This place is first-class. Compared to other gyms, you'll find each route clearly labeled, with all the holds matching in color, consistent in their rating, and the dynamic ropes are always in good shape. It's large enough there's never a shortage of ropes available. Bathrooms are clean and they have showers!", "date": "4/22/2012"}, {"review_id": "K6C6CpWhkgy7C-bXbVZWFw", "user_id": "EzmjbuP56xdF8itcKK3puw", "user_name": "Michael G.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am giving this place a 5 because it was an overall good experience. I did my first climb ever here today so I have no comparison to base how good the climbs are. All I can say is that I enjoyed them. I didn't feel pressured and I felt pretty comfortable with the training they gave.The only con is that it was kind of pricey.", "date": "10/31/2010"}, {"review_id": "uCWQf5vyswMth7ciTJCuQg", "user_id": "WjmWNxvDNcnjTT0t_uDofA", "user_name": "TJ H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Bar none the best climbing gym I've been to in 20 years and I've been to over 50.  Mike runs a tight ship and it shows.", "date": "8/30/2010"}, {"review_id": "Y1WUuwxe794daqgIpqFqYw", "user_id": "bbqDq3eWdyckanfAm5bapg", "user_name": "Via B.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place for teenagers (as well as  younger kids).  Very clean, professional yet friendly staff and the yoga studio is outstanding.", "date": "2/17/2012"}, {"review_id": "exdRpQB5Sam6cWwa4jlYPg", "user_id": "RySxQU4aCJmIUctGvMqqfA", "user_name": "Chris W.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I was very impressed by the tall routes in this facility.  The climbs were appropriately rated and they were very well thought out.  The staff was super friendly and helpful as well.", "date": "2/17/2012"}, {"review_id": "QOVCqpa-GkS8OWn3TO3T2Q", "user_id": "dPtUg9aHOZNlove7d8zxTg", "user_name": "Dustin L.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "If you rock climb, you are probably already pretty passionate about it. You don't need any added motivation to get out to the gym several times a week and work your body to exhaustion on a wall. But with Mesa Rim, you will literally want to drag your enfeebled body back as soon as the lactic acid stops oozing out of your aching muscles, because the facility, the staff, and the vibe are just that good. One reviewer referred to Mesa Rim as the Walmart of climbing gyms, but it's more like the Bellagio of climbing gyms. Yes, it is very LARGE, but every last detail was conceived and executed with the level of care and design usually reserved for luxury resorts. Even the bathroom is a welcoming and aesthetically pleasing space. But the gym isn't just beautiful to look at and pleasant to be in, the climbing is unmatched. The walls are TALL, and the routes are masterfully set - they are deliberate and have a great sense of pace. The bouldering section is amazing. The entire area has a padded floor, so you never have to worry about landing on a crash pad, you can focus all your mental energy on climbing.  The gym has great ventilation, so body odor is not as much of a problem as other gyms, although the walls are so tall that sometimes you'll find that you literally climb above the cooler, air-conditioned climate your partner is belaying you from and get stuck in a pocket of heat at the top of a route, which is not so much annoying as it is hilarious. The music selection is varied and appropriate - it seems to rotate between alternative rock and energetic electronica. While the gym is very large and there are numerous routes to choose from, it can get extremely crowded on weekday nights. Some will find that they can harness the vibe and energy of being surrounded by so many enthusiastic climbers and use it to their advantage, while others will be overwhelmed and agitated by the abundance of bodies both on the walls and on the floors. The staff is wonderful. They are legitimately caring and involved in making sure that each new member is safe. On that note, the certification process can be tougher than other gyms, and they won't hesitate to fail you, so be prepared to take your certification and/or lesson seriously. This is with good cause, if you fall from the top of one of these walls, you probably won't survive. Overall, Mesa Rim is a no brainer for San Diego area climbers. It's pretty much amazing. My only real complaint is that there aren't as many good overhangs for top-ropers as there could be, but in the scheme of things, this is just a minor complaint.", "date": "2/5/2011"}, {"review_id": "uq_OHewtd2BR9H2Hlcha9g", "user_id": "qKYGiUvNJ9Rkr6sL5zUDTA", "user_name": "Robert P.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "In general I think this is a great gym, certainly outstanding in the sheer size and variety of routes, bouldering, toprope and lead. In addition the fitness area seems very complete, and the gym and procedures appeared to be well organized. The staff was for the most part friendly and helpful. We brought in a small group of competitive youth climbers for lead practice last week and, upon all of them failing the lead belay instruction and test (I've heard and read a pretty fair amount about this), one of the staff who had just clocked out volunteered to stay for awhile on her own time, and lead belay our group. This person's name is Peggy and if you have the good fortune to have her assist you then you are in good hands. She helped us out for about two hours, many kudos to Peggy!Our only real negative for the day came in the form of our test for lead belaying. I didn't pick up on the name of the staff member who observed the test, but his method was to watch everything that was done, then point out all the mistakes that were made, suggest we take the Lead 102 class, and tell us to come back the following week to try the test again. His attitude was pretty much neutral, not exactly unfriendly, but came across as very unapproachable. He also mentioned several times how super dangerous climbing is, but as part of the test directed  the climber jump from the topmost part of the climb  (an overhanging 5.8 at the top of the arch), above the last clip, and take a 15 foot fall from the ceiling, as a test for the belayer. I understand why this might be a good test for the belayer, but a lead fall is a lead fall. I think instead of doing the fall from the ceiling, a little  lower down might be better in the event the climber decks for whatever reason. Aside from a disinterested tester, we had a good time, and will come back.", "date": "4/9/2012"}, {"review_id": "s3BIFJYr-8J2myYHyYPtcg", "user_id": "pMb2cVNDGTtkisUrXz9ytA", "user_name": "Eva S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Got a great deal on yelp for Mesa Rim Rock climbing   My kids really enjoyed it.     I have 3 girls ages 20,11 & 9. However we brought a friend along and unfortunately we had to have her mom sign a waiver and fax it to Mesa Rim which took an hour. Not good. Also it would be nice if your signing waivers for minors that you could do all kids on one form along with the adult. I had 4 kids plus myself that I had to fill waivers for. It took way too long. After trying to get the waiver for our friend faxed over I felt I should of lied that the child was mine. That's what you get for being honest. One other thing my 20 Yr old wasn't able to enjoy all the walls because she didn't have anyone to belay her. They were under staffed   Would of been nice to know that ahead of time.   Would of had a better experience had we known. Not sure if we will go back for regular price. ;0/", "date": "1/24/2012"}, {"review_id": "MGxTIX54mc-kBl-vD5O27A", "user_id": "FAMhn9mZvQ90CM-bGsEJvw", "user_name": "Saori H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I have unwavering love for my gym, ClimbX in HB, but Mesa Rim is pretty comparable for completely different reasons. ClimbX is more mom & pop shop to Mesa Rim's Wal-Mart Superstore, scale wise.The facility is bright, clean and massive. The scale of it makes for longer routes but what it gains in endurance it definitely lacks in dynamics. The routes tend to get tiresome because they don't have very many technical maneuvers. I also think they put up more hand holds on their top routes than necessary- even for the higher rated routes.They have this sort of \"real wall\" which is supposed to stimulate outdoor climbing and it's kinda cool solely for novelty reasons. The bouldering routes were rated accurately with some interesting problems. $17 a day not including equipment rental is a bit steep and because I'm not from this area I would probably only visit this gym every few months or so but yes, I'll definitely be back here again purely because of it's baller status. We did actually see a pro that some of the climbers \"ooh'd and ahh'd\" at which was cool for a minute.", "date": "1/5/2011"}, {"review_id": "bKuOStwUoGWPcPoKYO29KQ", "user_id": "PIHO0w4olYAKSj5TOnlUew", "user_name": "Colin R.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "this is probably the best indoor climbing gym in San Diego, perhaps one of the best in the country.  High walls (~75ft), lots of routes, realistic crack climbs, big bouldering area, gym, yoga, clean facility, rarely find loose or broken holds.  climb on!!", "date": "12/22/2011"}, {"review_id": "TGp7IDQ9Wb522gB3Aqj_uA", "user_id": "EtUFQddzm8G1dcpNoi4UYw", "user_name": "andrea l.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm new to climbing and a climbing gym but I really like Mesa Rim. The staff is super helpful and friendly, making a newcomer like me feel welcome.", "date": "12/20/2011"}, {"review_id": "XNOn3syYfqqPqG2OA6BkVA", "user_id": "kUg7Gn6w3HlV5Iwr7sVqAA", "user_name": "June S.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym in San Diego, hands down. A bit spendy, but incredibly tall walls with routes that change regularly, and a gigantic bouldering area. It can be pretty pricey if you don't have your own equipment, but it's worth it.", "date": "4/17/2011"}, {"review_id": "W09u9wHzS9UvBtbDh79gZQ", "user_id": "vtJYNBT_1PE_If3ZzKhTbg", "user_name": "C H.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I started here as a newbie and even though the walls are huge and there are plenty of expert climbers here, I found a friendly and supportive atmosphere as a beginner. I had some regulars encouraging me and directing me up some bouldering routes by NAME within my first week. I have even met some other newbies who I have been climbing with for the past 3-4months. Now we are planning trips outdoors. What a great, positive place to climb. :)", "date": "6/23/2011"}, {"review_id": "AYTwhBhe7yPKQtoIlzLggA", "user_id": "6RFxwva-oKRRXXO9lrvUgQ", "user_name": "Matt D.", "business_id": "mmoy-s1s3LEmgQOFJ4yc5A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best indoor climbing.  Just make sure you know your textbook belaying basics and know how to use an ATC if you want  to climb without hassle.", "date": "3/28/2011"}]