[{"review_id": "0dXEmtess2bRnMPR0M4jNw", "user_id": "Qpdp-snc3dsnRY7CWGyuEA", "user_name": "Katie B.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Mesa Rim is the bomb. The staff is friendly, the place is clean and the climbing is FUN! I've been to quite a few climbing gyms and Mesa Rim is by far my favorite. They change their bouldering and top rope routes frequently so things don't get boring. They have a nice little shop where you can buy some gear. They have a ping pong table, a yoga room, training walls for climbing and even floor space for a little gym area where they have pull up bars, hang boards, weights, boxes and rowers. I am not a yoga fan in general (which is probably why I should be doing it, but that's besides the point)... but everyone I've talked to that does yoga says they LOVE Mesa Rim yoga so try it out! They also do a core clinic on certain days which is really hard and really fun. Check their website for class times and schedules.Another cool thing Mesa Rim does is that they host events. Whether it's a used gear swap/sale, climbing competitions, a day where you can try out different vendors etc., there's something always going on there and there is always thought behind every event planned which is awesome. They also host movie nights where they rent out a theater at the Kensington Theater and other locations to show movies like Reel Rock or No Man's Land etc. Those are probably my favorite events!Last but not least, you can bring your kid here for camp or as part of a team. There are always people walking the floor checking for safety and anytime I've seen one of their staff members working with kids (whether in a group or one on one) they're always paying attention to ensure they are climbing safely and they they are comfortable.Overall, this is a great climbing gym with great staff and my friends and I love coming here!", "date": "3/20/2019"}, {"review_id": "VUL9Daym8_xMA-XnMCu-oQ", "user_id": "sXJwXEHR64393fWO4Qdq6A", "user_name": "Kim P.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Best gym in all of California. I've been to a lot of them and we are so spoiled here in SD. Mesa really does put a lot of money back into the wall. All the routes have separate holds. I've been a member since 2015 so it is very worth it.", "date": "3/5/2019"}, {"review_id": "jpbMfK25JksHko48GZqCvA", "user_id": "QpaiYM-6-Sd9wqiTBSYRiw", "user_name": "Lauren W.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Yes. Yes all day. Totally worth every penny. Do yourself a favor and don't even mess with other gyms, this is the safest, cleanest, best environment to be in - trust me on this! I can't believe I've lived in San Diego since 2013, and only just discovered Mesa Rim in 2017! I've been a satisfied member since then and won't look back! If you're thinking about joining, here's a pro-tip: Check then our around holidays to save on sign up! You can also get three other friends (so four total including yourself) to sign up and you all get to waive the one-time $50 initiation fee!", "date": "2/7/2019"}, {"review_id": "wah-XcBH3iQK0eIYcEJssQ", "user_id": "ABmzo9oUGCbe_3Tf10qPHw", "user_name": "Mark S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 4, "funny": 2, "cool": 0, "text": "It's a nice gym to visit.  I would give it a higher rating but as a veteran climber it seems the safety staff doesn't make their rounds during their shift.   When you allow bad habits, it reflects on the teamWhat you do while climbing outdoors is your own choice.  But in a controlled environment not good", "date": "9/2/2018"}, {"review_id": "qNP_ii9U2yJg5FNOK08nLw", "user_id": "IdFl0SfIdZ52L3sdfA9k_g", "user_name": "Charles P.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Hands down the best overall rock climbing gym I've been to in San Diego. No matter if it's your first time climbing or if you've been climbing for years, there's a little bit of everything for everyone. The very spacious gym has bouldering, top rope, and lead climbing. New routes are set weekly, so you'll always have something new to do, too. In terms of route difficulty, I would say in general Mesa Rim sets a little more difficult compared to surrounding gyms, but don't be too intimidated-- even if you're a complete beginner there are routes you'll be able to do. The downstairs fitness area has free weights (dumbbells, and barbells with bumper plates) and upstairs there are some cardio machines, so after your climb you can get your complete workout in. As you might expect, the gym gets somewhat crowded on the weekends, but I've never found my self waiting around too long to get on the walls. If you ever find yourself going to the gym solo but still want to do top rope or lead climbing, just stop by the front desk and have them make an announcement to see if anyone else is looking for a climbing partner. More often than not, there's probably someone else wandering around who needs a partner too! The staff in general are very friendly and knowledgeable, if need help with absolutely anything just ask.", "date": "11/20/2017"}, {"review_id": "vzGzug_k2uq-ND-x06p40g", "user_id": "7U1ryY7mG0gXs1rHFitNrg", "user_name": "Minz N.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "I took my 6 year old and told them that he has never been rock climbing. They said the coach would train him. The coach was young, and I explained to her that he had no experience rock climbing. She sets him up and sends him up. He did not know what to do to descend and panicked. She just stares at him. Really? Please train your coaches to give instructions to the little kids. They do not know what to do. This was a horrible experience for even me. I've seen adults freak out b/c they don't know what to do, and this was a little kid. The gym was so packed that no one cared, and the coaches were too busy to even know how important it is to teach safety, educate the kids, and make sure they know what to expect. Never again.", "date": "2/2/2019"}, {"review_id": "gwIBVoXDGAoqKkPCP2pIwA", "user_id": "N1RKTzz_mXPw8GNLWONvxA", "user_name": "Stephen H.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place was a lot of fun! Have never been to a rock climbing gym before. The over all atmosphere was awesome! The staff made me and my buddy feel welcoming! The class for safety was very informative. Got the week pass that includes all gear for $35 that included the class!", "date": "4/13/2018"}, {"review_id": "_HXm106Mk8Bk71NOWukbWQ", "user_id": "BP9OO43KQPWHyFV0wjR9Dg", "user_name": "Stacie M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Love this place.  I was very skeptical of enjoying climbing the first time I went, but I absolutely fell in love with everything about climbing AND everything about this gym.  Everyone that goes here is SO FIT.  But not necessarily in an intimidating way, just in a kind of encouraging way.  So the first time you come, if you want to top rope climb, you have to take a little class (that takes about an hour).  After that you can belay that day, and then you actually need to come back your next visit and take a little \"test\" before you get your official \"belay\" card to hang from your harness.  Now that I've been to other indoor gyms I can say that this place is huge.  There's a separate bouldering wall.  There's usually a lot of people hanging out there, but I've never found it too crowded.  And everyone over there is SO NICE.  I don't boulder that often so when I'm over there I often feel kind of silly, but everyone is always so nice, encouraging you or giving you tips.  The walls with the top ropes are SO TALL!  My first climb up I made it up about half way, looked down, and freaked out!  They have a really nice mix of levels setup, and they change it up pretty frequently.  Obviously weeknights at 6pm it's rough to find something, especially if you're going to be picky.  Weekends are usually pretty empty, especially if it's a nice day out.  The yoga classes are also great.  I've been to the climbers yoga, and it's actually a pretty intense workout (again, everyone that goes here is so fit!).  My boyfriend has a monthly membership and also uses the \"gym\" area. He generally likes it, although same problem at \"peak times\" it sometimes gets a little crowded.  I've found the 10-pass to work for me, turns out to be $18/day. I especially like to get my money's worth and make it for a Saturday yoga class + a climb.", "date": "10/2/2018"}, {"review_id": "J0xdvQLytrZEV7bHJm_12g", "user_id": "kK-UwWNBqr_Fy7h42RPAqg", "user_name": "Noah E.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love Mesa Rim. The best mix of climbing yoga fitness gym i've ever been to. The members are really nice and the staff is phenomenal.", "date": "4/14/2019"}, {"review_id": "NZ_QpmBeCHY4hpE0dVdXPw", "user_id": "zdSuaVngp68RLNyVKR8CYA", "user_name": "Cody M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Its been a while since I have climbed a rock wall!! Yesterday after a long day at work I decided to release some tension by taking my girlfriend on a rock climbing date. We ventured here and decided to check it out. When we arrived to the facility, which is a massive building easily noticed from the 163 freeway, we enter to find two nice welcoming employees Matt and Moe, who were extremely helpful with our first time checking in, Matt gave us a tour of the facility and a basic rundown of the rules. Moe was also very attentive and helped us with other various questions I had. Both of them seem to enjoy their job and how can they not with such a nice facility to work and work out at!! We ended up try out some bouldering since we hadn't belayed anyone in a while and we couldn't make the class at 5pm, but the nice thing is there was so much to do in the bouldering area that were able to get a nice solid workout in. As i write this review my arms are still on fire from that whole experience. This is something almost anyone can do and its so much fun if your looking to get back in the gym or want to get in shape give this a try you really might find your new addiction ( in a good way)Ill be back with more of my friends!! Thanks again!", "date": "11/16/2018"}, {"review_id": "uSvHEh6k2m8N8wAwS4c9BQ", "user_id": "W8XCU8gRndzb8VEVyz1TaA", "user_name": "Johnny T.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Spacious climbing gym with a good community, friendly staff, and patrons. This is the nicest climbing gym in San Diego.I main the Mira Mesa location, but since all gyms are included in my membership, I make a point of coming to this Mission Valley location on the weekends a few times a month. This location is huge and full of great amenities to make up for how pricey a monthly membership can get. Yoga classes, a decently-size weightlifting area, free wifi and work spaces, and a huge variety and selection of bouldering and climbing routes. Day pass prices great for drop-ins who want to see what climbing is all about, but with the commitment of going regularly the membership is a good value if you're visiting 2 or more times a week.This location was built from the ground up as a dedicated climbing gym and it doesn't disappoint.", "date": "2/26/2018"}, {"review_id": "_LM-9FoIL2FmDkRcDeYH-A", "user_id": "Yf5MTcVL7HTbP61rl5sHWw", "user_name": "Tyler P.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 2, "useful": 11, "funny": 4, "cool": 2, "text": "I'd love to give this gym more stars, I really do! It's just how their gym is ran is really what needs to be updated. The pros: great setup & place. The routes change regularly. They play good music. There is more to do than just climb. A full gym with other classes. The cons:1. Memberships are expensive! Not only that, there's an initiation fee and if you want to freeze your membership there's a fee still. 2. Gear is not included in a full membership but is in a week membership. Like what about the members that forget their gear? They have to pay. Full members don't want to live comfortably in the loaner gear anyways, so they shouldn't charge us. 3. The belay lessons are almost impossible to get into unless you really plan ahead. So if you're bringing a friend have them schedule the day before and have them go an hour before you. 4. The staff is incredibly unaccommodating! Everything is incredibly strict. Timing, rules, techniques, etc. I get it, safety is cool but come on...use discretion! The main thing that caused me to cancel my membership was that I brought a friend that has climbed and belayed with me at another gym and he failed their belay check because his atc was sideways because he used another atc a different gym, which is totally not their fault but come on, give the guy a day pass so we can climb. The main issue is this - I came in with him at 11:55 and knew they had a belay lesson at 12:00 and specifically asked the guy that if he doesn't pass your check, we can get into the 12pm belay lesson so we can climb and he said yes. We did the check and he failed because of a newbie mistake but then they wouldn't let him take the belay lesson because it was now past 12pm. Instead of any discretion, it's just a simple no because it's past 12. I specifically asked this question so we wouldn't waste our time and here we are with time wasted. I ended up going to Vertical Hold & got taken care of. No more time wasted. Great gym, just have to work on staff and policies here!", "date": "6/13/2018"}, {"review_id": "MBg294P58SL9XbqTQruV2Q", "user_id": "2NoSjy5a6TXYWHyF_lTTSg", "user_name": "Christian W.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 3, "useful": 5, "funny": 2, "cool": 2, "text": "Spacious gym that is packed with people.For the most part, it is what you expect from a climbing gym, it has everything you need. Though I found the bouldering skill increase to jump quite a bit so it left beginners with not much to climb without a good spacing of challenge.I would definitely come back, but they need to change the way the membership works. It's outdated to have a silly initiation fee nowadays.", "date": "6/6/2018"}, {"review_id": "hhFBriF849kSglCVj81Nvg", "user_id": "-j0us6ZIqy3jPf687_rmjg", "user_name": "Dylan H.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "One of the best climbing gyms I've been too; lots of variety in routes and many problems involving volumes which is super fun.", "date": "12/22/2018"}, {"review_id": "NkM8bLRFfNNPyDaPD2YeWw", "user_id": "lP8_lPjrzeYMu2wwOXy3IA", "user_name": "Keith A.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Had a company wellness event here, and it was amazing. First time here and first time climbing. The place and staff are very impressive, and there are many other things to do besides climbing. I saw workout machines, yoga, ping pong, etc.There are several climbing options. There are small walls to practice on and then there are 50 foot walls to ascend. There are also bouldering walls, shorter and no ropes needed, which were fun too.There were people of all ages and skill levels, so you can feel totally at ease. No one made fun of me being a beginner or falling. I was put to shame by the little kids are flying up the walls like spiderman.The event was from 10:30-12 and there was plenty of parking. The center got more and more packed as it approached noon, but still not much wait to do any climbing.The staff was very friendly and helpful, it made me feel more comfortable since this was my first time. They explained the setup, what to do, which routes to try for beginners, and showed you that you were totally safe. I can't wait to try this again.", "date": "6/3/2017"}, {"review_id": "pmGpkJsPJ_BSKkWNtL3Uwg", "user_id": "o2Or6xqxeWaE46tdzK0UGg", "user_name": "Lisa W.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 12, "funny": 6, "cool": 11, "text": "I'm not a rock climber so I don't seek out to go to rock climbing places. So when my BF and friends wanted to wake up early one Saturday morning... I was not in the best mood for interest to rock climb... Having to drag my ass here I was surprised how clean and beautiful this MR was and how much I enjoyed it. The place is huge, lots of courses, beginners on the second story and intermediate to advance on the bottom floor with like 50ft walls. Since the ropes are not dummy proof you'll have to get tested for belay for non members every time you come. Day pass is about $25, but if you know a member they can bring you in when they go at no charge, pretty cool. I also love the fact that they have a mini gym, all the equipment you can find at a Crossfit gym w/o paying that ridiculous price. You can definitely do your own workouts.", "date": "11/18/2016"}, {"review_id": "HwuB4k5wP7sSKS2SDgXVqQ", "user_id": "su2zdjzk81ipVD7z68H94A", "user_name": "John W.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The employees here are actually interested in your climbing journey, they always seem excited to talk to you about anything. The location is itself is very clean, organized with plenty of space, brights and all around inviting. The bouldering grades seem more difficult than at other gyms, but I like that. I also like the general atmosphere.  They have full locker room amenities, a gym, and you get one free guest a month. What's not to like?", "date": "5/16/2018"}, {"review_id": "_vdu6NFGdtxZBYHMhUUXdw", "user_id": "xPVeaPptTK3z4gcWxCcPBw", "user_name": "All A.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 3, "useful": 3, "funny": 4, "cool": 1, "text": "I love this place as a gym and love the people but I'm getting really tired of this music situation. In 1 hour I heard 3 different genres of music, all heavy, and songs being switched mid song. It feels like the employees make the place their personal jukebox. I hear volume fluctuations, drastic changes in tempo and flow of music, and it's dominated by alternative rock/EDM often, which represents a single demographic. We pay a LOT of money to go here and it should be run like a business not a personal jam session. Other people have complained on their board about music and their response is music is \"subjective\". Really tho? So record companies are gambling when they support an artist and have NO idea if they will do well? They call it popular music for a reason. Tl;dr Please play normal music that's uptempo/happy/chill and consistent! It just needs to be background noise, not someone relishing in breaking up w/their S.O. or going on a molly trip. Just something chill and easy. PLEASE!", "date": "7/28/2018"}, {"review_id": "fGe28UAPgLWDgpLN-3DYEA", "user_id": "_NaeP7HJ9NBC42Svct5opw", "user_name": "Alex M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Great spot for rock climbing. My friend brought me here, and it was a lot of fun. When it comes to rock climbing I do like how they have levels for the routes, so you don't have any experience then you can start on the way courses. I was first intimidated about going up the Rico path, but once you beat your first level then you want to keep going. If you want to have a fun activity for your self or with a group I recommend checking this place out.", "date": "8/9/2018"}, {"review_id": "fJ2tpMLSshO_Cvvy0b8CDQ", "user_id": "IPFqLKJnv8FRQw7xuxbYzQ", "user_name": "Natalie F.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "I had so much fun here! I am NOT a climber and I haven't been before, so this was brand new to me. I missed the last belay class, so I bouldered and did the tall wall thing once with a certified belay-er. I didn't know what to expect AND am afraid of heights, but I still had lots of fun! I can see why people get into this. I tried my best and had lots of fun, and learned that it's way more fun to just enjoy it than need to be good (life motto, right?). My forearms are sore, my hands are sore and sort of torn up (chalk is a buddy), and I had a lot of fun! Great for small groups of people, great for all experience levels, and they bulk discounts are pretty good!All in all, this place is equipped, well run, well maintained, and a fun place to be!", "date": "5/30/2017"}, {"review_id": "ZYNC2fSoepZKefJxyqxLwQ", "user_id": "n3RJTeUyq6tHyO0REAKsLQ", "user_name": "Karyn T.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "I went to Mesa Rim with my fiance Bryan and couple of our friends. I hadn't rock climbed since I was in 6th grade and I had wanted to try again! I forgot to mention my crippling fear of heights.This center is amazing, so many great amenities for members and for people who wanted to try for the day. We were trying for the day which I believe is $20, plus another $7 for rental shoes, harness and chalk bag, they do have really cute gear you can purchase too! The center is beautifully organized, clean and just amazing, there's a couple of different areas to start your rock climbing journey. We started with climbing the walls without the need of the ropes/harnesses, there's different levels of difficulty on clearly placed on each place. For starters, I did V0 and 5.4 difficulties, which means it's moderately easy. Our instructor for the day was Trevin, he was great, if were unaware on how to traverse through the climb he'd give you some pointers and even provided some motivation. Our whole group felt really safe and secure because Trevin was so professional and really wanted us to succeed and overcome our fears. I fell and thankfully but that is due to the fact that I am a bit of a klutz, I missed a rock on the way down, I landed on the bouncy flooring which I love but at least I have a battle wound to prove me conquering my fears! My fiance Bryan and our friend Heidi did a really great job climbing all the way to the top on the 60 ft walls! I did attempt to climbs on the larger walls with the harnesses and felt completely safe and secure, Trevin gave pointers on how to get down and he kept insisting that if we needed any breaks to just take them because he would have our backs! I appreciated that and definitely put me at ease! I made it further than I thought, I looked down (bad idea) screamed blacked out, cried to get down and that was that! I still had a great time, it was probably the most exciting thing I've done all year! If you want to try something different when it comes to being active, I definitely suggest going to Mesa Rim! I've honestly had the best experience and I can't wait to come again!", "date": "4/3/2017"}, {"review_id": "WeWzpk0KP0qvgYvDJi0PCA", "user_id": "-cmwkaIsbJWPYLXglpWRhw", "user_name": "Amy O.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best climbing gym in San Diego! So proud to be a member here.  The yoga classes are great, staff are friendly and helpful, and there is such a fun atmosphere to hang out and solve problems with other climbers of every level. The youth team is amazing, with skilled and talented coaches.  Full gym, great supplemental climbing classes and many youth programs.", "date": "1/5/2019"}, {"review_id": "mRfhWNFmQyADMCwp9BY1cw", "user_id": "LPdXBha8G42MkbXJSWZZlw", "user_name": "Lori P.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 1, "funny": 1, "cool": 0, "text": "I've been climbing for years and was excited about going to Mesa rim for the first time. Turned out to be an expensive waste of time since I tied a different knot in the belay test and wasn't allowed to climb the top rope. Apparently, I could have taken a belay lesson for $10 but this was not explained to me. I didn't get refunded for my gear rental when I could only do bouldering. The staff member that checked me in was nice but one girl was quite rude when I asked about how the top rope worked here. Very unhappy with my visit, would like to give it another try but all experiences at other gyms that I have been to had clear rules and very helpful and friendly staff.  Also seems way too expensive when I could go to Vertical Hold or elsewhere and have a good experience. Really disappointing. Highly recommend going somewhere else if you're not a frequent climber.", "date": "11/18/2018"}, {"review_id": "aM2HIYRbuO_bJ4u5OiKrBw", "user_id": "T66khTnPItW0GVAKRYrYhg", "user_name": "KC G.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 9, "funny": 4, "cool": 1, "text": "I came here because I got a gift card from a friend for my birthday. I was really excited because I live down the street and I've heard great things about this gym but it didn't live up to my expectations. I walked in with a friend and told the guy at the front desk that it was our first time there and he told us to check in and sign their waiver. We did and when we went back to the desk he asked us what we planned on doing. We wanted to top rope climb and when he gave us the gear we realized we weren't familiar with their belay devices. He told us that he'd recommend coming back for a belay class to learn and to just boulder for the day. We were fine with that but he wasn't very helpful at all. Usually when I go to a new gym someone will give me a tour around and show me what the gym is all about but that wasn't the case here. So me and my friend were on our own but decided to leave right after we got there because we didn't feel comfortable or welcome at all. I wasted my money and ended up going to a different gym who comped all of our expenses when I told them what happened here. Sorry Mesa Rim, I've heard great things but your staff should be more accommodating to newcomers.", "date": "2/8/2018"}, {"review_id": "IVZ8251g_AEWPSBnxgrs7g", "user_id": "08pYzypfvSO7QtdGN3oHig", "user_name": "Allis N.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great gym! Smells like sweat and feet and that's the fun of it. This is the newer, bigger, and much better of the two! Has very many routes and challenges. There's a rock wall, boulder walls, gym, classes, and lounge area. So many great possibilities here!!! I really like the pingpong lounge area, very comfortable with books. It definitely does get crowded but never really had to wait! There are lessons that can be taken here, yoga classes too! For all ages (lessons for kids/kid classes), levels, and very friendly environment.The best in San Diego considering there are only a few. The monthly fees may seem alot but well worth it because it includes EVERYTHING!!! Get your back workout on!! Love it! Forsure a go to!", "date": "1/13/2017"}, {"review_id": "jg_JS1G-qnMz9q3YpMGKHg", "user_id": "EWpAXCw0IelwF1Jfjpbunw", "user_name": "Michael M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "My 9-year-old gave their week long camp 5 stars because it's fun and the instructor, Zack, was awesome. I took a star away because if you're not their clique or target demographic, the staff, with the exception of Zack, was, at best, indifferent. But it's a nice facility, and Zack was a fun, welcoming, encouraging, and patient teacher. If you aren't their target demographic, I recommending asking for Zack.", "date": "4/6/2018"}, {"review_id": "iEitOIfhvTh6y0pwpHmugg", "user_id": "TiyjvKKXV5Ga-_lsAUE9ag", "user_name": "Matt S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 1, "funny": 3, "cool": 0, "text": "there are some cool employees there that are truly awesome humans.... but as of the last 9 months or so they are hiring kids that act like know-it-all policemen, who walk around writing tickets to meet their quota. constructive criticism that makes the gym safer is always appreciated, but some kid with his coffee cup acting like the Lumberg in \"Office Space\" is pretty lame for a sport like climbing.", "date": "8/17/2018"}, {"review_id": "pZUlPsE5OvO4Lw4kLsnghA", "user_id": "qhryBW9fYxP5WOzFe830xg", "user_name": "James K.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to a few climbing gyms and I'm happy to call this one my home gym. Something about it feels cozy when compared to other ones. The routes here are the most fun for sure, especially in the bouldering area. The runs are all diverse in style whether it be overhung, slabby, crimpy, etc., so it allows you to improve in all areas. The place smells pretty dank but it's a gym, not a Nordstrom's so I don't care much. Besides, true climbers don't believe in deodorant... it ruins their earthiness The reason I'm giving 4 stars though is because the employees are hit or miss. Some are helpful, some are friendly, others seem bored and in their own bubble. I've had to get someone's attention just to check-in sometimes.", "date": "11/3/2017"}, {"review_id": "L5NLlZNE0z47toD2zeclJQ", "user_id": "h8pthOnqCxV94D8-JkZXCQ", "user_name": "Cecilia S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Noob here!  I promised the BF that I would go climbing with him for years now.  Since it was such a chilly Saturday afternoon, I wanted to get moving but also stay indoors.  Mesa Rim came to mind.  I drive by it everyday on my way to work on the 163, and every morning I tell myself, I have to check it out one of these days.  The BF would be happy.  So finally, we decided to check it out this past Saturday.  The facility is quite large and very clean.  The last time I went climbing was probably in 2013 or 2014, so it's been a while.  I got the Beginner Package which included the belay lesson, day pass and full access to the gym, and gear rental for $30.   My instructor was Moe, and she was fabulous.  She was patient, personable, and explained everything very clearly and concisely.  I was climbing and belaying in no time!  If it's your first time too, I would definitely recommend checking out this location.  The gear rentals looked pretty new and were quite clean as well.Like I mentioned earlier, the place is huge.  Even though there were a lot of people there on a Saturday afternoon, it didn't feel crowded.  I thought it might feel a little intimidating since there were a lot of really good climbers there, but it was actually really chill and encouraging.  I loved watching the little kids climb because they are so fast and carefree!I also really liked that their gym area is set up like a Crossfit-style gym.  But if that's not your thing, there are also bikes and treadmills upstairs too.  There didn't appear to be a lot of yoga classes on Saturday, and the ones that were available were all in the morning.  It would've been nice to hop in on a class too.  The bathroom/changing facilities were very clean and well-kept, and there's tons of space for parking too.  Win!Overall, we had a really pleasant experience and I definitely got a great workout in.  My arms, back, and shoulders are so sore!", "date": "12/19/2016"}, {"review_id": "2JWPmdBYvXE3Ru1j-pr8KA", "user_id": "URQvI3KplmSyMcfh0NHY7g", "user_name": "Julian W.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 2, "useful": 6, "funny": 4, "cool": 1, "text": "Great facility - clean, modern, and very large.  The bouldering routes were lots of fun.    I came here on a Friday night and brought a date.  We'd gone climbing before and she learned how to tie in and belay the last time; when we went to take the belay skills test and get our cards, she blanked on the first step in tying the knot.  I tried to remind her, but the staff was very persnickety and said I couldn't - they then told us she would have to take the class but we'd have to come back another day because they already taught the last class for that day.  I asked if I could just remind my date how to tie the knot and they told me she had already failed the test for that day and could not get a belay card.  I got my belay card with no problem and my date had a great time top-roping and I was able to boulder, but I wish the staff hadn't been so fussy and uptight!  I understand that they make money from teaching belay classes, but it's cheap and in bad taste to push the classes on someone who already knows how to climb, especially when they are in the company of an experienced climber.  I won't be returning to Mesa Rim simply because the staff was so rude.", "date": "5/15/2017"}, {"review_id": "8TOpyo1JX_ncLIVxhBa5zQ", "user_id": "5Xp6ByaJzyOLjUAAobfxdQ", "user_name": "Joe K.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great rock-climbing gym. This is a huge location, full of great amenities. Maybe that is why the monthly membership is pricey. However they have classes for children, and the safety is good. Even though it is crowed the weekend since is it a spacious location it is still really enjoyable. They also have a cool staff. This is a great spot for a fun family time.", "date": "4/19/2018"}, {"review_id": "TjJoHU1xgxIIw7ceQbnECg", "user_id": "NU1cGh7oHJVAMPj2dZ2Ibg", "user_name": "Lisa B.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "Pretty great place to climb in terms of routes and ropes. Floor is pretty messed up in some spots and makes belaying a bit shaky. I'm from out of town and have been climbing competitively my whole life and I have never received so much sass from someone proctoring a belaying Test. Sorry this isn't the SAT and I did not explain things your way. Quite ridiculous and I don't understand why teaching folks I'm climbing with a figure 8 follow through is a punishable offense by having to pay for a class right then. I'll stick to climbing outside thanks.", "date": "5/31/2018"}, {"review_id": "mv3eAaEr2RCvXItCWyhGYA", "user_id": "6pwVH0a1iKN3nxRDRrEvKg", "user_name": "Sany N.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I'm not an avid rock climber but I definitely do enjoy this activity. My friend who has an unlimited membership here brought me in as a guest. The space is quiet spacious with an assortment of areas. Immediately walking in there is an area for weight training and exercising. That includes free weights, a treadmill, some jumpropes and yoga mats. As you turn to your right, there are smaller shorter walls for practice, or if youre a noobie like me, just to get the hang of it. Towards the back there are higher foot walls and slopped walls for the intermediate-advance climbers. (I attempted numerous times and I fell every time). In the middle of the entire place there is the belay section. I didn't get to try that, but I plan to next time I can stop by!!The place was clean, well maintained and the staff was helping. Oh, and there was plenty of parking space. Their hours are great and they also have snacks and drinks if you get drunk or thirsty. The woman's bathroom was clean and spacious.I will definitely be coming back.Oh Tip: MAKE SURE TO CUT YOUR NAILS!!! Keep your nails short and plain, it is very hard to climb with nails that extend past the tips of your finger and with the powder and use of your fingers, I doubt you want to come in with a fresh painted set of nails.", "date": "6/30/2017"}, {"review_id": "yoC9WbbHghRHboSWxOy70g", "user_id": "2yta5JxHZn61CiA9aw7ryA", "user_name": "james a.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "This place is awesome.  Between the awesome setting and the super friendly front desk staff, who will humor my dumbass and change the radio station to Beyonce from EDM (Thanks Mo!), I couldn't ask for more.  But Jaque, Jack, Matt, Mateo, (and everyone who's name i don't know yet) totally make this gym so much more fun that just the rad facility.  Nice job hiring winners!", "date": "11/21/2017"}, {"review_id": "T2LGPy5x-XvdzPhIOgUl4w", "user_id": "AE8nHSRPFlB4nh7CP8PlGQ", "user_name": "Tiffany Y.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 5, "funny": 2, "cool": 5, "text": "I've been wanting to check this gym out since I saw them constructing this building on the freeway. I had a few hours to check it out, so I got there around 6pm, there wasnt an ample amount of parking so I can imagine that the parking is probably pretty tough at peak times. I wasn't able to check out any of the rope routes, but I spent a decent amount of time at their bouldering section. This gym is so new, fresh, and clean!! It is a huge upgrade from the original Mesa rim, the front desk guy was super friendly and nice as well. The routes here are not that beginner friendly. They will make you alot stronger of a climber prep you more for outdoors. I usually climb v4-v5 at my current gym but here I could barely climb v2-v3. The problem I had with the routes was that they had scary ish - large moves at the top out which I hate because I'm scared of injuring myself.  This is great way to train mentally though ! So I'm all for sandbagged routes. Beginners here will likely be stuck on vb- v0 because even some of the v1s are pretty difficult.  They also have a yoga room upstairs along with a few treadmills, stationary bikes, and ellipticals. They have great training for climbing with an entire trx setup, gymnastic hoops etc. This gym is a great addition to the mission valley area, and  it makes climbing more accessible for ppl whom don't want to drive all the way up to Mira Mesa.", "date": "2/19/2016"}, {"review_id": "ZK021Ba_VQyIf0bKckdEWA", "user_id": "UH0w0Ux78iQwbCZTy51kYw", "user_name": "Andrew V.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym I have been a part of thus far. They have an extremely knowledgable and kind staff and offer great classes on both climbing and yoga. Everyone who climbs there is super nice and friendly. The facility is well maintained and they are very intentional about taking feedback from members. They are also really good about setting new routes for people who climb on a regular basis. I climb about 4 times a week and the routes are always fresh.", "date": "8/17/2017"}, {"review_id": "SBGVYd_4TNOmV17i9virLw", "user_id": "nxhtHhSq-BRoGZJDSrDuHQ", "user_name": "Tommy D.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 2, "useful": 3, "funny": 2, "cool": 1, "text": "I came here for the climbing into/training class earlier this year and had a pretty good time, but never made it back. Fast forward several months to two weeks ago, and as I was contemplating joining a gym again, Mesa Rim came to mind because I had recalled seeing gym equipment there, as well as an offering of various classes, in addition to the rock climbing part.  This being the case, I decided to go check it out a little more in-depth before signing any contracts somewhere else.  As soon as I walked in the door, I was floored by a stench that no locker room has ever come close to, and this was three feet inside the door of a huge building with super high ceilings.  No, it wasn't the best impression, but I went with it anyway.  I approached the desk to find a guy that I cannot describe as anything but childish and unprofessional, who was quick to make it clear that he could not have cared any less about my potential interest in signing up.  After signing the waiver (apparently the previous one had expired), he told me I was then free to roam around and check it out, which I did for a few minutes until I was basically just turned off by the entire situation (the previous 5 minutes) and decided to leave.  Even as I was heading back by the desk to leave, he glanced up and then looked away without so much as asking if I had any questions about the facility, joining, etc.  Overall, it was very disappointing, especially since I had enjoyed my first visit there; that guy made my decision to sign up elsewhere an easy one, so, thanks..?", "date": "10/17/2017"}, {"review_id": "tE5xll-1rmiTUEekyfKTDw", "user_id": "pRLG3TptY-jZdfhafMDmqg", "user_name": "Nadia H.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun place! This was my first time rock climbing so it was definitely an experience! It was $24 for a day pass and to rent shoes. We stuck to the bouldering sections which were more than enough for us! They have a good variety of walls to try from so as a complete beginner that was great for me. Would definitely recommend checking this place out!", "date": "7/8/2017"}, {"review_id": "MB48gaqLt__JWw5MoSQDmQ", "user_id": "GUsxSk3AVpGKbC-hg13--w", "user_name": "Joanie T.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "I came here for the first time on Saturday. It was a spontaneous  random idea.We all have rock climbed before but just haven't been at this location. We got there and signed up and filled out the waiver. As soon as we came up to the register, the guy had told us we couldn't get  on ropes unless you know how to tie knots and basically all the rock climbing knowledge. It's not a place for beginners that's for sure. They also have lessons that they give out for those that don't have the knowledge. Which is at an extra cost. I went to the solid rock gym and they actually help you there before starting. But then again, it is a smaller gym. We didn't have much time to wait for a lesson then learn and then get on ropes. So we did bouldering instead. It was just as fun. You basically just climb the walls like little kids without ropes. we spent an hour bouldering and it was a good workout. My forearm was super sore the next day. I will definitely make my way back. It was also pretty hard climbing especially when you have nails hahahaP.S- The place kind smells like stinky feet O_o", "date": "2/16/2017"}, {"review_id": "dvt2OjhQC0OVfpJw939tkQ", "user_id": "2YZdiQd-6YHMsL3k9KpOVg", "user_name": "Celeste B.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 3, "useful": 6, "funny": 0, "cool": 0, "text": "I was very excited to try out the new Mesa Rim Climbing Gym in Mission Valley given that the experience I had at Mira Mesa was amazing. Top rope routes are awesome; Id say good variety of routes such as slab,overhang, varying heights, hand crack routes (which I haven't tried). I have not yet tried the lead routes but they look awesome too! Boulder problems had a wide range of difficulty. Problems were graded three levels wide; i.e. V1-V3, V5-V7, B1-V0.It had an interesting vibe depending on the staff that day. The one particular day, one of the guys was trying to get cleared for a belay test. He had previous belaying experience from other climbing gyms, but it was not exactly clear on all the fundamentals or belay requirements for this gym. The instructor was a little pretentious in pointing out the importance of rock climbing safety so the whole experience wasn't the best. I have seen other gyms handle this situation more tactfully instead of making the customer feel let down. If there was a mistake or missing fundamental, I would suggest teaching the person what is missing and not passing judgements.Rock climbing is a dangerous sport and may need to be explained in a more tactful less aggressive way in order to encourage new climbers to keep climbing. Great job in pointing out that safety is key! The staff may need to do this for kids running around the bouldering area.I was a little surprised about having to provide my own climbing rope to lead climb in the gym. I am not sure what other gym does this. I came out of town and will not want to bring my own rope just to climb in an indoor rock climbing gym.Overall, it was a great experience as long as you have an idea of what you are doing. Otherwise, caution! Ask before doing anything in this gym. :)", "date": "12/23/2015"}, {"review_id": "Bvr19cruSwuO2ao8RjrWLQ", "user_id": "45sJVfybluENyorEIqRkKQ", "user_name": "Venus V.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym! Lots of street parking and accessible from the 8 freeway. Upstairs and downstairs. It has all the Amenities a person needs to stay fit and balanced. There's yoga classes, workout gym, top rope and Bouldering. Spacious restrooms and lockers. There are also cubbies for your things while climbing. Foam crash floors you can trust to fall on. Membership is  $80 or $81 per month. If you get friends to join they will waive the fee (4-6 people; not sure, Just ask). I usually get a week pass for $35; but worth it to get a membership if you're going more than 3 x's per week.", "date": "6/26/2017"}, {"review_id": "rO78zRSDS9S5N6ZvoLdEKw", "user_id": "wJQ8J7eiZX7XSv7iJRBvXw", "user_name": "Chay M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Absolutely love coming here. Every single staff member is friendly and helpful, but Mateo in particular is one of the most awesome employees of any company that I have ever met. The staff is awesome, the company is awesome, and the climbing is awesome. Just wanted to say thanks to such an awesome company for everything that you do!", "date": "4/15/2017"}, {"review_id": "lSs2Xu11vtX0p0s4w9jEWA", "user_id": "2EoX_H5Xrfpsz1lWVTImVA", "user_name": "Jessica G.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 2, "useful": 10, "funny": 5, "cool": 1, "text": "There is no question this climbing gym has beautiful facilities, but their customer service and greeting staff needs major work. After arriving at the gym and filling out a waiver, we approached the front desk and there were two female staff members there holding pretty lengthy conversations with other members (I'm assuming). We pretty much just stood there until one of them finished their story and greeted us, \"Hey!\"  \"Hey, this is our first time here.\"\"You will need to fill out a waiver.\"\"Ok we did fill them out.\"\"Ok...\"After that moment, a male climber approached her to buy shoes, and which any other establishment would have probably let an incoming customer know, \"I'll be right with you, just let me get them set up.\" Instead, we were treated to one of the most awkward customer service experiences, ignored and favored to the gentleman purchasing $151 La Sportiva shoes who ALSO lived in Portland...around the same area as her...y'know back when it was a good area to live when her family bought the house in '94 and not a bad one like it is today because, \"They gentrified the surrounding areas and you know what happens to your neighborhood when that happens.\" Literally standing in front of you are two customers you were just helping but are now being given Gentrification 101 and made to listen to your self-absorbed, narrow-minded comments about how the plight of low-income community members ravaged your neighborhood. Probably a conversation best to have over coffee or a city council meeting. After about 5 minutes of that, the other female staff member turned her attention towards us.\"Hey guys!\"\"Hi it's our first time here\"\"You need to fill out a waiver...\"Before she could turn her attention back to the guy she was talking to we replied, \"WE DID.\"She asked if we needed gear (we didn't) and began to get us set up in the system. Gentrification Girl finished her conversation with La Sportiva Guy and said to her, \"Oh are you helping them?\" -.-I asked about getting belay certified, but thought twice about it given my first consultation with the greeting staff. We weren't offered a tour of the facility but that's something that is standard at my climbing gym. 5-star facility1-star for the pretentious, they're-just-not-interested-in-you greeting staff.", "date": "7/8/2016"}, {"review_id": "8IwVyLr26_9TsVedPqU58Q", "user_id": "Bsl3Ih8AppYQqddlpYV4qg", "user_name": "Aimee V.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I am absolutely IN LOVE with this place, and with rock climbing. From the moment I first grabbed onto the wall, I was in heaven. No matter what time of day I come here, even at the peak hours (5-730ish during the week and nearly all day on weekends), the atmosphere is laid back but motivating, fun, and the eye candy helps, too. There's a decent feeling of community here with fellow climbers. Even if you come here alone (which occasionally I do), you'll always find someone to belay for you and sometimes you make a new friend (or a date for Friday night...I swear, though, this is not a meat market type of place). The facility also has a full weight training area, including gymnastic rings, ellipticals and treadmills upstairs and BONUS, a ping pong table. Sometimes gyms can be intimidating--not Mesa Rim! Most of the staff are accessible, friendly, and knowledgeable when I've had to purchase equipment (by the way, members can buy gear at a discounted rate). Parking can be an issue here sometimes, but you can usually find a spot eventually. Go climb!", "date": "1/29/2018"}, {"review_id": "MCKewX8VLY3FyJIQAbs44Q", "user_id": "c89Oxkl5Mju6FuMz9VVauw", "user_name": "Cat M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Huge climbing gym, awesome vibe, excellent honest employees. Great tall routes with good settings, shout out to Alex, Jacob, Luis, Jonathon, Moe, Connell.", "date": "10/20/2016"}, {"review_id": "5wiCtZHkZh27A-PSG5AQIA", "user_id": "FLU6cA0j7hAQbN394gbq9Q", "user_name": "Alfie S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is freaking awesome! Fern was amazing!! Very knowledgeable and a very good teacher! The staff was great! They treated my daughter very well", "date": "8/16/2017"}, {"review_id": "PW_ZvMeCKtJcHM47JH__7g", "user_id": "IckO8qHB_lIlyf3Tm9T2mw", "user_name": "Elizabeth B.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 9, "funny": 4, "cool": 1, "text": "I want to climb here, I really really do. But they make it so hard to enjoy. I've had a membership for about a year and climb with my kids a couple weekends a month. I finally am giving up. Many of the staff are extremely pretentious. I LOVE the idea of the kids area upstairs with a bouldering wall and tables. It's one of the main reasons I chose this gym. It's so nice to be able to have my kids color or play so I can get a few climbs in. However, today took the cake on rudeness. One of the employee's daughter came up to play too. She pulled out a box of pool noodles and kind of threw them all over the room. I figured since her mom worked there she was allowed to play with them. But my kids were not playing with them. Shortly later a woman came upstairs and announced \"whose kids are in there?!\" I said \"mine\". She says \"we need to compromise here\". Me: Um, okay? Her: That's our event center, we have events every Saturday in there, it's reserved.Me: Oh, okay I come here pretty often and I've never been asked to leave? (They usually just say the kids can't boulder while they have a class so my kids sit at the table and color) Her: You come here a lot? I've never seen you. I'm the only one working here that has kids but anyone else would ask you to leave. I'm just telling you, we need to come to a compromise here. Me: Okay. She never explained to me what this \"compromise\" was that she was looking for. But as it turns out, she was the mother of the little girl who was up there playing with the pool noodles. I can only imagine that her \"compromise\" was that she wanted to pool noodles cleaned up so they could have their class. The noodles that HER daughter pulled out. Then she disappeared for like 20 min. Once again leaving her daughter in the room, I guess she didn't have to leave for the \"event\"? But I went in and had my kids clean up (despite that they didn't get them out and weren't playing with them) and we left. I will not be returning. I will happily take my business to Vertical Hold. All this woman needed to say was hi, I just wanted to let you know we have an event starting here in about 20 min so we'll need to move your kiddos over a little while we hold the class and then they're welcome to boulder again after our class is over. I would have been like cool, no problem at all. Instead she was aggressive and rude, implied I was somehow not important because she'd \"never seen me before\" and then said she should be asking me to leave. No problem lady, you made it real easy for me. I will leave and not come back. I hope you guys get your employees some customer service training.", "date": "11/4/2017"}, {"review_id": "GwWS_eMn2yg9K9kz4V7tfQ", "user_id": "xnVSeUjD-W24s7mC3Oqwag", "user_name": "Matt P.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really awesome experience and to the team of trainers who helped us get started, I just wanted to say a big thanks to all of you for the outstanding job!", "date": "9/7/2017"}, {"review_id": "IRWJQILLum2i-7ufs7SaMQ", "user_id": "DB4Zk1af6NuuMSFtAuzkuA", "user_name": "Emily B.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I've been a member here since November 2015 and realized I've never written a review for Mesa Rim!When I started out at MR, I was a novice climber - had a little experience here and there with some climbing walls and a couple of days at a climbing gym in northern CA, but otherwise completely brand new to climbing. I went with a new friend and we got to start our top rope belay certification within 30 minutes of arriving (the class times are online, so you don't have to arrive so early like we did). The guy who taught us helped a lot, especially for me because it was my first time belaying ever, and we were ready to go climb some walls!My friend and I were instantly hooked. We signed up for memberships within the week, and we've been members ever since! Yes, it's a little pricey, but it pays for itself if you go more than 4x a month - which has been well worth it since we go about 3x a week. Plus, with membership you get challenging routes of all levels that are rotated regularly (less greasy routes! it never gets boring!), discounts on gear and classes, free yoga classes (which unfortunately I don't utilize enough because my work schedule is abnormal), a gym area centered around increasing your climbing strength, staff that are super stoked on climbing, and well-maintained facilities. Plus there's a nice little area upstairs where you can work or study if needed.I'm now at around an intermediate level in climbing, and in the 9 months I've climbed here, I've fallen in love with a new sport, increased my climbing skills and strength, have tagged along with friends on outdoor climbs, and now my friend and I are working towards getting lead certified and assembling a rack for our own outdoor climbing adventures! Definitely wouldn't be where I am today without Mesa Rim! :)", "date": "8/24/2016"}, {"review_id": "u9gCK9tzS-vrHYT39FSHrg", "user_id": "JE2TS2nTlYwjbNj9hVrwNw", "user_name": "Robert B.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been a member for about 4 months now and I couldn't be more satisfied with my membership.   The staff here has helped me every step of the way during my climbing journey. They helped me find the right climbing show that best fits my foot and style, and they didn't focus on their store selection!    The price at first was a little steep, but if you use Mesa Rims full potential, you will realize they are a yoga, weight, and climbing gym all in one.    Plenty of routes for all skill levels (both bouldering and top rope) and a friendly atmosphere.", "date": "9/19/2016"}, {"review_id": "caNtq_ZhjLzzMMF4JNVCSg", "user_id": "0SVK1v4pnI7lPC7CYyIh9w", "user_name": "Madeline H.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym in San Diego hands down!Here's Why: It's huge!CleanTons of top rope and lead routesWalls are 60 ftGood amount of boulderingLots of exercise equipment Friendly staff The gym really seems to care about teaching and preparing people for outdoor climbing i.e. You and your belay partner tie in to the rope instead of most climbing gyms where you just hook into a belay device.They have climbing classesNICE RENTAL GEAR which is a huge step up from most gymsAnd multiple locations", "date": "12/15/2016"}, {"review_id": "X5G1nCMkhntTlS4pm4nHeQ", "user_id": "HWlPTVfeIeoncLtbnomjgg", "user_name": "Ryan W.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I started rock climbing 6 months ago. The employees here are very relaxed, but also very knowledgeable and helpful. Crowded at prime time and memberships are pricey!", "date": "9/20/2017"}, {"review_id": "q3S9KxVzFAmjbBsb2ajqyQ", "user_id": "8UyAzEZ-Y-L_KizJYCDC-w", "user_name": "R E.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "the best gym i've been to in san diego. definitely love how high the walls are. the staff is extremely nice and super laid back.  i did ask about group packages and about volunteering for the collegiate competitions and unfortunately the front desk told me to \"email them on info@mesarimblahblah\"... i was a little disappointed in that and ended up missing out on volunteering. but someone (i think it was chris) told me about it when i visited the one out in mira mesa, which was after the competition (sad face). other than that, i love this place. super clean and lots of walls to climb and weights to lift. super hard to leave this place at the end of the day when you're having too much fun.", "date": "8/10/2017"}, {"review_id": "1pCSX8MyQxICBmtHonz7Zg", "user_id": "R2ZkNLLzZ1qj0kUryyO3Qg", "user_name": "BK E.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love to come here. Brought my 5yo son today and signed him he for the kids class. He loved it and can't wait to go back.", "date": "9/3/2017"}, {"review_id": "vfOxRrYMaUz3fGFqkqXggw", "user_id": "oK642fgQocR7oBWg8ot7Rg", "user_name": "Will C.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great first time climbing at this location! Staff was very helpful and friendly. Thanks Jackie and Joy!", "date": "8/15/2017"}, {"review_id": "U2xbNZSV7hK6aKuD4BJTfA", "user_id": "WGuhb1GYI_13pX_e92A7zg", "user_name": "Jeniffer L.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Pros:- It's new (all new gyms are nice).- The staff members are friendly.- I prefer the bouldering section here over the other location (better layout and I'm pretty sure it's bigger).- Lately, the team of setters have been doing a fantastic job of putting up fun & challenging routes at all levels.- The yoga studio is tiny, but it's nice. - The lounge area is sweet.Cons:- It gets pretty packed during prime time, which means it's crowded and hard to find parking between 5-8pm on weekdays. - There aren't as many roped routes available as the other location.- The gym area is better at the other location. Mission Valley seems like it has less equipment than Mira Mesa.- I had some trouble getting a private lesson. In my personal experience, they didn't handle email request properly until I spoke with a manager.", "date": "3/27/2016"}, {"review_id": "8jT0VQ434zLwJWkfFajGfw", "user_id": "9CIPSVcHKEke_v90SZKxVg", "user_name": "Emilie L.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I sooo so love mesa rim! I go to Mira Mesa and Mission Valley and have been a member for about six months. The staff is fantastic the walls are the best in San Diego in the Mission Valley location in my opinion. I freaking love that I can charge anything from classes food and geared to my account and it's just charged to my card when my monthly dues are. If you're interested in climbing you found SDs best spot!", "date": "6/17/2017"}, {"review_id": "rOChS0uVwLbKfjkKRzP8Ow", "user_id": "7XHfdT31PHBTsugFjvRgDA", "user_name": "Mandy C.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 2, "useful": 8, "funny": 4, "cool": 1, "text": "Don't believe the hype... I heard about this place and the built up hype for this new gym in Mission valley. As soon as I walked in the vibe felt very pretentious/ snobby and the girl at the counter wasn't exactly welcoming. The bouldering was ok, the routes were pretty cool but it was just a simple flat wall or over hangs... Not exactly what I'm used to. It was kind of a bummer since in order to top rope you have to be \"belay certified\"... Which costs $8 plus the girl who was supposed to be showing up how to belay was rushing through and kept reminding us they were closing.Over all I felt like this place was over priced for an ok experience. Probably won't go back again.. I'd rather stick to the gym I usually go to- less expensive and better over all atmosphere.", "date": "12/26/2015"}, {"review_id": "gzrM2TWgEdMoAyW-37BDDQ", "user_id": "IlSzNIEBDoAGsxuu1l85_g", "user_name": "Lexie E.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Awesome first experience rock climbing!! I went with experienced friends who I'm sure made my trip so fun. But great climbing walls over all, and even though it was packed with people you still had plentlyl of walls to choose from and everyone was polite and considerate. I definitely found my new hobby!", "date": "5/20/2016"}, {"review_id": "64rWKci3_Y8Z8QL6wDPRtQ", "user_id": "evtY1DGsPzQD3TlrD-56sw", "user_name": "Adriene S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I had my daughters birthday party here yesterday and it could not have been better! From the actual party planning with Caitlin to the day of the party was just flawless. Shout out to Alex and Chris the 2 guys that taught the kids how to climb and went over safety procedures. Everyone was fantastic my daughter said it was her best party yet! The facility is super clean and spacious, everyone there is so nice and helpful! I would recommend this place everyone!! Thank you Mesa rim for giving us a great day!!!!", "date": "5/1/2017"}, {"review_id": "hQBNiUgSQMFEwyYXDJsiDw", "user_id": "0NZLdG_w3OWW0QsbnuHUqQ", "user_name": "Dan E.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had an absolutely awesome time here. The instructors did a great job of teaching everyone in our corporate event how to climb and belay and be safe doing it. Once complete, you're basically set free to climb walls that range from easy to a serious challenge for probably even the most experienced rock climbers (granted I am an amateur but saw plenty of regulars). I loved the speed wall competition they had us do as well. In addition, there is a small section of weights for those looking to body build here as well. I would definitely consider becoming  a member of I lived closer.", "date": "7/30/2016"}, {"review_id": "LC6qeScWPP27oWnVKrAMwg", "user_id": "1Rt6A3fZTyvM_mpxkG6Tdw", "user_name": "Kaison T.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is great. High High-ceiling friendly staff incredible members. Great location with lots of free parking and locker rooms couldn't ask for more. Also I'm not sure why but every single time there's a couple during acroyoga a CrossFit dude grunting in the gym and very miserable looking people burning away small numbers of calories on the stationary bikes.", "date": "5/10/2017"}, {"review_id": "EDht_IJDsGcN12yq9_d0Ig", "user_id": "iGUXNbvNwSxUYH_2TKK-4Q", "user_name": "Nick J.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is by far the best rock climbing gym in San Diego. I've tried the others and they just don't compare! I walked in and fell in love with the layout immediately, they have everything belaying, bouldering, yoga and even a full gym complete with 2 squat racks, rings and cardio equipment. I was a little hesitant to sign up on my first visit but Sierra and Ana convinced me with a combination of their amazing customer service and beautiful smiles. They tested me out of belay and off I was climbing! I will definitely be bringing my friends here as often as possible, and with my free friend once a month pass it wont take much convincing.", "date": "9/22/2016"}, {"review_id": "hQa8gAJ306Fp45i_Cme9Fw", "user_id": "R4U_14N1YsI8pukSRzhQ_A", "user_name": "Amanda M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "My brother has been going to their original location for years and now this location. I tagged along recently for a yoga class while he climbed. I'm not a climber (disclaimer) but wow was I impressed with the facilities! I go to Equinox, Soul Cycle, and Bar Method which are all kind of considered \"top of the line\" probably but I had no idea what to expect at Mesa Rim. The place is brand new so yes it's all shiny right now but they really did a great job with the buildout. Everything felt clean, nice, and open. The staff was very friendly as well.I only practice Iyengar yoga typically but found a class close enough that I was happy just to go. Again, I was so impressed! They have nice Manduka mats, cleaning stuff and cloths, and the instructor was great. I will tag along with my brother to a yoga class here next time I'm in town!", "date": "12/29/2015"}, {"review_id": "auCHAe2ruCdU3u2q5MxR2Q", "user_id": "SKYrPp7npNzaeeMYz_Bf5w", "user_name": "Derek C.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Totally cool setup for climbing. Clean. Neat. Gym amenities as well as lounges for even reading or doing work. My first time going there this afternoon with a friend and the routes on the free climb wall was definitely challenging specially since I had not done climbing in 10+ years like that. Had a blast. Def considering a membership.  The price to climb/visit can get expensive and is pushed towards making you sign up for sure. Will be going there 2-3 times a month minimum. Fun hobby!", "date": "6/22/2016"}, {"review_id": "6IsXVwdh43_Gp7QVDbsLGg", "user_id": "KtHRUDbe_R89NGjbw1jROg", "user_name": "Priya P.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 3, "useful": 5, "funny": 0, "cool": 0, "text": "This location is awesome. I'm a beginner climber but the sheer size compared to the other location is great, I believe the walls are higher and at 2 stories, they even have some climbs on the second story. They have additional bouldering walls and lots of kids areas plus a random ping pong table upstairs. Overall great facility but hate the location. It's at the terrible intersection in Mission Valley near Auto circle and the entrance to the 8. I'd be wary of being in the area after work in the rush hour traffic. Granted I was at the grand opening but the parking lot was also hell. The spots are tiny, even for my tiny corolla, and if you're going to build something of this size here I think they should've taken that into account. Nearby Thai restaurant and TGI Fridays for after climb munchies.", "date": "11/14/2015"}, {"review_id": "-HG3jDJNy2YLheKgKFWWZQ", "user_id": "SVO9_EI0S8sk32LYXGBH8w", "user_name": "Joan G.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughters on the climbing team hereAnd she loves it! It's a great place to workout and climb. It's also a great place for your whole family or just you and a friend. The prices are reasonable and so are the routes.", "date": "8/3/2016"}, {"review_id": "G5OpbONjyD_ojl9psUw5QQ", "user_id": "5gBYZQl96MpCDDQy_gx0lw", "user_name": "Alex S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I'm a new climber so I've only been to one other climbing gym before. First I have to say that this gym is very impressive. It's brand new, kept very clean, and the staff are very informative and friendly. I have been bouldering a couple times here. I had a blast and really feel that I am getting better, little by little. I top roped today so I took the class necessary. Our teacher was very professional and even though I was having some trouble understanding the knots, he was patient with me. After coming here a couple times, I was impressed and signed up for a membership. Yes, it is a little on the pricey side, however, unlimited climbing, yoga, and fitness center use makes it worth it to me. I am excited to try the yoga classes and use the fitness center when I need to. Overall, I am satisfied with my purchase. I would recommend it to anyone who is interested.", "date": "1/23/2016"}, {"review_id": "gmzcYyG-xRCNhPrB4n5X6Q", "user_id": "4bRncLamEGJ_i5fIyuuK2Q", "user_name": "Andee M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 2, "funny": 6, "cool": 1, "text": "Quite disappointed with this place. We we're excited to try this place as this is new and the biggest one in SD but I guess our expectations may have been too high for this place. I'm always fair at giving reviews and look at both the good and bad side of things so let's go for the good one. This place is the biggest among all the other indoor rock climbing in SD. The walls are also higher than the others. The interior design is pretty neat and spacious and there were a couple of iPads to do waivers and signing, which, eliminates wait time... So now, let's talk about why I'm giving this place a 1 star. Right when u walk into the building, it smells like FEET. And I have A very good tolerance with smell but idk if the people inside were just immune to the smell but holy cow, it's like  the building has smelly feet air freshener. So, we go and sign the waivers and had to go thru 2 different iPads because the first two aren't working right, the touchscreen may need to be cleaned or perhaps they need to restart these devices so, yes, they may have plenty of iPads but not all are working as expected. Then, we were told by front desk that we need to take a test to ensure that we know what were doing, otherwise, wait for the next lesson (u must pay for this lesson) which is about an hour later -- that means we'd have to wait for an hour before we can even start climbing . And the funniest part for me was when she said \" u have to rent our shoes for sanitary reasons\" though, I wanted to be blunt and tell her that before she speaks about sanitation, haven't they smelled the place?\" For these reasons, we refuse to rent shoes from a place that's smelled like feet. I didn't want to be rude to the front desk as I understand they were only doing their job so we left and went back to vertical horizon. We've been going to vertical horizon and for all the times we've been there, it has never smelled like feet or even had any stench. For some people who don't care about cleanliness, I'd say try this place. But I would highly recommend VERTICAL HORIZON over this place.", "date": "8/7/2017"}, {"review_id": "2nED9bgAyNDBAxTCU2nWvg", "user_id": "QJUSpTWBvjnak7KERsnqaw", "user_name": "Robert C.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "I've been waiting for this location to open for a really long time so that I don't have to make the trek up to Mira Mesa.This location seems to have a more varied difficulty in the bouldering section, which is good for a beginner like myself. The rope area seems to be evenly split between top rope and lead climbing so I imagine it would be great if you are a lead climber. The Mira Mesa location only had a small section dedicated to lead climbing. The staff is great and very helpful. Andy in particular is always walking around the bouldering section and helping people come up with alternatives for difficult moves. Overall I've been very happy with the way this gym has turned out although my hands are a little cut up because all of the holds are brand new. Time to develop thicker calluses!", "date": "11/8/2015"}, {"review_id": "RRI9xvKqTDXusJs4MegwMQ", "user_id": "o0Ibbk9bBY-M6mswdqAdmg", "user_name": "Teresa M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "clean, friendly, great climbs! A bit out of my price range, as i am only a casual climber, but for a serious climber this place is legit!", "date": "2/13/2016"}, {"review_id": "XOEcr25C3mq9EIK7TyQ0eg", "user_id": "Gbf7vVRZ6_FFltnExifqdA", "user_name": "Melissa O.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I recently moved back to the PNW and surely don't think there is a climbing gym here better than Mesa Rim. It's incredibly clean, the community is so kind and helpful, I love the machines upstairs and the chairs to study or hang out. It's very spacious. This gym was definitely my stress reliever, and helped me grow significantly within my goals in climbing.", "date": "3/16/2017"}, {"review_id": "UYkf0cjOGtaxPKi3aQuRpg", "user_id": "ZD83Rheh47vp3EIunFtLFQ", "user_name": "Airam O.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is amazing! My husband surprised  my daughter (5yo) and I and brought us here last week and I was so nervous at first because I haven't climbed in years! Worry not!!! Everyone including the customers there are so helpful and knowledgable and friendly they walk you through it all! The shoes powder bag and gear are included in your day pass and you can take lessons. My daughter had so much fun she was very sad that we had to leave. We will be coming back very soon :)", "date": "1/20/2016"}, {"review_id": "Esiuv-x6E73Sdo9xv83ZFA", "user_id": "UaNKa3eWkNtQetYPZe340A", "user_name": "Serra M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Such a beautiful place so big and clean! Everyone is nice and very knowledgable!! The membership is a great deal too. I highly recommend this place no matter what level you're on.", "date": "12/11/2016"}, {"review_id": "Ath3KBXzbWzaKQauvck13g", "user_id": "1tRNDH-CaAsBKqbJrG_dww", "user_name": "Michael D.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "This is an awesome facility but sometimes the customer service is just atrocious.The walls are tall and sections get new routes weekly. The facilities are clean and there is a very friendly atmosphere. There have been several occasions where I stood at the front desk for minutes at a time right in front of someone while they ignored me and chatted with their friend. Definitely not topics important enough that they can't stop for 5 seconds to check me into yoga.", "date": "9/17/2016"}, {"review_id": "XO6dHtpGlUX3AHxwWBwZWw", "user_id": "MzEfg1gWzdpAOcioqza_rQ", "user_name": "Melinda C.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Overall, I really enjoyed my experience at the gym.Climbing quality: the climbs are good and I love the chimney section in the back. I came around 2:00 so not really peak hour, and the gym wasn't crowded, but still had a decent amount of people. The routes are interesting enough. I haven't gone enough to experience this, but my partner mentioned that they should change the routes more frequently. Since everything was new to me, I felt like I was in a giant playground!Space: the facility is absolutely beautiful! I like how there's an upstairs area where you can sit and relax if you bring a book. The training area also seems pretty good.Location: The location is nice, because it's downtown and I feel like a lot of people can stop by here on their way out of work. However, traffic can be pretty rough, so avoid going during rush hour.", "date": "12/26/2015"}, {"review_id": "tgtWxPdZzj5xeraSOTK_Iw", "user_id": "wOI8whvozg-nQkMtSseR9A", "user_name": "Beth R.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Mesa Rim is one of the most well organized, safe, and large gyms I have found in San Diego. They switch out their routes often enough so you can get a nice variety of skills to work on and levels (ex. 5.11, 5.6, 5.13). They have a nice gym facility including treadmills, cycle and rowing machines, free weights and much more. The staff their are super helpful and sweet! There is a nice balance with their combintaion of bouldering, top rope, lead climbing and yoga. Great for beginers (classes, belay lessons, and easier routes upstairs).  YAY CLIMBING!!!", "date": "2/19/2017"}, {"review_id": "1gvyWQrBEIVIM2gIDM0LjQ", "user_id": "LV65ZA-Uz6uarhSY5WGB_g", "user_name": "Garrett S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 10, "funny": 2, "cool": 2, "text": "This gym is NOT for new comers or people who want to climb. From the get-go, they didn't know what to give us. We explained, \"we don't have any gear except shoes and need to get on the wall with everything necessary.\" They handed my climbing partner and I a harness and that was it. Once we realized that we needed an APC and everything else we needed, they started treating us with a tremendous amount of disrespect and wanted nothing more to do with us. Kemper, who was the person who we asked to give us a refresher on how to tie our figure 8s started becoming very PRETENTIOUS and rushing through the demonstration. Once done, he asked why I hadn't been paying attention. Well, I needed to be completely focused on the rope and his demonstration and didn't look him in the eye, which he took as disrespectful.... Once we got to the wall, he had completely flustered us with backwards information and technique and my partner had tied the wrong loop and I had forgot to check due to the scrutinizing I had to perform on my own gear. The reason we were so flustered is, we could feel Kemper staring at us the entire time. Once my partner finished his climb, he we started the belay process. My partner was holding onto the rope because he could feel something wasn't quite right. At about the halfway point down, Kemper came over and started instructing my partner to let go of the rope... Once my partner touched down, Kemper proceeded  with, \"So the reason I had you hold on to the rope like that is because you has tied your figure 8 through the wrong loop. My partner knew this, he was holding on to the rope for that exact reason... Kemper at this point had given us such conflicting information on how to climb at their gym that he stated that we should just go and they would give us our money back. The part that really topped off this absolute waste of time of an experience was, he said \"Well, Solid Rock is still open and around the corner, you should just go there or back to Grotto....\" The bottom line here was, they said we could have a free day pass but that would only cover the day we would have to come back and take the class they offered for $40.... This class was book work only and consisted of a paper test..... We have been to Vertical Hold, Solid Rock and Grotto and every one of these gyms has demonstrated how to properly get people on the wall and do it safely. They don't make you feel stupid or like you are getting in the way. There were 5 people at the front desk eating granola bars and talking about the girls they were checking out in Mesa Rim that evening. Kemper could have been a SOLID representative for Mesa Rim by getting us on the wall and learning their ways but this is precisely the problem. It's THEIR way or the highway and their way isn't safe, knowledgeable or beneficial. It's inconsistent and, if anything clouds the climber from being an actual safe climber because they are trying to follow their proclaimed procedure over following common sense safety precautions and practices..... I wouldn't go back even if they paid me to go back and the funny thing was, Kemper ONLY offered a free day pass the next time so we would have to SCHEDULE an APPOINTMENT and PAY for a CLASS.... These people only want their little crew of people, that is it.", "date": "1/18/2016"}, {"review_id": "znHxqV56KlN4tdianwHjsg", "user_id": "qiJMkkUD6hNIlL-z3Wx1sg", "user_name": "Martin C.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff are welcoming, helpful and courteous. The routes are fun, challenging, and always changing. We've brought family and friends just for the day and they've always had great fun. Coming here is the highlight of my day.", "date": "12/11/2016"}, {"review_id": "76qvPEP4EHvWSk6Rr48PtA", "user_id": "gxnlN0mFvRKmgIThn814TQ", "user_name": "SpottedLove S.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 1, "useful": 6, "funny": 0, "cool": 1, "text": "DANGEROUS:   not safe.   4 and 5 year old kids running un-checked. My wife was leading a climb an a small girl ran right underneath her when she was preparing to clip the 3rd clip. Had she fallen the kid probably would have been hit, injured or worse. After telling the staff they did absolutely nothing. The remaining of the time spent there the parents climbed and the little girl was not around them and running amuck.  After talking with the staff they refused to speak with the customers about safety violations.", "date": "1/25/2016"}, {"review_id": "uzbvHZFjK7wJjYauArG4Nw", "user_id": "tasRGflBcEtm2_EUDDsKVw", "user_name": "Jeff N.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love coming here and getting a workout in. For the most part everyone is super cool and friendly, with the exception of Mateo and Casey... Those two guys are the absolute best!  They make the whole experience of learning to climb and entering a new \"gym\" fun and welcoming. You can always count in one if those guys to be there and to greet you with a smile and some encouragement.", "date": "9/8/2016"}, {"review_id": "ZiOn7uBhuakSEpSfIUEJ8A", "user_id": "L62aM7nw4_kDyjcctO8fHw", "user_name": "Donna B.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym, awesome vibe, excellent employees (shout out to Mateo and Casey), and challenging routes make this one of the best places to work out. You'll actually want to come here and stay!! Thanks for making fitness fun and encouraging positive vibes!", "date": "8/19/2016"}, {"review_id": "ni5L-WQjv9ZNhXUuHYj2MA", "user_id": "K28SQl-gl6uMmltlrh-dRQ", "user_name": "Victor N.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 3, "useful": 5, "funny": 3, "cool": 2, "text": "Reportedly one of the best climbing gyms in the country, but definitely more expensive, compared to the original Mesa Rim.  The climbing vibe at the mission valley seems a bit more pretentious than up north.  Routes are fun and varied to accommodate all skill levels. There are definitely cheaper alternatives in the area, eg. vertical hold, grotto.PROS:   Cool areas for ping pong, kids area upstairs, good bouldering area, excellent yoga staff.  CONS:  Pricey.  No slackline.  A couple of the front desk people are kinda rude each time you go there and have this \"too cool for you\" mentality, especially Jackie who needs to smile more. By that reason alone I'll probably seek membership elsewhere.", "date": "12/7/2015"}, {"review_id": "savHFPGlfaZCbF2EVijjrA", "user_id": "_KD9717dj4bB4gjuEi3FBg", "user_name": "Jamie M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Was traveling for work and wanted something to do in the evening after a long conference. It was a quick uber trip from the place where I was staying in Mission Valley. I really enjoyed my experience here. It was $22 to buy a day pass, rent climbing shoes and a chalk bag. I got there at 5, which is a peak time, but people were considerate and took turns on the bouldering wall. It's a lot smaller than my home climbing facility, with less beginner routes, but it was still fun to experience a new place. I took an Ashtanga yoga class after climbing, and the mats they provdided were awesome! Manduka mats that were clean and in great condition. Thanks for a great visit, when I'm back in SD I'll definitely return.", "date": "9/8/2016"}, {"review_id": "ohr-55ZHzNiHJzcBYIt4eA", "user_id": "WUNbq_ULUJytYynfPyp4pg", "user_name": "Brent M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym around. They change the routes often. High quality climbs. Friendly staff.", "date": "10/9/2016"}, {"review_id": "Mn24t4L3yI428T5K1FFXCw", "user_id": "PjnRRDSyLze2-iqEJGEwUA", "user_name": "Austin E.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE this gym. Been a member here for 6 months now. Great facilities. Great yoga schedule. Community focused. Awesome staff. Every time I go here I get a smile and a positive experience in some way. I've been to many gyms (not rock climbing specific) in my time and can tell you the bar is set. They go the extra mile with motivational speakers, special classes and yoga, give back projects, and super clean facilities. I use it for a steady mix of gym, bouldering, and yoga. Cheers!", "date": "7/28/2016"}, {"review_id": "aAFmHdJzP5rKMbEFD4lPMw", "user_id": "BTmrw-XytLSzVVijeCIO-A", "user_name": "Irem N.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "After going to Mesa Rim for a full of two months, I am absolutely delighted to give five-stars to this indoor climbing gym! I am not a sports junkie, however I feel bad after a week without movement. In the past, I've done yoga, so i wanted to continue moving when I moved to the States from Europe. Each yoga studio asks at least $75 with very restricted opening hours, that are basically for stay-home people. I find forcing myself out of work for going to a peak-hour class (and not enjoying) not enjoyable. For this and many reasons, I was unhappy, because yoga studios were very expensive, parking was horrible and I had to leave work quite in advance to reach to a yoga studio... Not worth it..Then a friend of mine got me into Mesa Rim with his guest pass.. and boy I loved it! Before reviewing the place, I must say the community is fantastic. It is not a \"gym\" where people go to show off, exchange looks and judge each other. Every time I go there, even though I am a beginner, I don't feel discomfort. Climbers are very respectful for me to finish a route and helpful. Likewise, the front desk people are the friendliest. I love it! Even my husband (who is a very outdoorsy person and despised the indoor gyms) became a member on our second visit. Since I go to Mission Valley more often I will review it. The place  is very clean and maintained very professionally. Parking is never an issue. The background music playlist is awesome. There are more beginner routes upstairs (5.5 - 5.7), which does not get so crowded. You can get pretty good deals with gear and the staff helps you to pick the best - not the most expensive.Overall, I highly suggest this place, even if you're a beginner, it is a wonderful experience.", "date": "8/21/2016"}, {"review_id": "xzD8rteVRNVznp52Qg4i5Q", "user_id": "37GSkII0JdKY3_40T3z41Q", "user_name": "Isaac H.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "A-maz-ing!  Endless awesome routes, abundant natural light, great community!  Fantastic yoga teachers!  What more could you ask for?", "date": "1/1/2016"}, {"review_id": "HDriNQWZqIj9kqTlmF_DxA", "user_id": "C3dH2B-QClcO9Mqufu3AOA", "user_name": "Matthew T.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "Huge facility.  Great friendly staff.  Quick and painless check-in process for first-timers.  Clean and spacious layout.  Ultra-filtered water fountain available, and water bottle filling station.  Bouldering area is quite popular.  Bouldering offers top-outs in some spots.  I feel the routes were a little more difficult than rated.  Probably one of the better climbing gyms in San Diego, if not the best.", "date": "12/28/2015"}, {"review_id": "QEuP28rEHWW4k-EkSEVBsA", "user_id": "4vLwd5jduyQBrJQarMlZGg", "user_name": "Michelle A.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went here on suggestion of a friend. I'm a beginner but found the staff and facilities to be awesome. Took the belay class, amazing instructor Quinn, very personable and knowledgeable. Would highly recommend checking this place out.", "date": "4/10/2016"}, {"review_id": "nEHwLdeFNm_atJrC1fwPTA", "user_id": "1oBslbfD2bMecE12hTUbmw", "user_name": "Revelator T.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "The long awaited Mission Vally location is coming soon! I had a chance to check out the facility and it's legit. Everything I love about the Mira Mesa location has been duplicated (and in some cases improved) here in Mission Valley. If you climb for fun or train seriously this facility will have what you need. The rope section is expansive and dynamic. The bouldering area is diverse and offers everything you'd want on a short wall. And it's clear that they'll have various other amenities (yoga, exercise equipment, etc.) I've been a customer of the Mira Mesa location since they opened and I'm so happy to see the Mesa Rim gang grow and expand their operation.", "date": "10/22/2015"}, {"review_id": "1p1V0MGZ0Fb03qYLyt6uWA", "user_id": "LDtBZ2EUF60UyD8zyusN9A", "user_name": "Kay R.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The facility is beautiful, the staff are all welcoming and the community is great. It is a bigger gym, so it's hard to feel that tight-knit community like a smaller climbing gyms, however, they have reoccurring events to that gives you the opportunity to mingle with other members and/or staff.", "date": "3/13/2016"}, {"review_id": "oJxHfctZPG8JkFv0KWUYTw", "user_id": "NbPNh3b2VBN-11Pjtu5N-Q", "user_name": "Johnny I.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Dropped by while visiting from Portland.  Great tall routes with good setting.  Bouldering was good too.      I love people watching while bouldering and seeing the bro's all try to impress the cute girl who is just trying to get get her climb on.  It never fails.  Best gym in San Diego though.", "date": "9/23/2016"}, {"review_id": "fe_YR8zzizI97POh1BpcUA", "user_id": "6uUPycsV4v3R8bqCOK7Uww", "user_name": "Andrea G.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I've been looking for something exciting to do with myself for a long long time and I am so so glad to say that after the belay class and one climbing session I absolutely become a member! I'm looking forward to learning more l... I'm a true beginner and the staff was ever so patient with my million questions! Thank you! It is clearly best to bring a partner to climb with but how absolutely nice that they have a sign up sheet so as people enter they can get put into a list to partner up with a stranger! They encourage new friendships too... Could this deal get any better! For this mother of 2? Actually yes!!! Each month of membership comes with a guest pass so you can introduce a friend to the excitement  aaaaaand Drumroll....: your kid under 10 can get a free dependent membership attached with yours! Family friendly!!!! I'm so excited! Don't wait till Jan 1to start your new resolution! Belay on..... climb On!!!! Oh yeah and if you are a newbie and need a partner! Hit me up! I'm so down!", "date": "12/17/2015"}, {"review_id": "UYgWcBemnpR4VxXbOATMVw", "user_id": "xz7ViTNohtzn_WmUetct_A", "user_name": "Cynthia M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Signed up for an membership on Saturday, the staff was really friendly and informative. The gym is a good size with lots of choices. Big lead wall which is nice. There is a decent amount of room to also workout with weights and some equipment. I like the nice desks up stairs and couches. The restrooms/lockers are really nice and clean. The only con about this gym is that there is no towel service, for a $75 membership I really feel like it should be included and I was surprised that it's not.", "date": "1/3/2016"}, {"review_id": "rui7Kc2c2QlK3OQ12uTdlw", "user_id": "YMGASkXNVeD19aYn0ECvkQ", "user_name": "Darian M.", "business_id": "ShWan26H3hBpmvfE9_nTPw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome first time at Mesa Rim! I'm not really big on doing adventurous, athletic things but after i got the hang of it, I absolutely loved it! I went with my boyfriend on a Saturday afternoon and surprisingly it wasn't busy or crowded. Since it was my first, i had to sign a waiver which was very self explanatory and easy to fill out. The workers are very kind and are always looking out to see if you are holding the ropes right or what not. There are so many different types of difficulty leveled climbing rocks which was nice just in case you need to start off with something easy and then just later progress to something harder! I would love to get the membership if I didn't live so far from this place but I'll definitely be back!! Also, a plus is the discount you get if you're a student or have a military id", "date": "2/28/2016"}]