[{"review_id": "3sAaZdRfL-Qo7SLp_Rff0g", "user_id": "sXJwXEHR64393fWO4Qdq6A", "user_name": "Kim P.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I climb in San Diego and am super spoiled by these gyms. So when I came to Pac Edge I didn't really like the dirtiness, the smallish space, the lower walls, the crammed ropes, and the non-color coordinated holds. But I know a lot of people who swear by this gym and love it. There is a small cave area for lead climbing and a hand full of decent rope climbs. There is a weight lifting area and a bouldering wall. But really when you come to San Diego you will see how much better it can be.", "date": "5/8/2019"}, {"review_id": "HJTH5UwwlF06MTZY0AxNLA", "user_id": "E4j2jKY8hBCRYVSohFEgGA", "user_name": "Ira F.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "For beginner climbers: There are a good number of top rope routes that           are very good for beginners (like me). They can be confusing but it makes for a little challenge. As for the boulders, they do wind and turn a little, but it serves as good practice and teaches you to plan routes ahead of time.      For more advanced climbers:Just like the beginner routes, it is quite a good gym, there is a good selection of harder bouldering routes and just like the beginner routes, they wind and turn.     The normal gym: Very basic like any other gym, the \"cardio deck\" overlooks the bouldering walls and you can watch the lead and top rope climbers while you run.     Hospitality:Everybody there, front desk and guests, are very nice people and will help with any rational thing you ask of them.      Overall: A good gym, not five star, but not bad.", "date": "5/16/2019"}, {"review_id": "2lFCgrmy2RkwAcfiB4uReg", "user_id": "kqsmiDrnYKHl2e8dTsPC-A", "user_name": "Cici L.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Love this gym even if the climbing here can get about crowded. But if you come early within a few hours of when they open you can pretty much have the gym to yourself. I love that the top roping and bouldering gets updated a lot. They have a lot of fun routes and great setters at this gym. They even have the moon board, other hang boards, and crack climbing walls. There is also an amazing sauna that is perfect after a climb, it is so relaxing, clean and smells nice. The have cool small key and phone lockers near the front next to the tees. I need to get my lead climbing so I can climb their lead walls when it gets too crowded. This place also has everything you need for a great workout. Stair master, cycling, rowing machines, treadmill, weight lifting, kettle bells, Olympic Rings, etc.", "date": "9/27/2018"}, {"review_id": "MR0tLTxR-rmox_tDJTO63Q", "user_id": "xuNx8PTKrvcqIHuZnR_PiQ", "user_name": "Gino L.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "If you're looking for a place to Boulder this is not the place to go. Routes are very confusing, footholds we're greasy so you were prone to get injured. Super condensed and only good if you're looking to just get stronger or you're an intermediate climber with more advanced technique. Not beginner friendly... Only thing to enjoy there is talking with fellow climbers and staff members.", "date": "3/16/2019"}, {"review_id": "fOdaNVs7qmHBdJuHTXgDdg", "user_id": "-5L74UyulQ9kzd0Ul4XlTg", "user_name": "Leslie D.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Total disappointment my son and his friend went today for his 18th Birthday. He had gone a couple years ago and had a blast. After paying he was told he could not use the harness today because there wasn't a instructor and you can if you know how to tie the knot, but they wouldn't show them how to tie a knot. Are you serious???!!! Wtf! It was very quiet when I dropped him off. So they were confined to a baby wall barely taller than them. Huge waste of 50$ and really bummed him out for his special day. That should really be posted online with operational hours. Don't waste your money!!", "date": "2/15/2019"}, {"review_id": "t1exZ1hv4SLjxgOlvewEEA", "user_id": "o8fSZum7ar2qVcUSAwZVzw", "user_name": "Julie N.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I've been to about 4 other rock climbing gyms in the Bay Area, and I had to say this one was my least favorite. I normally Boulder, not belay, so if you are going to belay then this is a good location. It's small but the walls look immersive, but both the bouldering area and the belaying are small enough that you'll be done in about two hours. The bouldering area was...confusing to start. The routes didn't seem very well thought out for the sake of beginners, im normally a V2-V3 but I couldn't get past the V1's without cramping in my shoulders by the awkward placements of the boulders. You could tell that they were old as well, I pulled out my arm a bit and my friend almost fell from the slippery foot placements. It makes me feel spoiled at the other places I go to such as Dogpatch boulders, where it's very easy to jump right in to a route, and its easier to figure out a predetermined route before climbing. This was not the case here. The routes went across one wall, up and over and back to the original wall (not surprising since the walls were max 12 feet tall), you had to wing it along the way, which I'm sure some people are into. It's literally maybe 6 small walls so it gets crowded fast, not to mention that anyone could be walking under you and it's unavoidable due to the narrow space all around. Then there's two random rooms in the back, which if anything should be converted to the bouldering area. The one in the front is far too small and confusing. If you want to feel good and at least get 4 routes out of your day, this isn't the place. V6 and up? Go crazy, you'll have a good time with the oddly placed holds and distances. I didn't have that great of a time and I tried to make the best out of the three hours I was there. They should just invest more into the bouldering area, but what made everything fun was the people who climb there, not to mention the very kind and friendly front desk. If this is the only place closest to you, it's understandable. Otherwise, I'd try elsewhere.", "date": "3/16/2019"}, {"review_id": "tnGRqwXsXl_6Jc0Rp1u3wg", "user_id": "KoOGv19Jfg8pYd4mIMj1Xw", "user_name": "Michael L.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, I've been climbing here for five years now and couldn't be happier. The route setting is varied and fun, and they often host competitions which means you get comp routes to climb every so often. The gym facilities are small but thorough, with a large assortment of climbing training devices (hangboards, campus board, moonboard, etc.). Lovely and friendly staff. I'm happy to call this my home gym.", "date": "4/2/2019"}, {"review_id": "qecPK93zGuhiLlUtrfCEbQ", "user_id": "KRebz7nFTwNlcdti36RiNg", "user_name": "Kendra M.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff are very friendly. The facility is wellPut together. Easy to rent gear. They have a wide selection in their pro shop.  I had never done rock climbing, and this place had me buying a 10-day pass! Thanks for making this so easy!!", "date": "1/3/2019"}, {"review_id": "FG10ED9VmzFubH9LbV_Hfw", "user_id": "ZBz-ZyI4lxxipO5Ue_K7Kw", "user_name": "Mac K.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "This place is just plain bad. I don't think they reset their bouldering routes the entire time I was there (6 month minumum). The weight room is crowded with janky equipment. They open late and its almost as cold as outside in the mornings. You have to pay more for unlimited classes, but then it costs almost as much as the chains without any of the quality.  Other than being the one place in town there's no reason to choose this place.", "date": "1/7/2019"}, {"review_id": "kHgdHdgfka2FSNTM2CPOuA", "user_id": "cufWmIMkQkYkDwhS7FTmsg", "user_name": "Jenny B.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my nine year old nieces here to climb around for half an hour and the staff were extremely kind and helpful.  I highly recommend this place to anyone interested rock climbing.", "date": "8/7/2018"}, {"review_id": "BQ8h3SK5VRZo8SRfXWDQkg", "user_id": "--NuF57_1o5DyOaCJB5lcw", "user_name": "Andrea S.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "Seriously underwhelmed. The routes were confused, meandering and senseless and the grades seemed totally arbitrary. Not a lot of wall space either. Front desk and staff was helpful & friendly, so nothing on them. But the routes were awful.", "date": "1/14/2018"}, {"review_id": "3HCUGytXGPz9MLQW1yRfcg", "user_id": "kpdAfiaYZ5H21aIAxKvPRw", "user_name": "C. F.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Last week was my first day climbing, and I am hooked! I am clipped in! I am on belay! I am more puns that I don't know yet! This place is suitable as your go-to gym, with the bonus that 1. you can climb stuff 2. everyone is rad 3. the staff genuinely want you to enjoy yourself/love climbing.  Personally I have really enjoyed the community offered (in just one week!) and especially enjoy \"Ladies Climbing Club\". Do yourself a favor and go check it out.", "date": "1/9/2018"}, {"review_id": "aDM-6R8Hfozob0TM0_SBPg", "user_id": "JXmmEmCZ_tZUzK7krs1ABg", "user_name": "Shawn S.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Excellent gym, especially given the somewhat limited size relative to other large gyms in the region. They have a little bit of everything to cater to every type of climber. Friendly staff and nice Santa Cruz vibe. Great place to come spend a few hours.", "date": "9/11/2015"}, {"review_id": "xDebsmWFVbncbplAnX798w", "user_id": "oVwDb1ygkds5mEoRK4N7TQ", "user_name": "Skyler D.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "From a resent injury at the gym ( My own fault!! Not there's) from climbing the staff went above and beyond too help even called back to see how I was healing up  . Definitely an A+ staff and gym .", "date": "9/23/2017"}, {"review_id": "hvQCPcRI7Ca5T811jsSj-A", "user_id": "J2A5xGSDgln4_v9xiC-Qwg", "user_name": "Matan S.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic climbing gym!Friendly and knowledgable staff, lots of well set and tall routes, and chill atmosphere.I couldn't ask for anything more from a gym.Well done PE!", "date": "1/10/2015"}, {"review_id": "CZcwaq3NL1GDH0rY64kt6A", "user_id": "tZ-51tb_ve_eBkSljCq1XA", "user_name": "Amy A.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I was a member here back in 2000 to 2003, and I have to say growth has not affected their service. The front desk staff is friendly and knowledgable, and pretty patient t despite it getting pretty hectic in their at times.    They have plenty of top roping for short to no waits and enough bouldering to keep even the most advanced Sharma inspired athlete challenged. Their Lead climbing routes are some of the most diverse and definitely highest!    My 11 year old celebrated her last birthday there and they provided all the belayers and room at an extremely low price of $150 which included all the equipment too.   So for the 6-112 year old adventure seeker in you, this is a great place.", "date": "11/12/2014"}, {"review_id": "ToNzcG4c1RCDv3nHxjul8A", "user_id": "kPLE0zuW_X4Lbr8USI6haQ", "user_name": "Karen A.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I have had so much fun with all of the great instructors, they are all patient and fun to work with, especially Ty who is super cool, and also a great climber. They have lots of great walls for all types of climbers and the bouldering wall is great for practice. I had my birthday there a few years ago and it was really fun to climb with my friends. There is a separate area for eating and cake ( reviewed by my daughter and her friend )", "date": "10/4/2015"}, {"review_id": "Y2e1Smsl-fge9W8XsUGNWA", "user_id": "jZvaQNN9z3fdALTEMfgAGA", "user_name": "Anthony S.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 4, "funny": 4, "cool": 4, "text": "\"In the American Southwest, I began a lifelong love affair with a pile of rock.\" ~Edward AbbeyI seriously can't stand gyms. The mere thought of going into a gym to exercise makes me nauseous. Add to that having to deal with the whole \"bros and hoes\" mentality drives me crazy. I can't tell you how many times I've been in a gym and seen fights break out over fitness equipment or free weights. It's disgusting.Luckily going to Pacific Edge is nothing like going to a regular gym. The people there are friendly, supportive, helpful and they're all there doing something they love...climbing really tall walls! There's climbing for everyone here from beginner to advanced top rope routes, a HUGE cave for lead climbing, and bouldering walls that run the gamut from beginner to certifiably insane. The staff update the routes every week to keep the (very) small gym exciting and new.For those wanting to build muscle or do cardio, there's a full weight room and exercise machines. With your membership you also get at least one free yoga, core conditioning, or therapeutic yoga class per week which is a really good perk that I try to take advantage of each week.If I had one gripe about the gym its the fact that they're open at weird hours. I'd rather workout in the mornings to avoid the crowds, however Pacific Edge opens at 3:00 pm on Mondays and 10:00 am on Wednesday, Friday, Saturday and Sunday. I sometimes wish my gym was open when I want it to be open. That's not too much to ask, right?After burning thousands of calories while climbing there's lots of food options including coffee at Verve yelp.com/biz/verve-coffe…, burgers at Betty Burgers yelp.com/biz/betty-burge…, or brews at Seabright Brewing yelp.com/biz/seabright-b…!  Climb on!.:My 300th Review!:.", "date": "4/6/2013"}, {"review_id": "lxw_pln_VgqetficUR14uQ", "user_id": "07GNnatg9L1qd1UNgdtdDQ", "user_name": "Ginger R.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 1, "useful": 7, "funny": 2, "cool": 1, "text": "One star for customer service.A friend introduced this gym to me because he thought id like it. I did and I was sore for the first time in a long time! So, I tried bouldering for the first time, it was fun climbing the wall and there is a tiny weight room(it appears to be pretty good for functional movement). The problem I had stems with the employees I spoke to in person and over the phone, not the equipment.I didn't know there was yoga at the gym and called to ask if I could take the class for free today(there are a tremendous amount of yoga studios in SC that offer this). The man on the phone said I should have taken it when I came in originally. I told him I didn't know there was yoga at this gym(which adds value to this particular gym for me). He said, \"We can't answer questions you don't ask\". Swear to god! Ha. That is actually funny. How about, you tell me about your gym when I come in the first time and explain why it stands out from the rest!? I don't know, maybe a sales pitch!? I don't know what the climbing community is like but I do know what good business practices look like, this is not one of them. My suggestion, check the gym out but make sure you're prepared to ask every question you'd ever have about a gym. I wouldn't want you to miss a thing :)My suggestion to the gym, you obviously have a decent facility, train your employees to talk about your highlights. A few minutes could have saved me from such an odd experience.", "date": "12/9/2014"}, {"review_id": "Stza7f51-alp2t3PRA5Jwg", "user_id": "_SVfoi3YUFNHswsfZUO9mg", "user_name": "Mikey U.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 14, "funny": 7, "cool": 9, "text": "For a climbing gym with a 21 year history and impressive pedigree - Chris Sharma, one of the sport's most recognized and considerably strongest athletes, began his career here (video.nationalgeographic…) - I'm surprised by the sparcity of reviews.Like so many things in Santa Cruz, the atmosphere and vibe is invaluably pleasant and welcoming. The staff and patrons [for the most part*] are friendly and engaging, encouraging and insightful, lending helpful advisement and rallying to your climbs and ascends. It's a nurturing environment and camaraderie that I think is inherent to the sport, though I think its particularly prominent here partly due to its small size. The routes & problems I attempted were rated very firmly [DISCLAIMER: I'm not a strong or adept climber, with only a few years of casual experience, as much as I enjoy the sport], and I'm told that they're quite comparable to outdoor grades. I was grunting on routes a letter grade below what I might decently climb at Planet Granite, Sunnyvale and/or Touchstone Studio, San Jose. This may be partly attributed to the height/length of some of the climbs; I found myself run out of gas just before a couple of finishes. And let's not even start with my near inability to close some of the bouldering problems. #realitycheckMy only real detraction from being able to rate this fantastic gym a better/best is more personal than objective? The smaller footprint of this gym, coupled with its legacy for fostering great climbers, left me, as a relative beginner, with fewer options. Nearly half the routes are set aside for lead-climb, there are possibly a handful of top-rope routes per rating (5.9, 5.10a/b/c/d, etc.), and bouldering problems below a V2/3 are few. Still, this is a fun gym to spend an afternoon at, but I am not a skillful enough climber to have enough to do/try to completion.But if you want to get better, you should be around better. And it goes a long way being in a environment and community that is warm and welcoming. Pacific Edge has got that vibe in spades. I'll definitely be back sometime and hopefully be strong enough to enjoy more of it!_________________________________________*Except for one guy whom I assume was a regular, whose self-perceived elitism precluded etiquette or sense of safety, beginning and climbing through his route that clearly overlapped and intersected with our friend's route while said friend was problem solving THEN telling our group WE were wrong for thinking him rude & inconsiderate.F*ck that guy. F*ck. THAT. guy. All day.", "date": "6/15/2014"}, {"review_id": "1Z_KtCGY3EkmOXDNfche9Q", "user_id": "IIwfcmU08iU_zLYEF0Qtjg", "user_name": "Christine T.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice space with room to explore your own limits, with decent rental gear available.Looks to be a popular spot for kids parties so if that's a non-starter perhaps recon ahead.  They offer memberships and packages with instructors.The yoga space is an afterthought shoe-horned into a space that maybe was storage? Completely uninspired...Parking is available off street and bike parking better that most Santa Cruz (ie Seemingly well policed area with people in and out..)", "date": "12/22/2014"}, {"review_id": "FI-4YE3Km4Oxwa3gys8ycg", "user_id": "cKXmPrL5Jf7p7kmQByzf_g", "user_name": "Shelby H.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm so glad there's such a nice climbing gym here in Santa Cruz. The yoga is rad (even if the room is a little small), the sauna is a huge bonus, and the climbing is awesome. I've had a membership here for over a year now and absolutely love it. Most of the things I like to do are in one place!My only suggestion would be to place more left side dominant routes, most of the bigger moves are right handed. I'm not left-handed but boy is my right side waaaaay stronger compared to my left. It'd be nice to even it out.Thanks Pacific Edge!", "date": "3/22/2015"}, {"review_id": "f7rzKs2DCl00tCl-Xoj_XA", "user_id": "1DyjLkfEarNSFpPcwNhfLQ", "user_name": "Gemma R. L.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I dont know much about rock climbing - but I came in with my daughter and was way impressed. The instructor rocked and was super patient with my daughter who can be extremely shy. He was so calm and patient, that by the time we were on our way out - she was taking on the tallest walls. WOW! She did every wall and every style. Super impressed with her instructors encouragement and patience. Huge impact on her life. She is a totally different kid now! Thanks PERG!!", "date": "10/23/2014"}, {"review_id": "cq22MQV1YFkkfwMnc-_W7g", "user_id": "TBtdDXBdm-qwNuBXuTh-kA", "user_name": "Shauna R.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went to the Women's Basic Safety with a friend on Friday and we had a blast! Our instructor JoJo was sweet, friendly, and very helpful. I definitely plan on going back soon :)", "date": "3/27/2016"}, {"review_id": "q9vReYP45imumr_ZlGoUKQ", "user_id": "kP20_xSdbU_4bUrtb0RFYw", "user_name": "Monica S.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "5 stars, cause this place has exactly what you want from a rock gym. Routes are pretty legit. The ratings here are as close to outdoors as you can get.  Lots of routes that challenge you to use technique.Staff are super helpful and really personable. Chill vibe. They have yoga classes. Also, there's a sauna!", "date": "10/21/2013"}, {"review_id": "hhc20uqHToU-UK0xzdwRcQ", "user_id": "S2pKSvK1pvRqGg_6vjm--Q", "user_name": "Kathleen K.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "i can't say enough about the wonderful staff and the cleanliness of this place...great environment and the rules are in place for good reason...it's all about FUN and SAFETY!...my 8 year old granddaughter learned in 1 lesson how to climb and before the day was over she scaled the wall to the top,...no fear!...and total respect for her teachers...excellant staff...i wouldn't recommend talking alot of young first timers expecting to be at a birthday party there because this place requires discipline and focus...not something the prior post would understand since she couldn't wrap her head around the rules...which are basic and SIMPLE!...Great family environment!", "date": "8/13/2017"}, {"review_id": "SLL4yJDcRsGEz-35IWQ0mA", "user_id": "hR-ViFnmpLwl3nLBI7GL7g", "user_name": "Simon S.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best climbing gym and shop in the area. Really well stocked and full size shop for climbing gear. Have been coming here for years, and will continue to for a long time to come.", "date": "3/8/2017"}, {"review_id": "09JUeoXZWfSxi2rO05jDYw", "user_id": "o4ygI6_4RP4zLS1RMKyeJg", "user_name": "Eve I.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is my first rock climbing gym, I have been a member for almost a year now. I love the routes, they are harder and more realistic than let's say at Planet Granite in Sunnyvale. The staff is super nice. Good climbs, good people around. Small gym, with a few cardio machines and weights, plus sauna. When I there, I have a feeling I am around a lot of experienced good climbers.", "date": "8/28/2013"}, {"review_id": "xhNl7HLPxuzI9Qm-laniHw", "user_id": "JL2tjK_g8R3E_vjmFMq5yg", "user_name": "Pamela M.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I learned to climb here. I've since been to many indoor climbing gyms. While I've never met a climbing gym I didn't like, this is still one of my favorites. A large space with places to top rope as well as free climb, boulder and lead, the routes are reset frequently. There is a small workout area in the back and plenty is showers in the changing room. They have a separate area for belay classes and they offer ongoing education. I highly recommend them.", "date": "9/23/2015"}, {"review_id": "sjEUwgVDnQmqsNdEbQgOSw", "user_id": "9VhN6YnI-0-UsWbNhcj7Og", "user_name": "Sydney G.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "The staff here is really subpar. If you go at half-off time make sure you check the bill because I've been charged full price (they corrected it when I brought it to their attention but dude, wake up) and I've gotten a pretty pretentious attitude about climbing in sneakers on the basis of street shoes being \"gross\" for climbing (guess they never climb outdoors in a lysol free environment? lol). It's also pretty expensive (unless you drop in at half off time, and assuming they don't charge you the full price anyways :P ) and super small---so it gets CROWDED, there are lines waiting for bouldering sections and major lines for the top ropes so that's a major deterrent...I don't like to feel like I have to rush having a good time or trying to tackle a route because there's a line :/", "date": "3/9/2016"}, {"review_id": "eohiKauD4qySlxdC9tbPAA", "user_id": "fFQ3xZqWLfoEMLM6sWT39Q", "user_name": "Nico H.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went here to get gear before going caving in the Hell Hole (IxL Cave). The manager told us everything we'd need in order to rappel to the deepest portion of the cave. He spent a good thirty minutes showing us how to use everything we purchased in a safe manner. We wouldn't have been able to make it to the bottom of the cave without his help.A+ for customer service.", "date": "5/26/2015"}, {"review_id": "XMim5gJwdO9ImX7kPV9KdQ", "user_id": "mzk1sSNlLILBehRtBoj5PA", "user_name": "Yuan W.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The place is amazing. My friend took me here. First you need some device on your body. You can rent in the front board. You need to get a permit to pull some one. But I failed. so I only can climb. I have seen a pregnant woman, an old couple and so many children. We all have a good night here.", "date": "1/15/2015"}, {"review_id": "Z1-GUSmWRp_U3GXQMr_e3w", "user_id": "HKwNNVu-xM31Wr_RVDMQCg", "user_name": "Nicole L.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first experience ever rock climbing! Me and a buddy did the women's class with JoJo and she was such a great instructor. She made it super easy to learn and FUN! I'll definitely be going back soon to take the belay test and climb some more walls:)", "date": "3/26/2016"}, {"review_id": "Vd_SLJohluyzu5WoRgo4dQ", "user_id": "LR-2wswSvvGMA7IjSxQQKw", "user_name": "Serena A.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing- great energy, great people, great routes. I'd move back to Santa Cruz just to be closer to Pacific Edge. The routes are constantly being updated- they're challenging in different ways and force you to incorporate various techniques. I love this place.", "date": "10/2/2014"}, {"review_id": "h4FVEftWyt2vTPnB96G1EQ", "user_id": "OIIvfRKHHWRxnivbBjfbbw", "user_name": "Todd W.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I'm digging this place! The staff has been very helpful in getting me set up with gear and learning to climb. I'm taking the \"Climbing 101\" class with Mike and have met some fun people to climb with. Mike is a great teacher and gives a lot of individual input.", "date": "11/13/2013"}, {"review_id": "-e0BATDEDmtc4kBbaKBK_Q", "user_id": "hgWamnI2a4zG6hRqJGVczQ", "user_name": "Joseph J.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very reasonable membership price. The facilities are awesome. The staff is always very friendly and in a great mood. Pretty much everyone including the staff is helpful. Much better community than you'll find at a typical gym (if that's what you're looking for).", "date": "5/24/2014"}, {"review_id": "cUKIheIzIPfyo4bu2zW--A", "user_id": "30vjKdW6wNF5i1Hu-6-agA", "user_name": "Vince N.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "This place is pretty nice. The walls are super high, probably the highest I've climbed for an indoor gym. Ratings are softer than other gyms, but there are definitely some tough routes to climb. The high routes make up for a softer rating, it does get your heart pumpin! Top rope area was nice because there are benches to sit on and people to chat to. Service is great here, the guys are very helpful and don't act like \"super elite\" climbers. Thumbs up to the crew there. Belay check was very fair and reasonable. No tricks or games, just making sure you know the basics and how to be safe. I'd recommend this place for anyone interested in climbing. Prices are average for day passes and rentals.", "date": "1/14/2009"}, {"review_id": "bOGlCVk0A5vL4NLAAeYCiw", "user_id": "vpPv1J5UFwlG5D45K_4WKA", "user_name": "Cameron B.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The facility, staff and patrons are all wonderful! I am so grateful Santa Cruz has an affordable rock climbing gym. If you haven't been here, you should check it out.", "date": "4/7/2014"}, {"review_id": "K6yNDlEIa1B5z3YdSLkUqA", "user_id": "dZhj5RLG5LGLcbRvKoMQUw", "user_name": "Steve L.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been a member here for years, this was one of the original climbing gyms in the Bay Area and has a history. Whats great about this place is the friendly community and knowledgable staff. The route setters work to a very high standard and unless you are climbing v12 off the couch you will find something to challenge you. They have one of the best pro shops in the bay area - only Wilsons in Bishop or the climbing store really compare. How do they compare to the other gyms ? For years PE was the biggest and best, in the last couple of years though they have got some serious competition from Planet Granite in Sunnyvale. The addition of a new bouldering room in the last year has helped, but they will need to do more to stay competitive. The lack of WiFi in the building is an easy one to fix. Verve coffee is right next door and you are right next to the beach - can't beat climbing in Santa Cruz !", "date": "6/30/2014"}, {"review_id": "VzHyYXf2rYKj7JT5K-MNRA", "user_id": "bhaveiVBZsW1dHAhupYD3A", "user_name": "Ryan G.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Cool little rock gymSmall but quality routes, fun little bouldering area in the middle of the gym, cool little work out areas for cardio and weights, there are a few very knowledgeable and passionate climbers on staff that give you great advise for outdoor climbing trips and indoor climbing tips. I just wish it was a little larger so they could offer more routes and variety in climbs", "date": "10/22/2011"}, {"review_id": "3fgBBB5e21SnCovvYGN4Fg", "user_id": "fDJBZ-G5MSG1fIZLaLVdeQ", "user_name": "F.M. R.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "I think this gym is amazing as a climbing gym. this is NOT an amazing place for a birthday party. They are not \"kid-friendly\" at all. In fact, the staff seemed to dislike their jobs working with kids. there were so many rules I couldn't keep track! At no point did they ever explain what the kids \"could do\". It was all \"no this, no that....don't touch that, stop it....\" They even benched kids! At $150 for 6 kids...ummm, never again. The group of kids we had was very sweet and respectful too. I can't imagine what would have happened with \"rowdy\" kids....", "date": "4/18/2015"}, {"review_id": "wYBj9AVzebxaTdFK1NDMBw", "user_id": "ZiNgmN1wBbUzZNYzYvM1Wg", "user_name": "T T.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I prefer to climb outdoors, but this is a great place to stay on top of technique when weather doesn't welcome me to the great outdoors (Castle Rock, Pinnacles, Yosemite). It's a climbing gym full of really awesome people.  I have all these associates from the regular world who I never knew climbed...and then I see them here, and it's so awesome!  It blows my mind every time.The walls are great, the employees are great, and I hear the technique classes are pretty cool too.Oh, and the best part is Ladies' day!  $7.50 to climb on, hell yeah!", "date": "6/26/2011"}, {"review_id": "14dv-G0gqcAMbu13eAdFyQ", "user_id": "v6OdcJwVDqvCiqDWMVH2Gw", "user_name": "Adam A.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best \"small\" gym I've ever seen. Tolerant and friendly. The recent bouldering room expansion is very welcome. The sauna is a must. The training systems are modern. The grades are stiff, so if you get good here you'll be good anywhere. I love this gym. It was a great place to grow.", "date": "9/7/2013"}, {"review_id": "3oP28fxMbuAxSRmK1r3P-g", "user_id": "SMZ_-88-om2NT7HEaSUoVg", "user_name": "Chris N.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "Pros: (of having a membership)Big climbing walls for lead and top ropeFull gymYoga coursesHelpful and friendly staffCons:Kids everywhere that don't follow safety rulesSmall bouldering area with only 1 crash padExpensive on a student budget", "date": "6/12/2012"}, {"review_id": "vWPfQSbm7d5PtnPYtC2nBg", "user_id": "jZvmWwZt6qOcWwfdtMi7-A", "user_name": "John B.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I moved here from Boulder, CO where I was spoiled when it came to gyms. So I understand that's hard to match. However Pacific Edge is still a fun wall with a friendly staff, nice sauna, and they are continually adding new routes. The new Boulder wall is great too since the other ones are pretty short. The gym can get really crowded but thats not really their fault. My only real complaint is the pricing. Their day pass is on par with most gyms but then they charge you for harness, shoes, and everything else a beginner would need to get started. And their membership is through the roof. Plus you can only get it in 6 month increments. Whats that about!! Not even a 3 month option let alone a month to month? Pretty ridiculous and I know people who opted out of it because of the commitment. They are losing business.", "date": "3/7/2013"}, {"review_id": "318tQP3hhmlMt3Jlm6mZXw", "user_id": "FuQEA599CgkRu2QZ70TkgA", "user_name": "Samantha R.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 5, "funny": 3, "cool": 6, "text": "This gym is probably going to be one of my best memories of Santa Cruz...It got me serious about my climbing for a while, and I had a great time conquering the ever changing routes...The gym is small, but its packed with some punch. Each top rope has 3 or 4 different routes to traverse, at varying difficulties, so partners can easily pair up and decide on a wall. I really liked how at different areas in the gym, a 5.10-5.11 could vary significantly in technique needed to get to the top (try the routes in the corner, its nuts)Sadly its a tad on the expensive side. The one month trial membership isn't really worth it (90 bucks) but if you don't have any equipment and have commitment issues, this might be a good option for you. Six months comes out to around 35 a month, still a little much, but being the only rock gym on this side of the hill, I'm willing to deal.Its in a good location-- close to Betty's for a good burger after a good climb...the yacht harbor/Seabright beach for some sun and ocean...and the Brewery if you wanna down a brew after chalking up. Climbers get discount on Wednesday! Cheap pitchers!!Thanks for the sweet climb, Pac Edge.", "date": "4/21/2009"}, {"review_id": "zV243XBB8Jt5qICTofX9Lg", "user_id": "2reFZPgoFUcxPoLhe6o-Fw", "user_name": "Jessica T.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm proud to call Pacific Edge my home gym.  It's not super posh, but I truly appreciate the mixed crowd (not filled with shirtless preening 20-somethings).  On any given weekend, you can find whole families climbing together.  I marvel at the children and grandparents that can smoke just about anyone.  Plus, as a geologist, I regularly bump into other department members.  The student membership is a little pricey ($45 a month), but it's worth it because they rotate routes frequently.  Sorry gyms that leaves routes up a year plus, but consistency isn't what I'm paying for (you know who you are).  The gym has the basic amenities, weights, and machines.  It's nice they offer a yoga-type class a week, but I have yet to try one.Only qualm:  too many children's parties!  Is climbing the new bowling?If you plan on buying a membership, don't bother to freeze it.  I think it's ridiculous that they charge to freeze a membership and the amount you pay to unfreeze it isn't worth whatever time you have left.", "date": "3/24/2010"}, {"review_id": "J2_M3DXUSWzZdM0bYKcA2g", "user_id": "w2OhEZftZcK8nzApK_Jt4Q", "user_name": "Amy W.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "Best Climbing Gym.  Ever.So many climbs, must be at least 15 top ropes with two or three routes each.  Gigantic lead cave with a freakin stalactite (nose) that hangs down.  For real.  And great bouldering area with a cave.  There are routes that allow you to traverse all the way around (and around and around) the bouldering area. They also have a large weight room, yoga/pilates studio (members get one free class a week), machines like stairmaster, stationary bike, rowing.  And a sauna in each restroom!   For my husband and I monthlies are $71.  Who could ask for anything more?  PS we are about to move to San Leandro and devestated we will be so far from this place.  Is there any climbing gym in the Hayward area or do we have to go to Berkeley?!  Alert me if you know.", "date": "9/14/2008"}, {"review_id": "m76WE31dmfQcluoDJJ-mHw", "user_id": "hovO6uTj1F-_8l9h2vo0hg", "user_name": "Mark B.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 1, "funny": 3, "cool": 1, "text": "every so often I really like to come here and climb until I can't hold my fingers together anymore....so about an hour. There's something about climbing though that makes one feel very accomplished. After struggling up Pacific Edge's 50 foot walls, I definitely feel like a superhero. Plus there are enough ropes available to provide lots of variation and the grips change every few months as well. The place itself is very very big. I mean, it's hard not to have a large facility when you are tying to mimic a mountain but still. They have tons of ropes to climb for skills ranging from very beginner to super expert-don't-try-this-unless-you-like-to-break-your-body-into-itty-pieces, some bouldering walls, a gym above the bouldering wall, locker rooms complete with saunas and showers and yoga classes somewhere. Plus they're right next to Beckmann's bakery so if you position yourself right, you can smell bread and cinnamon rolls wafting as you hug yourself to the wall.The staff there are down to earth and friendly. The last time I went in the guy at the front desk was munching on one monster of a burrito. They are easy to deal with and are more than willing to help. The only problem I had with the place were the ropes: they really need a wash. They aren't really dirty to the touch or anything but they definitely aren't as slick as they should be. But, that's just me being nit picky as well. Overall, this is a great place to have fun and work up a good sweat. Just don't go here before you have to do any writing with a pen the next day or if you're a professional hand-shaker.", "date": "9/6/2007"}, {"review_id": "Hu4fdFD7M2IknuS5qD90hg", "user_id": "iuIUwbgIFk6-beQyGCL3Iw", "user_name": "Eric C.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "Stepping into this gym for the first time really was an intimidation, especially for a novice climber like me.  There was a huge number of ropes, I'd say at least 15 or so, and a bouldering wall.  Each wall gives a ton of various paths to choose from, with a bunch of inverted walls and cracks to use as well, all designed to show you how weak your grip is and how unflexible you are  The chimney also provides a different experience from the usual grips.They also have a weight room, a couple gym machines, yoga space, and  a shower/sauna to finish up the package.  The other climbers here are super nice too, always willing to give advice or correct my belaying techniques.", "date": "11/26/2008"}, {"review_id": "zM6vED8LyAsfDEcaSWZwnQ", "user_id": "XQf9W-ocdbKMtwxKec7c0w", "user_name": "Jacob G.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A great (helpful, knowledgeable, friendly) staff, great (well kept) equipment, and top notch (reset often enough, well rated, varied) climbing areas.They also offer various free and informative clinics, in-depth paid classes, and assorted yoga/pilates classes.", "date": "4/28/2010"}, {"review_id": "wNyFmPAuxYwfQ3A4TZlWvg", "user_id": "ITKmmjLA1mO_Ugwok9L6VQ", "user_name": "Luis T.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I think this has been mentioned before, but I'd just like to add that rock climbing truly is a different kind of workout, and Pacific Edge really does offer an alternative experience to the type of workout you are accustomed to, for it also poses a mental challenge.Besides rock climbing they also feature yoga, mat pilates among other things.For those who are thinking about trying it out for the first time they offer climbing school which also features kids classes for ages 6-11, youth classes for ages 11-17 and outdoor climbing.", "date": "9/2/2008"}, {"review_id": "409CYrX-_3oSqQf5u80d7g", "user_id": "eCX3nd_B46f90kA1l8OJuw", "user_name": "Katrin D.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pacific Edge is a gem in Santa Cruz, an anchor for the outdoor recreational community.  Having climbed here since 1999, this place has challenged many a climber to push their skills and make friends in the process.  The people here are awesome, the antithesis of the robogym stereotype.  Instead of \"working out\", the exercise is fun, purposeful, and can be deeply meditative and thoughtful.  The ratings are spot on, if not on the harder side compared to other gyms.  A 5.11b here may rate as a 5.12a in some other climbing gyms.  The staff is friendly, and the yoga classes are great, too.  They also have a fully stocked pro-shop with special discounts each month.  With climbing gear being so competitively priced, Pacific Edge offers some good deals on gear, and you get an informed, experienced professional to tell you what you really need to know.  This is overall a fantastic gym that makes so many of us in Santa Cruz happy and healthy.", "date": "7/20/2014"}, {"review_id": "oUhVC_rpbOWDeFpJrY-x9g", "user_id": "DEhMuVEOnXLhDwufW2RqLw", "user_name": "Darth Y.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I climb all over the bay area. Of the bouldering routs here,  I think the ratings are horrible. I could do a V4 but not a V1?!? Of course you can still climb, it's just confusing to know which routs to try.However, I was asked to pay $2 for a towel, seriously???? who else does that???Also, it's dangerouse because there isn't much room and people end up standing below you when you climb!!!! OUCH!!! NEVER AGAIN!!!", "date": "6/5/2011"}, {"review_id": "j2ZyKhCBbEaKfe_rl7VIRQ", "user_id": "2VpUdJvI3JucWoOVB-F8OQ", "user_name": "Kenneth C.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "After catching the sunset at the nearby Lighthouse Point, my sister and I went just down the street to Pacific Edge.  Upon entering, the friendly staff got us our first time papers and told us that because we were there for the last 1 1/2 hour, we would get 1/2 off.  And on top of that it was ladies night, so my sister got an extra 1/2 off on top of that too!  What a great way to start out our first visit to PE.I mainly boulder, and PE had enough bouldering walls to keep me entertained for the night.  Not as extensive as their website photos make it seem, however...   All in all, I would highly recommend giving PE a try, as it is the only climbing gym in the area.  Perfect place for an occasional climb, super friendly staff, and great location near the ocean.  What more could you ask for?", "date": "3/28/2009"}, {"review_id": "ht2smz3x_7s1Qx2YvItMAA", "user_id": "YZWljiYBv2sFSuVzOslFLQ", "user_name": "doug v.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Might be small, but certainly packs a punch.Great for novices to the radical. Friendly and helpful staff. We took a bunch of local children from the 'flats' area of downtown Santa Cruz who come from impoverished homes, and they had a blast. The owner gave us a great discount because he knew it was going for a great cause. If you are a tourist looking for an action packed opportunity, this is one of the tops.", "date": "7/25/2009"}, {"review_id": "ZTd-ATcVGyqik496WQ5JRw", "user_id": "vLN7B_EoO3_3mJSvIkq5Tw", "user_name": "Ken B.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great facility with super knowledgable, friendly and helpful staff. The routes are constantly changing and always challenging. I've come to know many of the staff and many of the regular climbers - a great bunch. And after five years I'm still paying the same monthly fee - I appreciate their cost control. As others have said, I'm proud to call Pacific Edge my home gym.", "date": "6/27/2011"}, {"review_id": "Ft3xv3neoIsAHDTlqH7wWA", "user_id": "sw2Y9wwqn_QqfRXaBX_m_w", "user_name": "Chris B.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Its a climbing gym.  You largely get what you expect.  Decent weight room, a few bikes and treadmills.  Staff is friendly, and well, its a climbing gym.  They only have one fewer star from me because of the price.  A deal on membership, maybe waiving the initiation fee periodically, or with the purchase of a 10 pass would be cool.  I'm sure they aren't getting rich, but without competition, there aren't many choices, and there isn't any downward pressure on prices.  Oh well, if you're a dirtbag, I guess you probably wouldn't be in the gym anyway.", "date": "12/5/2011"}, {"review_id": "GkCGSlWpqOB-P8xNpaJKMA", "user_id": "Ji1gGA5lfT9YrNNxKICoJg", "user_name": "Greg B.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "While I may be a bit partial to the place since I live right by it, of all the climbing gyms I've gone to Pacific Edge is my favorite. The top rope and lead walls range from a couple short ones (mostly for beginners) to tall 50+ foot ones which range from 5.7-5.13. The bouldering area is pretty big as well and has everything from VB-V7. The atmosphere is really good. It is often busy, but rarely crowded (where it is hard to get on something quickly). The staff also is top notch. One thing to note for the beginner's out there, there is a higher concentration of intermediate routes here. There is enough stuff in the 5.6-5.8 and VB-V0 range for a few days of climbing, but if you come more often than a couple times a week you may start to run out of new things to try. However, I never found this to be too big of an issue since you normally progress into some of the intermediate stuff fairly quickly. If not they are pretty good at putting up new routes in a given grade every 2-3 weeks.", "date": "1/14/2009"}, {"review_id": "r0RppALhTSzf8trwBXqhCA", "user_id": "LRJgblf3U3v1MwhR7GrnfA", "user_name": "Julia W.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 4, "useful": 5, "funny": 0, "cool": 0, "text": "awesome, helpful staff here!  great place for learning/training.  Not overly large but some super high walls.  Climbers here tend to be a friendly bunch.  For a warm up or a bit of diversity members can exercise in the Cardio Area or the Training/Weight Room, there is even yoga.", "date": "4/26/2006"}, {"review_id": "U9GttoZQz38QjebaOML0fA", "user_id": "eCcjxh8zjAqn-kZVWZ_HJQ", "user_name": "Katie S.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 2, "useful": 2, "funny": 0, "cool": 2, "text": "I like to boulder more than climb vertically, so Pacific Edge doesn't really work for me.  They do have bouldering walls, but I was never really impressed by them.  Good if you like going up and down though.", "date": "1/31/2007"}, {"review_id": "6ioDyuWwoPXLk5iNMCnQTA", "user_id": "DOzHoGQ7kXvYH64mr2gUOw", "user_name": "Autumn C.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "You get tons for your membership. Great staff, great bouldering problems, sauna, yoga, cardio, weights, tons of routes, extensive lead climbing, great pro shop, and awesome community. You can't go wrong, and the most affordable rock gym I've ever been to (East bay minimum $65 month.)  Every time I walk in I feel at home. It's one of my favorite places on earth. When I moved away from Santa Cruz for 5 years, Pac Edge is one of the things I missed the most. I love it!", "date": "4/8/2010"}, {"review_id": "xFD3mbT_ZS-xdHkB2ZBKuw", "user_id": "Mk2dLQ91c3iTcU5jRYxDtQ", "user_name": "David C.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This has the highest ceilings of any indoor rock climbing gym I know of and a bonus weight room and sauna.  Prices are $42 a month for a membership or $12 for a day pass.  If you want to build up your grip power for wrestling or something similar i recommend this over anything else.", "date": "3/30/2005"}, {"review_id": "CDaJ4DnUwzP1UEPJsA5QUw", "user_id": "ibCi-_L6gyP-fPKekrcCCQ", "user_name": "Aubree N.", "business_id": "dLSkedZvkE1xldE5cwvquA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I didn't really know how good I had it at Pacific Edge until I moved from Santa Cruz.  First, the facility is great.  There are lots of routes and the walls are really tall so you can take your time getting to the top and you don't have to tie in as much.  The bouldering area is good too, it's nice to have both top rope and bouldering.  I love that their are benches you can sit on while belaying.  It gives you time to relax.  I also really love the yoga classes!  It's great that they have a separate room dedicated to yoga.  The instructor was great and they offer a wide variety of styles and classes to fit your needs.Second, the staff at Pacific edge is amazing!  You can tell they are all very passionate about climbing and eager to share their skills and knowledge with you.  You really get a sense of community by being a member here.  They take the time to get to know you, which is also helpful because they sometimes take note of your progress and give you tips/compliments.  (Especially nice if you're a beginner climber).  Third, the price is great.  It's a lot cheaper than other gyms and they offer discounts if you sign up for a membership with a friend or family.  If you are debating the value of the membership, know that rock climbing is incredibly addictive and you'll end up going way more than you think!Last, the gym is located just down the road from seabright brewery..I mean, c'mon.  A good climb and then a pint.  It's a good combo.", "date": "3/2/2009"}]