[{"review_id": "wR8E0bMqLb8wvBYC5hxUJw", "user_id": "abzY14X8EwPyXwdeVPqreA", "user_name": "Anna I.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "All I can say is this gym is amazing. It has it all and then some. I don't rock climb but a few friends and I have came here to boulder and what a cool experience. My buddies have a membership so I can come once a month with their guest pass! Upstairs is the bouldering area which means free climb, no robes, no nothing. Everything is labeled by numbers to know where to start. V0 is the easiest but if you've never climbed it may not be (at least for me). Still a great experience even if you don't climb regularly. I'd recommend any level of climbers to come here. Their gym equipment is top notch  Wether it be weights, cardio or climbing equipment. It's all here. They do a drop in fee for those not wanting the monthly membership and have student discounts. The memberships aren't cheap, but you pay for what you get for. Bathrooms have saunas and showers as well.", "date": "5/20/2019"}, {"review_id": "uP8nMJJVwvFY0tqgdIGt_w", "user_id": "m7qspOgw7KssNTBfujRLIw", "user_name": "Takako S.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "I have done some boarding with my friends and finally decided to take a belay class.  The instructor, Jasmine was super nice and clear.  I got two weeks trial pack including renting gear for $28, which was a good deal, I tried my firs belaying with my friend, awkward, a bit scary but it was fun after all.  Though, my legs and arms are so sore, it would be recommended to take follow up beginner class, so you can learn many tips to make climbing easier and effective. This class offer a month membership after you complete 4 weeks (once a week) class. They have stretching area, some workout machines, set of weights, so you can warm up and cool down.  Their locker room is very clean, there is a sauna, it's perfect after climbing. Close to my house is a big plus, I also got another week deal from Groupon to try a little bit more, they offer other classes, yoga, Pilates, etc., also good for kids climbers as well (and I think they are fearless and much better than me...) I don't know other climbing gym but I heard this is one of the best one in Portland. I like them a lot!", "date": "3/2/2019"}, {"review_id": "lblidkWwCYdUfCApj13zXA", "user_id": "VE5sgM_Y8vUI4Xbdy6BxBw", "user_name": "Darren Y.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 2, "text": "Best climbing gym in Portland. Facilities are top notch and staff is super friendly. Lots of street parking available. Parking right in front of the gym is usually taken but the blocks surrounding are almost always open. Main floor has sport climbing and a good size exercise area with machines, weighs, rowers and nice stretching area. Second floor is for bouldering with a warm up area and room for stretching. Third floor has a room for classes and another set of cardio equipment. This place is huge and has everything you need for climbing and general fitness.  The climbing walls are super well maintained and routes get changed every couple weeks. They also have an excellent steam room. If you want to try the gym out I highly recommend taking the beginner rock climbing course. It's 129 bucks for 4 classes and includes a 4 week membership - amazing value. You'll get a belay class, learn the basics to top rope and boulder. Instructors are super knowledgeable and also super nice and friendly.", "date": "1/4/2019"}, {"review_id": "xDnAJpyn7Wm2d2TjV8q3Rg", "user_id": "smantZRbVX66eYVejZxpvQ", "user_name": "Stephanie A.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This PG location is insane. For top roping/lead climbing it has soooo many routes as well as bouldering upstairs. It's also soooo bright and colorful which I loooove. ....Has a gym downstairs but I don't use that hahaha. I've only been here a handful of times and every time I have visited I've always been treated with such kindness! (started my membership at the sunnyvale location).", "date": "10/7/2018"}, {"review_id": "fMyNX1H6webEMFE1hn-ypQ", "user_id": "qh2W28cTECBTT43aE_WPRA", "user_name": "Alan D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 6, "funny": 2, "cool": 6, "text": "Jesus Christ. I have to be honest. I think this Planet Granite is nicer than the one in San Francisco... So I'm native to the bay area, and I'm also a mountaineer.Oregon has some great mountaineering objectives. So naturally I have to visit Oregon, specifically Portland here and there. So why do I give this PG Portland 5 stars? Because it's... freaking... amazing...I mean, good lord, there are so many walls to climb on, and it's so varied! AND YOU CAN TOP OUT on certain walls. That's what I'm talking about!The bathroom facilities are extremely well kept and clean. The staff is very kind and will even go out of their way to show you around the gym if it's your first time there.There's also workout classes, gyms, saunas... dude this place is greatI highly recommend this Planet Granite!", "date": "7/27/2018"}, {"review_id": "qaNE-vt2lZj7K3rTH_aHhA", "user_id": "_H5J9PzkSjloFy8rAsQ6BA", "user_name": "Pierre D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "This is such a great gym and is so under utilized, loved this place and highly recommend. I was visiting and used my membership for Planet Granite in the bay area at the Portland location, yay for free gym access when traveling!  In comparison to bay area this location is bigger, newer, and cheaper. I am not sure when this location opened but everything looks new and there is only a slight stinky foot smell, much less than other gyms haha. I was there on a Saturday morning with my date and we were both surprised how few people were taking advantage of this great facility. Climbing is always better when it is not crowded, so this was a real treat anyways. The main attraction is the indoor rock climbing walls. There are tons of trails for both bouldering and belay, much more than I have seen at any other indoor climbing gym (they say ~200 bouldering trails). The belay trails were the highest I have ever seen (up to 55feet)! We did bouldering during our visit and got a great session in.  There are trails of all difficulties, an area where you can top out, some overhangs and a ramp. You might see a rock in the shape of a baby face.Additionally there is cardio and lifting equipment, a yoga studio, and fitness classes to get you moving. Some of the cardio equipment overlooks the belay walls and gives a great view to enjoy while getting those treadmill miles in. Memberships are very reasonable for everything that is included. I did not like that they charge an initiation fee, which just seems like a useless fee. However, their membership cancellation policy is very fair and better than other gyms. There are lockers, showers, and towels. I had a great time at this location and would return if ever in Portland.", "date": "8/1/2018"}, {"review_id": "YwGO3Lsi-TACHiAqZzXsSQ", "user_id": "opdbggrufvUGH8gP9wHL8w", "user_name": "Brian S.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This review is only for the fitness part of this gym, not the climbing portion. If you are like me (a powerlifter, olympic lifter, or CrossFitter, and visiting Portland from out of town), this is a great gym with all the equipment and facilities you will need for a good training session. Let me break down why it's so great:1) The overall facility: bright, airy, and huge. A lot of climbing space as well as fitness studios for classes. Really liked the music playlist. 2) The locker rooms: also big, clean, and well stocked. Lockers require your own lock (this is a good thing I think) and showers are good. 3) The fitness equipment: really, really great. Two large rigs for barbells (squatting, benching, etc) and pull-ups, three concept-2 rowers, two airdyne bikes, two GHDs, about 20 total barbells of various weights with lots of corresponding bumper plates, lots of dumbbells, lots of kettlebells, wall balls, plyo boxes of various heights, as well as a few treadmills and elliptical. If you can't do your olympic/power/crossfit workout here, it's way too complicated. Lots of space for stretching as well.4) Prices: pretty standard for drop-in: around $20 depending on when you come.All in all, a great fitness section to get your lift on when you are in town (and a great gym to join even if you don't climb). Two small annoyances to note (not quite enough to bring the gym down a star, but almost): 1) Even if you tell the staff that you are only there for the fitness equipment, they will still make you watch a safety video about climbing before you can enter. This is a complete waste of 20ish minutes. 2) They don't have any rules stopping people from going barefoot in the weightlifting portion...and lots of people do it...sort of nasty. Otherwise, a great gym!", "date": "6/11/2018"}, {"review_id": "XDSKUzdVGbbgcEZz_vfWbQ", "user_id": "DJZFQrNL2IFu5a-N0f61yA", "user_name": "Robyn S.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "These people were excellent! The claims were wonderful the atmosphere was amazing we love it it's our favorite climbing place in Portland!", "date": "2/6/2019"}, {"review_id": "vjxrKVF2VAIBIPzCCoscUQ", "user_id": "0nDQvUpT4TFKkzHd6kusOA", "user_name": "Matt S.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Sorry for this. They're snobby and too expensive. It's bright and new and clean and in the Pearl. I get that there is an element of snobbery involved with nichey activities that scorn unfamiliar faces so that favorite secret spots don't get too populated. But you work in a gym in the Pearl District. No need to be so aloof and uninterested. It's really too expensive. I want to like it but there are other places that feel better for me. As for the kids, same but moreso.", "date": "4/6/2018"}, {"review_id": "7nNWMY_SiKpu7BuNxlUDMQ", "user_id": "NIVuOgTMUh0k4Z4RsiEAsw", "user_name": "Sammie Z.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is hugely impressive rock gym! They have a ton of routes and lots of options for beginners and experienced climbers.", "date": "12/3/2018"}, {"review_id": "0NoU3ZrOF3B3c2f37Osbdg", "user_id": "PcgtOrx8nNChB__ccEPPDw", "user_name": "Andrew H.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 12, "funny": 4, "cool": 4, "text": "Brand new, large rock gym in the hippest* part of town.  They built it shortly after I left Portland and I'm just now getting around to climbing there during a brief visit.The gym is squeaky clean.  It doesn't smell like sweat and feet.  The facility is huge.  We went during a slow time (Sunday afternoon) and most of the routes in the cavernous facility were open.  It reminds me so much of our brand new gym in Anchorage (Alaska Rock Gym) that I feel like it must've been built by the same people.How does it compare to the Portland Rock Gym (PRG)?- PG is much bigger.- The grades at PG are much, much softer.  I struggle up 5.9's at PRG and cruise 5.10c's at PG.  Who's correct?  Well, outside I usually struggle up 5.9's...if that tells you anything.  Seriously though, the grades are soft here to the point of being dangerous if you're going to transition to outdoor climbing.  Start much lower when/if you start climbing outside!- The routes I climbed at PG were not as inventive/puzzly as the ones at PRG.  The difficulty largely came from how sustained they were, rather than in trying to mentally figure out the moves.- PG makes you use GriGri's.  Personally, I hate this.  I think it teaches lazy belay techniques and poor safety habits.  *get off my lawn*-There are no auto-belay's at PG.  Maybe it's because I'm a loner, but I really enjoy being able to go to a rock gym and do a bunch of laps on a roped, route solo..- There are no slab routes at PG and very few pure-vertical routes.  This is a matter of taste.  Personally, I don't climb overhung rocks with massive jungle-gym-style holds on them in the great outdoors.  I prefer routes that are more similar to what I encounter in the mountains: slab and vertical.  Most of the routes here can be described as \"easy boulder problems with huge jugs\".- The parking situation is a nightmare at both gyms, but it is especially bad here.Where would I go if I still lived in Portland?  I'm not sure.  I'd probably go to where ever most of my friends climbed at.   If I didn't have any friends, I'd pick PRG.*If you're new to Portland, that is.", "date": "5/17/2017"}, {"review_id": "VcpBs3-DRaQRNorXAI-Msg", "user_id": "niu5oV8x84MXZ2XjjTw1gA", "user_name": "Kooter W.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is awesome! I'm a pretty nervous person when it comes to new things, and especially when I see them as dangerous! However, I didn't feel intimidated here at all, and everyone was very friendly. I made it all the way up to the top and felt so proud for overcoming both a physical and mental challenge! PG is HUGE. Even if there are a lot of people in here, it doesn't feel crowded. I love that. Also there is a gym, yoga, and bouldering.100% will be back.", "date": "12/29/2017"}, {"review_id": "ByKNImHdochwk1rofI6Ofw", "user_id": "zWzEwzH6WBGpyrQkvkmywg", "user_name": "Quinn A.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 22, "funny": 10, "cool": 22, "text": "This review is for the beginners, the people who are interested in climbing but maybe aren't quite sure they are able to give it a try.  This review is also for anyone who wants to bust out of whatever is holding them back, whatever script they've been following that says they can't do certain things.  I work about a block away from Planet Granite. In fact, when I get dropped off at work in the morning I drive by and see folks working out inside and I yell, \"Good morning, Graniteers!\"  I don't think they hear me, but it makes me smile. Made me smile so much that I started liking the idea of being a Graniteer myself.  But I've always thought climbing was for skinny people with long, tan limbs and sinewy muscles that flex even when they are standing still.  I always thought that a strong, big bottom gal like me (we make the rockin' world go round, you're welcome) just wasn't built for it.  I've never been able to do a pull-up, wouldn't that be kind of basic?  What did I know?  Nothing.  But the more I looked, and cheered, the more I thought about it.  Then I was at a park in Colorado that had an informal wall with holds, just a fun place for kids to clamber up, maybe an adult too.  I reached out and spidered all over that wall, and someone watching said I did a good job.  It was fun.  Right then and there I decided to become a Graniteer.  I went to the website, checked my calendar and signed up for a four night basic climbing course.  My instructor, Lindsay, is one of those people with energy to spare.  She is very knowledgeable and shares, explains, and demonstrates what is needed with ease.  She helps me feel confident.  She patiently taught us some knots we needed to know, and then said, You got it?  And I'm like, Nope!  And she went through it again with a smile.  I finally got it, and we climbed, and climbed, and she pointed out tips and techniques that made sense.  I could see what she was saying playing out all around me, watching the other climbers.   The other three folks in my group are all very relaxed and easy to know - we takes turns on the belay with each other, and we offer encouragement when one of us gets way up there.  We laugh a lot, and we have a good time. For the beginners and others who read my first sentence and got this far, I say go for it!  Do it.  Break out of your inertia, or programming, or whatever it is that is holding you back.  There is no perfect time, do it now.  And since you got this far, let me praise some other things I like about Planet Granite.  I work out a lot, and I took advantage of having full run of this gym while I was a student (4 weeks).  I really like that there are no mirrors in the 1st floor area.  I guess your work out does in fact count even if you can't watch yourself, quick, go tell someone over at LA Fitness.  The selection of kettle bells, assorted weighted balls, dumbbells, etc is quite good.  I like the mats for my floor work - they are soft on my creaky spine.  It's a climbing gym, so the opportunities to hang are endless and I love them.  Finger board?  Of course.  Bars?  Everywhere.  There is a downside and that is crowding.  During the after work rush hour it gets tight in there.  If you can drop in during the day that is a win.  I was able to jump rope and do my thing without crowding anyone.  And a run on the treadmill doesn't feel like work when you can watch people climbing while you do it. They also have group classes, yoga, the usual.  I haven't had time to drop in on those but I am interested in a couple, such as Prehab - a program to improve stability and strengthen the core.  There is more to know.  Read more reviews.  Visit the website.  Drive by and yell encouragement at the Graniteers.  And if you have even a tiny feeling that you might want to try this, then you know what I say.  Do it!", "date": "10/3/2017"}, {"review_id": "9aOF7_HdXV6rvwrhOhoQPA", "user_id": "cSer36-jfM1hC223DFI1cg", "user_name": "Desiree C.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "LOVE this gym. From the climbing, to the yoga, to the staff. It gets crowded but what cool stuff doesn't?!  We climbed at the \"other\" main climbing gym and never felt welcomed there. If you aren't in the locals group, well, \"you aren't really welcome but we want your money\" was how i felt about the \"other\" gym. But I did love their auto belay. So this gym opened and it was instant love. My outdoor climbing went up two grades by attending a gym that I felt welcomed.  So, people can say the grades are soft etc, but whatever... Climb a harder grade then!  This gym has perfect locker rooms, amazing yoga and fitness classes and above all...awesome climbing.", "date": "6/27/2017"}, {"review_id": "54CNPaxPATZ5WGN-mgu8bQ", "user_id": "N2YGng8TQAXpPfiMInBC2Q", "user_name": "Kristen S.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Chris, the desk guy, did not suck.  :P . (Meant for Chris, the desk guy.)This Planet Granite is the best climbing gym I've experienced anywhere in the world, and I've gym-climbed in San Francisco, Sydney, Rio de Janeiro, and New York.  It's modern, clean, spacious and airy, has amazing natural light, a great variety of routes/fitness equipment/classes, and a pretty sweet little climbing store to boot.  When my boyfriend and I recount the reasons we would consider moving to Portland, Planet Granite Portland is one of them.P.S. The sink faucets with the built-in Dyson hand dryers blew. my. mind.", "date": "8/5/2018"}, {"review_id": "Ggzw4zBRVVROqrUq8V3GgQ", "user_id": "jpIGlAym6z88W2xzHiK5_A", "user_name": "Denise W.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is awesome. Its the biggest climbing GYM in North America. The place is so huge that you basically need to spend a whole day here. The first level, they have a gym with elliptical, bikes, etc and yes the great famous climbing wall. Second floor they have bouldering and top floor is yoga. I am amazed. Not only that, they have a small section store and they have a discount on a set (harness, shoe, chalk bag and chalk) for $128. WOW.I had a great time here. Its a bit challenging. You can't use your own belay device and you must you their own belay gris gris.if you want to lead then you have to bring your own rope. You have to check out this gym in order to see what I mean. I am definitely coming back. I love this place", "date": "2/29/2016"}, {"review_id": "aBLtiZQyy7H3ddJjgWaiKg", "user_id": "shTVQJhu-NftZfRTUxYxrg", "user_name": "Claire S.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 3, "funny": 3, "cool": 3, "text": "You guys in Portland have it SO good with your Planet Granite.Yes, I know the California locations are much older and are full of character and whatnot. But I started drooling when I walked into this location. Let me give you a brief recap:+ State of the art climbing (for both bouldering & top roping)+ Multiple levels to work out on+ A very up-to-date lifting area with brand-new equipment (I would kill to have properly sized plates, instead of the 2 old donated bumpers and a whole lot of nothing else at my PG)+ A clean and well-maintained facility (proof that a big gym doesn't need to be dusty and grimy)+ More than 2 bench/squat racks (seriously, I'm so jealous.)+ Fantastic air flow/temperature controlI know my PG is a neighborhood classic and community favorite and all, but you put the other PGs to shame. I vote the CA locations invest a little money into upgrading a bit (although to be fair, the SF walls are fairly legit).", "date": "10/20/2015"}, {"review_id": "1LVvzahGn12rr4H_FTXvhw", "user_id": "nS8Ex7eqYbEhMdorkVdY2w", "user_name": "Rachel H.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is super friendly, and the place is huge!The upstairs bouldering was very user friendly, and they change the courses constantly.", "date": "2/18/2017"}, {"review_id": "n6F65NmzlZ3m40cai-BO_Q", "user_id": "Ty6IsWg5ve2f7-9dxsUzKg", "user_name": "Root Canal C.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My 5 year old son did the half day 1pm to 5pm drop in rock climbing camp.  I really liked how flexible and accommodating they were.  They allowed us to buy individual days as we did not know how our son would like it.  It turned out that he loved climbing walls.  What 5 year old kid doesn't??  The first day he climbed all the way to the top and was fearless.  His instructor was Kara, a super sweet and patient instructor.  The half day rate 1pm to 5pm is $56.  While the instructor is working with other kids climbing on the wall, the other kids get to play around or do arts and crafts.  Here are things to know:1. Bring food and drink.  They don't provide this and you can buy snacks at the front desk like cookies and zbars.  We were not told this on the first day and had nothing prepared.2. It's not a professional kids camp where everything is perfectly organized and structured.  It's usually a small group of kids 4-6 and one to two instructors.  Kara was a great instructor for Asher as he was the youngest, she would walk him to the bathroom to make sure he washed his hands before snack time.  I really appreciate that given that he's super young and still learning basic habits.  I wish that there were 1 or 2 more kids that were Asher's age as the other kids were much older.  But other than that... it was really great.  Note that I had called Portland Rock Gym before I called Planet Granite and they do not accept kids under 6 years old, so this is how we came to planet granite as they do accept 5 year olds.Thanks!", "date": "7/28/2017"}, {"review_id": "gMWt5QiUnh3XAbpPa2nggQ", "user_id": "4CA-qAu_Pbyn84JcNZnN-g", "user_name": "Samantha G.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 5, "funny": 0, "cool": 1, "text": "I have a friend who has been trying to get me to rock climb with her for the last 10+ years. When I visited her recently, I decided to finally give it a try at Planet Granite.Planet Granite has set my expectations high after my recent visit. Its a gorgeous gym with bold colors and is fairly spacious. Luckily, my friend had a guest pass so all I had to cover was shoe and harness rentals, costing me $8. Not bad at all.Before we jumped into climbing, we did a 1 hour fitness class that I can't remember the name of. My friend thought it would be a great idea for me to take it since the focus of the class is improving proper climbing form. The class consisted of shoulder stretches, planks, wall balls, weights and pull ups. I really like the instructor. She was very friendly, gave clear instructions, and corrected form when needed. It is one of the better fitness classes I have taken so far.After the class, my friend went over the basics of rock climbing. I was impressed with how high I went for my first time. Even though there were a few times I got scared, I had a lot of fun. The fitness class and climb is such a great workout. Its been 3 days since I went and I am still sore!I really wish Planet Granite was in Seattle because I totally would get a membership with this gym but for now, I'll just have to settle with occasional visits.", "date": "2/22/2015"}, {"review_id": "7O-NurUR8R2StfR9covZeQ", "user_id": "Nw_qhJuPSsMmNrfU8mBWUw", "user_name": "Roger M.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 4, "funny": 2, "cool": 2, "text": "In the Pearl a place to hang out. LOL!  Climbing works your core and entire body, in theory. Exercise your mind while you're figuring out your hand and foot hold and moves, like a puzzle, when climbing the wall. Feel the adrenaline hanging out, different then pumping up in the gym Do you want to join a gym. This is another way to train and get in shape while having some fun and challenging your strength and flexibility. My facility tour went well. I'm ready to give it a try, take a class. All equipment, even shoes, provided for the beginner. Lots of classes for climbing and nice engineered hardwood floor in the yoga room, stories high, with views of the Pearl. Lots of exercise equipment for aerobic and light weight conditioning.  Sauna. Prices for a day look reasonable to see if you like it before locking in a membership.", "date": "11/9/2014"}, {"review_id": "SCJ-3RI_70p04byQ0hzq6g", "user_id": "_P8Ur1b-tPqW0-USx960vg", "user_name": "Jordan B.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 1, "useful": 0, "funny": 2, "cool": 0, "text": "It sucks I really wanted to climb here while in town from Eugene for the holidays... but cmon seriously, $21 for a day pass?? That's absurd and unfortunate as you drive people who are not millionaires away like myself. Kind of disgusting you can charge that much for a student to climb for one Saturday... lost respect for the place already.", "date": "12/23/2017"}, {"review_id": "1E6NroDmvvar5-0iQatfVA", "user_id": "QKbq76KuUHLRZjWXDtbwWQ", "user_name": "Jess R.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "On a recent visit to Portland, my brother and SIL brought me here.I'm in love.It was my first time climbing, but I always wanted to try it. The staff were incredibly helpful, there were lots of options for a completely new person, and all of the people who were there climbing were really helpful and supportive. I wished I had a Planet Granite in LA, I'd be there ALL of the time!Not only was the vibe and climbing walls amazing, they also had a regular gym as well. Weights, treadmills, elliptical machines... This is the exact kind of environment that I want to have to work out in. This would, without a doubt, be a regular place for me if I lived in Portland.I look forward to my next visit already, and the positive experience here has inspired me to check out my local climbing gyms. (Not of which have stacked up yet!)", "date": "5/4/2017"}, {"review_id": "e9exz4YlQkI9SDBrnteqsg", "user_id": "JQx4W4LjrmAAdox1GbvEYg", "user_name": "James G.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I really can't say enough good things about this gym.  It's like a Disney Land for climbing.  One of the nicest climbing gyms in the U.S.  Super clean and high-end facilities.  I love the training area.", "date": "9/21/2017"}, {"review_id": "-I_zS6JGg9_aCELyffA0hQ", "user_id": "SzT7YehmEo8huCfWgWMOnw", "user_name": "Joshua P.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Best route setters in PNW ! Great community of climbers, the staff are always in a good mood and put out great vibes!", "date": "12/22/2017"}, {"review_id": "OUBYP2XKmcdjc7GHW8kNjQ", "user_id": "l7-9ruxojvNRFT0T6F18Hw", "user_name": "Andy F.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is great!  Solid bouldering upstairs, top rope climbing for days, plenty of fitness classes, lots of gym equipment... I could go on!If I had a criticism, I'd say that it's pretty packed around peak hours which is to be expected.  That said, they're open for like 19 hours a day, so if you can find some time, they're probably open!", "date": "10/18/2016"}, {"review_id": "AFfklbMyYnd25xNi-aWPMA", "user_id": "X568BojbbH6cAxqXU5zLwA", "user_name": "Ophelia Y.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "I've climbed both here and Portland Rock Gym, and if you're trying to figure out the difference, I think we've got it figured out. I've only been climbing for 2 months, but so far, this seems to be the common consensus among our climbing group.At Planet Granite, you'll find the routes to be graded a bit easier. They require more strength and endurance instead. The holds and the walls are newer. They have a large weight training area. They have some higher walls, and a great spot to practice overhangs. The place is corporate feeling and the staff don't make much conversation. It's more expensive than PRG. They provide you with belay devices when top roping. I've successfully climbed 3 5.10cs here.At Portland Rock Gym, you'll find the routes to be a bit more intricate--they will require more technique and creativity, and you will rarely ever find yourself sprinting up the wall. They have auto-belays. The staff are warm and friendly, and it feels like you're supporting a local Portland business. I climb a pretty solid 5.9 here.So the two are fairly different.Planet Granite is great if you don't have a regular gym to go to. It's also great if you travel to the Bay Area since they have some other locations. The place is new, has a sauna, and is large and well lit. Memberships are on the steeper side, price-wise, but it's a great option for people who like climbing!The one downside is having to watch the bouldering video and no auto belays.", "date": "11/17/2015"}, {"review_id": "lJLJBwLYmKyg586OgS9txw", "user_id": "aS8WLWfq6zmYtcDMHJXoqg", "user_name": "Patrick F.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "A shiny pretty gym with great facilities that is absolutely ruined by crowding. Even with the discount for a family membership, it's not worth the money. Peak hours of 6-9 am and 4-8pm are essentially unusable-- you have to wait for a rope, elbow your way into the locker room, or wait for cardio/gym equipment. This winter the crowding became much worse, which simultaneously the gym scheduled workout and climbing classes during peak hours. As of this review, five of ten treadmills are broken and have been for weeks, simply from overuse. Repeated requests to increase the number of stairmills (2) was met with the suggestion to come during the day or return in the summer when the gym would be less busy, or to hire one of their trainers instead to learn \"equivalent exercises\". We'll be looking elsewhere for a gym and I encourage you to do so as well.", "date": "4/6/2018"}, {"review_id": "plynti66-GLcFzhh5cwZOw", "user_id": "X05SmFFo05zYlrhMV5q72A", "user_name": "Rudrajit D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely loved this climbing gym. For first timers like us, they had so many different courses to choose from and gradually go up the learning curve. Always filled with people and a high energy place overall. Friendly instructors aplenty, patiently answering questions.", "date": "4/17/2017"}, {"review_id": "7Ux6wXt4U5V7OOrO50ogVQ", "user_id": "mzYJUd80NNy-EK4lVeGd0Q", "user_name": "Toni D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I absolutely LOVE climbing at planet granite. It's clean, bright, & fun environment. There are great staff and members who are overall friendly and kind. I appreciate the sauna, showers, and towels as well. I really like that the routes are all one color as oppose to using colored taped to label routes. I can't think of anything that I do not like about it! They seem to be always open too! Climbing during the snow storm? No problem!", "date": "1/17/2017"}, {"review_id": "R4fDHSgqbpa1jlbEnWKBbA", "user_id": "PNUFy6p2nrUVJQ4jXtksvg", "user_name": "Luke M.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "PG is absolutely the best indoor climbing gym I've been to. The route setters do a great job working different styles onto every wall. They lift up garage doors when it's hot to let in fresh air. I left a three star review because I had some not great interactions with staff. Since then staff have been super friendly and helpful. Gotta chalk it up to them being human and probably not having the best day. They deserve five all the way.", "date": "3/27/2017"}, {"review_id": "4V5y_wVS7jpttFXis6hNfQ", "user_id": "RHMp5UHil7zhoNHMEHG-ow", "user_name": "Kim H.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "This is an INCREDIBLE gym!!!!!!!  I had been climbing outside all week while on vacation, so I was hesitant to go to the gym, but I am glad that I did.  I spent about 4 hours in here climbing, and I was so sad to have to go back to my crappy hometown gym.  From the moment I walked in I knew this was an extremely well kept gym.  So many routes to choose from from top roping, leading, crack climbing, bouldering, etc. a really top notch, state of the art gym for sure.  I did not know where to begin!!  There are saunas in the locker rooms!?!?  And you open at 6:00 am?  The bouldering area left me in awe too.  The workout area was top notch and very clean too.  And the temperature in the gym, wow.  They really did not cut any corners with this gym!!!!  In the words of Napoleon Dynamite \"LUCKY!!\"The only thing I hated about visiting Planet Granite was knowing that I had to come home to really crappy, unkept gyms.  Man what a huge disappointment it has been to be back home.  Next time I'm in Portland, I will be back and will definitely spend more time here.", "date": "8/10/2016"}, {"review_id": "8kpCL_XkzhLVhSLqVjjIPw", "user_id": "YlD58ZlQ1shkgvpnR2bjmw", "user_name": "Andrew Z.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Hands-down phenomenal climbing gym. Clean, well-kept facilities, wide range of difficulty levels for both bouldering and top rope, and very entertaining problems. The bouldering area has two things I haven't seen in other gyms: a section where you can top-out and then walk down from the top of the bouldering wall, as well as a long inclined section that is as long as a top rope pitch but the mat rises with you. It's perfect for practicing long inverted routes without the need to lead climb! It wasn't crowded at all this Saturday, so my brother and I had our pick of whatever routes we wanted all morning. Can't wait to go again!!", "date": "9/2/2017"}, {"review_id": "R0c_FhoUyuzyostpN_giLQ", "user_id": "HMvdVEZ_1L1LGo6rz1pEPg", "user_name": "S S.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "A really nice kiddie bouldering wall with the whole alphabet, around 30' long with various degrees of difficulty.  It would be better to have more of a separation between the kiddie bouldering and the belay portion.Really nice facility with towels and a workout area and multiple layers of walls/bouldering.It would have been nice to have bigger grips on the bottom 3 feet so that the 2 year old could grip more.", "date": "9/5/2017"}, {"review_id": "dF8mjaq00kZQKkJ2SpUkOw", "user_id": "Tp0KPjGUWh3z6z4T09HCEw", "user_name": "Melissa N.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 5, "funny": 2, "cool": 2, "text": "I normally climb at Seattle Bouldering Project and was visiting Portland for Christmas break and thought to try out this new gym! I hear it's super popular in California and I was excited it was making its way up north. I have been drooling over the pictures and in awe of how enormous the gym seems. It's located downtown, but in a less crowded area, so you could still find some free parking if you look carefully.Upon walking in, you can sign your waivers and pay at the desk. You are greeted by the massive, tall walls where you can top rope and even do some lead climbing. What I really like about this facility is that there is a separate area to take the belay test. The places I've been to, it's just at a place where you can climb on the wall. There are sooo many routes that loop around into rooms with even more routes. I've climbed in Seattle at Stone and Vertical World and I must say the routes here are quite long. I got pooped after one! I like that the routes are numbered with which rope you are supposed to use. There's also a shorter wall for kids to climb with easier routes. I mostly boulder indoors and top rope outdoors, so I was impressed with the bouldering area. It's located upstairs. They have a pretty decent bouldering area with \"the wave\" that juts out where it's more overhung. I've noticed most of the walls have some sort of slope or curve to the wall to add dimension to your climb. There are some parts of the wall where it's completely vertical. There is also one top out boulder. The most exciting part of this area is the underhang part that has a 45 degrees incline. There are mats right below you so if you fall, it's not a long way down. SUPER fun spot. They also have a large area to work out in with several treadmills, weights, hang boards, etc. They also have more machines upstairs. Lots of variety to mix up your work out. I noticed that people come here primarily to top rope. They also don't change their bouldering routes that often. I noticed routes dating from when the opened and not many newer ones were put up. I don't know how their schedule works. Their selection of equipment (bags, carabiners, crash pads, helmets, etc)  is also impressive. It's comparable to online! They also have a wide variety of shoes to choose from. Compared to REI, you have quite the selection here, with a lot of different sizes you can try on. The gym is very clean, colorful, and large! Needless to say, I will be back!", "date": "1/7/2015"}, {"review_id": "c7cbLe5sCAFPTQApZIfrJA", "user_id": "-zqGTvnQt9IFgTsUvuYcSw", "user_name": "Mahsa K.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 17, "funny": 5, "cool": 14, "text": "State of the art, new climbing gym in the Pearl. I have been tracking this place for almost a whole year, marking their progress and waiting for their doors to open. I am so excited to say that time has finally come!Following the footsteps of their amazing legacy gym from San Fran, they know exactly what they are doing... in fact, I think this is the company's 4th gym nationwide. They put a lot of time, money, and thought into every bit of construction of this fantastic place. They have weights, cardio equipment, 55 foot rock climbing walls, hundreds of bouldering problems, a yoga studio, a spin studio, and a sauna. There is definitely something for everyone in this world-class over 30,000 square foot gym!The managers and staff are so nice and so excited for this place to open just as much as the public. They had a couple preview nights for avid fans to sign up for memberships early and take a sneak peek of the place. It was jaw-dropping. I have climbed at one of the biggest gyms in the country (Earth Treks - Bethesda, MD), as well as a lot of smaller ones. This place is Grand, capital G, Grand! It's like the \"Equinox\" of CLIMBING gyms. The locker room walls are gorgeous, they might actually be made of granite. Tons of day lockers, several bathroom stalls, and individual showers. Towel service included! Just try to only use one and don't abuse the towel availability for everyone else, unless you need a clean one post-shower, before entering the sauna, then by all means keep hygienic. They also have these cool sink faucets with built in Dyson hand driers (yes there are paper towels available as well), but what I really appreciate is the built in lotion pumps by the sinks. Great for those post-climb dry hands. Brilliant foresight, thank you Planet Granite!!!They don't have their own parking deck which is a bummer, but there is a decent amount of street parking since it's more on the edge of the Pearl neighborhood bordering the still developing areas of Naito Pkwy. Short walk to park, or short walk from where the street car takes you and you should be okay. Their rates, relative to their spectacular-ness, are unbelievable. Right now, for a couples month-to-month membership (which is obviously what I got) is only $55 per person! That is RIDONK!!!!! Speaking of Equinox, high class gyms of any affinity usually are over $100 monthly memberships per person, so think of it that way! It's a sweet deal, in fact they could've charged more and we would've still done it. This place is sick, totally worth it! You can tell how much money went into the place with the exquisite route setting. They obviously had enough dough to shell out a plethora of holds so they could have all matching-colored holds, despite changing them around all the time, so they didn't have to fuss up their beautiful walls (signature 3D styles by Walltopia) with so many different colors of constantly-removed-and-replaced masking tape.I could go on and on about how much this place is (pun-intended) ROCKIN', but actually I'm afraid too many people will come and crowd me out... hehehe. Seriously though, I fear for PRG, they are so going to lose some business. Source should still be safe though cuz not all people want to drive over the bridge to climb. To each their own... me... I think I found my local place.", "date": "10/30/2014"}, {"review_id": "gXV6OYBxUuy26f_14gaLEw", "user_id": "_SVfoi3YUFNHswsfZUO9mg", "user_name": "Mikey U.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 13, "funny": 5, "cool": 7, "text": "I have to admit, Portland, I'm a little jealous. You already seem to corner the market on brunch, beer, and boobs, but now you're home to one of the coolest climbing gyms I've ever seen!I mean, there's no love lost for the climbing gyms back home - each one has their niche and character, their grandiosity or their homeyness - but Portland PG has to be one of the sleekest environments ever; newness and fresh coats of color and gleaming finish might have contributed to that excitement, but the thorough, thoughtful design of absolutely everything, from rock-walls to washrooms, make this newest PG feel like it's many peoples' passion made real.\"... indoor climbing is never going to be rock climbing, so why try to make it look like rock?\" - Chris SharmaThe [Triangles?] Walltopia system all through the rope & lead climbing area have a modern, vibrant look and add variety to towering 55'+ ascents. The bouldering areas offer some exciting features like top-out walls for those that like to stand atop their conquests and a ramp under a lengthy negative wall for all of you overhang climbing gluttons [me]. The weights and cardio amenities should be sufficient to occupy most circuit trainers & fitness freaks.Route-setting runs the gamut from straight-forward, muscle-y ladders to funky, body-mechanic engaging, balance tests. Like anything, what's been set and how it's climbed is subjective and a matter of personal process and ability. Sometimes cerebral, sometimes daredevil, find your way and have fun with it!*While this newest PG is fresh and new (for now), it's great to see some familiar faces from PG Sunnyvale manning the staff and that they've brought their welcoming and friendly vibes with them! Mmmm. I could almost move to the Pacific North West if everywhere vibes as positive and laid-back as Portland and Portland PG. Very much looking forward to coming back!_____________________________________________*Knocks, but not really: already, even on opening day, elitists (of which I am so glad there were only a few) scoffed at the presence of so many newbs and \"soft\" ratings - that routes were graded harder than they should be. To that and them I say STFU; we get it, we get it, you're an awesome climber and you need to qualify that. Blah blah blah. F*cking snobs, calm down; let excited new climbers be excited. Dear newbs (myself included): just read routes and try them - don't let a rating determine whether you think you can or can't try to send something. Go after it.", "date": "11/7/2014"}, {"review_id": "D3tUTxzdASp7bzk0dapUdw", "user_id": "zHqOkEr4shzHhpG7qRUFkw", "user_name": "Amy D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Such an amazing gym. Super nice staff. Very thorough safety checks. Very automotive. Yoga teacher was one of the best teachers I've ever taken from. Routes set were great and not sand bagged.", "date": "4/22/2017"}, {"review_id": "AWwywCXPBk3b0Y2v8TSwRg", "user_id": "ymiohz-DlNLHGAlXbVhw5A", "user_name": "Sudipto G.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Disclaimer: this was my first time doing rock climbing.Went here on a weekday night to give rock climbing a shot with a couple of friends. Said friends knew how to rock climb so that was good, otherwise you have to take a lesson to learn how to belay before u can hit the walls, should have looked that up before I got there!Its pretty reasonable in cost, $24 gets u unlimited rock climbing with all the gear u need. The walls looked like they had a good spread from the easy to the extremely difficult. They have a bouldering gym too on the first floor. Nice cheerful place to check out if you like rock climbing.", "date": "1/31/2015"}, {"review_id": "31wtaI1PrDeR70iP7TxF4A", "user_id": "1FFgI8DzatqbcJhIne45Vg", "user_name": "Mary D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "What a beautiful gym! I just started climbing this month and I already got a membership to this place. I've been experimenting with other gyms such as The Circuit (all 3 locations), Portland Rock Gym, and Stoneworks. Hands down planet granite was the best one in my opinion. It has both top roping and bouldering. It's beautiful and it's for a relatively decent price (I have a student membership so I'm paying $54 a month)Membership perks: you get a guest pass every 2 months (it doesn't roll over so be sure to use it) but you can sign up to 2 friends a day to take a belay lesson for free! Belay lesson + day pass + rentals (shoes&harness) = 28 dollars originally but it's free if you have a member sign you up for the lesson. Definitely a great way to introduce climbing to your friends, without having them to pay. All they need to do is take the lesson for an hour and they're free to do whatever they want in the gym. I really like how the routes are all one single color and not labeled by colorful tape unlike the other gyms. I notice they change the top roping routes more often than the bouldering routes. I also notice the routes here are harder than the other gyms. A V1-2 here would be a V3 at one gyms. Great staff. Easy to point out, they all wear light blue t-shirts. Looking forward to develop my skills as a climber here. The only downfall for me is having to pay for parking. Paying to park sucks in general but paying for parking and having a membership can add up. So either go at 6am till 8am or after 7pm to avoid paying for parking.", "date": "1/31/2015"}, {"review_id": "Qsf5f2ATxXjzgbO7NTsSMQ", "user_id": "eyjf9a2iXa3JbYUwh8GO9w", "user_name": "Shannon M.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I HATE customer service people. I hate being waited on. I don't like it. I'm that guy. Now that you know me let me tell you how much I LOVE every person who has helped me at Planet Granite. These guys are no bs, super cool, and are so good at getting you excited about climbing. Cat did our climbing class and Tiffany did our test. They were both so cool and remembered us like a week later when we saw them. They made us feel welcomed and answered any questions we had. This place is rad. Nuff said.", "date": "6/7/2017"}, {"review_id": "5QIXzyxwaKyR_M1PRD6B9A", "user_id": "pvd8arxkQT8B3fwapvMbVQ", "user_name": "Linda N.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 1, "funny": 2, "cool": 0, "text": "I was here during opening weekend. It was a bit of a cluster because there were so many people there, but place is definitely awesome. I interacted with a few staff members and they were all really nice and helpful.I'm not a seasoned climber, so I can't comment much on climbing here compared to other places, but here's some pricing info.:Reduced introductory pricing until the end of the year. These prices are valid until 2016. Go check it out and jump on it if you're interested:Individual: $67/mo. or $737/yr.Student: $54/mo. or $594/yr.Family of 2: $110/mo. or $1210/yr.Membership includes access to all four PG locations, yoga, gym equipment use, etc. For more info:planetgranite.com/locati…", "date": "11/8/2014"}, {"review_id": "QqCcPHGNpAkKYHex8py6nw", "user_id": "Gh6dkzmGTs-CU2a69EtKOw", "user_name": "AJ D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I've been living in Portland since 2008, and since then have been looking for the mythical climbing unicorn that is an \"ideal\" climbing gym...Some of the many things I look for in a good climbing gym; - friendly staff that you can chat with. - Not feeling like everyone treats you like a complete climbing newbie.- Feeling like even newbies are safe and well cared for.- wide options. i.e. good range of difficulties, types (overhanging, crack..)- friendly folks- good workout facilities.- cleanliness - lots of chalk, lots of dirtbags = hard to keep clean.I started going to Planet Granite about a year now, and I can honestly say I've found my Portland climbing home. One of the difficult things to really pin down with gyms is an attention to routes. This means consistent route updates/changes, but also it goes beyond that. A good climbing gym has good route setters, and route setting is a mix of science and magic I think.So on top of the list above, which Planet Granite has nailed, they also have the route setting wizards. These wizards equally attend to the bouldering area as they do the sport climbing routes.Much better though they've got an amazing workout area, friendly and warm staff, and lots and lots of great people to share belays with. I love PG, and am happy to have found a place to set down my climbing routes.. I mean roots.", "date": "11/12/2015"}, {"review_id": "HwQYqgK_iltaF6otC-pB7g", "user_id": "ex5zPYeDVITjsLmoAQhATg", "user_name": "Matt H.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "This might rank as my second favorite place in Portland behind Forest Park.  I joined having never climbed before but have really come to enjoy it over the past year or so.  Lots of routes whether it be for top rope, lead, or bouldering so even when it's busy seems you rarely have to wait for a route.  M-F 4-8pm seems to be the busiest time.  The yoga classes are nice (and free) as well.  Just a few cons.  It's not cheap.  I wish they did guess passes monthly rather than every other month.  The weight area gets a little packed when they have a class going on.  For the most part, there aren't mirrors in weight area so I can't watch my form.  Too many dudes climbing and working out shirtless since the don't have a \"policy\" requiring shirts (I guess this might be a pro for some, but it makes them look like tools).", "date": "3/7/2016"}, {"review_id": "xuFm5obdOVHUCpW7tVMh_w", "user_id": "KdvF4hhsMqxe47yiS1netw", "user_name": "Robyn W.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 2, "text": "Great gym - lots of stellar routes!  Friendly staff!  Do you need more??", "date": "12/19/2016"}, {"review_id": "LoEfuVLTQ7YxHGlUNaqoJQ", "user_id": "M0CzekXEz2LSOqUmnAXzlg", "user_name": "Scott P.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 6, "funny": 0, "cool": 1, "text": "I've been to rock gyms all over the country and internationally, and this is one of the best rock gyms I've been to.  The biggest differentiators between here and other gyms you'll ever go to: This is clean, it has a legit weight area, it has a sauna.The dozen other reviews talk about the climbing, so I'll just discuss the weights.  The weight area has 5 racks you can configure for benching, squats, or anything else with a bar.  The weights are the bouncy colored type so you could go full olympic weightlifting and do cleans and drop the bar.  The dumb bells go up to 100 lbs.  There are two cable machines.  There are various bars and handles for the cable machine.  There is a hamstring machine and leg press machine, but admittedly both feel awkward.  There are no mirrors (I've seen one guy actually bring his own mirror to the gym).  There are big windows that are usually opened up for air flow.  There are some rowing machines, running machines, and assisted pull-up machines.  There are tons of bars and hangboards around to do pull-ups and practice finger strengths.", "date": "6/3/2015"}, {"review_id": "NtCKwOy5yhAgrOReulgtew", "user_id": "lnvSwmL_wNDsNb2s9ctLug", "user_name": "Johanna F.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "This is probably my favorite climbing gym I've been to. Not only are the routes color coordinated by the holds, they often change and also require a variety of technique to accomplish. The staff is always smiling and stoked to help you answer any questions or give advice. They facility is incredibly clean and well kept (it is brand new). I've also witnessed their classes for both adults and children. These guys take climbing seriously but make everyone feel welcome in participating. It's a great atmosphere. There is also an epic bouldering area. Bouldering is not really my forte but lots and lots of bouldering, a whole floor!My only gripe with the facility is that there are no auto belays. I can't always get to the gym with a parter and sometimes really just enjoy going it alone. There are many resources for climbing partners but I'd rate this place 5 stars if they had auto belays. Even if it were just a couple.", "date": "3/29/2015"}, {"review_id": "PAGblV8b6e2n2ruiVPKbCA", "user_id": "ALpVoayua4CclgPu7xx6EA", "user_name": "William C.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 7, "funny": 0, "cool": 0, "text": "Great facility! Having both bouldering and top-roping options under the same roof is great. The climbs are color coordinated making it easy to distinguish between routes. The base floor workout area is spacious and filled with new shiny equipment (treadmills, stationary bikes, elliptical, rowing machines, there are more machines on the 3rd floor).I also tried out the power yoga (studio on the 3rd floor) and two F10 fitness classes. They offer a great workout alternative and are included as part of the monthly membership. My partner went to a spin class which was held in the group fitness room on the 2nd floor.Sauna, showers and towels in the bathroom. Signed up for the introductory pricing at the family rate of $110 for both of us. Amazing deal!", "date": "11/20/2014"}, {"review_id": "aKIAK9fhaTNantKrDe9BGA", "user_id": "-O_LA1DfigqdSoeHsd5YrQ", "user_name": "Lisa L.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Another great climbing gym.  Our home gym is PG SVL, so it was quite a thrill to visit this spacious gym in Portland.  It has all of the look and feel as home, right down to the bathroom tile.  If you enjoy climbing, this gym is top notch.", "date": "10/29/2015"}, {"review_id": "xo3pv4YbJAHtEzaD5eZDiQ", "user_id": "akjoFTD8mUVTGbN8Eo-zgw", "user_name": "Michelle L.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "This is one of the nicest rock climbing gyms I've ever been to. Everything is so fresh, shiny and clean... because it's brand new. But still -- there are others ways you can tell that this is a great gym. For instance, they've got garage doors on the bottom AND top floors that will open in the summer to let fresh air in -- crucial for rock climbing gyms, since most tend to be in just barely-ventilated warehouses that heat up fast the higher you climb. And they've got a TON of other fitness equipment, all top of the line stuff like Rogue brand pull-up stations, Olympic bars, weights and even medicine balls for wall balls. It's wonderful. Also, they have towel service!!! The routes themselves are also well planned and more thought out than that of Portland Rock Gym. They use the Yosemite Decimal System to grade climbs with more granularity than PRG (Planet Granite does stuff like 5.10 A/B/C/D, whereas PRG only does 5.10+/-), and have a wealth of different grades. It's also definitely more beginner friendly, with a larger variety of easy routes (5.6-5.9) for those just starting out (in contrast, PRG only ever has 2 or 3 of those types of routes).The only downside is that it's super corporate. There's a surprising amount of red tape to go through before you can do anything. Signing up for the family plan with a partner means you have to show proof of the same address (or have the same last name), and you'll need proof of a current ID before you do anything else. Parking can also be a hassle. But aside from that, I've no complaints -- all the high quality routes and equipment more than make up for those annoyances.", "date": "11/12/2014"}, {"review_id": "uB4EDs18rY6Ee6965Hr3nQ", "user_id": "SR7TgIBpvLFslv0z_zxWTw", "user_name": "Cutthroa T.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Probably a top 5 gym in the Country, at least top 10.The routes are a bit soft, but that will likely change with time, especially considering how un-soft the real rock is in the Portland/Bend area.The route-setting is top-notch, the angles were very well thought out, the Cracks are the absolute best gym cracks I've ever seen (besides the other Walltopia cracks at Momentum in Salt Lake City), and the people are generally friendly and polite.Thank god there is a place to hang in Portland when the weather blows, like when I'm visiting family for Christmas.", "date": "1/28/2015"}, {"review_id": "-YnaEUgPrksnmxZwnXytcQ", "user_id": "JuhkRE8QwxQe37i1T25Kxg", "user_name": "Melissa D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing climbing gym!!! The routes and bouldering areas are very well done. I love the features and the setters (esp Mitch) are awesome. Went to a yoga class which I didn't like at all, but the climbing itself is awesome.", "date": "6/3/2017"}, {"review_id": "E5CE8Y1_M33HzBtFiFOzHQ", "user_id": "3R2ITWMWYTr0BzICOocagQ", "user_name": "Justin B.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the best indoor rock climbing experiences I've had. The routes were varied and natural. The staff was pleasant and professional. Outstanding facility.", "date": "5/20/2016"}, {"review_id": "PfvTWFOlZBV7c0Hd2rNwWg", "user_id": "DF103-6ADovugggsRc3DEg", "user_name": "Adam C.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great for top rope and bouldering. Routes are decent and the features are really great. Well equipped gym and yoga too. If you drive, you'll have to pay for street parking. But it's an easy bike ride. Lots of rules in the gym.", "date": "5/15/2016"}, {"review_id": "Qm2GyCxxaFueZZwVnCIMUA", "user_id": "TgSVHYFgeHH-d3VTU0LWHw", "user_name": "Clayton P.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best place to climb in Portland year-round! Very clean facility with up beat staff. I like the long roped routes, but the bouldering and workout facilities are also huge. Yoga classes are surprisingly high quality in my experience. Plenty of cracks to challenge everyone. Huge leading area. And it's nice to take a shower post workout.", "date": "4/19/2017"}, {"review_id": "IvZrFxkdKOwCwadv38iQ9w", "user_id": "8RGcR9THTF8XwpH09iE3sg", "user_name": "Alex M.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I think this gym is amazing. My only complaint is that the yoga classes are pretty hit and miss. I feel like some of the instructors are new to teaching or are not really committed to yoga. Other than that the facilities are mind blowingly good, the staff are great, the people are friendly, and I have never even come across a climbing facility that robust. I realize that it is a climbing gym, so for most the yoga wouldn't matter much.", "date": "4/29/2016"}, {"review_id": "s96TM1_flYtgnTFRnXNJLw", "user_id": "xg-_FzsSh8GY3lZfs7hNOA", "user_name": "Jess H.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic Gym!!! The routes and boulder problems are by far the best in the Portland Metro.  The gym is super clean.  I LOVE that you also have yoga and tons of other classes included with your membership.  The only downfall is the 6pm closing time on Sunday, 8pm closing time would be pretty amazing.", "date": "4/10/2016"}, {"review_id": "7ASjdvdF04vALSCiHCNM0A", "user_id": "bjZu25QDY8Xe4Wgjm6p5bg", "user_name": "Antonio G.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I recently broke two tarsals in my right foot and I got a severe sprained ankle and I needed to use the boot for recovery. I was afraid that my climbing level could decrease quickly. So, I decided to ask someone at the front desk what kind of exercises to do. A friendly guy guided me to talk with Matthew Hopkins, a Certified Personal Trainer. Matthew was very kind, friendly and helpful with his advise. His professionalism was outstanding and I appreciated his time.", "date": "4/7/2016"}, {"review_id": "-mjPvI032G-02T7WagSncg", "user_id": "muqinR954zd7hyP0QckDmQ", "user_name": "Daniel C.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "This place is the bomb.  Great indoor climbing, tons of options for both ropes and bouldering.  Great strength training area with basically a full crossfit gym inside.  Nice bathrooms, dry saunas in each, and showers.  The water pressure is pretty anemic in the men's room; but I'll give them credit for being newly built.  We LOVE this place and are members.", "date": "12/12/2014"}, {"review_id": "MUXZL3wW-p5QkAeXm6p1oA", "user_id": "U9WNSWzPQ6bDPqOA9q91Kg", "user_name": "Rickie Lee T.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 3, "useful": 2, "funny": 3, "cool": 0, "text": "Planet Granite is an amazing facility with more luxury add-ones than Portland's other climbing gyms; they've got a sauna, towel service, a huge amount of workout space, and tiny lockers for valuables. It is the pearl district, however, so maybe this is just par for the course for their target customers.The whole operation is a bit corporate for my taste. I find it bizarre that one can't purchase a month pass mid-month. I went in on the 11th assuming that my month pass would be valid until the same date the following month. Nope! Somehow their billing cycles can't accommodate this, so you have to pay until the end of the following month and then there's a process involving some forms and a voided check that will allow you out of the contract on the desired date. Priced slightly high for Portland gyms, but reasonable once you consider pearl location and aforementioned amenities.There are events for \"swingers and singles\" with Coldplay rocking the system in between PA announcements for pizza and raffles. I have no clue if this is a standard thing, but there was a lot of PA action both times I went, which made me feel like I was at some child's roller rink birthday party.Bouldering and top rope routes generally super fun and interesting, with a good amount of variety. It's true that all the routes are soft in terms of rating. So your ego will feel good climbing a whole grade above what you typically do!", "date": "12/11/2014"}, {"review_id": "qbps6LAVjFreRiMC4YoMJQ", "user_id": "zv8zJXDjz7WJ_YWzh5ENww", "user_name": "Daniel B.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Amazing climbing, just top notch! Lots of variety with steep roofs, some cracks, face climbing and bouldering. Great price for the monthly pass. The downside is that it don't have the vibe of a community gym. It feels very corporate and flashy, but not exactly friendly.", "date": "2/21/2015"}, {"review_id": "m-QVQoYq-fk7FlrhQv1adw", "user_id": "OJsHWM2DUJJF7r4bFnr2Yg", "user_name": "Skinny D.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Beautiful, huge, brand new gym.  What most climbing gyms should work to emulate.  The only detractor is the lack of autobelays.  Also, the texture of the cracks is akin to sandpaper.  Should have been smarter than to go into a gym crack sans tape or gloves....but alas, my IQ is less than my age.The setting and monochromatic setting are awesome.  Angles of the walls are ultra modern.  The ramp feature for bouldering is fantastic, as are the top out walls.  Throw up some auto-belays and this place is the Shangri-La of climbing gyms!", "date": "7/10/2015"}, {"review_id": "0xwhVYCNJwUOz22xE6qGyw", "user_id": "9bLzuDSGOtwU2dvi0zPMfw", "user_name": "Eric H.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "Great facility with a good mix of lead rope and bouldering routes but not where you want to go with your family. They have too many arcane rules restricting younger climbers. They blame it on the lawyers, and as a chain they have a corporate mentality. Not necessarily a bad thing but the rules don't make sense. Climbing safety and ability are not age-dependent. There are plenty of teenagers and younger who could teach some of the adults a thing or too about belaying safety, not to mention climbing technique. Other Portland gyms are less short-sighted and get this.", "date": "2/25/2016"}, {"review_id": "Pf5prFZoNfocnbHR533QhA", "user_id": "7lHCMMFoGgCf8FxfH4J_8Q", "user_name": "Jacob H.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 5, "funny": 0, "cool": 0, "text": "Absolutely stunned by what this place offers. Best rock gym I've been to, plus incredible bouldering area, plus a killer weight and cardio room with free classes, plus free yoga, plus a suana. It really sells itself.", "date": "11/10/2014"}, {"review_id": "X1WJArLaMVAqpAe9sDz6zQ", "user_id": "0m2Z9ga5EKMOxWVEvrs5wQ", "user_name": "Hailey A.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The gym is big and wonderful, some really cool walls. However their route setting is really soft especially for sport climbing. Bouldering grades aren't as bad, but top rope and leading you can climb so much \"harder\" at the gym because they are a tad undereducated when it comes to what a real 5.11 is. It gives people false confidence which will bum you out and make you climb stuff much lower in grade when you go climb at other gyms or outside.", "date": "9/24/2015"}, {"review_id": "Z0SjnDr8gXeEiMc75NOITw", "user_id": "ZDBKOigECjQSpEPhPxEodA", "user_name": "Teran M.", "business_id": "6hOQqQa5yK9son4ZKUKoFg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Amazing!  I learned to belay at Planet Granite down in the Bay Area.  Their newest facility in Portland lived up to both my memories and my high expectations of what an indoor climbing facility should provide.", "date": "1/28/2015"}]