[{"review_id": "sc6ZGnmqoCugKzYmkfx9-g", "user_id": "xiZ8pb5wQJ7yUNz75URsKA", "user_name": "Andrew T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "The first time I started climbing was at this location and thought it was really fun even though I wasn't able to finish V0. At the time I was afraid of heights. That fear hasn't gone away. TIP: Just go up until you are done. At least when I've been to this location, it's rarely ever crowded which is great because my home gym in Sunnyvale feels like Disneyland. The lines can get long when waiting for routes to climb or even bouldering. This location is a bit smaller but never did I have to ask if a person was switching or not. That was nice for a change. There are two bouldering areas and the fitness area is all upstairs. I've taken the yoga classes here and I really like taking it with Nadia. I use to go to Doris's classes too at Sunnyvale, but it's hard getting up for that 6:15am class. However her core yoga class is great for the hip flexors. Never noticed how helpful it was until I got on the overhang walls.PARKING: Street parking or if you go down a block there's a parking lot on 43rd ave.", "date": "4/25/2019"}, {"review_id": "2qpyPL3I4vaEMN0RWMz0-g", "user_id": "BnywXOmsaeNYIKJQWaQIlQ", "user_name": "Sharon Z.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "This is an updated review for the yoga classes. I used to be snobbish and sworn to only go to dedicated yoga studios. After I went through teacher's training last summer, some of my yogi classmates highly recommended trying out a few classes at PG. I took Nadia and Doris classes, oh dear, they are not for the faint hearted! These yoga classes are geared towards conditioning the core for climbing, target strengthening of climbing muscle groups ( e.g. hip flexors, glutes), as well as functional movement patterns that mimics climbing. I come out of these classes more broken (in a good way) than a hard climbing session. One of the best teachers I've ever had (Edwina) as well as my classmate (Jen) are both teachers there, which says a lot about the high calibre of yoga instructors here. Now, I take majority of my yoga classes at PG and looking forward to trying AcroYoga in a few weeks.", "date": "2/14/2019"}, {"review_id": "oDVcxd6QRBPgb2K9THWf2w", "user_id": "pDLiTcL6X1erVXdb9l_uGg", "user_name": "Nelson W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "It's not a bad gym. However, considering the pricing for similar climbing gyms on day passes and membership, it is somewhat lacking.This location offers a boulder wall, moonboard without LEDs, and substantial settings for top rope / lead. Every top rope route has an assigned GriGri to belay with. Planet Granite does not offer rope for lead. I was told that the chain was working on rolling it out soon, but as of December 10th this is not yet available. This is apparent in the settings as well - it is very much top rope oriented, and there are no lead exclusive routes. Lead climbers will have to bring their own rope and belay device.Overall, very beginner-oriented gym. Newcomers have to watch a five minute video to orient them to gym etiquette. Equipment is set up in a way to be redundant (which is good).", "date": "12/12/2018"}, {"review_id": "ypon_X7t1SO5RTFFpR921A", "user_id": "aoz97hVqJxrfY5WGUZouUA", "user_name": "Connie W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We've only been here twice for the drop in rock climbing for kids. The check in process both times were quick and painless (booked via phone). The instructors we've had were awesome - great at explaining gear and options and very encouraging and supporting during climbs. My daughter always has so much fun and asks to go back often. They have various paths of difficulty and the instructor will choose the next path based on the kid's feedback after each one. It's so great that they let parents come in and watch so that we can get photos/videos of their kids.", "date": "5/19/2019"}, {"review_id": "HjgiH1C21cit_67UnMGjvA", "user_id": "W9zijUD2zWitabVsnbo2NA", "user_name": "Brent W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "(Bouldering only) Very interesting how different gyms can be so different. My current home gym is Brooklyn Boulders in Somerville, MA, but I was in San Mateo for a weekend so stopped by PG for an afternoon. I think PG's bouldering is better than Brooklyn Boulders (BKB), it feels like the problems are more idiomatic and interesting, rather than being short versions of top-rope climbs. It has more natural \"rock\" feel walls (BKB has an interesting wood laminate), more surface crevices and corners, meaning potential stemming and fun techniques like that (little potential to practice stemming at BKB); and most of the problems go to the top of the wall; none do on the main wall at BKB.These walls are also super dense and filled with so many problems, which is good and bad. Good if you have the wall to yourself, but bad if it's at all crowded because so many problems are blocked. It's also the first time that I noticed holds from other routes getting in the way of your climb. (But that's not necessarily a bad thing, it's perhaps more \"natural\"?)They also had more interesting holds types. My favorite were these shallow jug-types that felt secure, but were too shallow to grip past the first knuckle. I felt that this is good training for different parts of the grip. They also had a very interesting green cylinder type hold, that I felt forced you to do monkey-bar style climbing, which was fun.Great staff and impressively stocked retail area. The men's locker room was huge! And the trad gym equipment looked pretty solid.", "date": "8/25/2018"}, {"review_id": "uKeq3_VWNzCRqorXeICU4Q", "user_id": "TjbzFbntdD2l-WxuWHTAGA", "user_name": "Brian T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Not my favourite PG location, but they do a solid job there.  Although not as commodious as other PG locations, they really maximize the space and set a lot of quality routes.  I went on a week day morning, so everything was open, but I can see how it can get crazy in such a small space during a busy time.  We had fun at Planet Granite Belmont on our day off, and if we lived in the area, I'm certain we would return.", "date": "9/29/2018"}, {"review_id": "HsQUwzzkBo29FXMTXoX8ag", "user_id": "smantZRbVX66eYVejZxpvQ", "user_name": "Stephanie A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this gym. Friendly employees and great climbing. It's a bit smaller than Sunnyvale and Portland but that means it's less crowded which is a good thing.", "date": "1/7/2019"}, {"review_id": "2Pcrtw8X4-GEDJXERzyBCg", "user_id": "A4RKOv14yVYAM-mvfhHLJA", "user_name": "Adam Z.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is definitely one if my favorite places to spend time. Lots of cool people and good climbing/yoga/sauna. I spend hours here each time I come. Only complaint is that the showers are too often flooded with filthy water and hair. Please clean more often guys! Still love this place regardless.", "date": "3/28/2019"}, {"review_id": "4Vvh-UEuDfOI8til3c33vg", "user_id": "cojpppgrOEaCYKKq3FiBrg", "user_name": "Mayee L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Took the Belay class and it was supposed to start at 4:30 but we started at 5:30 or so because someone called in sick. The guy that taught us was a little obnoxious too. He looked like he just wanted to go home which is pretty dangerous considering that none of us know what we're doing. We got to climb and practice after though which was good. But then when we took the test the day after, all the questions were so vague. Like \"what do you wanna make sure of when you see the ropes?\" I COULD SAY A BILLION THINGS... Also the guy that taught us how to belay apparently didn't teach us the correct way to break because I did that during my test and the lady said I did it wrong the entire time... I was so confused.", "date": "3/7/2019"}, {"review_id": "_fMjZRaiATGIFMTEc9FS8w", "user_id": "TiH2XLVXj0Cf8x6CHsldoQ", "user_name": "Dario S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My wife, who has some climbing experience, suggested that we would see if we would enjoy indoor climbing. We looked up this place and decided to sign up for an introduction class (intro for me, fresh up for her). Having a toddler usually prevents us from doing things like this, but this time we felt adventurous and the three of us went to Planet Granite.When we arrived there the friendly team welcomed us and signed us in. I needed shoes, so we went through a couple of sizes until I had a pair that didn't make my toes curl. Who would've thought that my climbing-shoe-size is 3.5 larger than my usual size? (Next Time i probably get one half a size bigger).Michael was our trainer for the day. And we have to give him a lot of credit. Having a toddler that comments everything she sees, wants her parents attention, and cries because she's to tired next to us must've been very challenging. He was so patience with our situation and often explained things multiple times. We didn't feel as he was judging us and even accommodated a second trainer to do some of the exercised with us.From what I can judge the infrastructure seemed new, the trainers knew what they're talking about, and other people enjoy their time at (or on?) Planet Granite.5 stars because I have nothing to complain about and lack of knowledge what I could complain  about.", "date": "4/16/2018"}, {"review_id": "eMKlY2pLwxvHZZzOtoentg", "user_id": "rFTbVPPZPoLW2RxQdedDtw", "user_name": "Siruo Z.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "And update with regards to the reply from the business - I saw a white guy registering using nickname! Sorry but lying is not going to help out.", "date": "2/13/2019"}, {"review_id": "kNdABG_Q0JRGC5FRPyDKUQ", "user_id": "j_nM5mmziPS7rUQopc5EeQ", "user_name": "Sarah M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 2, "cool": 1, "text": "5 stars for Tyler!I went in about a half hour before closing to take a belay test. Tyler was helpful with the exam, which I passed just fine (but Tyler even gave me a few easy tips to remember everything for the future). When I asked if I could then purchase a day pass to join my friends for the last 20 minutes or so, Tyler was kind enough to let me in, with gear, for nothing at all. It was so sweet. I have been back multiple times because of it (and purchase a day pass each time). Thanks, Tyler!", "date": "6/19/2018"}, {"review_id": "WPNFI_G_IPn_qcNtz6yrKw", "user_id": "jHwMV64G3jQbbT1_z4qclQ", "user_name": "Kerrick S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 1, "funny": 0, "cool": 1, "text": "Planet Granite Belmont requires that visitors go through more rigmarole in order to start climbing than any other gym I've visited. They require all guests, even frequent climbers, to watch a 5 minute orientation video. Also, if someone makes a mistake filling out the waiver form (which I did, I accidentally put the wrong state-of-issue for my driver's license) then they have to go through the entire process again. This overhead is really frustrating if you only have 90 minutes or so to visit.", "date": "12/14/2018"}, {"review_id": "DBriC956rnbzzmeJyuYZgQ", "user_id": "ukpLRKroyGaxxtXPG1Eh0Q", "user_name": "Kacey M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 4, "funny": 1, "cool": 1, "text": "Several months ago, I got into rock climbing, which convinced me to get a membership here at Planet Granite, and it did not disappoint.  I can climb here but there are also so many more things that the place offers.First of all, there are climbing walls (duh, haha) for bouldering, top roping, lead climbing, tons of stuff.  I like bouldering on my own and then top roping with a partner or a group.  The only thing is, at least one person must be certified to belay if you want to top rope.  If you have no one with the belay license or if you are climbing alone, the two bouldering caves are both great.  The routes are updated every couple months, but they never get old because there are SO MANY to do!  Lots of challenging routes at every level for any climber, no matter how much experience they have.Then there are the yoga and fitness classes.  These are free with a membership, but you can also take them if you buy a daypass or use a member's guest pass.  The instructors are super great at helping you reach whatever fitness goals you are hoping for, and they are very knowledgable and caring about what they do.  The gym upstairs is great, too -- lots of equipment and space to work out. And if you're running on the treadmills, the second story location allows you to overlook the rest of the building, and you can watch the climbers as they go up the walls.  A nice way to pass the time if you're running :)A recommendation I have is, if possible, come before 3 PM.  If you come after that, there are a lot of kids that make the place very crowded and a bit hectic, because they have gotten out of school at that point.  And the same goes for work hours -- if you want to beat the crowds, come before 6PM or else the after work crowd will meet you there!All in all, I LOVE PG and definitely recommend getting a day pass here at least once.  And, let me tell you, that'll soon lead to a membership.  You'll love it!! :)", "date": "5/18/2018"}, {"review_id": "3xvJdnOmQsoPPE8Lt-wGFA", "user_id": "G-yOucON3iJIxCSpxSJ1YA", "user_name": "Peter P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A solid reliable option for climbing in the area. I normally go to the PG in the city but stopped by here on the way up from the south bay. This gym is smaller then their SF location but its cozy and quality of the routes were good. Their bouldering area is split up to 2 sections but it feels like 2 cozy bouldering caves. not too high or big but enough to get a good work out. Their top rope selection was pretty solid. lots a routes with plenty of features to use. The workout area was really large and had a good selection of workout equipment.", "date": "12/29/2017"}, {"review_id": "Tp0HaTAuvWsRH0o7-kS-ng", "user_id": "jzGA1gv7K3raunDm1e81YQ", "user_name": "Elaine S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Harriet's core and fitness classes are the best. She makes up a new playlist for each class and each class is different. Her classes are so wonderful that most of the people who take her class are gym members just to go to her classes.", "date": "12/12/2018"}, {"review_id": "3sEudLso8Vzz0GnTH0qTrA", "user_id": "zdJE2i9SoLa9KgQFZpUnvw", "user_name": "andrew t.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff and facilities.   The trainer is clearly passionate about the sport.  Gave great instructions to my son and was very patient.", "date": "11/11/2018"}, {"review_id": "kcDr4DUtvXFRGcQMGoomAA", "user_id": "9zXbVNk1DwPPUZ4FHm46Yw", "user_name": "Cathy C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came to PG as an experienced climber myself (I've been bouldering a total of two times in the past...../sarcasm) with my two friends who were first timers. $25 for a day pass and $5 for shoes - which in reality, you are paying $30 for 2 hours because your hands will probably fall off afterwards if you haven't already developed calluses on them yet. Only $2 extra if you want to learn how to belay....we didn't take advantage of it, but hey, if you're interested, it's only $2 more so that you can rock climb!The front desk attendants were helpful. After signing the waiver, we watched a five minute video on the basics of bouldering. After that.....off into the gym we go! They have two bouldering rooms - one to the left and one to the right. To be honest, we didn't know that we could go into the one to the left because the lights weren't on (I don't know if there are even lights in there....?) so we stayed mainly to the right. There are a good amount of routes in that room itself so it should probably keep you occupied for the most part. I've always heard that the rock climbing community is extremely nice and supportive, and based on the few people we met here, I agree with that! And lastly, we weren't sure if we could park in the parking lot next to PG since it was really more connected to the auto shop, so street parking could be a little iffy.Can't wait to climb again so I can conquer the V2's (don't laugh at me....)... but rock climbing gyms, imo, are expensive af.", "date": "8/17/2017"}, {"review_id": "1bxtrH1EUjHoW9jVETj-Dw", "user_id": "IKI7vT9BvEJsP7RYfbMtpQ", "user_name": "Anthony P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I mainly boulder here.The areas are small but the setting quality and the volume of climbs per wall is great. The people are very friendly as well. They also have a Moon board on the top floor!!!My main gripe is that there are hella people bouldering in their street shoes. These are mainly new climbers and they don't know... but I feel like the gym should address how unsanitary this is.", "date": "2/3/2018"}, {"review_id": "7xTyELjPrYWSFm0PC9DH1Q", "user_id": "-sNnd2sJl8_X1ogHIhHe6Q", "user_name": "Siyan Stella W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I am now a member. I usually do bouldering because I think it's more fun. I think it'll be good if you could have a line to put not-climbing people put in a safer region without being hit by falling people. It can also bring climbing people more confidence and safety when they challenge themselves without worrying about hurting others.", "date": "10/25/2018"}, {"review_id": "oEoANPnQcxSfJqdMBxfnuQ", "user_id": "1FFgI8DzatqbcJhIne45Vg", "user_name": "Mary D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been going to this gym for two years now. Great staff. Fun climbs. Decent machine and weight area upstairs.", "date": "9/12/2018"}, {"review_id": "PWzcDn4aDVDIAmDloBQmZQ", "user_id": "Jj8eW79UQmPwc1iC2kGIgg", "user_name": "Kamakshi A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Damn this place! I didn't know rock climbing could be so much fun! I attended Intro to climbing: Belay lesson, and it was good. Huge space with lotta options. And friendly staff.", "date": "9/30/2018"}, {"review_id": "sPPHGnru691C71miDHesSw", "user_id": "Z7Rh-z6EpHJLrOSo-YGH5Q", "user_name": "Thor D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Just walked in and reserved my belay class for myself and my girlfriend. Was greeted and helped by Caden, who was professional, kind, and efficient. Excellent service. Thank you Caden!", "date": "6/19/2018"}, {"review_id": "XsGZGBSKB3ly14r8F_OClg", "user_id": "eGgJBYceU5D-txlODsdZtA", "user_name": "Cavan W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Updating after a year and a half -After my rant of the gym area back in Aug 2016, the staff reached out to me to discuss my issues with the gym. There were some simple items that were fixed in the following weeks - broken leg extension replaced and smith machine replaced with a squat rack. The gym manager at the time had lots of ideas on how to improve the lifting area but he was transferred within a couple weeks.The new gym manager, Evan, and the staff for 2017/2018, much praise to them! I noticed new gym equipment would start showing up and new upholstery on the benches, but in January 2018, they finally made it happen - all bumper plates except for a couple steels. It was Christmas in January for us regulars! We still can't do oly lifts and drop the weights, so I just keep it under control. Only complain is they took away too much of the steel plates so there's only one pair of steel 45s and 10 pairs of 45 bumpers. There is plenty of bumpers for everyone.It's nice to know that the staff and the gym manager taking our complaints seriously. There's still a couple guys that doesn't know how to rack their weights (because honestly, some climbers seem to be in their own little world sometimes, but that's a rant of another time), so I just make them wait while I take my time in the racks or benches.It's a good gym with updated locker rooms/restrooms and if you're a regular, the people are friendly - you just need to break into the individual high school-like cliques. If you're a regular lifter, you can join mine", "date": "1/22/2018"}, {"review_id": "KdcIKka3_GFJjkfk1Bq1Iw", "user_id": "lCD1NqrbeFB7C5POf6VhKw", "user_name": "Dipti S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best place to unwind after work. Love the fitness classes that planet granite offers . No matter how hard your day was planet granite experience never fails to make you feel good about yourself .", "date": "8/15/2018"}, {"review_id": "MWMzcOOMz_GC6ieM-XSp7A", "user_id": "K1lkv1Zpnzsl3n08Zv04kg", "user_name": "Jessica C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 6, "funny": 3, "cool": 3, "text": "Just went here the other day and as we arrive it took two people to figure out how to find my friend in the system, for them to say she's never been to this gym before, even though she was previously a member, then needed to sign a waiver again, and they said she didn't have her belay card on file and wanted to retest her, when she showed them the card from the Belmont gym and promptly corrected them. Then they offered to change her 10 pack to a digital card, but with all the mishaps in checking in, she refused.While I waited I decided to take the belay test, since I am relatively new to PG. The woman I had was pretty condescending. I do know all the safety requirements, I've been outdoor belaying and belaying at other gyms, she was looking for particular words vs knowledge on what to do, so she said she'd only give me a day pass. The climbing itself ended up being really fun. I have gone climbing at other gyms, and have never experienced such awful customer service. This experience with the gym staff definitely soured my opinion on it.", "date": "9/11/2017"}, {"review_id": "FOGNAuy21__ajmxpmRfPww", "user_id": "iGsDXl6YOVTgjZj5WllpFQ", "user_name": "Daniel B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Even when it's busy there is space to climb and workout. When I see everyone walking around with their bare feet I think of two things: foot fungus and plantar warts. I always keep my shoes on.", "date": "6/12/2018"}, {"review_id": "h3ynDXm2dmhVW6Le-oKpvw", "user_id": "KH-C-lhxHtdegtT-v-4V-A", "user_name": "Jackie Y.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "Decent sized rock climbing gym located right off El Camino. There's not a lot of parking along the side street next to the gym, so I would recommend parking in the neighboring plaza lot.Overall, this rock climbing gym is a great place to climb/work out, whether you're a beginner or a seasoned rock climber. The gym has climbing grades ranging from 5.5. to 5.13 and boulder grades ranging from v0 to v10+. Ratings here are on the softer side, and I would highly recommend coming if it's your first time climbing, as the atmosphere is friendly and the staff are attentive. They also offer a number of Intro to Climbing classes every day ($30/class, inclusive of gear + shoe rentals), where they teach you climbing + belaying basics and prepare you to take the belay certification test. Because this is the first Planet Granite location, some of the amenities are older, but they are slowly renovating and improving their amenities. One factor to consider, however, is that Planet Granite is on the more expensive side. A day pass costs $25, and a monthly membership is $90, before the initiation + other fees.", "date": "9/17/2017"}, {"review_id": "llqZuThVxq_SVUU1B6qxuw", "user_id": "cMSZp7Go1bPKEQMYqStaXA", "user_name": "Joan S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Though I prefer the Sunnyvale and SF location, this location is closer to work so I come here about 2-3 times a week. People are friendly and although it can get quite busy after work, you usually don't have to wait too long for a climb. People here are more laid back than other PG locations so I always have fun and meet tons of new people!", "date": "5/29/2016"}, {"review_id": "BWCAN5IE8L6dtQImcSTT6w", "user_id": "Vm2aAjWuN_S87a182zHUGA", "user_name": "Scotty S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "This climbing facility is the worst and unsafest I have ever been to. In fact, the staff brags about how often the ambulance has to come to the gym!!!!  The safety gear is unclean and outdated.  The ropes have been over-stressed and lost their elasticity, which is essential for a safe belay.", "date": "10/21/2017"}, {"review_id": "gZf_Tr5YiYKpa892w3ivxQ", "user_id": "CZuA2T1aJm-E5LVaMMrTwg", "user_name": "Jess F.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE the fitness classes taught by Harriete!  My family just moved to CA and I was used to doing only CrossFit type workouts and Harriete kicks my butt every class!  She works all of my smaller muscles and core that I never take the time to work on.  I am glad that I found her classes and the class times as it is the perfect start to my day!", "date": "12/18/2018"}, {"review_id": "xZkaL-TQnJyynJwmvMFnAg", "user_id": "W3pB9iiIEkkCjX18gtYnMw", "user_name": "Stacy D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Visited this gym on my one week SF trip and loved it here.  Came on a Saturday morning right as they opened and it was not crowded at all.  The bouldering area is smaller than the one at Planet Granite Presidio but for my 1.5 hour bouldering session I had more than enough problems to keep me busy.  Some very creative and fun bouldering problems and the other climbers here are very friendly. My friends joined me for some top rope 1.5 hours later and I really enjoyed the the long routes too.  My gym (BKB Chicago) only has smooth walls so the texture of the PG walls is very different to me but it's nice to try out different styles.Around 11:15AM when we left, the gym started getting busier than most routes you have to wait.  Can't wait to come back again... hopefully soon.", "date": "3/20/2017"}, {"review_id": "ifTqYWWEgOB65i3jiQxsHg", "user_id": "dfrgm7OMjcqqg4d9DXERGg", "user_name": "Kristen S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Started coming here 2 mos ago and the family is hooked. Have since checked out another gym on a trip and realized that we are very lucky to have clean holdsthat arenot super smooth and slippery and also that are color coordinated (vs tape markings). Precidio location is much larger but Belmont totally suits my needs and the staff is really great!", "date": "7/8/2018"}, {"review_id": "kfshQsvDt6lbdQ5JsI0pnQ", "user_id": "3F5jYqHytIVth5zEYiMILQ", "user_name": "James P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I've been coming here for the past 2 months now. I come here during the mornings and early afternoons. Since my joining, I've seen nothing but daily construction work in this gym. As a result, it obstructs any chance to do any bouldering because of the obstruction (see pictures). I get that you need to update and put new routes, but can't this be done at night when no one is here? Why do the morning people have to sacrifice their hours for this? If you like bouldering, this is the worst gym for it.", "date": "1/8/2018"}, {"review_id": "fs0vZDbT0ru3oCTIUKz2Pw", "user_id": "w1L7b3N3DENtuqN53BIYYQ", "user_name": "Milo D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Rock climbing is always a great idea! Whether you want to go on a friendly date, you want to tire out your kids, try something new with friends, or just get a good workout it this is the place to go. It may not look like much on the outside, but I side they've got a weight room, machines, tons of bikes and treadmills, 2 bouldering nooks (rock climbing without the rope attached) and of course the rock walls themselves. The service is ok, not very attentive, but they know what they're doing. And just in case you dont, they have plenty of classes covering a variety of exercises. You can, also, rent or buy equipment, and the prices are very reasonable! Only downfall there is no pool, but hey, if you're not gonna need it why have it, right?", "date": "6/6/2018"}, {"review_id": "Jk873_w1V-Va4cY6rGVOwg", "user_id": "CUitYzsWZHK8w-Vys6PwxA", "user_name": "M C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Planet Granite Belmont is where I met my friends and we totally became a climbing family. PGB has a great vibe. I hope it never changes!", "date": "5/19/2018"}, {"review_id": "9fVgKUlZJQt7fx-kw7O-LQ", "user_id": "DmyBMPJPa1svRv_ZHbdp7A", "user_name": "Jacob S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Not the MOST extensive climb terrain in the bay but a great community and usually pretty empty so great for training.", "date": "9/21/2017"}, {"review_id": "6gW8TP5tnwip1tfyFgUU2w", "user_id": "TAZ2UvEzXXbieQMCWn8qhw", "user_name": "Luke S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 1, "cool": 3, "text": "The first customer service is cool but after you've gone through check in and all you're pretty much on your on. Feel free to ask questions because you can get a lil lost .  You need special certification to do the big climbing. They have a couple areas for boulder climbing you can do without it tho.  They have a great workout area. It's pretty much a full workout area. They have special event nights that are pretty cool too.  The parking isn't as bad as it used to be, it's actually pretty good. They have stumptown coffee here too.", "date": "3/17/2017"}, {"review_id": "cP3I4NQhMakUpX-F5JaBuA", "user_id": "e40jyZciIMDks-11LrwarQ", "user_name": "Josh S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 5, "funny": 0, "cool": 0, "text": "Been a member at this gym for over 4 years, and I can't say this gym is changing. The crowds at this gym at getting larger. Most of the time the gym is packed. I use the weight/ fitness area upstairs often. I used to love using their pull-up bars, but now it seems that the \"climbing team\" (mostly composed of young children) are always in the fitness area using all of the pull-up bar equipment. I can no longer practice calisthenics on the weekdays at this gym. ***updated review 5th time this month I have had to leave what I was doing because of the climbing team... these kids should not be allowed upstairs.The showers usually stink. Climbing facilities are cool, I like using them when it's not crowded. Best times to use this gym is probably in the AM. Last, and I think this is fair to list, but membership cost are high and have consistently increased every year since I've been a member.", "date": "12/8/2016"}, {"review_id": "cmRU7-Q4TevpF4RhZ8m3ag", "user_id": "shTVQJhu-NftZfRTUxYxrg", "user_name": "Claire S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 10, "funny": 4, "cool": 4, "text": "Ah, PG, I used to love thee (although a little less now that I lift more and climb less).It's pricey and an older facility, but because it IS a specialized gym for a sport that you can't do 'just anywhere', they charge way more than expected.  Membership to one PG grants you access to any of their family of gyms (San Francisco Presidio, Sunnyvale, Portland, and Belmont). Their hours are extremely broad, meaning you'll be sure to find a time during your work week to drop by.They offer belay lessons to all newcomers (as you must be certified before you can top rope), which are pretty helpful. Every Wednesday (unless it's a holiday) or so, they put up new routes on a certain section of the wall, so you're always going to run into something new.They also offer yoga lessons, and upstairs is a decently equipped (albeit dusty) gym.My biggest complaint is how little love the lifting area upstairs is given. The equipment is limited in number and is shoved into a small room, making it difficult for more than a few people to use the weights at once. There's only one bench press and one squat rack, so wait times can be high. The manager had said that he was going to bring in new equipment, but that was some time ago, doesn't seem like it's going to happen.It can get quite crowded on weekends, but it's at least a great community of people.UPDATE: They raised membership fees, but still have broken equipment around with promises of repairs from nearly 1 year ago, and almost 2 years worth of empty promises about updating the weight lifting space. It's a little disappointing :/Tl;dr: a good climbing community, but not a well-equipped place for anything else.", "date": "4/21/2014"}, {"review_id": "mTHuMyQiui_qUUe8SRTLyA", "user_id": "hTEKSL52x8cUUlHpUEx4lw", "user_name": "Lindy F.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 3, "funny": 3, "cool": 1, "text": "\"He's climbing the rope, and he's gaining.\"  -- The Princess Bride (1987)What a great rock-climbing gym. Nice and spacious, plenty of staffers around to help out, and the facility is clean and well-organized.  I've been here a few times to bring my niece for her classes/camp.  Her camp had 5 or 6 girls in it and they each got to climb at their own level with the counselor/instructor.  Here is my only complaint: this guy was not really engaged. When the girls were climbing, he was texting on his cell phone (with who, I have no idea) and had a hard time managing 6 Tweens. My guess is he was early 20's and maybe didn't sign up for this.  He never dropped anyone (he was belaying for them all), but he was also easily irritated. Surprising he wasn't more attentive considering I was standing right there as a parent. My niece also said she disliked when this kid was her teacher.  Update: she quit going to camp.Now, let's talk positives. My niece also had her birthday party at this location. Now, this they handled beautifully.  We had a couple of even younger (seemingly) young ladies help out with belaying, plus we brought our own certified helper (thanks Helen F.) so more kids could climb at a time. PG was cool with it, so the kids went to town.We didn't have the place to ourselves by any means, but seriously it certainly felt like we had the run of the joint. We had no real limitations.  The kids had a blast and the adults got to climb some too.  I think this is a great place to have a kids a party - the kids are active and they handle it well.I will say that we went around the corner to a pizza joint for dinner and dessert, just as an FYI.", "date": "1/5/2014"}, {"review_id": "zbx9N_eJ-2pSLWEueTyeIw", "user_id": "aFBQko4yhl66_UgVfAlnRQ", "user_name": "Amy T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 7, "funny": 6, "cool": 3, "text": "Oh my lord I dislike this PG so much. Maybe I'm spoiled because I've got the PG in SF as my stomping ground, but BOY THIS PG COULD USE SOME SERIOUS WORK. First off, LOCATION IS SUCKY. It's on a busy street and the parking situation is confusing. I'm still confused. 5 hours later. Still scratching my head at where everyone parks when they climb here. There's not really a parking lot for this PG; there's one next door but I think it's for the autoshop. Street parking is iffy because it's on a crazy busy street. WHERE DO PEOPLE PARK???? HALP LOL. The gym itself? Small. Cramped. Stuffy. All the things you don't want when you think of gym. The front lobby is essentially a third of the gym. There are only two bouldering sections, basically little alcoves on opposite ends of the gym. BARELY any space. If you've been to PG SF or Sunnyvale, Belmont is like a quarter of the size. There's no breathing room. And since it's so tiny, it reeks. It just smells like a stinky climbing gym ya know. And the women's locker room isn't any better. The facility seems very outdated. There is gym equipment upstairs though, overlooking the rest of the climbing walls. Maybe they get better ventilation up there from being purely higher up than all the clogged, smelly air downstairs.I was bouldering the day I went there and it started to get pretty busy around 7ish so I left. But I usually climb V2's at PG SF & Sunnyvale. I was doing V3 here so either I got better overnight or the routes are a little easier here LOL. I think it's the latter. Overall, probably the worst PG location I've been to. But that doesn't mean PG is bad. I LOVE PG. SF. SUNNYVALE. YOU GUYS ROCK. The facilities are great. Belmont -- not so much. If you want to try indoor climbing, go to another gym instead of Belmont. There are far better options.", "date": "6/28/2016"}, {"review_id": "kB0iVYKp5jzRbDVRX6VIYQ", "user_id": "kRmKlcv31KGk_wxublaZ4A", "user_name": "Ritika P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I signed up for the gym and yoga/fitness classes. For the monthly unlimited price, the value is exceptional. The quality of yoga classes is high, in comparison to other studios. The ambiance is peaceful. The gym does get packed during peak times, so I'd always try to go during work hours (but I'm self-employed, so that's reasonable). Overall vibe is wonderful with down to earth employees and people. Instructors will often walk around during non-class hours to try to teach PG members about their classes and encourage participation. Clearly, they take pride in their work and care about creating a great experience.I can also tell that people really care about the community here. It's great to see a gym where the leadership team really cares about quality while still keeping price points reasonable for lots of different people. I've never felt nickeled and dimed, like I have at places like the Bay Club.The upstairs gym isn't awesome, but it *is* good for a basic workout, if you're not looking for anything fancy. I think everything is very well-cared for given the foot traffic that this business has.", "date": "9/7/2016"}, {"review_id": "wKGt9hVVYBdvEPuHT5TFqQ", "user_id": "74oOkfHdvclO1XXNGvRLfQ", "user_name": "James K.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "I've been a member of PG for years, and kept coming back by joining a fantastic climbing community that feels more like a family after all this time.PROs.- The climbing routes here are challenging, well thought out, and technical- Some of the friendliest people come here to climb, lift, or yogi it up- There are regular community events and climbing comps- Membership at one PG gives you access to all locations (Sunnyvale, SF, Portland)CONs.- Weight machines that break tend to stay broken (there's one that's been 'out of order' for the past 3 months, with no fix in sight)- Upper gym area has some uneven flooring issues, especially in the weight room - It's a specialty gym, so it can be a bit steep (~70/month)Ultimately it comes down to the fact that PGB comes with the highs and lows of being a specialized gym with no competition mid-peninsula, but the sense of community here is what truly makes the Belmont gym shine.", "date": "6/12/2016"}, {"review_id": "6w8SurmXcLX_ZBmsGQb9_w", "user_id": "JIgw1yuutK2KT-bXDhaztg", "user_name": "Richard D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This review is for Danae Robinett's wonderful yoga Vinyasa on Sunday mornings 9:30am Planet Granite  Belmont.   Her class is playful and encouraging.   She takes proper alignment seriously,  but encourages the class to have fun.   Class difficulty is adjusted by Danae according to the class makeup on each day. Highly recommend this class.", "date": "5/18/2016"}, {"review_id": "7vSEiB0f3LA_iW7TwMl_OQ", "user_id": "noGT_siVKru_r_Yzz8pfIw", "user_name": "J L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 2, "funny": 1, "cool": 0, "text": "This used to be a 3 star joint.  I would think Sunnyvale could fund Belmont in its revenue alone.  Even if that is not so, why is Belmont so junky. Before it used to be limited wall space and not as fun to explore any routes.Now Belmont is dirty. I skipped a skirt and wig but I would have a hard time to believe the lady's locker room is a whole lot cleaner. The boy's room smelled like the carpets have not been cleaned.  Body order, sweat, and a longer list of organisms that I care not to mention (and where these organisms stem from). Fans, bleach, and carpet cleaner are possible solutions.Please use your revenue wisely.", "date": "5/3/2016"}, {"review_id": "bP0tgnnb2kIWEEvcsfH7bw", "user_id": "xKQN8VVv5R2rD9GMKCrZJw", "user_name": "K L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing at this gym on and off for over 5 years now and I still love it! They have a variety of climbing problems for all levels of experience/ability which makes it a great place to bring both experienced, and new climbers. The upstairs gym has just about everything one can ask for, plus it looks out over the climbing walls. They also have 2 bouldering areas. The only downside is that parking can be challenging at busy times, unless you want to brave the gnarly hill around the corner. It's steeper than it looks. Anyways, happy climbing!", "date": "8/22/2017"}, {"review_id": "TClqQFKJdLmz-ASJ_pCavQ", "user_id": "Ma_gwnVShENgTuhHNpAvyQ", "user_name": "David C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 6, "funny": 0, "cool": 2, "text": "I've been a member for about a year now.  I have a few observations.The Good:- excellent fitness classes including crossfit, yoga, cycling, core with flexible schedules- excellent weight lifting amenities (endless barbells, weights ,squat racks etc)- best top route / lead climbing gym in the Bay Area bar none- formidable bouldering problems- excellent instructors for climbing and fitness- great, helpful environment and community for new climbers- many members only perks and social events- walk-ins allowed on a member guest pass or paid day pass- free climbing lessons for friends if you are a memberThe Not So Good:- peak hours are incredibly busy; there are waits for every climb- sometimes they run out of lockers during busy times- parking is horrible; there is no better way to put it; way too many cars and way too small of a lot during peak times- may be a bit of a wait for lifting equipment during busy hoursOverall, my experience here has been incredibly positive.  I've made lots of friends, learned to be a better climber, and have increased my overall fitness and quality of life.  At first, I thought the membership fee was a bit steep compared to somewhere like 24 Hour Fitness or City Sport, but PG really has a much more community feel and the caliber of instruction here is just so much better.", "date": "12/9/2015"}, {"review_id": "fzmPAvMRHi6OPDJeinc9DA", "user_id": "PYESpXaUSnyYgQ3P4ayyuw", "user_name": "Carolyn L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I've been coming here weekly for 6 months now and LOVE it! The actual facility is pretty old and beat up with leaky roofs (which I think is in the process of being fixed soon), but the employees do a great job maintaining it. I used to come in the middle of the day and would always see employees sanitizing every piece of equipment! Employees here are super friendly and welcoming. Honestly think they are the nicest compared to SF and Sunnyvale too! I think people tend to hate on Belmont because the facility is a lot smaller and older, but it's also not nearly as crowded as the other locations. I will admit that the gym membership is pricey, but I like the option of having the climbing section, weight area, and yoga. I'd recommend people interested in signing up for a membership to wait for that awesome Groupon deal! It gives you free equipment rentals and waives your initiation fee so its super worth it. Can't wait to come back and climb on :)", "date": "11/23/2016"}, {"review_id": "rqghhfOKgj_huIeP5--ITw", "user_id": "bK3Nf0elZu8dzWDYXdhn-g", "user_name": "Roy - Ocean IPhone Repair ..", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Late review, was here a few months ago and I had a great time. Had some friends talk me into rock climbing so I finally decided to take some time out and try it. Parking was easy, staff is friendly and they have a gym upstairs. Thanks Zoey for helping us out on our first rock climbing experience. We'll be back again very soon.", "date": "6/30/2017"}, {"review_id": "K0LRRhxklNimSAt_FoMFsw", "user_id": "1D5EQITb4hOzPMZT8gDPQQ", "user_name": "Krista S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Last night was the first time I've climbed at the PG in Belmont (pretty regular at both the Sunnyvale & SF gyms). While the gym is a lot smaller than the other two, I was sufficiently impressed with the number and varied difficulty of the routes they've been able to fit in the space.Not only was there a good mix of routes, but there are possibly more lead routes here than the other gyms (so much of the top rope space is available to lead) which is really awesome. I need to get a new rope so I can check out some of those routes!The only down side to this gym is the parking situation - no parking lot, street parking only. But given it's in Belmont there wasn't an issue finding a street spot so not sure if this is a big deal.I'll be back, many more routes to explore!", "date": "6/5/2014"}, {"review_id": "bovI2_7O2PFP7fm-WGT24Q", "user_id": "QXAYZBYuZ1NbygFKvynnJQ", "user_name": "Jenna T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Great great way to work out your body and challenge yourself. I went here since two of my fiends were members and they wanted me to try it. The place is clean and you can tell who the regulars are. The staff is very driest and ensure you know all re safety precautions. If ya your first time rock climbing, you'll take a mandatory hour training with thee folks and learn about climbing, tying knots, and releasing rope for the climber. Staff do not take this lightly.The walls have different levels and it takes a certain technique to do rock climbing. It's best to be with someone who's is experience so that you gain all you can in your one day session. They have bells at the top of the walls and people stuck their name badges up there for bragging rights. Loved it!", "date": "2/16/2014"}, {"review_id": "CqwyeGhKheN2aVuLkvlfTQ", "user_id": "8NMlM-h7jcuKorZKdFR6HQ", "user_name": "Matthew M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "The wall is great. Very contoured and intricate. The climbing experience was great overall.My gripe with the place was with this pretentious and rude staff member that wasted an hour of my time. Ive been to many gyms and this experience was by far the worst. I watched as maybe 15 other people got helped while I sat waiting. Don't go here if you appreciate respect.", "date": "6/23/2016"}, {"review_id": "oRCXrz2iS9UC4RfvKjz_hQ", "user_id": "Oh6-UzfSvdJA7QU0YDnARQ", "user_name": "Bridgett M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "This is merely a money making business. It lacks any higher purpose. If you want to rock climb for any other reason (care about nature, or other human beings sharing space on this planet, for instance) look elsewhere. A more fitting name: \"Planet Ego,\" if you are looking to pay a lot of money to be treated like dirt, you've found the right place.", "date": "9/20/2017"}, {"review_id": "evdVVTgth6eUuh5R4WNBzQ", "user_id": "_UXWlGpGI8QeDUZMyjP3jw", "user_name": "Tiffany C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "I love this gym for multiple reasons!1) close to work...It allows me to dodge traffic..2) I usually have no trouble finding parking3) Love the Tuesday Yoga taught by Josie Zhou4) Top ropes comes in multiple level and accommodates climbers of all levels5) Fitness center is large enough that it doesn't feel over crowded6) Class times actually fits my schedule7) Bathrooms and changing areas are clean8) Staffs are nice and helpfulOnly wish they had more of a discount. Kinda pricey for membership and even more expensive for drop ins.", "date": "8/7/2015"}, {"review_id": "ix_kHma2FH-_Fe18pp0rgA", "user_id": "yAerUZJKW7bNcYVH-Z3YXQ", "user_name": "Linda N.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Although this location is small, it's perfect for beginners.  The instructor, forgot his name, sorry!, was down to earth, honest, and made me feel at ease.  The one tip that I found very useful that other facilities didn't give was to just fall.  One of my fears was falling and and having my partner catch me at the last minute but this tip helped me conquer that fear.Tips:-Lockers are available but BYOL(lock) or use the open cubbies to store your things-Shoes are provided; you are required to wear a size smaller than your regular size-There's a water fountain to quench your thirst-Bring your workout gloves to get your workout on after climbing-Plenty of street parkingI recommend signing up for the package that's offered before/after your class.  It's 5 class for $55.", "date": "11/6/2013"}, {"review_id": "mgrHeD0etn3zlqzICzkwPw", "user_id": "KV_xhz4JNwH6WGaPvKDyTw", "user_name": "Kat H.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to boulder for the day! And I am a huge fan of the rock conveyor belt... especially the incline part. They have belaying and classes here too and a weight section. I enjoy the cave as well for a bit of stretching and climbing. So much fun! Would go back anytime I visit Atlanta :)", "date": "11/1/2017"}, {"review_id": "fh9NIRT0qQHsKidNTP6hZg", "user_id": "_E1aAQ0Yrf0QHGkiG5oqlQ", "user_name": "Quinn V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Liked it. Airy. Clean. Pretty tall. Empty during work hours. Everyone that comes in during that time is solo n goes to the fitness area. The routes r really fun!  All levels. Kudos for the setters. Friendly and knowledgeable staff. Always cleaning the place. Well run place!", "date": "5/15/2014"}, {"review_id": "Klwg9lHzUAg0tN1VD1Q_tA", "user_id": "5gbkhlWANGVzQYi_0m3vOQ", "user_name": "Jess C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Of all the Planet Granite's, this location is the smallest but the emptiest. It was totally empty at 5pm on a weekday (mostly kids), and got pretty crowded at around 7:30pm. There are more tall walls and interesting wall configurations for top rope. I also think the course setters make everything easier than other gym's, I climbed my first 5.11d. So awesome. They have cool classes and plenty of machines. The locker room is a bit cramped, but they have all the essentials - shower, lockers, a couple bathrooms, and a sauna.  Also, people are really nice here. Would definitely return and make this a regular gym if I was closer.", "date": "4/11/2013"}, {"review_id": "VFwNuNyurY7NRX3t3hVfpg", "user_id": "jbOV66secENSq6-optuNOA", "user_name": "Yolanda M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 2, "funny": 1, "cool": 0, "text": "In terms of top roping this place is great! They have walls of varying heights and routes of varying difficulty. The staff is quite friendly and helpful and they offer belay lessons for those that need it. For the belay lessons plan ahead because they get filled up fast. They have two bouldering sections, the grading for both are definitely not as soft as the gym I'm used to climbing at. The walls are also shorter than I'm used to but the routes are still fun. Not sure how often they reset but it's nice to have the option to Boulder. The gym itself is surprisingly very well developed. They offer a much of weight machines, rowing machines, rings, cardio machines, free weights, yoga room and even squat racks. If I didn't work at a gym I would highly consider making this my go to gym. They have a couple groupon deals and student discounts as well but are strict about who qualifies as a student.  Drop in price is $20 which is a lot more than I'm used to but also pretty typical for a climbing gym.Beware, parking can be hard to find!", "date": "1/11/2015"}, {"review_id": "8DAoQtanyyPHIesZ1MvfoA", "user_id": "f29DEq1EdV5Qq_8TGNkS-A", "user_name": "Ang P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Wish Planet Granite was closer so it could be my go to gym.  Front desk personnel were friendly helpful educated and hard working. There were about 4 people people behind the counter and each person busy either with supplies, check ins, training new customers on climbing or checking on people putting on climbing shoes.  Our party of four wanted to go bouldering. We climbed for a good 3.5 hours and had a blast.  This gym has regular workout equipment upstairs, a yoga studio, 2 bouldering rooms and a central area dedicated to belaying.  It can get quite crowded because this gym is smaller than most of the other Planet granite locations. Highly recommend this experience.", "date": "8/11/2015"}, {"review_id": "-ayYlNcoHg_kbBLvc7esFw", "user_id": "pb-Fw9SjbDULRRO9LOP8gg", "user_name": "Fiona L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 3, "funny": 4, "cool": 3, "text": "This location is nice for ROCK CLIMBING and not so much of bouldering. By now, I'm sure you've heard that the Sunnyvale location is bigger than Belmont one and that is definitely true. As I come just for the bouldering, I came at the wrong time this week. It so happens they had a competition so one of the side walls remodeled to accommodate and thus, it wasn't back to the normal V0 and on. They only had one side of the wall. In addition, I came at like their peak hour so it was really crowded with people. Overall, there's plenty of rock climbing space and a nice gym upstairs, too. There's nothing wrong with this place, but as someone who just boulders, I'm more used to going to places with the entire place set up for bouldering.", "date": "10/1/2014"}, {"review_id": "e7BlNQYthObA_TN014FqNA", "user_id": "yNfT71tgD0YuCrgAcC0-OA", "user_name": "Michael G.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Not comparing it to the other locations, this is an excellent climbing gym. Fairly large area, two bouldering rooms, wide variety of top rope levels, gym equipment on the second floor, and yoga classes. Climbing lessons of varying kinds offered for beginners and more advanced climbers. Rental gear available so you can come with just your will to go vertical. Also, one of the best parts for me, is the other climbers are generally very friendly and courteous. You can find help if you're struggling without looking hard.", "date": "4/2/2014"}, {"review_id": "099faDCI8kjmM2OWAuWwyw", "user_id": "ZXNwO2bY3QTYP0k_5bhG1A", "user_name": "Dan B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 8, "funny": 6, "cool": 7, "text": "The Belmont Planet Granite is filed under \"Gyms, yoga\" but maybe should have an additional category of \"playground\" or maybe \"babysitter services\" (??)Discovery #1: Planet Granite has a \"climb and dine\" every other Friday, 6:00-8:30. We dropped off the kids, and went out for a nice dinner nearby.  Cost was a little steep ($40/kid) and we had to combine with another family to fulfill the minimum of 4 kids. But that's not too far from our total babysitting cost, plus the kids had fun and got some exercise. Both my daughters loved this SO FREEKING MUCH that this led to...Discovery #2: Kids birthday parties!  My youngest turned 7 and, after her experience above, decided this was the place to bring her friends.  For a group of 10 kids, Planet Granite supplied 2 friendly, experienced, teenage instructors. (We were asked to provide one add'l certified belayer beforehand since a few extra children joined the group; Luckily one parent friend qualified).  Kids were all issued helmets, harnesses and safety-briefed. The only problem - no facilities for food/cake here, so at the end we gave kids snacks in the lobby and fed them pizza and cake at home. But everyone had a blast, and it all worked out just fine.I can't say enough about Planet Granite's:-- Commitment to Safety: Enforcing good rules means safe kids-- Staff: My kids bonded with them on both occasions, and they didn't want to leave.", "date": "3/30/2010"}, {"review_id": "Zm_G2TmcpzvbHdpjpdsZag", "user_id": "hcXO67s7stk98s836akRnQ", "user_name": "Emily K.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 2, "funny": 1, "cool": 0, "text": "For new users, I highly recommend you STAY AWAY from this location. Customer service is HORRIBLE! My boyfriend is a very experienced rock climber and I am sort of a beginner but I've climbed 10+ times.We had never been so we filled out waivers (at this point they should have given us more information on how they work but they were all too busy texting to bother with that) and they charged us for 2 day passes and shoes. After we paid and got out gear on they told me that because we were \"new\" we would have to go through a class before we could climb. The class was $28 and didn't start until 3:30 pm. This was about 2 pm, so they expected us to wait on hour and a half. There were plenty of them standing around texting/drinking coffee/etc but they wouldn't give us an overview or let us take a class for AN HOUR AND A HALF! AFTER we signed up and paid. Will not be going back to this location. Highly reccomend staying away.", "date": "7/5/2014"}, {"review_id": "eK4-OqRL4JCO1sSNcVHfKg", "user_id": "rDHB7O_CCEIXYUSZZYrRng", "user_name": "Gareth B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been climbing here for close to 18 months and I have to say it is an excellent gym.  Firstly the staff are super helpful and friendly and incredibly experienced climbers.  Secondly the gym has a great mixed bag of climbing and bouldering routes. The workout area is superb too.  Lots of modern equipment, weights, etc. It's a smaller gym than the Sunnyvale location but that being said it is more intimate and has e a very friendly atmosphere.  Everyone is helpful and considerate as a result.  One of the things I love about it is that there are lots of very good climbers to help you with technique and lots of routes that are changed very frequently so you don't get bored.  Also the holds are cleaned every time so you don't end up with gunky chalky holds (and nasty bacteria!).The routes vary from a small slab wall, to overhangs and longer pitches (~40ft).  There are lots of top-rope routes and mixed in there are sport lead routes to so you have lot's of choice.  It's pretty hard to get bored with the routes !!For all you parents, this gym is super kid friendly.  I believe they have many activities for all ages for teaching kids to climb.  And having kids around livens up the place (as long as they are being safe!).", "date": "11/16/2014"}, {"review_id": "Fut6EUQYdmj62O1mfIBUxQ", "user_id": "7CekSzu8b11RxBW-j198vw", "user_name": "Nikko L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been here for about 9 months,I could spend all my afternoons just climbing and hanging out, actually that's what I do.Taken about 10 different friends for free belay classes (perks of being a member)Free guest pass every two months, it use to be every month (like 4 years ago). Bummer.GreAt staff, seems like they vary in experience (which is nice for me because I'm a newb)", "date": "7/24/2015"}, {"review_id": "E-vzuWDWZSou39-hx1zBGA", "user_id": "IHmii6S1ndKD5c8KsOeXhw", "user_name": "Steve C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "Tried a drop in for crossfit. Entry staff were poor and tried to make me do an evaluation class.Evan the crossfit guy was a pretty poor trainer. He looked bored, didn't walk around and coach people but just sat on the sidelines. Lots of people could have benefitted from coaching on their form. Place felt chaotic.Maybe rock climbing is a lot better, don't go here for crossfit.", "date": "9/23/2014"}, {"review_id": "3vtrwG5TH0hPCtsGXEfhHg", "user_id": "998DQ764VSBA73s-DANBAw", "user_name": "Chris S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have been a member at Planet Granite for just over a year now, and can say that it has been a very painless experience. The staff is always very friendly and accommodating. Lending long time customers a pair of shoes if they forgot them, versus charging them is always a very class act. I have encountered this once or twice at Planet Granite, and it is always very refreshing. It does not feel like they are after your money, what so ever. The facilities are always super clean, and if you are upstairs lifting weights, never very cramped. Machines, barbells and cardio machines are always available.If climbing is your thing, there are plenty of routes with varying levels of difficulty. They have many top rope climbs, as well as two different bouldering rooms. The climbs are updated every month or two, as are the bouldering problems. There are even some super crazy climbs that are set by the gyms signature masochist \"Mike A.\" In addition to the above they do offer yoga and classes, but I personally do not have any experience with them. The bathrooms are clean and well kept up, although the mens bathroom smells horrible and has since joining.", "date": "2/9/2015"}, {"review_id": "M54iwHSyKDFMj-Bnr6RZgA", "user_id": "t9OAdJcdL3suwm0jsAzQEw", "user_name": "Leslie H.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "My home gym is the Planet Granite in Sunnyvale, but I've always wanted to stop by Belmont too. I think that the Belmont PG is probably the oldest out of all three gyms. Maybe they are next in line for a remodel! It's a bit smaller, and parking can be really tough because they don't have a dedicated lot. However, those in the know have advised me to park in the lot just one block north. The walls are shorter, but they more than make up for it with the terrain of the walls, which are very different from PG SF and PG SV. There are lots of overhangs and caves that make for some rather challenging climbs. I think that the setters do a great job keeping their routes creative. I noticed a lot of climbs that traversed in order to make the most of the shorter walls. I didn't get a chance to try out the bouldering, but they have two separate, cave-like areas, one of which has a nice skylight. The locker room was stocked with the same amenities you'd find at the other gyms, it was just smaller. PG Belmont also offers yoga and other fitness classes. And their upper level has the same cardio and weight machines that you'd find at the other two gyms. I think that I'm going to try and stop by more often. It was pretty deserted on Saturday morning around 10:30 when I climbed, but the crowds started trickling in by 12:30 when I left.", "date": "7/9/2012"}, {"review_id": "HBDQ9iV1a2gTsPoqIUHm0w", "user_id": "4r0-Q5eu4FyGQwYwEcxC3A", "user_name": "Bori B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Got a membership to planet granite and really like the belmont location, mostly for convenience!It doesn't offer as much climbing walls as the sunnyvale location, but it is adequate! They offer yoga classes and other work out classes as well so it just isn't focued on \"rock climbing\". The front desk is polite and helpful as well.Parking is a bit of a confusing thing- but you can park on the road and you can use the parking spaces the next street past planet granite for free parking! It is definitely worth the cost monthly if you are an avid climber. I wish they changed the rocks more often because that would be more challenging and if you see a rock path with a smiley face theyre a little bit harder than the other ones :)Great place. it has a sauna too which is nice.", "date": "1/16/2015"}, {"review_id": "GTEAQIl8towTbVRw0E91Cg", "user_id": "k8PWv11EdnzZ071TwwSniA", "user_name": "Wendy M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "A star for the staff - we are usually met with a nice greeting and they are helpful when I have a question. Only one girl who seems fairly new seems constantly annoyed and never smiles. A second star for the climbing - challenging routes and interesting climbs. It's a small gym so you have to keep that in mind, but they do a good job with the resources they have. A star for the sauna - not something everyone is looking for, but I'm happy it's there, especially with the cold weather.Minus a star for the showers. They have people that come in to tidy up, but I don't think anyone ever comes in to do a deep clean. I was going to take off a second star for the lack of better gym equipment upstairs. There are quite a few machines, weights, etc., but only a few great ones. Hopefully they can afford some better ones soon.", "date": "12/17/2015"}, {"review_id": "t1YfUPlFPeOPeNszn7e-Nw", "user_id": "-cM9FQWp3-uu53Os983yCw", "user_name": "Sarah C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 2, "cool": 0, "text": "I'm a newb. Enticed by a deal I found on groupon I decided to check this place out with two other friends. For $35 we got a belay class, free rentals for a week, and one week unlimited use of the gym.It's a good idea to take the belay class or test if you plan on going with friends. I ended up returning with a friend who didn't take the class so she couldn't belay me. I have a fear of heights so it took me 3 visits to reach the top. After that I ended up having a great time and I'm planning on returning. It also gets very busy on weekday nights but the crowd died down as it got later in the night. I think this is a good place for beginners like me with the exception that there isn't much help after your belay class. My friends and I were all new to climbing so we had lots of questions and no one to ask. I think I may sign up for the BRC class to get more introductory knowledge on rock climbing.It doesn't smell that bad in the climbing areas, but the female locker room smells like nasty feet!", "date": "1/11/2014"}, {"review_id": "yjkTIGg0zzPYbn5vxmADrw", "user_id": "XcWmZ6BTXyiEGL6lofBAbA", "user_name": "Ben Z.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 1, "funny": 1, "cool": 0, "text": "This planet granite needs to step it up! I've climbed in in both SF and Sunnyvale and my most recent job change has forced me to climb here. I'm going to hone in on one of my biggest complaints about this place and that's the bathroom. How long is your sauna going to be out of order!? No matter that I cut my cardio short because I believe that sitting in the sauna is pretty much the same thing... sweat is sweat... right?RIGHT!Also, the communal showers are fine, but when PG's two sisters have stall showers it sets a standard that belmont broke. Maybe SF and Sunnyvale spoiled me, but I should expect less, OR MAYBE PG-Belmont should fix its sauna.", "date": "3/21/2014"}, {"review_id": "y-8W5Vi-Cam0rBO9Rb2b3w", "user_id": "ioLQrCvCBz3HmlKZeFxbJQ", "user_name": "K W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 7, "funny": 6, "cool": 7, "text": "I'm giving Planet Granite Belmont 4 stars because I do not like it as much as Planet Granite Sunnyvale (my review: yelp.com/biz/planet-gran…). It is a lot smaller and less active, and the walls are shorter by 10 feet (50 as opposed to 60 ft). The cleanliness and the quality of the ropes and holds were comparable though, and I did like the routes themselves. The walls had some cool features though not as many as in Sunnyvale, because of the more limited space. The difficulty level was slightly more difficult than the Sunnyvale location. Parking was on the street in a residential area, which was kind of weird. We checked out the climbing wall \"treadmill\" machine too, which was very hard to use. Definitely more of a novelty than anything. The second floor also has some other gym equipment.Verdict: This was definitely more like a standard rock wall gym than its Sunnyvale counterpart. Good routes but nothing stood out.", "date": "6/29/2013"}, {"review_id": "_WgU_nElZnF71cTl4txo1g", "user_id": "Wd4m-rvH7ulUHUF5bosBIw", "user_name": "Georgette E.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've never rock climbed before and joined a few days ago (using a Groupon - awesome deal)!My body isn't that of a RC as a matter of fact...I'm not in very good shape at all but I will continue to come! It's fun, everyone is very friendly  and I'm actually starting to enjoy it! I truly admire everyone who practices this sport! What a work out...Thank you for the experience Planet Granite...see you later!", "date": "4/24/2014"}, {"review_id": "ZrQi5InfC7bXf_EJ1gXZiA", "user_id": "D-rKFBb1s4_4vpDA9Wjiog", "user_name": "Michael E.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty solid gym, good mix of bouldering and top roping.   Interesting fake rock wall too.    The route setting was good, and when i went it wasn't crowded.", "date": "7/1/2014"}, {"review_id": "sDr0jusuuclSox0D5VFkDA", "user_id": "47jYU6CunkW--4S9vYqyYg", "user_name": "Helen F.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "Belmont PG is a midway point between SF and Sunnyvale.1)  Location-wise it's very conveniently smack dab in the middle of the Peninsula.2)  It's not as luxurious as PG SF, but it's definitely not as stinky and crowded as PG Sunnyvale. 3)  The classes here are by far my favorites!    Harriett's Abs & Core will destroy you.  Don't be fooled.  The equipment upstairs seems ok and the set-up is interesting - as Scott L. has mentioned, it's great for people watching.They are getting a new bouldering room in August!", "date": "7/28/2011"}, {"review_id": "OkCQdHDlLXee1AGLQVgBOA", "user_id": "d3Bo5XEL_vk8dGg_vjhdJQ", "user_name": "Nathan T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 2, "cool": 2, "text": "I can't not like PG, but I have to not like it because it's so far from me - I'm in East Bay - and it's so damn expensive. I don't have a membership because their gyms are so far and so expensive. But, I take every chance I can to come here and climb. Belmont is not my favorite just because it's so cramped at this gym. There are two small bouldering rooms with plenty of problems, but the area for people to exist in these rooms are miniscule. Always chill staff at PG, but if you are in Belmont and need a solid place to climb, come to PG. I haven't done much top roping at this PG, but it should be just as fun.", "date": "9/2/2015"}, {"review_id": "Rtr22yotOXMqaYjLeS8Ktg", "user_id": "tUsrdWOWjOGf_hTsjMKycA", "user_name": "Stephanie C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm used to the Sunnyvale PG, but came out to explore this one with a friend who lives in the area and wanted to try this one out. I don't really boulder, so I'm really just covering the top-roping in this review.Compared to Sunnyvale, it's a much smaller gym, but I feel like they're a lot more creative with their route setting to compensate for that--the routes aren't all a nearly straight vertical climb, and I appreciate that because I'm not yet very good at remembering to look around for other hand/foot-holds. I also like that they have walls that are a little more random than the generally flat panel ones in the center, which resemble the Sunnyvale gym more closely.The staff here seems a little less approachable, but it may simply be that I've interacted with the Sunnyvale staff a lot more from having started out with a couple of classes there, so I kind of know them a bit better than just strangers. The locker room and bathroom here is a bit dated and worn, but seems to be clean enough. Parking is confusing--after coming twice, I am still not sure where to park, but we've managed by finding street parking or parking in the lot for the car shop next door. I think they have a fabled lot somewhere, but I'll be darned if I can find it :/Definitely a place I need to bring my usual climbing partner, because I think she'd appreciate the route creativity :) All in all, a better gym than I thought it would be a first sight!", "date": "7/5/2014"}, {"review_id": "RCeuBl32UtVg6RBhvY16rA", "user_id": "zHLYe5QQUIZcavmLWeHD_Q", "user_name": "Karen C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I started climbing in February (SuperBowl Sunday to be exact) and since PGB is 4 miles away from my pad, it's hella convenient.  Since I started, I've been averaging 2 visits a week, often times more.  It's definitely WAY smaller than Sunnyvale (haven't been to SF...yet!) but I love the peeps here - the staff has always been super nice and they are extremely safety oriented.  (I notice that the bad reviews I skimmed are largely due to being told they couldn't teach their friends how to belay and tie in...it's a liability issue of course, there are signs everywhere stating that only staff is allowed to coach and instruct, which makes perfect sense to me!)  Again I'm a new climber so I don't know how frequently routes are changed at other facilities but there are new ones set pretty often.I've brought an experienced climber here for a climbing date a couple times and he was impressed with both the routes and the features of the walls - lots of interesting cracks and crannies on the back wall and the slab to work with.I also love the community feel here.  People are very friendly and open. There are regular parties & events - I especially enjoy Swingles night (2nd Thursday of each month) where you get an opportunity to meet new belay partners and dine on Round Table Pizza (Win!).  I belong to two other fitness clubs so have only used the cardio equipment a couple times and have yet to go to the classes, but trying the yoga classes is definitely on my to do list.I used to go to the movies here as a kid way back when the building was the Belmont Cinema.  Love that they kept the sign (wish it lit up though - I asked about that and they said it doesn't work anymore, rats!) and some of the old movie seats.  I also think the bathroom toilet area has the original stalls and fixtures (hey as long as they work and there's ample TP...).  The locker rooms aren't Equinox quality, but then again I'm not paying Equinox prices, and they are clean and tidy.PG is also the best deal I've seen for a fitness club membership - $75 a month and that gets you into all three facilities, includes the yoga/fitness classes and free guest passes every other month as well as the first Friday of each month.  That my friends is a SMOKING hot deal!Doesn't have its own parking lot, but there's ample free parking the next block over in the Bel-Mateo section.  I've never had a problem finding a spot.The SV PG might be way bigger but PGB is my home climbing club!", "date": "7/17/2014"}, {"review_id": "-yVcRdcczSlAvw1fBEnKgA", "user_id": "oOWQeejChOieuAO1mHHW8w", "user_name": "Justin A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Stand-out: Best vibes of all the PG'sStand-down: Stuck on dubstep :/ ... sometimes I like a chillax climbing dayTry: Climbs set by Mike A (smiley face guy) and don't be ashamed when you can't figure out his 11a's. They're special.Haterade (bathroom reviewers): No, the bathrooms aren't incredible. But would you rather them spend money on new holds / pay their rad people good wages... or a dyson hand-dryer?Qualifications: Home gym", "date": "1/17/2015"}, {"review_id": "4ixSMXueebh7VFmLeNQ5fA", "user_id": "kUxc3c3UT43bTKqIT_sN_A", "user_name": "Kia S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "this [lace is awesome. Great place to workout and socialize. the climbing was fantastic. Nice family friendly place and classed for all ages", "date": "2/17/2014"}, {"review_id": "LD-1B71r-TqzFqZo96Iz8Q", "user_id": "u90GXRGhw1IR1hahrF0dzg", "user_name": "Kirsten A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "ON BELAY!!!I absolutely love this place.  After work the crew usually goes here, and I have been the latest addition the last few weeks.  Tonight I decided to buy a membership with my boyfriend.  Such a great investment.  Great prices.  The only complaint I have is that I still have to rent shoes (and that is my fault.. I haven't bought ones yet).  As I type this, my hands and forearms are sore, and I love it that way.  I am now looking forward to becoming certified in belay and the ropes course!Now that I have a membership I can take all the yoga I want, boulder and climb after work, and even use the gym upstairs. It is never too crowded, so I always get a nice space to climb without feeling like someone is going to fall on me or invade my space.The staff is very friendly and helpful and the place is pretty clean.  Definitely 5 stars.  Just wish it was a little bigger like the Sunnyvale version!!", "date": "10/16/2013"}, {"review_id": "qVsE0Dm51YAe5RCoTMuNPA", "user_id": "73uREN3CeWi61xro00BMlQ", "user_name": "MJ B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "This review is only for  the gym part of the establishment not the rock climbing - I will make this fairly short and sweet.Great staff super friendly and laid back Below average equipment especially the cardio machines - treadmills out of order allot one day I went in and I believe 4 out of the 6 treadmills were out of order - same with elliptical I believe it has to do with the dust that the powder produces when people are rock climbing. Not very tidy I believe this also has to do with the powder from the RC but the yoga studio is not the cleanest eitherAll I can say is this place is good for a quick in and out work out. I believe that it is great for the RC but they are also trying to pass themselves off as a gym which does not quite work for this location. I do not know of the others but this one is a bit mediocre.", "date": "4/8/2014"}, {"review_id": "eGJFJ3y_maQOjj6a7zCrRw", "user_id": "rmVUJyUx9Rtq2ePN-C7wSQ", "user_name": "Mochi C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "This is my usual rock climbing gym.  The people who work here are super nice compared to what the San Francisco / Sunnyvale Planet Granite.  The climbing area is smaller than the other two but I think it's at least not as crowded as Sunnyvale's on a weekday night.  (Don't make it up to SF's so don't know about that one).  I took for the 4 week climbing class which I enjoyed cuz of the tips I got in the class to help me climb, which I tell my friends when I drag them to climb with me :)If you get the membership you get to sign up friends to take their 1 hour belay class for free! (2 max at a time :))   You also get to bring in one friend for free(without the class) once every 2 months(odd months)The place does smell.. but I think most of the climbing gyms smell cuz of the shoes and sweat .  I like the routes and the climbers are friendly~", "date": "10/16/2013"}, {"review_id": "hGRji8Pu8QGt9jf2OKYFDA", "user_id": "mcOij5eZkNo5qBnwgHhLaA", "user_name": "Quinn Z.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I did enjoy the rock climbing. They have you take a intro class first. Watch a 15min video, then in person you get shown how to climb and secure your harnest by one of the workers. Next visit you come in and want to climb, they will test you to see if you will get a red certified slip or a temporary slip (if you fail). Beware of the busy after work hours and weekends. Then you would have to wait for a section you are interested in climbing. This place tends to smell like feet. A lot of ppl walk around w/o shoes on. There is also a gym upstairs that has treadmills, bikes, weights, and some machines. Not too bad. I would like to thank Travis for allowing me to keep using my five day pass even after it had expired ( I'm busy and didn't check to see it had an experiation date from date of purchase, my bad).", "date": "10/26/2015"}, {"review_id": "iwQUVNeOV5e3L49XoJ9uYg", "user_id": "AFMCz8n65JMWQUClaYAMsA", "user_name": "Vivian H.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I'm a little hesitant to post a review for this PG, because I don't want it to be over-run by all the jocks at 24 Hour Fitness. The routes are tall and varied, and the bouldering areas don't look like they ever get too crowded. The machines and weight area is nice and the equipment is in good shape. The locker rooms are also pretty clean, and the staff is super friendly.The only problem is parking around the area, but there's plenty of parking in the lot to the north of the gym.", "date": "4/9/2013"}, {"review_id": "iEOO6acUSOdIcUNUFmOj3g", "user_id": "bU_cbQ-wO5a1LkUE-6PDXg", "user_name": "Anon P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Appears to be staffed by minimum wage teenagers.  Not very attentive.  Kids class is $70/hour, 5 kids per instructor - that means 80% of the time is spent waiting to climb.  Also that's $350/hour they are charging, for a teen instructor who they are paying $10-$15 for that hour.  What's wrong with this picture?", "date": "10/19/2016"}, {"review_id": "bN00qlCKx8Yr9nDbFycEpg", "user_id": "J0m0GUv6iSmo7urOYWrU3g", "user_name": "Benoit T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I have been coming to Planet Granite Belmont about twice a week for the past 3 months. This is a great climbing gym with a nice atmosphere. It is relatively small, which can make for some busy nights. The ventilation is not the greatest, even if there are a few fans around the room.The routes range from 5.3 to 5.13a (the highest I could find yesterday). Even on busy nights, I've never had to wait very long for an appropriate route.Safety is always a concern when it comes to rock climbing. I started here with the belay lesson, and I have never felt unsafe. The initial instruction was thorough and clear. Also, there is regularly a member of the staff walking around the gym and checking people belaying. On several occasions, I have witnessed them correcting people.", "date": "5/21/2013"}, {"review_id": "JJlyaWleS72L3kd27l7R3Q", "user_id": "8L2ZA3hyONXxCj0poc9MmA", "user_name": "Natalie G.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This has become my home gym. And it wasn't an easy thing, given that my previous home gym was 5 min drive away, and this one is 20 min away.I happened to come in for the first time the night the BRC (beginners rock climbing) class was starting, bought it on a whim and kept coming back ever since. It's a class that meets 4 times, and by the end of it I was feeling very comfortable doing whatever I wanted. Jesse and Cheyenne, the guys that taught the class, were super awesome. Some of the participants needed more help than others, and they would do whatever it takes to be helpful. Others needed a challenge, so Jesse and Cheyenne came up with the (fun) drills and harder climbs. They answered all of the questions we had, and Cheyenne even spent extra 15 minutes after the class (it ends at 9PM!!) belaying and cheering me up while I was finishing a tricky route.I live between their Sunnyvale and Belmont locations, which sort of gives me the freedom to choose between them every time I go climbing. And, even though there are more space and more routes in Sunnyvale, I prefer the Belmont location, as the staff here is so much more friendly and helpful and I truly appreciate it. They will teach you, advise you, challenge you and help you every time you need it. I also tend to bring all of my friends that want to try climbing here instead of other locations even if those are closer.As for the gym part, the machines are very simple, but there are some fun additions, like the rings and the boards. I also heard people raving about TRX classes but haven't tried them myself yet. Everything is organized nicely, and you can create a good workout using what they have. But if you are already here, you might just as well go climbing, right? Hey", "date": "6/2/2015"}, {"review_id": "JAVMmlnu6Z3uHCKX9tkdNg", "user_id": "kK0QDyfeSwcZl4gGilnW7w", "user_name": "Amy H.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "I came here with reservations at 2pm to take the class so I could climb those walls. I think its a requirement if you are to start and once you complete the class, you have a temporary pass that you would bring next time where they quiz you to see if you remember. If you pass, you get a permanent pass and never have to take the class again. Also, you get a special deal at the end where it is 5 passes for $55 that is only redeemable that day you take the class. Classes are usually $20 a person so if you are into it, then you should buy it unless you get membership. The class was very thorough and lasted for over half an hour. I can imagine that it would take longer if the class was bigger but since it was only three, it was ok. I kept messing up on tying those friggin knots and I felt like I was in college again cramming right before the exam when I had to show my knots, phrases, and security checks. Dat pressure. I just wanted to climb already but the safety is important. Once you go over the actions for the climber and the belayer, then off you go to explore.It was fairly empty around 2pm but it got pretty popping closer to 3-4pm. There were classes or tours for little children so it became a zoo. So many yuppies do rock climbing and I can only imagine what the Sunnyvale and SF locations are like. You can see there are so many legit people with their chalk and shoes and it is quite intimidating but oh well. It is all about the experience and reaching the top. The routes are marked depending on difficulty. I think the easiest is 5.6 that you practice on and the hardest I saw was 5.13. The most I did was 5.9 haha. I cant help that I am short with no reach or upper body strength. Prepare yourself because your arms will hurt during and definitely the next day as I type this. You see people climbing up like spider monkeys but just take your time and if you fall, you hopefully have your partner to catch you. When you go back down, you just gotta let go and trust. It's definitely hard to let go but Frozen it up. I didnt push against the wall as I went down but I would do that or else you derp and twirl around. There are also shorter walls where you dont have a harness and a complete gym upstairs. If you are into climbing like these hardcore people, I guess this is the best option since it has your walls and a really nice gym. Go with at least one person but you wont be able to race them because one has to hold you. It is fun to go with a group of four maybe because you can cheer each other on. You dont need to bring sneakers since they provide it with your pass I think. I got the one with the class and it included everything so I think the $20 for a regular day would include equipment. Wear workout clothes like tights and a shirt since people may see up your shorts haha. The people here are really dedicated to the sport so I wouldnt worry about that actually. You will sweat as you climb and trying to reach for those things. Girls, dont forget that hair tie because it could potentially get stuck in the ropes or what not. This would totally be fun with friends and I might just do it for funsies even though I get tired so easily. I stayed for about two hours and probably only did 4 tracks haha. Good enough for me!", "date": "9/28/2014"}, {"review_id": "QFVneYhZoRaGLaU3rrlhBA", "user_id": "zdCIG0Gmtkc0UlyUWV-znA", "user_name": "Gaby V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I don't know much about rock climbing but I do know that this place makes me want to start doing it every single day. I think they also have a gym there for people who are interested but I'd definitely recommend Planet granite for a fun time rock climbing", "date": "9/28/2015"}, {"review_id": "hfFLP3h6Jruqj1RLV2zUrA", "user_id": "w8flMOM04LfF0175Stp3AA", "user_name": "Nette T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 6, "funny": 10, "cool": 5, "text": "For those who know me personally, they know that I hate exercising. Getting me to move my old carcass around takes lots of cajoling, begging and finally, admonishing me that I need to exercise for my health.I've finally gotten around to moving my carcass around more often. The reason? It's not my health. It's so I can eat more noms.Planet Granite is crowded on weekday nights where you literally have to wait around for a route but if you go on a Monday night or even weekend it's almost empty.  Facilities are pretty clean and doesn't have the \"interesting\" smell that the Sunnyvale PG has.I always start out on the kiddie routes and end up somewhere on a 5.8 which for me, is a miracle. I don't have any technique per se, but it's more of a physical challenge for me that I'm using muscles that I didn't know exist. I've worked out at the gym upstairs and it's almost always empty. It's way better than Golds or 24 hour where you have to wait for machines at peak times.Trust me....if I can get my carcass to move up the wall, so can you. If you are thinking of trying it, just do it!", "date": "7/6/2010"}, {"review_id": "o0URx1SLN-JHDgPBAVAUhQ", "user_id": "q1cCZya0JWNWjlMbS-LXCA", "user_name": "Han-Hsiang P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 1, "funny": 1, "cool": 0, "text": "Don't bother to call them. They just put you on hold and never respond. Just make anther call hopefully someone else can help you right away. And there is always a competition event going on...", "date": "2/22/2015"}, {"review_id": "AIiQOe4xqmXfGcHgq2uoZQ", "user_id": "TIUNy47Np73O6czmNuLg4Q", "user_name": "Evelyn K.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Planite Granite day passes are expensive, but membership is not bad for what you get.  The equipment/gear packages they sell are also a great value (harness, shoes, etc.)This location, like all others, smells like stinky feet.  It is something I had to get over, as there is no way to avoid it at these places.The staff is really awesome, and the members are pretty awesome too.  Everyone is so nice, friendly and helpful.  The locker rooms are sufficient, as are the climbing walls and and standard gym equipment.  Parking is a little tougher in this location with street parking versus the Sunnyvale location, where they have a large free parking lot.", "date": "6/10/2013"}, {"review_id": "KhnjTkc2zjd0dduZ-7aQmg", "user_id": "m_-slAwQAeWlQZyAOEup1A", "user_name": "Mark M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 2, "text": "Looking for a new hobby? Rock climbing is something you should try. Great place to work your upper body and legs. Very nice staff and they make sure you know how to belay / use their equipment.Definitely coming back, good music too. Probably need more fans or windows, too many people can cause the place to smell a bit funky at times but overall good. They also have other locations and once you are in their system you are good.", "date": "5/10/2013"}, {"review_id": "7WlELYQJbMUkvf6_oqobFA", "user_id": "LrLpepM5eIfaEVIHqh40oA", "user_name": "Natalie S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had my daughter's 10th birthday party here. Girls had a great time, there are areas to climb for someone who is just a beginner to one with more advanced skills. 4 to 1 kid to instructor ratio was good (their maximum is 6 to 1). Everyone, from people at the front desk to instructors were super nice and accommodating. Special thank you to Jesse who handled the arrangements and was there on hand to answer all questions and make sure that everyone was having a great time. If you're thinking of a birthday party or to just come a climb I would highly recommend this place.", "date": "10/12/2015"}, {"review_id": "w5_P8fGavCIGJN4VFYFkwA", "user_id": "l7oyEHjWQi5SQO8Vy5AH_w", "user_name": "A P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place in the morning for lifting because no one plays with the weights other than 3 people. The classes they have to offer in the AM are tough and led by this lady with a drill sergeant attitude .  The climbs here feel more challenging compared to Sunnyvale and SF even though it might be the same grading. I took my lead test here and they are accommodating vs the busy San Francisco gym and Sunnyvale gym at peak hours. Friendly environment for all are and skill levels.", "date": "12/10/2013"}, {"review_id": "_IOh9VfDF2SXQUnbS2lr4A", "user_id": "wrrY2eOV6NiHl0NW_GS_Pg", "user_name": "Tracy C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "On belay?  Belay on!!New to climbing?  Expert climber?  Looking for a great workout?..... Then this is the perfect place to be.  PG offers many classes for all climbing levels.  I took a class here when I first started climbing and the staff made it a really fun and safe experience.  Although this climbing gym is pretty small (especially compared to the SF and Sunnyvale location) it's my favorite, for sure.  I like this location because the staff is way more energetic and it's always clean.  I also love getting in a cardio workout on the 2nd floor because it allows me to watch the climbers instead of staring at my treadmill screen during my entire workout.  If you've thought about climbing, this would be a great place to start... You'll feel right at home!", "date": "4/10/2013"}, {"review_id": "7npcR5KrubhTxwgYGmpHLA", "user_id": "ZmFl1-MRitlcxU7UAPpCNw", "user_name": "Yanna L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I originally joined Planet Granite at their Sunnyvale location, which is much larger than the Belmont location. However, we live just down the street, so Belmont has become my new home. All the staff are friendly and I see them cleaning the machines often. I wish they had better ventilation, at times especially in the summer months it can get a bit stinky. Also, some of their classes take place in between the main work out areas which can also be frustrating (especially when they take all the mats and weights). Perhaps they will have people start bringing their own mats to participate, which would be a plus.I also hope they start offering their pilates classes on other days than Sunday. I'd love to go during the weekday when I have the time! I wish they also had the \"gym only\" option  again which was a bit cheaper since my belay partner is injured for the foreseeable future and we aren't utilizing the rock climbing aspect.", "date": "9/25/2012"}, {"review_id": "V6eNeuw8uc_U_Ffh6D3RTg", "user_id": "L_uOck4lGl4cdw8o5EsJ9g", "user_name": "F C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My go to gym. My hubby loves to climb so I tag along. People are nice and routes are challenging. If i need nick pick on something is that the place should has some heating!", "date": "4/19/2015"}, {"review_id": "Q9XGmKQ8zkmJy6IGiXWSEw", "user_id": "HAv257_IVJnQT0ZIL8Nn-Q", "user_name": "Greg G.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "Planet Granite is a great climbing gym, however this location (when compared to the other two) is a little bit on the weak side. It's not bad at all, but I mean it's just sort of small. The top roping routes are pretty short and it can get crowded really fast due to the smaller space of this location. The staff is kind and the other members are great too. There are two bouldering chambers around the outside as well as a yoga room. There is a fitness center upstairs and I believe this location allows for you to just have a fitness membership at a cheaper price than the 70 bucks a month for the full gym access. Not bad I thought.", "date": "4/24/2010"}, {"review_id": "Fp5n7UKry0rGYIWc0cluCg", "user_id": "tQRw0aZcyns3i2V7PxygKw", "user_name": "Stephanie S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 4, "funny": 4, "cool": 4, "text": "This was my first experience rock climbing. Conclusion, I am very bad at it. That's not to say I can't climb. I can climb. Despite my small, unassuming frame... I'm quite quick and agile. The height of the climb wasn't really an issue either. Truthfully, I thought the height was exciting. I suck at it because apparently, I am really bad at multi-tasking. Who knew? We started with the belay lesson. Our instructor was great. I think his name was Brandon? Anyway, we found him to be fun and informative. He went over different types of knots that we would be using. Figure eight, double figure eight, double fisherman's knot, etc. I soon discovered that there's more to climbing than just climbing. Many steps to memorize and be proficient at.You must be able to:- attach the belay device- complete a safety check for the belayer (check harness, check that you are clipped into your harness, check that the carabiner is locked, check that the belay device is fed and configured properly)- tie in with a double figure eight knot, followed by a double fisherman's knot- do a safety check on the climber (check harness, check where the rope is tied into, check figure eight knot, check double fisherman's knot)- demonstrate correct communication (climber says, \"on belay.\" belayer says, \"belay on.\" climber says, \"climbing.\" belayer says, \"climb on.\")- demonstrate correct belay techniqueI went first. I got all the way to the top without incident. Rang the bell to signal success. Then suddenly realized, I had no idea how to come down. So, I call down to my instructor, \"Okay, now what?\" Probably something I should have inquired about prior to. He responded with something like, \"Just sit back as if you are in a seated position. Grab the rope with two hands and let your partner do the rest.\" Easy enough, if you aren't a control freak like I am. Needless to say, my partner came through for me.  Now it was the bf's turn. No fair. He'd been rock climbing before, so some of what we were expected to know, he'd already practiced. He too reached the top without incident. I then suddenly had a thought. Oh, s**t! Is the obvious difference ie; his height/weight ratio to mine going to be a problem?! He's 6' 5\". I'm 5' 1\". He clearly significantly outweighs me. What's going to happen when I release the brake?! I turn to my instructor with my concerns. He assures me I should be fine. I release the brake... and... F**K! The weight of my partner starts to pull me!!! I calmly blurt out a few profanities while informing my instructor of what is taking place. He quickly grabs ahold of the rope and we (together) safely lower my partner to the ground. What I learned from my 1st climbing experience:- I love to rock climb- I could benefit from much more additional instruction- I am not-so great with the multi-tasking- Watermelon weights (they aren't REALLY watermelons, but instead weights that you attach to your harness to keep you grounded) are a must for petite climbers like myself who climb with larger partnersPlanet Granite is a great place to climb, especially in the mornings. Perfectly set routes for all levels. Tons of routes to figure out. You could climb non-stop for hours and never even come close to trying everything in your level. And... if the dates on the cards are any indication, the routes change quite frequently. Enough to challenge the most experienced climbers.The front desk staff members were all very friendly and attentive. I'll likely be back, as I'm considering taking the B.R.C. course... if they ever offer it on a Monday or a Tuesday (my days off). For now, the course is only offered Wednesdays from 7-9pm. I only wish that I lived closer so I could come here everyday.", "date": "11/14/2011"}, {"review_id": "e3UinE5Qu1K2Oi0cwZYhNQ", "user_id": "OFGOQyjxMTD2zFnFK7dR7g", "user_name": "Krystel D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "I went here for Valentine's Day with my husband. We were completely new to everything, so we took a short 30min beginners class. For just 30 bucks per person they gave you rental shoes, the class and as long as we wanted to climb for the rest of the day. I had a great time. The only thing I would recommend it to buy your own shoes. The rental shoes they gave me really smells (duh since they are rental shoes) and also it was not an exact fit (apprent", "date": "3/26/2012"}, {"review_id": "T6POc1A2dG9c8HGHqAL3Wg", "user_id": "zA4doZHLspqkmfKiKfGmVA", "user_name": "Mike C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "If you're an experienced climber, leave all your experience and habits outside. Planet Granite is so anal on how they run their place that they will harp on you if they don't have it their way. I was scolded at for trying to give a climbing refresher course to my partner. I was told my partner had to take a class to learn to belay and set the figure 8.  My fault for actually knowing how to really climb and teach... Also, the day pass price to outrageous!! $20 is a bit too much for the amount of routes and size of the gym. I pay the same price at planet granite in Sunnyvale and SF for twice the routes and size. On top of that, it's over crowded. I drove in traffic from SF to be in traffic waiting for a route to open. Your paying $20 to literally wait for open routes.Overall, not a bad climbing gym if your a beginner. For the experienced climber, I recommend going to planet granite in Sunnyvale or San Francisco.", "date": "7/16/2014"}, {"review_id": "zAIfh95ENmskU99JStEZlQ", "user_id": "397N9-g-uc56q97VnaSBCw", "user_name": "Jennifer C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Murphys law. When you plan and everything goes wrong. Well, that was the case for my guest. I'm a member here and I'm hesitant to write a review. Why you ask?  Its cause its awesome and I don't want to share!   Well, after today, I would feel horrible not sharing. I signed a gf for a belay class and she ended up being super late.  Well, poor girl had a few bad things happen which caused her to be an hour late. The instructor told me he would wait and sure enough, he did.  This isn't the first time its happened (different guest)  Every time I come here,  the staff is always friendly.  They make one feel comfortable and ts awesome.  One day,  I came in and it was packed. I came in with someone who had a day pass. It was so busy, we decided to leave less than an hour later. The gal at the counter gave him a pass for another day to make up for that one.   Can't say enough good things about the service. I'm definitely sticking around for a while. Yay planet granite!", "date": "1/18/2012"}, {"review_id": "Bx22SzBLO1xcN0KAw0YuvA", "user_id": "q4HdIRXq1SOFGLknVvqqFw", "user_name": "Gary A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First, I don't come here for the rock climbing (I don't do that...yet).  I come here for the machines and the yoga classes.Machines are always clean and functional.  I've never had to wait for one, either -- even when busy, most people are climbing, leaving the exercise machines mostly unused.  Awesome!The yoga room is nice, although it smells of feet by the end of the day.  I go to Edwina's \"Foundations of Flow\" class, and it's a great way to get a simultaneous workout *and* stretching that I can feel for a couple days afterwards.  She's absolutely great.  If your schedule lets you attend one of her several yoga classes, you should DO IT.The front desk staff is a little out there and occasionally maybe-stoned.  If there isn't a button to click on the front desk computer, they don't know how to do it and need to call a manager.  Eh, what can you expect from today's college kids? :-)", "date": "4/20/2013"}, {"review_id": "stkM4cBn5JbNhsIAmHzADA", "user_id": "Mln71x70ZKNA7EDxtK9EpQ", "user_name": "Glen G.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 5, "funny": 6, "cool": 2, "text": "Free fun is gooood, like 5 star goood.  If you know a member here, the first Friday of every odd number month entitles them to bring a guest.  As a first timer, you get belaying/climbing lessons as well as equipment for free.I've never climbed before, hell the last time I even tried anything remotely similar was long ago when I failed climbing a tree for my 5th grade crush MaryLou, so I approached this with a lot of trepidation.The lessons were informative, and quite comprehensive on the safety aspects of tying knots and belaying, though could be more thorough in the actually execution of the climb.  I guess I really shouldn't kick out when coming down, huh?  I picked a climb that was in a corner and ended up cartoon bouncing back between the two walls smashing into the AC vent before finally getting down...so a bit banged & bruised.But if you can swing this w/ a current member, you're saving like $40...not bad if you bored on a Fri night.On a side note, for my fellow bigfoots, they only have up to size 14's on rental and they are sized down by 1/2.", "date": "9/6/2011"}, {"review_id": "B-CfTrCd0VWcdIYzq4gkDQ", "user_id": "qsDBC_a68Ge72K_oPlznaQ", "user_name": "Katherine F.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Silicon Valley yuppies ditch their suits and dresses and the monotony of the 9am-5pm work schedule to become super hero climbers at Planet Granite.THIS IS WHERE ALL THE YOUNG PEOPLE ARE.  On a weeknight, PG is flooded with 20 and 30-somethings -- I just fit right in.  Climbing has become an incredible stress relief outlet and a healthy hobby!  No wonder it caught on so well.I started off as a young grasshopper of a climber.  I am by NO MEANS a natural at rock climbing.  I can't position my body well, the lack of dexterity in my fingers is largely unhelpful, and I have little arm strength to contribute.  But man, oh man.  After one month (2 climbing sessions/week), I improved leaps and bounds.  PG has plenty of courses and you can always find a challenge.  The Belay Course:  1 hour course, offered at 6, 7, 8pm on most days.  First, you learn how to tie-in, learning the knots, the safety check system.  Next, you learn how to belay: hook-in, safety checks, feed the rope, and brake.  My friend and I were the only ones in this course so we received personal attention.  The instructor had a bit of trouble accommodating for a lefty (myself), but it was a-ok.The Belay test:  line up!  It's a lightning fast hands-on quiz of everything you learned in the belay course.  Don't flinch or you may not pass.  :O  No pressure though.  Just refresh the basics and you'll earn the red belay certification in no time!The top-rope climbs:  there are so many!  Varying heights, difficulties, and features.  The courses are altered monthly.TIPS for 1st timers:- It's gonna be a blast. - If possible, I recommend you eat a light dinner beforehand so you have some energy to devote to those muscles.  Or bring a Cliff bar (ya know, cuz you'll be hanging off cliffs?).  - I don't recommend that you wear shorts just bc it may result in an embarrassing wedgie.- Find solace in the steam room.  10 minutes and your muscles will thank you.- The parking lot gets pretty full just FYI.  It's unavoidable.Overall, after one month of climbing, I'm hooked.  After one and a half months of not climbing, I vow I will return soon.  The people here are incredibly inspirational and I can only strive to do what they can do!  No complaints.  :)", "date": "8/9/2013"}, {"review_id": "MPQbWukZvv_2tema13EMpQ", "user_id": "D_XyDs6d4DXgIdObhHeZDQ", "user_name": "Nick K.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "***Good***Decent selection of top-roping routes. Average workout facilities. Solid cardio setup. ***Bad***Bouldering here isn't very fun. Not a great set-up or selection of routes. ***Recommendation***Go to the PG in SF", "date": "12/29/2012"}, {"review_id": "FDMTc8-VhIe09NzRHXhHDA", "user_id": "LRbEWHJSxy_xtVvazIaaZA", "user_name": "Tai C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! Very helpful staffs, interesting paths, and not a lot of people. The only problem I have is the men's bathroom is kinda stinky.", "date": "11/25/2014"}, {"review_id": "AEN99NkWM4_gcaQiDC2jXg", "user_id": "KRlvnjCrbItaW7fjOhXSMw", "user_name": "Monique G.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place. Wonderful service, the staff is friendly. Good for kids 5 star.", "date": "4/26/2016"}, {"review_id": "Tn8_YjOTuWGywbdpMAID-A", "user_id": "UQFE3BT1rsIYrcDvu_XVow", "user_name": "Mike V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "slowly edging PG-SF in the music category.sorry Patty.especially mid-day when the place is 99% empty.also, the locker rooms, saunas, showers with tons of towels, shampoo, conditioner, bd wash, are awesome. (I've heard the womens was a bit cramped so the guys definitely lucked out)", "date": "5/25/2012"}, {"review_id": "Yoe_W9qmqoY5u1NsDJ1-hQ", "user_id": "a21yEFhTXEJImb9hGl0JyQ", "user_name": "Walter P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 6, "funny": 2, "cool": 4, "text": "$20.00 for the daily pass:   $17.00 to climb and boulder.  $3.00 for the harness.    I saved a few bucks because I brought my own climbing shoes and caulk.My friends and I visited Planet Granite last Saturday.    My goal was to utilize all the strength I worked on for the month of March and put it to the test at bouldering.    The simple and intricate patterns (steps) are mind blogging but worth every minute during my climb and canvassing.       It wasn't very crowded on a early Saturday morning so I was able to take my time and scale the walls with ease.   No one bothered me and I didn't feel rushed.     I was able to sort out the difficult ones and improvise well.By late morning, a group of kids (5-8 year olds) began to flood one of the bouldering rooms. That's when I decided to call it quits.  Besides my hands began to blister up after two hours of workout.There is workout gym upstairs and a yoga room downstairs next to the lobby.  I didn't venture upstairs but I did see eliptical machines.   The lobby has a gift shop and appearal station (in case you want to get into indoor rock climbing or bouldering).   I will be visiting again for another strength test.", "date": "4/3/2007"}, {"review_id": "apKDiOClapUmBgEp7zvXsA", "user_id": "F0ZYoC3hm3XspMEb0NeiUA", "user_name": "Erin T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I am here pretty much every week so I guess its about time I wrote a review.  I have not actually been to the other PG locations yet so I cannot compare, but I will compare to Rockreation, my old gym in LA.  The top rope routes here are fantastic.  They set new routes just frequently enough that I have a new challenge once I have tried most of the routes at my level.  The gym does get pretty crowded on weeknights after about 7:30 so the earlier you go, the better.  It does get to the point where I am waiting for ropes.I don't like the bouldering areas quite as much as my previous gym.  It seems that they are all just incredibly challenging so it is difficult to get started if you aren't already an expert climber.  I was able to do most V0 and V1 routes at my last gym, but I can barely handle the V0s here.  Just a little frustrating.The amenities are great.  There are regular yoga and kickboxing classes and lots of cardio equipment.  And even a sauna in the locker room!  Overall a really great gym.", "date": "6/7/2012"}, {"review_id": "WFkyoULtZE3-dX6dUrhqlw", "user_id": "3mhWPOgs2JJOAObNPQD3MQ", "user_name": "Mario B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is possibly the best gym in the Peninsula. They have a small free weight area, which is separate from all of the machines and abs section, and it is never crowded! They also have great rock climbing and fantastic route setters. The staff is extremely nice and approachable. The gym is constantly being cleaned and it seems new routes are being added. You also don't get the highschools kids in here that take up machines and free weight but spend 45 min. starring at themselves and flexing. Overall this gym has a great crowd, a great set up, a great staff, 5 stars because it is perfect.", "date": "11/7/2012"}, {"review_id": "mBzbVXsBRpq5WddVpVU5mw", "user_id": "D7LWHDlXV06OQQhC0bZm3A", "user_name": "Matthew W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Went for some bouldering. I've been training my grip for the last couple months and it was still incredibly challenging. When my hands got tired, I headed up to the gym for some running and lifting. Everything was great. Two bouldering rooms with a variety of challenges. Chill people and good equipment.", "date": "5/18/2014"}, {"review_id": "Yhol4PyAv111XRUeZEs3xQ", "user_id": "1ziPC7yx27Ps_m0MzN2OxQ", "user_name": "Cindy C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "I love that this Planet Granite is not only a climbing gym, but also has yoga and regular workout equipment.  I love that this Planet Granite is less than 5 minutes drive away from my house.I don't like that the membership is $70+ a month.  But they do have a sauna which can be a nice benefit I have yet to use.I wish there was a easier way to find climbing partners. I wrote my name on the board but still no one has emailed me. :(  Now that I am a member, I need to go more often!", "date": "3/21/2009"}, {"review_id": "euH9vIi6S_5rjakkS-MoKA", "user_id": "AqO6dQtItZDo3wModHHRFQ", "user_name": "Caitlin C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A smaller gym that offers all the climbing amenities- sweet routes, friendly faces, nice locker rooms, fitness center, and yoga/workout classes. The staff and climbers here are super friendly, and the overall vibe is down to earth like a good homie! Perhaps one of the greatest parts of this gym is the pushing limits class where you can get personalized advanced lead techniques, feedback and instruction from experienced climbers Stephanie and the belmont manager, Dan. Really great people and teachers- this class has given the tools I need to become a stronger and more confident climber!", "date": "2/26/2016"}, {"review_id": "eOGTbkTVCyX3K16iszttig", "user_id": "CubkGRy-qVoMgu-eLNhUXg", "user_name": "Lorenzo M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "Planet Granite (PG) is a rock climbing gym, fitness club and yoga studio all wrapped into one nice (and economical) package.  Twice a year, in winter and summer, PG offeres a no initiation fee membership sign-up period.  As I recall, the period typically lasts a few weeks.I've been a PG member for about three years now.  I've made extensive use of their exercise equipment and have taken several rock climbing classes there.  I don't really have anything negative to say other than that I have occasionally found the front desk staff to be less-than-attentive and sometimes unfriendly but for the most part, they're pretty good.The upkeep at PG is outstanding.  The locker rooms are clean and well-stocked and the exercise and climbing equipment are well-maintained and CLEAN.  Membership prices are reasonable (around $64/mo for singles).  The climbing routes range anywhere from beginner to expert, with lots in between for intermediate climbers like me.Things you should know:- You don't have to be a rock climber to join PG -- they have a \"fitness-only\" membership option which costs less than the fitness+climbing one.- Do not park in the tire store parking lot just south of PG -- you will be towed.  Instead, park one block north on the same side of the street.- Weekend afternoons are very popular for kids' birthday parties, so if you don't like kids or birthdays or parties, stay away.- PG gets crowded around 7PM during the week.  Even when it's crowded, there should always be a route available for climbing.- PG does not have a swimming pool.", "date": "3/26/2008"}, {"review_id": "No6nVAkUU41Ham9MQuCEkQ", "user_id": "jRXuEMwKmA8d4tg3b5TjSg", "user_name": "Isabelle B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had my daughter's 10th birthday party here last week and it was a great experience.  The staff was extremely helpful and very nice.  They attended to our every need and were so kind.  The place is very clean and well kept.  This is a great fun place to have a birthday party.  I highly recommend it.", "date": "11/14/2012"}, {"review_id": "zulLjLFd1SrSr5DQIJHzSg", "user_id": "tLNdfa2OZBqwPjZjmcyB3Q", "user_name": "Allison T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "While I do agree that this location is much smaller than Sunnyvale, to me it's a blessing!  Belmont is NEVER packed, meaning less downtime while climbing.  The staff and fellow patrons are a lot friendlier and the overall feel is more laid back.  If you're looking for a great place to go climb and meet some friendly faces while you're at it, this is the place!  The only downfall is that they offer less yoga classes than the other locations.", "date": "10/10/2013"}, {"review_id": "f_cGPui_v13gbCXunDE7Lw", "user_id": "3eu3RvaLqk3llgbPZZSgng", "user_name": "Lane J.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Like the gym, but it's a smaller facility than their San Francisco counterpart and what's up with all the Rap music?  How do you climb to that?  Would be good if the music was more generic for everyone to enjoy/tolerate.  :)", "date": "5/29/2014"}, {"review_id": "11PCknr6fMyWPwt_Ie51Uw", "user_id": "rp2WFpnQJNcKSAumaeMlDg", "user_name": "Hope A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 6, "funny": 0, "cool": 1, "text": "I've been a member here for about 3 months now. I agree with many of the positive comments and reviews about this place. It is clean, the staff are generally friendly, the equipment is in pretty good shape. I don't climb I'm just there for the work out so I use the weights and take some classes. Edwina's Saturday morning yoga class is great. I've never taken a yoga class before in my life and she has me totally hooked. So why the 3 stars? Dealing with getting my automatic payment set up was a pretty big pain in the butt. They won't accept a credit or debit card.  You *must* give them a voided check. There is absolutely no other option possible. What year is this people? I don't have checks. I pay my bills through automatic bill pay like other people who live in this century. So I took their little form to my bank and the teller filled out all the correct information for them. THIS was not enough. They said because it wasn't printed on bank stationary it was not acceptable. I asked them to call the bank and verify the routing number and account information. They said \"most banks won't do that\".  I told them that my bank told me they would gladly do that and they said they could not help me. My only option was to bring them a voided check or pay for 3 months in advance with my debit card. This is just laziness on the part of the accounting people there. I ended up having my bank specially make a check for me just to give to Planet Granite. (see my very positive review of them!) I almost had to drop my membership because of this because I don't want to pay 3 months in advance. If my bank had not been so helpful I would have dropped my membership. It really is sad because this is a great gym. I have consistently had nothing but great customer service from the staff. It is a really good price for what you get out of this membership. Edwina is awesome. While I'm not a climber it is fun to watch all the kids climbing up the walls while I ride the bike or run on the treadmill. It looks like fun and it appears the instructors are really engaged with people. If the people in the office were willing to work with customers and consider that there is more than one way of doing things I would gladly give this place 5 stars.", "date": "1/15/2013"}, {"review_id": "rCV0nv7mlMLU_6wRWe8_hQ", "user_id": "_U0sDTQFfWAs9TqIxBT4cQ", "user_name": "Polina F.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I had a wonderful experience learning to climb here, marred only slightly by the very cranky staff member who did my belay exam on my second visit. I did not use the technical terms for the knots (which I made correctly) and she told me to re-test next time... uhh, really? Note to self: do not request a belay exam before lunch!My lesson was taught by a staff member who was patient and thorough. The gym accommodates a variety of levels, though there are very few climbs available for the very beginnerest of beginners (but luckily I didn't stay that way for long!). It's a bit expensive ($19 for a drop in, plus $6 equipment), but frequent groupons and multi-passes make it a bit easier on the wallet. Note: there is no heat or AC! Note 2: this gym also offers yoga and the standard cardio equipment (but I have no experience with those!)", "date": "2/20/2012"}, {"review_id": "y9IN-aKpIXyMYQLfa5jpsg", "user_id": "6zZPfuZkDRzSkYY9EvVJ5A", "user_name": "Bob R.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "Music volume level needs to be regulated by management.About half the time it is too loud and I wind up asking them to turn it down.Please just put a mark on the dial and keep it there. It's not only annoying for those of working out to not be able to hear our own music players; it's possibly a hazard for the climbing partners who can't hear belay instructions.", "date": "6/13/2011"}, {"review_id": "BfMRIPaqR-tOviHoRshb0A", "user_id": "WYCv0Q-QIKCSIo8IqOLOfw", "user_name": "Anne T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Oh my gawd! It is freezing in here!!!I bought a Groupon for 2 and used it as a date night for the boyfriend and myself. We came in late Thursday evening and the person at the front said the classes were completely filled. Huh? There's classes? I didn't even know that we should have called in advance to reserve. Wish they would have noted that on the Groupon. Luckily we didn't drive that far to Belmont and we were free the following evening. I want to take a star off, but coming back the next night for the class, we met an extremely cool instructor that added that star back on. Andres was chill and completely put someone like me that is afraid of heights, at ease. I would highly recommend him. The steps to tie knots and make sure you know the safety calls/precautions, I felt like a pro after the hour class. I was belaying my boyfriend on a 5 10 wall on my own by the end of the night.I would totally come again and take the belay test!!! Highly recommended for date night. It's a great team exercise and made us both communicate and work well together! I placed a lot of trust in my partner and he did the same for me. Thanks Andres for the encouragement!!! We hope to see you again real soon!", "date": "1/2/2012"}, {"review_id": "wNM2ceIZW7GNJjLs7bRgcA", "user_id": "ijWQ0R9ra0KF1IGNbhkODQ", "user_name": "Kelly H.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Belmont is the smaller Planet Granite sibling in the South Bay. The gym was converted from an old movie theater and true to the old place the gym keeps a few theater seats as a good memory of it. I'm really impressed with Planet Granite because I can expect the same quality in both gyms. The routes are fun and Belmont also provides good bouldering routes. I find myself frequenting this place during the week because less crowded than Sunnyvale. Also, if you like sandwiches Ike's Lair is a close drive by and pick up for a post-climbing meal.", "date": "1/7/2011"}, {"review_id": "US5K4Q9W-HcKpudGTyEuKA", "user_id": "xQa55k6FDGISxZGLWvrxxQ", "user_name": "Chris A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I had never climbed before, but I am generally quite athletic (professional fencing coach).  I did the BRC (beginning rock climbing class) here and had a great time.  It was like 125 for rental stuff for the 4 classes, and membership for the gym for the month of the class.  Instruction in the class itself was mediocre.  Not a whole lot of actual help being given, but the price of the class was low enough I didn't mind.  Membership for a month is normally 70, so the class was really 55, and including rental stuff thats included, the \"price\" of the class is really like 25 total.After the class, I joined the gym with no initiation fee.  $70 a month seems very reasonable for the product.  Gym is overall clean.  Not full of meatheads like many gyms.  Full fitness and weights area, as well as lots of climbing routes and bouldering.Routes are changed regularly.  Good mix of grades.  A few easier than 5.8, but mainly its between 5.8 and 5.12a.  I climb 5.10c now, and any given day, there are ALOT of routes to choose from in my skill level.Big focus on safety with the grigris.  Ropes and clips all seem to be in very good shape.  Bouldering caves are nice, although I like roped climbing more.  Overall experience:  A", "date": "4/19/2011"}, {"review_id": "0gCrptD0hJSnowX9w9matw", "user_id": "1L--tKQBtf3RbIiXRJYSeQ", "user_name": "highlightall l.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! PGBL may be the least crowded of the 3 PG locations in the bay area. The staff members are extremely friendly and helpful. I also took an Intro to Lead class here, it ended up being a 2-person group class, and the teacher was amazing. We got a lot of practice in too.Overall the climbs are great, with variations of long routes, overhangs, caves etc. They switch them up pretty often too.", "date": "1/16/2014"}, {"review_id": "aBQNg0Ki4hJHtzOdLRtbTg", "user_id": "Q7CaPtCugtkzZFInVammTQ", "user_name": "Dave C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is my only experience with indoor rock climbing and climbing gyms, but I've taken climbing classes and climbed outdoors before. Also, I have not used any of the facilities here other than the rock climbing section, so this applies only to that part of the gym, not the yoga, sauna, cardio equipment, etc.The number and variety of climbs here is staggering - everything from 5.2 (super beginner) to 5.15 (superhuman), and the center section is high enough that you can actually climb for quite a while before reaching the top. You're not done in five minutes. I'm not in the superhuman category, but the challenging climbs seem to be pretty challenging, with a lot of opportunities to do lead climbing, cracks, overhangs, etc. There are also two free climbing rooms, again with routes of varying difficulty and pretty challenging holds. My one criticism is that there are only a few very basic (5.2-5.5) climbs, so if you've come with kids, or if you're just learning yourself, you may end up waiting for a while between climbs while other people climb, especially on busy weekend days.I've only taken the belay course, but the instructor was good. He knew his stuff, explained it very clearly, gave us plenty of practice, etc. Everyone of the staff has been helpful, pleasant, and knowledgeable without fail. Prices seem reasonable, but again I don't have anything to compare to - harness rental is free if you are only belaying, belay course is $34, kids day pass is $10 + $6 for harness and shoe rental = $16 bucks to climb with your kid as long as you want - even all day. Sure beats a movie!", "date": "2/10/2012"}, {"review_id": "UU9Pr_R3uWmrNdEjkOysig", "user_id": "oT6gKC62juCSmxH3KIOqZA", "user_name": "Tu N.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 3, "funny": 5, "cool": 2, "text": "I haven't been to PG SF but compared to PG Sunnyvale, I prefer this place. It's a lot less crowded during week days, and weekends as well. Therefore, less smelliness. OMG, the smell at PG Sunnyvale just hits you like a brick in the face every time you walk in the front door. The routes are more interesting here. Or at least that's what I find. They are technically more challenging.  I find the people who come here are also nicer than the crowd at Sunnyvale. Less cocky. And less shirt-less guys. I like guys who keep their shirts on in public, especially when their bodies are not exactly Brad Pitt's.The only thing I don't like about this place is it has only one water fountain downstairs. And the women bathroom is set up in a way that you have to walk all the way to the back to wash your hands. Not convenient, but no biggie.", "date": "7/30/2010"}, {"review_id": "j5aFPJrR3dMGqkHNn5sFnQ", "user_id": "XkLK2iBsgqF6mWwDfRgqqQ", "user_name": "Song P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "We signed up and then decided to check out each location in 3 days.  It's smaller than the other 2 and I would equate it with the Great Western Power Company in terms of size, exercise equipment and climbs.  It's small and has a large cardio area upstairs which I appreciate but since I was here to climb, I didn't explore it too much.It  is not very well ventilated because none of the walls open up to let the air in and the fans were not on at first.  It was cramped and fairly cavelike but like the other facilities, the location is clean and the locker rooms are decent.It's not a bad place to climb but not my favorite.", "date": "9/15/2010"}, {"review_id": "EEl2gXk1SOIk88jk_XxPfg", "user_id": "wEqETrWwpsujK2r8ZueOFw", "user_name": "Henry W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "A paradise for rock climbers and fitness enthusiasts, this gym has it all - 60 foot walls of all varying difficulty, Crossfit workout equipment, gymnast loops, rock climbing training equipment, yoga & fitness classes, bouldering walls, and a tightrope in the back. Sometimes I wish this place was open until 1 am, since I'm always here until it closes. The staff are super friendly and are open to any questions about rock climbing. I'd recommend this place to any newbie or veteran alike.", "date": "11/10/2010"}, {"review_id": "4lOajrBHLltS8zsi0ZG-qg", "user_id": "sXhGLvb7dIYBrzDh4s5UnA", "user_name": "Tina A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My 12 year old cousin and I were aimlessly driving around Palo Alto as I was trying to come up with something different than our usual to entertain him. Planet Granite popped into my mind, so I called to inquire about whether kids could climb (answer: yes), pricing ($10/day for those under 13) and their exact location before making the trek up El Camino. 40 minutes or so later, we arrive at Planet Granite to discover that my cousin wouldn't be able to climb without a signed waiver by one of his parents and a trained belayer, which I was not. I wish they had told me on the phone - minus one star for that.I didn't want to disappoint the little guy after the never-ending drive, so I called my uncle to complete and email the waiver to the front desk, and I desperately asked whether any of their staff would be able to belay in my stead. Thankfully, one of the workers there, Molly, made a couple phone calls and rearranged her schedule to accommodate him for a private hour-long lesson at $60. Molly did a great job of explaining the ropes and encouraging him, high-fiving him before and after each course. The hour was just enough time for him to experience walls of varying grades; he was pooped by the end. Immediately after, he decided he wanted to return for summer camp there - success!", "date": "6/22/2011"}, {"review_id": "GazufcEKGMsOitb3mbLMPw", "user_id": "m7iiJlloCRfWaCPwQwTmpg", "user_name": "Rhoda G.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have been going to Planet Granite for the past one and half years and it's been great.I do have to admit that I haven't been rock climbing or bouldering as much as before because my rock climbing friends have moved out of the area. Despite the $70 per month fee, I think the price is worth it because of the yoga classes and I like having the options of going to the SF and Sunnyvale gyms, which is why I didn't downgrade my membership to fitness only for Belmont. The Belmont gym is smaller than Sunnyvale, but it's less crowded. Also the exercise/fitness area upstairs is practically empty and I have no problem getting a treadmill every time I go.When summer hits, I may not go PG as much because I prefer to run outside, but I will continue to go for the yoga/pilates classes.", "date": "2/18/2009"}, {"review_id": "zVLIeJUHs0TNAEgbUi6HwA", "user_id": "t5uX3lqIQxOpg8xtPbsKhg", "user_name": "Warren S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good place for rock climbing. Decent routes and good programs. Being there for a few times and enjoyed it.", "date": "1/14/2014"}, {"review_id": "dyUdrClxpPfdVTW6wTS68A", "user_id": "SPsaDZluGokcyDHjLoZmaA", "user_name": "K D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Fun to do, very safe, friendly people, pricy tho", "date": "7/6/2013"}, {"review_id": "-w1kiq63Z70gcabZJXZiFA", "user_id": "WPqupt3tdhU-x9iTRfmTsQ", "user_name": "Victor L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Staff is extremely friendly, and so are the other climbers!  Even when I leave my phone / wallet in the unprotected cubbies, it's never stolen.I never run out of routes to climb and I go 3-5 times a week.  $70 / month is definitely worth it!", "date": "6/7/2011"}, {"review_id": "8peJm2q-mMQgypUVcTqRig", "user_id": "g3P32YlvYBT6qrKi6Ltstw", "user_name": "Colleen L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "General Facts Part of the Planet Granite Family (see more information about PG gyms in general in my PGSV review) Day passes from PGSF or PGSV from the same day will work at the other gyms.Good+ It's pretty in a converted old school movie theatre+ Has the high end equipment found in all Planet Granites+ Has good climbing+ Fun for the whole familyBad- Parking wasn't that great- Not as big as the SF or the SV facilities", "date": "6/20/2010"}, {"review_id": "XcjvjrvnP2wBON1t85scSQ", "user_id": "S8RsgBDaReSy3CC8yJ2shQ", "user_name": "Michael M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The Belmont Planet Granite is really nice. I really like Planet Granite as a concept, but really didn't like their Sunnyvale gym. The smell and unhelpful staff were really terrible. Here's the pros:1. The staff at the Belmont gym are nicer2. The gym isn't as crowded3. It doesn't smell like a 5-week-old corpse4. The routes are more technically challenging I think.5. The work-out (non climbing) area is nice (much better than Sunnyvale)6. Fewer... how do I say this delicately... freaky nut jobs. There are people who climb and then there are the ear-stretchy, all-over-tatooy, stinky, shirtless, hairy, weirdos. Belmont has the former kind of climber, Sunnyvale has the latter.7. Fewer kids than Sunnyvale. I LOVE kids, don't get me wrong, but the damn parents do not watch their kids and they run EVERYWHERE just waiting to be crushed by a falling climber or tripped over.Cons:1. No parking lot - a big big con2. Towels sometimes smell funky (not unwashed, just funky)3. Mens bathroom could be cleaner.If you like climbing, you should join Planet Granite. If you want to really enjoy your climb, drive the extra distance to Belmont.", "date": "5/20/2011"}, {"review_id": "_v0yr3h_rOdAz_unFBKSGg", "user_id": "79329jsxyx-SQXk6Fg93bg", "user_name": "Jeff B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "What is there to say?  It's a climbing gym and it's your only choice between San Francisco and Sunnyvale.  But the staff is friendly, the facilities are competent, and you'll have a fun time here whether your a newbie or an experienced climber.  I've been climbing here for over five years and still enjoy it.Just a couple negative points that kept it from getting five stars:  They don't update the routes as often as I would like, it gets crowded weekday evenings around 7:30, and it's not quite as high as the other PG gyms.  But those minor nits don't detract from an overall enjoyable climbing experience.", "date": "9/2/2012"}, {"review_id": "q9zcTui3m33WwZ29Hgc3Dw", "user_id": "Xf5KPJimu8cLFndTL8WPJQ", "user_name": "Mansi A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "A great place to learning rock climbing! Previously, my rock climbing experience was limited to City Beach in Fremont. Planet Granite is definitely more comprehensive with people well-trained to teach you the ropes (no pun intended). My friend and I took the intro to belaying class in which they taught us how to belay and climb with a partner. This portion lasted about 20-30 mins, after which will were allowed to climb freely for the remainder of the day. Daily admission to rock climb is $17/day. Shoe rental is also available.In addition to rock climbing, there is also a gym with cardio machines and yoga classes onsite for those who have a Planet Granite membership.This would've been a 4-star review had it not been for the lack of parking in the area! How can such a large establishment not having a parking lot designated for its patrons??", "date": "10/22/2010"}, {"review_id": "HNRYtiWRywS2pqdtjerK1Q", "user_id": "cQ2i-3GXwTiQ-vrCXDwMCA", "user_name": "Larry L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome.  I'm a total nooby I but I got myself a good workout here.  The staff is fantastic.  They are so nice and helpful.  I would definitely come more often if I can just get myself off this couch more.", "date": "10/24/2012"}, {"review_id": "ncCX6ru3HzYu6NEVH3QCIw", "user_id": "-lbsY6x1USjTbuEVTcf3ZA", "user_name": "Adrianna S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I come here for the Yoga classes and all the teachers I have been to are fantastic! They are very experienced, knowledgeable, helpful and have great energy. Unfortunately, the weights seem to be right over the yoga room so you can sometimes hear people dropping weights, but I have had that same experience at most gyms.", "date": "4/5/2015"}, {"review_id": "CcOhEyk-caycQpv3nTiw6w", "user_id": "p5x3VgTi2gSbNkl6XQLioA", "user_name": "Andrew K.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I prefer the Sunnyvale PG location to this one.I do like that there are fewer people at this location usually, but it's starting to get more crowded.  The ventilation is much worse here and although they placed fans around, it's not quite the same.  The worse part is the bathrooms which reek!", "date": "5/7/2013"}, {"review_id": "g6HEbicUOLe91mQSMIeh3w", "user_id": "Wb5Gs_FpWDYjrhn0luPd3A", "user_name": "Janel Y.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "Note: review on Ashtanga yoga classThe kind of yoga class I'm looking for. It kicked my butt so much that I was sore for 2 days afterward. Not too crowded on a Saturday AM and the instructor, despite being more like a military drill sargent, walked around the class adjusting people and shouting out poses in English and sanskrit.", "date": "8/10/2009"}, {"review_id": "bKkSYSMWkTPT5SjDblfarg", "user_id": "FxTlvzC6vy8znep4bTAfWA", "user_name": "Zhirafo V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "When I first came to Belmont Planete Granite, I was impressed by great bouldering rooms and always interesting routes. Fun atmosphere and easy to find a climbing partner. One day I tried a free for PG members yoga class with instructor  Ben. That class was so good that eventually I started coming only for his yoga classes. What a surprise after 6 years of advanced climbing.", "date": "3/27/2012"}, {"review_id": "XBvhLkW4Z3783wHH3dajTg", "user_id": "_SVfoi3YUFNHswsfZUO9mg", "user_name": "Mikey U.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 4, "funny": 5, "cool": 5, "text": "Though the Sunnyvale locale, with its grand, wide & tall eyefuls of all things \"rockclimbing\", is where this new athletic infatuation of mine took root, the smaller and modest Belmont location is where I go to nurture that passion in a less imposing atmosphere.Smaller by half the size of Sunnyvale's spacious digs, Belmont offers fewer top-rope routes but makes up for it with quite a bit of variety in \"naturals(?)\" (chimneys, crack, crag, slabs, etc.) and a [seemingly] more even distribution of difficulties.The same variety can be found in its two bouldering rooms (the main attraction of this gym for me); one room is primarily vertical with some overhangs while the other room offers numerous formations and severe ceiling/roof vantages... either a good testing ground for one physically and mentally.Being a smaller establishment and located in a lesser metropolitan area (the gym itself is seated aside a residential neighborhood), the fewer patrons and perchance not-so-elitist regulars contribute to a comfortable atmosphere, far less intimidating for self-conscious beginners like myself.This would be a great place to get your start or get a taste for the sport... and, shoots, drop us/me a line, maybe we'll join you...... I know what I'm doing, I promise not to drop you________________________________________And yes, somehow this location keeps itself less funktastic (BO) than its bigger, more crowded, South Bay namesake.", "date": "5/27/2009"}, {"review_id": "hNL1lXItzCNA2GUN2qXtww", "user_id": "lFy60SmV1Vs4Ug4MkwI2uA", "user_name": "Andrew W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 2, "cool": 0, "text": "As rock climbing gyms go, the Belmont location of PG is just ok.  It is very small.  The routes are not very long.  There are a couple interesting \"natural features\" but they don't have enough routes to make this more than a once a month visit.  The other problem is that there is only street parking.  The yoga room is also very small.  With the space, they have managed to pack a lot in.  But, I prefer the Sunnyvale and San Francisco locations because there are more routes.", "date": "4/2/2012"}, {"review_id": "cc-oL_3-tfRXKU72oXgmkA", "user_id": "9i6L_mn_4MLQGwmE-L2QYA", "user_name": "Kristen T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 4, "funny": 3, "cool": 6, "text": "5 stars!  i accidentally left ALL of my rock climbing gear here about a week ago and was devastated because i would have to spend at least $100 on a new set.  Yesterday, an employee called me up and said they found EVERYTHING!  hooooray!", "date": "5/18/2011"}, {"review_id": "Sykg_TouVZdf1TLQ218NmA", "user_id": "ZKkW7G2KbahwQGOdjjaSdg", "user_name": "Johanna D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 4, "funny": 2, "cool": 3, "text": "Rock-climbing and bouldering at its best @ Planet Granite, Belmont! For several years at Planet Granite, I rock-climbed at least 3-4 times a week (sometimes even 5 times) and loved every grueling minute of it. The staff is friendly and helpful, and it's not unusual to see the \"regulars\" befriending and belaying new climbers. They have great yoga classes on the first floor, and on the second floor are the weight room and the cardio area. The treadmills are facing the rock-climbers so you could get a good run in while watching someone scale a wall. The locker rooms are clean and overall, it's just a nice gym. I've climbed at the San Jose location as well but prefer Belmont's gym. Even during the day, San Jose's gym was dimly lit and kinda dark-feeling. Plus, their staff weren't as pleasant to deal with as Belmont's. Parking is easy too! There are open lots on either side of Planet Granite if you can't find something on the street.", "date": "1/11/2009"}, {"review_id": "J900UKyFIioWbJWYQ_tN3g", "user_id": "ZGmN5KMycUmSd7eUkj3RoQ", "user_name": "Michael M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been rock climbing for several years outdoors, but recently I started climbing indoors to train. I have been to all of the planet granite locations in the bay area and I like this one the best because it is the least busy day to day. All of the planet granite gyms are very clean as well, which is important incredibly important to me. The routes are challenging, the holds are new and sticky, and it is a safe environment to have fun rock climbing. This may be on the best full body workouts and you will have fun doing it! You may want to consider joining this gym as you will get access to all of the gym locations with your membership. All of the locations also have great yoga classes and they are free if you are a member.The staff at this location are friendly, helpful, and have a great attitude. This is a great idea for a date or just to go have some fun and exercise. All of the gyms are child friendly as well!", "date": "2/11/2013"}, {"review_id": "1C05HGtHDlIDlNjzefJ9SA", "user_id": "7v7Q69IgBX8_MRawwHxnbg", "user_name": "Jonathan S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place, not too crowded. Usually go there on a weekend. Cons: doesn't have designated parking area, have to drive around neighborhood to look for a spot.", "date": "1/7/2013"}, {"review_id": "uZZznNfXk0CXmwrlggnVGQ", "user_id": "JZxufqdTMqkaVKGhCSUr8w", "user_name": "Marie M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 6, "cool": 1, "text": "I'm not a rock climber seeing how I have no upper body strength. My sister is. And she's dragged me to this spot a few times. While they don't have TVs, all of the cardio machines face the rock climbing walls, so it's kind of like having a built in entertainment center. Except instead of watching reruns of the Golden Girls, you're watching people scale this ridiculous wall like Spidey. On my last visit, I even managed to take a climb myself. Pretty fun, except it's in Belmont. And I live in SF. But for you peninsula people, a fun gym with decent equipment. Rock climbing...it's the new yoga.\r Beware of the ball sackers (i.e. those guys that wear their straps too tightly around their man region). I almost went blind the last time I was there.", "date": "1/5/2006"}, {"review_id": "hI6yLk-e5nsOThMcGr1XEA", "user_id": "jH19V2I9fIslnNhDzPmdkA", "user_name": "Tom Y.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "This is a cool little place.  This is the closest place to my work so my co-worker and I decided to come here and check it out.  I almost didn't even spot the place while I was driving there.  It is definitely smaller than Ironworks and I heard it's much smaller than the other PG locations.  It was nice getting a chance to see the different routes here, but I can see how it can get old pretty quickly, unless they change it up regularly.  I like the set up they have here for the little space used.  The bouldering areas are separated and away from the top rope climbing so you don't have to worry about all these people hanging above you or getting in the way of the climbers up top.This is a nice spot to stop by once in a while, but I definitely want to check out the other locations to compare.", "date": "3/12/2009"}, {"review_id": "PCUagU0B43BjmMaAqihkkw", "user_id": "YF0lQ68NheKQ5Y2nuQ4zkw", "user_name": "Nathan E.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Rock climbing is a lot of fun, but I'm not a big fan of this particular location. Maybe because I'm more used to Ironworks in Berkeley, which is significantly larger.Planet Granite didn't have enough walls for my skill level. I don't want to be climbing a latter and I can't climb the professional walls with teeny tiny rocks.Another problem I had: They use a different type of belay device than I'm accustomed to. Planet Granite uses these bulky devices which are VERY slow at lowering people down. The advantage is that they have an auto stopping mechanism, and so I assume these are safer for beginners. But it really feels like belaying for dummies!Overall, I was disappointed by my experience at Planet Granite.  If I try it again at this location, I'll bring my own equipment.", "date": "10/10/2009"}, {"review_id": "rjGWA9q_CO4l-_EhALCK2A", "user_id": "oO6JdiPLnD1qWnmxb5CjhQ", "user_name": "Sjw-rx W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pg Belmont, you have changed my life for the better. I am stronger and healthier bk of you. We are so lucky to have you in our community.", "date": "7/5/2012"}, {"review_id": "ECcrajq3nhnW-GXBpdtQQA", "user_id": "x9jYpFgTpiBfD5hpKz15CQ", "user_name": "Kelly M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I came here as a guest recently and I was pleasantly surprised. I had never rock climbed before and only heard about how awesome it is through friends. Oh boy were they were right. This is a great place for beginners to go and learn the ropes and just see what it's all about. The staff was friendly and helpful overall.  I only had to pay $6 for my harness and shoes, not bad at all! I found the women's facilities clean and odor free.  I appreciate the level of difficulty and variety in the climbs. I can tell it would be hard for a novice like myself to get bored with the amount of options available. I can see now how climbing can become addicting.  I had so much fun climbing here that I would definitely come back!", "date": "5/4/2009"}, {"review_id": "PU5vTJ1pZcGspUnbcbKE_Q", "user_id": "iPoplhzQMDMVq_92SihXsw", "user_name": "hima s.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "I have a fitness-only membership and love it here!  Yes, the fitness area is super small (the gym is super small over all), but that just means that the grunt brothers choose other gyms.  Of course, the climbers do grunt on occasion, but that's acceptable -- I would grunt too if I were hauling my body weight solely on my fingertips.I generally go after work and it does get a little busy around 7.  That said, though, it's never difficult to get a cardio machine or to lift.The parking situation is a little bizarre (one block north on El Camino), but at least the lot is never full.", "date": "5/26/2008"}, {"review_id": "FhUYZwd-mcfR4QIZjGrJVA", "user_id": "swxJ8IlmBDTV4QfbuVv-ww", "user_name": "Robert B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "Good times, good climbs, and a good way to get off the computer. I just got home from a couple hours climbing, and I have to say, I feel great!!! The people there are fun and friendly, the staff is great, and it's a lot better than going to a bar to meet people.get out, get in shape, and have fun doing it!!", "date": "3/19/2007"}, {"review_id": "NXQ2Dt4SzmYVf6b2EaqfRA", "user_id": "DjlOT2cnbimXBAc1nzStKQ", "user_name": "Brian C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This place is really crammed and can get pretty stuffy. The bouldering is limited to small rooms. One is really dark and seems like climbing room in home basement. The top-roping walls are okay, but there are a lot of stupid who get into your way or dont' belay properly.", "date": "11/8/2014"}, {"review_id": "prmI2Rhcgpw_WZN7bbOjWQ", "user_id": "_fwB1RkTfS5WzUT6QvYF3w", "user_name": "Monica L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Luckily we live near the Sunnyvale location because this location is very small and not as challenging. Came here last night for a quick climb with my husband before meeting friends for dinner next door. Our first reaction when we walked in was \"This place is SMALL!!\" Plus the guy working at the front desk was kinda rude. We couldn't find the scanner gun to check in so we were roaming around looking for it and the front desk guy rudely told my husband that he couldn't go in until he got checked in....yeah we know buddy! We tried out a few climbs and this place is definitely a lot less challenging then Sunnyvale. We are still newbies at this and I climb a 5.8 and my husband climbs usually a 5.9. Those levels are still pretty challenging for us. We tried out some climbs and the first one I did was a 5.9 and I did it so easily! My husband tried a 5.10b and didn't find it challenging at all. Usually we would be dying after climbs like this. It was quiet but this is normal at the Sunnyvale location as well on a Friday night. Locker room is a lot smaller and definitely not as nice as Sunnyvale.A good alternative if you are in the area.  I feel lucky that we live near the Sunnyvale location which is A LOT better.", "date": "5/23/2009"}, {"review_id": "x7p0FyZAM_vy9LGDBULRtg", "user_id": "n4iI6JX1bpEq3E_f9f-0Ww", "user_name": "Liana V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I LOVE PLANET GRANITE!!!Pro ShopRock ClimbingYogaCardio MachinesWeightsShowersSaunaAwesome staffGreat ratesWhat is there not to love!!", "date": "2/15/2009"}, {"review_id": "2Qw3XzcImKsAFLZ280-ODw", "user_id": "elyvWgnY-oN7TfLMDt9o4Q", "user_name": "Wesley W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "I didn't actually climb here (except for testing out the shoes on the bouldering route before I bought them), but I liked this place.  Vs. PG in Santa Clara, this spot looks like it was built to have high ceilings (and thus long routes), in order to be a climbing gym, whereas Santa Clara looks like the supernatural rock-gym-god stood in the center of a vacant warehouse, and spat out molten lava in all directions, which conformed to the shape the warehouse was already in.These guys had a really well-priced gear package of harness, shoes, and chalk/bag for $119, which is definitely better than I'd be able to pick the components up for separately...the shoes fit so I bought them.", "date": "3/29/2006"}, {"review_id": "hoAtfLrj0zOIbTDa2dLrqA", "user_id": "L7xaBvvHoHm_sOtlZUBhCA", "user_name": "Katie L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I love Planet Granite in Belmont!   It's way, way, way less crowded than the Sunnyvale location and I think the bouldering is more challenging than the Sunnyvale location.  I meet my daly city gf here for climbing.  It's great. Oh yeah hot guys working at the counter and climbing doesn't hurt either.   Only downside is that it's $70+ a month, it isn't affordable for everyone but if you're the type who'd rather climb/yoga than drink martinis on a friday night, then it's all good.", "date": "2/10/2009"}, {"review_id": "G6KuU1ZXyb84HMqgReTG2A", "user_id": "-chRuVxr2a5EyqhyBnW5Pw", "user_name": "ben y.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "The best climbing gym in the area, hands down.  Even better than \"that gym in the mission\" that everyone raves about... anyone who's been to both will expound upon the benefits of PG.  The routes are more cleanly set, the staff is FAR more helpful and friendly, the place is clean and well maintained and the yoga and fitness options are handy.  Check em out if you're nearby.  They're worth it.", "date": "8/28/2005"}, {"review_id": "m5_ulhgrdtCZsdcY6XXnFg", "user_id": "zIDUDgoHsfvsi8oS8QlgIA", "user_name": "Jodie B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I -LOVE- this place. The staff is extremely friendly, though a bit transient. They are very helpful in getting you where you need to be if you're interested in learning how to climb - indoors or outdoors!If you're interested, take the Beginner Rock Climbing course to see how you like climbing...you'll be hooked. My husband and I joined a year ago out of interest in climbing, and we made so many friends and learned about so many fun places to hike and climb outdoors as a result. Its a VERY friendly community! If my schedule allowed, I'd still be a member, but I cant make it to evening yoga classes anymore - and that was my main reason for being there - so I had to change gyms. My only complaint is that I wish they offered more yoga classes in the mornings during the week, between 8am-10am. They have great teachers, just not enough morning classes.", "date": "12/27/2008"}, {"review_id": "AYWZuvp85XzcRQ2y0RCL8w", "user_id": "xhX9XmeBtXRC6PO-cEt8Fw", "user_name": "Ron G.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "Good fun for all. The people working there make sure that you are safe and comfortable and trained. It's a great way to spend the better part of a day with a group of friends. It is interactive and thrilling. Everyone can aspire to the level they want without being looked upon as an amateur. Ha! I feel like I could scale Half-Dome after day one!NEW RULE: People climbing here need to wear shirts because they either stink or their pale flabbiness is unsightly!", "date": "4/15/2006"}, {"review_id": "bn6MGUnAcGvjLNE2GyXmHg", "user_id": "h8eDSoKHpp-4l5G5_JPtFA", "user_name": "Bruce M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "True, Planet Granite Belmont is smaller than the other PGs in San Jose and San Francisco, but the club intime environment creates, rather than diminishes, chances for social interaction and fun. Housed in the building that once was the old Belmont Theatre, the lodges have been turned into a very well equipped weight room with Cybex and traditional free weights. There are also stations for TRX Suspension Training along with Abs and Core classes. The newly renovated bouldering cave downstairs is on a much more professional, high-standard than the old kids bouldering room that used to occupy that space previously. There is another bouldering room where easier problems can be found too. A Yoga room is adjacent to the main climbing area where there are climbs between 5.13 and easy 5.6 walkups for beginners. I personally like the sauna in the men's room for warming up first on cold days and for getting a sweat up after working out or climbing. The sauna seems to be working a lot more of the time than the one in Sunnyvale.The staff is courteous and competent and lessons are available at convenient times. So if you are a beginning, intermediate or advanced climber, I would recommend PG Belmont as an excellent venue for learning and practicing rock craft. If the main climbing wall is a little short, you'll find the overhanging boulder problems in the new cave plenty challenging.", "date": "5/9/2012"}, {"review_id": "7oc-09fnq1qFyAc3PulRGw", "user_id": "LooOFW7G8c8agsZbG5JanQ", "user_name": "Cari N.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "After climbing at PG Sunnyvale for the past 6+ months, I switched over to Belmont due to my new commute up the 101.   Great climbing and work out facility, like Sunnyvale, but here are the differences.  Belmont is way less crowded; especially the bouldering area.  Sunnyvale is bigger withmore hard climbs/problems and from what I can tell generally more hard core climbers.  Sunnyvale has an outdoor area (however I sprained my ankle and f-ed up my knee out there so not a huge fan).  Belmont does not have spin classes.  Sunnyvale's fitness area has more fun apparatus (i.e. jungle gym features and ropes).  Sunnyvale has a more awesome front desk crew that will shoot the shit with you; however I may just be biased to this as this is where I started.  And Belmont's parking situation is a little odd, but that's not a big deal.    Basically Sunnyvale is little cooler, but Belmont is less crowded.  And for those in the PA area, you would be surprised how close Belmont actually is.", "date": "7/9/2008"}, {"review_id": "JPqcn4350S1yoJKCV0lwHw", "user_id": "An3V2P6K2xfYW6gp8SoFIw", "user_name": "MICHAEL P.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "The appeal to this gym is the climbing. Although I like the honesty of bouldering, I am more into general fitness so I went here for the weights as well. For me, the big problem with this place is the basement like atmosphere:  small windows, it's not light well, old carpet... just kind of gloomy. Also, equipment gets misplaced or is just falling apart, and so it just feels like you are in a gym that is slowly going out of business.And, although it may sound petty, coming in the door is frequently annoying. Even if you have two people working the counter they are always preoccupied so you just stand there \"hello\". It got so ridiculous that I would usually just walk in without trying to register my card. If I was desperate (like this was the last gym on earth) I could make the best of it because they have a decent selection of free weights and they have the rock to climb, but I wouldn't recommend it to anyone not TOTALLY into belaying.", "date": "10/27/2008"}, {"review_id": "hWDjSw9d8d0eCxSrSnwNaQ", "user_id": "JS6vL24uwWV5OkJiYSZIJg", "user_name": "Marilyn C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 2, "cool": 1, "text": "Compared to the Sunnyvale and newly opened Crissy Field location, the Belmont PG is the least modern and nicely equipped. However, it is the only rock climbing gym in the penninsula, and also the least crowded gym of the three. The staff and the fellow climbers are always friendly.  I also enjoy the few yoga classes that I've attended. The only real problem that I have with this gym is that it is always freezing, and wearing a long sleeved shirt and sweat pants when bouldering can get pretty annoying. Yeah...you can join a fully equipped gym like equinox, prime time or save some money at the local 24 hour fitness. Sure those gyms have pools, hot tubs, and shampoo in the showers. What they don't have are the scores of young, hot guys, constantly parading their rock-climbing physiques.  Half an hour on the stair master is A LOT more enjoyable when you have a good view.", "date": "1/16/2009"}, {"review_id": "4WFX6ZRf5SmGC7Qh7quXbg", "user_id": "9P8-9EUP-aEnuisqUYt5jQ", "user_name": "Kathy S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "I like it.. although it smells pretty gross at times. The staff is pretty cool.", "date": "9/24/2007"}, {"review_id": "zYyXExrDktINTOYcpXSP8Q", "user_id": "Rw8K0VS2fhuXad9iHAIUkA", "user_name": "John V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I really enjoy PG Belmont.  I thought its size would be an issues, but they have some REALLY interesting walls they've routed well and they have a great selection of books that I love looking through.  I will definitely be back to work out  on the walls here.  I very much recommend it.  The center walls are almost 50' high, so there are some fantastic challenges.  Even the shorter outer wall has some really well done routes to exercise your body and your mind.  Sometimes the solutions are more mental than physical.  There are a lot of other amenities available, but I have not made any use of them and cannot comment, but the gym looks good and the bathroom was spacious with changing areas, showers, and a sauna, I believe.  Again, did not personally check out a lot of those amenities, just know that when I want to work on my climbing, PG Belmont has what it takes to make me sweat.", "date": "11/30/2009"}, {"review_id": "wbyp5-FxjAeX2SKhO1nTuw", "user_id": "ImVfDOri1NG5UE5MEmqHJg", "user_name": "Henry Y.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "Despite being smaller, this lacks the hominess of PG Sunnyvale. The parking is downright sucky, the staff are kinda holed up at the front desk which is separate from all the facilities, not like PG sunnyvale where you can shoot the sh*t with folk in between routes. However, the peeps seem to all know each other and be friendly. That's a good thing.", "date": "5/4/2008"}, {"review_id": "lWFVOBa1SqGeU-6vmPhzhA", "user_id": "z8CxDrU-xX4polTdzicZbw", "user_name": "Frank O.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great rainy day activity.  They have climbing walls at various difficulties.  Something there for all ages.  My kids love it too!", "date": "3/7/2012"}, {"review_id": "VRJQtzhLPQLkgklCQiomTg", "user_id": "k2NH35JGunilbWsNd7SU2g", "user_name": "Ryan M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place.  I consider myself an amateur climber but I feel like there are many walls here that I can climb with ease.  There are also many walls that are very difficult and I love that challenge.  They have 2 great little bouldering rooms to warm up on, and the main room is usually not that crowded.  Price is very fair and they even have the option to get a gym membership there that includes climbing. (yes they have a gym here as well).  Locker rooms are very clean along with the whole building.  Definitely nicer than most climbing places I have been to! Highly recommend!", "date": "1/12/2012"}, {"review_id": "xxH9MDv-V1iVLHFDKQoIJQ", "user_id": "xCs5hyuN3AQSDuefFYklLw", "user_name": "Edyta R.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Love it here!  I am fairly new to climbing.  They have a wide range of levels and will keep you busy for a long time trying to get good at all of them. We just got a membership here that covers climbing, yoga and other classes, full gym, and sauna at both the Belmont and Sunnyvale locations. All their fitness equipment is in great shape.  I haven't taken any of their classes yet but will be trying their new Ab routine soon!  The Sunnyvale location is larger with more places to hide from large groups of kids.  To avoid kiddy parties, try early weekend mornings and Friday night.", "date": "12/21/2007"}, {"review_id": "CePulpk9452Sk0KuVu5N5Q", "user_id": "6TBYRdA26VgitScNHRZCyA", "user_name": "Inga B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Belay On!Super nice staff, smaller climbing gym but it wasn't over crowded (was here Sunday afternoon) there was also bouldering, a fitness  area and yoga.  Not sure what the cost was, my date had a guest pass (great idea guys....prefect setting to get to know someone!). I will definitely come back if I am in the area...maybe after riding Waterdog... Oh and the girls locker room had a sauna...NICE!Parking is a little weird though.", "date": "5/5/2008"}, {"review_id": "aeR1q09kqqv_ToXobt4n2g", "user_id": "6jfWf1ij3EplaAyBkV-hSA", "user_name": "suzan s.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "The Belmont PG is smaller, with fewer people -- which is why I love it. In general, PG has been useful since for a $70 per mo membership, you get unlimited access to climbing, the gym, and classes. (They just increased to $73)BOULDERINGIt has 2 great bouldering rooms, one only for over 14 years old.  There's never a wait for bouldering or ropes.  There are frequently kids' parties on weekends, which can be cute or annoying depending on your leaning.CLASSESHarriet's circuit class MWF mornings are fun, and not too busy.  The yoga classes are good - Doris' class is popular. STAFFThe staff at PG Belmont are also well-knowledged in climbing, nice, approachable, and helpful.  In general, all of the climbers at the gym are quite nice, a bit of an older crowd than Sunnyvale, regulars and willing to help if needed.PG Sunnyvale is larger, but much busier - one night I couldn't even find a free rope!  And another night it was so crowded that the body funk forced me out.  More open bouldering (so people are watching - not great for a beginner).PG Belmont is super quiet/empty in the morning/daytime, but fills up a bit more in the evenings.", "date": "3/14/2011"}, {"review_id": "V0c6J8exL2PSVZdPc0YATA", "user_id": "XDgKe98qTvxuHNuwUVLwNA", "user_name": "Ron S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "If you like to get high, this is the place for you (as long as you can drag your ass up the big walls and not fall down).  You should also get rid of that spare tire, which you can do at Planet Granite before or while you are working to concur the various top down walls and two (yes two) separate bouldering rooms.  What that mean is when an asshole brings his 4 year old that plays consistently on the bouldering mats, you can go to the other room (before you do, say hi because that asshole is me).Planet Granite has a grigri setup for you at every top down climbing route, so you can leave your ATC at home (or carry is around for no reason, like me [the asshole]).  The routes vary nicely, from a almost vertical 5.2 to several extra tall LEAD routes.  As I said earlier, I take my son with me and PG supplies good quality shoes and harnesses for all ages.Best part, if you have your belay lesson at PG you get a 1/2 off day pass.", "date": "9/29/2008"}, {"review_id": "8aF7cAxy7HPbqlWtor592g", "user_id": "c9MOCO73ZRrFClBLzRf0Jw", "user_name": "Tiffany L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I was never a big fan of any gym especially given the close quarter/smell. I don't climb but I like the yoga lessons here. They aren't as hardcore thus are perfect for newbies like myself. The lessons are also more affordable compare to a going to a yoga studio. The friendly staff doesn't hurt.", "date": "10/1/2010"}, {"review_id": "csKuuZP7bnkMpunJLfHZXg", "user_id": "ibUClVZhrNl9PYlHAAXT9g", "user_name": "Maria S.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "As a drop in visitor I love when people make you feel as important as a member and Planet Granite did just that.  Their yoga room is super nice but not quite sound proof so you do get some noise from the climbing area.  I really enjoyed the yoga class here!  Very welcoming and good for any level.  I love it when you go to a gym and everyone is friendly.  My brother and sister-in-law love the climbing space.  Overall a pretty cool gym.", "date": "6/21/2011"}, {"review_id": "o4mO7_ikjG3h7XJXTTELqw", "user_id": "0O_RfIxAZH_qUIc59ndeYw", "user_name": "Mindy L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Ok. I've been here ONCE. I'm not an expert climber by any stretch of the imagination, but I do enjoy it, and go about once or twice a year. WTF is up with their rental harnesses??! NOT a fan. While they're safe enough, the straps don't double back, and loosened when I stood up. That made me DEEPly uncomfortable. But they must know what they're doing. Once I got up there, my weight made sure those straps were nice and tight, and didn't budge. But I have to say... it doesn't help calm you down when your harness isn't to standard specs. Come on. Other than that, I loved this place. There are plenty of climbs for all levels. Everything is well labeled, and the staff was great. I'll definitely be back. But I will bring my own harness this time. Yikes.", "date": "6/29/2009"}, {"review_id": "-hkASTYHkl3BKv-FPlxdEQ", "user_id": "4rrd9a5IbmR5pt9Qzm3k1w", "user_name": "Hoa T.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Just had my first belay lesson here this past week.  The Belmont location has plenty of space, climbs with a variety of difficulty levels, and even a gym upstairs.  Our instructor, Peter, gave us a thorough rundown of all the basic safety checks, procedures, and call-outs.  After your lesson, they give you a snipet of rope to practice for your test and a pass to climb for the rest of the day.  This was totally a great experience -- you really get your heart pumping and this huge sense of accomplishment when you reach the top of that 50-foot wall!", "date": "8/23/2010"}, {"review_id": "8dhOAuVAdgE2orXEW7jIcg", "user_id": "WIELEOmB2guw_JfWdx4_mg", "user_name": "Walter C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Woohoo!  Another Planet Granite.  This place is great considering that it's closer to San Francisco than the Planet Granite in Sunnyvale.  It's true that it is smaller compared to the one in Sunnyvale, but it has two floors!  The bottom floor contains two bouldering caves, a top-roping area and a yoga room.  The second floor contains a weight area, treadmills and a fitness room.  The restrooms have a sauna and locker area as well.The routes here are fun, but not as fun as the ones found in the Sunnyvale gym.  The great thing about this gym is that it isn't as crowded as the Sunnyvale location.  The prices for rentals and one day passes are on the website and there are student discounts as well.  If it's your first time climbing, I suggest scheduling a belay class with a friend.Definitely a friendly and chill environment.  Come here and have a good time!", "date": "8/1/2008"}, {"review_id": "xDQXZm_qaZKXgp_XAdjV5g", "user_id": "2Qpa7NAjtygh8m7XYmkTpA", "user_name": "Jennell L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I still like the place but they raised their rates again a few months ago so I bought a couple 10 packs for the classes and canceled my membership.There was really only one class I was attending with any regularity especially since Nandi Yoga opened in San Mateo.As soon as my second 10 pack is finished I will not return to PG.  Even their 10 pack and single classes is a lot more expensive than the competition.I like PG but I think they are a lot more expensive than the competition.  I pay 29 USD a month for Golds and have acess to RWC and SM where each has three rooms of classes at any given moment.  PG is 53 a month for fitness only.As far as yoga PG chages 17 USD for a drop in and 160 USD for a 10 pack.  Nandi yoga charges 16 USD for a drop in and 14 USD (for seniors and students) and 130 USD for a 10 pass.", "date": "12/20/2008"}, {"review_id": "2ZEhHVer2c_5GyNJfvbCHQ", "user_id": "J573NSGIdb_aliqlWzFDcQ", "user_name": "Krys B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I fell in love wtih rock climbing and joined Planet Granite about a year and a half ago.  I have to say, it just doesn't get any better than this.The staff are friendly, playful and knowledgeable.  The other customers are helpful and work like a community.  They'll give you advice if you want it, or encouragement if you don't want advice.  They'll chat with you while you're belaying.  The rates are about the same as any other climbing gym, but there's no contract to sign here - which is nice.  You can go month to month, and if you're going on vacation or if you get injured, you can put your account on hold for a month.The Belmont location is relatively small, but with some great bouldering opportunities.", "date": "8/13/2008"}, {"review_id": "o-FoWJD8pmYVI8IcIey6yw", "user_id": "g8tXlFu7ZDZDnsYfSoAQ3g", "user_name": "Don L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Planet Granite's Belmont location is the oldest in the chain and it shows at times - the other locations, San Francisco and Sunnyvale, are nicer, even in spite of a much-needed recent upgrade to Belmont's fitness equipment and climbing area floors (thank you).  Membership gets you entry to all three locations though.    Other observations:The men's restroom smells really bad.  I cannot be the only one who notices this because my nose generally doesn't work very well.  I don't know what the problem is there - it has been that way from day one (I joined when the gym opened).  I know the staff cleans it regularly, so it must either be an issue with the plumbing or users not flushing, but both are things that can and should be addressed.The men's shower is communal, no stalls.  It doesn't get used much.  I hear the women's locker room is better on both counts.    The roof leaks every winter.   The staff tries to catch the water in myriad buckets on heavy days.  I think the water soaking into the foam floor causes it to have a musty or moldy smell.  A new floor has been installed this year though, so that will help, but the roof still leaks.  It's taking forever for them to fix two of the four spin bikes that are broken upstairs, but that may not be their fault.  Climbing and classes are fun - that's really why most people (including me) come here.  The space is still smaller than SF or SV, but still a reasonable variety.  I agree with other reviewers that the staff is terrific from the people at the desk to the fitness instructors.  My little niece has appeared with me every now and again and the staff seems particularly nice to kids.  Staff gets 4 stars.  Overall if some of the above infrastructure issues get upgraded it'd be an easy call to go up to four stars.", "date": "4/14/2009"}, {"review_id": "Si11BruV1wniDjvucXA7Tw", "user_id": "kKSYrrHmO9Oe-hanS1rEVQ", "user_name": "Chris A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Needs more steep! This gym has lots of cool features but is much more vertical than the other new gyms around.If you like vertical faces this is place for you. If you are into the steep go to Iron Works or Mission Cliffs, or even PG's new gym in Sunnyvale.", "date": "2/29/2008"}, {"review_id": "0hvmIpUtMmMRKcAtY5TL1g", "user_id": "wpazdZ37epyyUslec-ujcg", "user_name": "Jackie M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for my first rock climbing experience and had a blast! It wasn't crowded, desk people were friendly, and so many different paths to choose to climb. Lower numbers are easier although paths vary - whether straight, or humps to climb over or around. It is definitely a gratifying experience reaching the top. I would def come with friends who know how to belay. Def fun times and I would come back again!", "date": "3/28/2013"}, {"review_id": "1NCzJCef_uLOKpxKAMZCxw", "user_id": "IyFKQqzmvQFDOx7YjSv7kg", "user_name": "David p.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place has a lot of variety:Indoor climbing (walls & bouldering)YogaA fully gym (cardio, free weights and more)Assorted fitness classesA saunaChanging rooms (with showers)I've been going here for years. The indoor climbing experience is second to none (other than, perhaps, their SF and SJ locations, which are also great).And the variety of workout is fantastic for the price. They get my highest marks.", "date": "12/27/2008"}, {"review_id": "9RC-6EwE5HoDOaRhPOxnrg", "user_id": "tWrRQH4eGEb8xyb5D1-rjw", "user_name": "Venkat K.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This rock climbing gym is amazing, and I have been a member for 3 years so far. They have good climbs, both in the top rope and boulder sections. They also have classes for beginners and the staff is really good and helpful. In addition, they have an amazing gym upstairs, which is almost never crowded and the equipment is really good, especially given the fact that their focus is rock climbing. They also have yoga classes and other fitness classes.All in all, if you want to try out rock climbing, or like rock climbing, this place is easily the best out there.", "date": "8/17/2008"}, {"review_id": "J6PQoSAYzg2auUHBlAQRWQ", "user_id": "fCnPueDHS4IJB2pNtW9bzw", "user_name": "Sofia A.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is amazing! I love climbing here. I have been here many, many, times and I just love the atmosphere. I have not been to the other PG locations so i cant really compare it to the other locations but its a great place to rock climb or just work out. The routes are great too. They set new ones just in time for me to challenge myself with new courses when I have finished climbing the old ones. It does get pretty crowded in the afternoons, but in the midday its pretty empty especially on weekday's. This is definitely a place to visit if you like climbing or to use the gym!", "date": "7/24/2012"}, {"review_id": "1Cv0a8mUQzbdcqUFmdkKag", "user_id": "LOx6CIKwtHocXSBazG3aCw", "user_name": "Charles D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "Compared with the PG in SF and Sunnyvale, this one is kind of a downer. Much smaller and lacking in space, 3 stars.", "date": "7/15/2010"}, {"review_id": "SUNHOM57lV5SsXCC9sEY0Q", "user_id": "7AD3ZggVQUUsvKj2ROVMEQ", "user_name": "Elias F.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "If you enjoy rock climbing, I would highly recommend the planet granite in Belmont.  The set up is great, you feel like there is a very professional and fun atmosphere.  The staff is very friendly, and you can get to know them on a name basis if you go enough.  All the people who work there (who i've talked to) are climbers and can help you with any questions you have.  The music they play is great.  They play the popular selections during the busy hours, but when there aren't that many people there they will bust out the fun stuff.  I've heard punk, obscure rock, and dubstep while climbing.  The prices aren't too bad, renting shoes costs or a harness is 4.  Both for 7.  It is 17 dollars for unlimited climbing, and 13 if you are a student before 5 and 15 if you aren't.  I enjoy bouldering, and planet granite delivers.  They have two different bouldering rooms with different styles of challenge in each.  One room has higher walls and the other has awkward walls jutting out requiring you to be creative.  The walls in the main room sport top roping and lead climbing, providing fun for the inexperienced as well as the extreme.  The routes are marked at the bottom and shown through colored holds.  If you get the memebership (or pay for the day) you can use their gym as well, or sign up for yoga classes.  The only problem that I find every time I go there is the parking.  The place is in a mostly residential area and they do not have their own parking lot.  It is unlikely there will be a spot right in front, and the Wheel works next door will get mad if you park there during operating hours.  Finding parking can be frustrating at times which makes PG lose a star.  Great place, check it out if you are bored or enjoy climbing.", "date": "1/14/2011"}, {"review_id": "fyYWMg4dOHD-cZa0vG527A", "user_id": "xki-u1m1fScq_nY4LdyV6A", "user_name": "amee m.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "i can \"check\" rock climbing off my bucket list now!  i've always been reluctant to pick this sport up because i'm slightly afraid of heights, but with my friends' insistence, i decided to try since i had nothing better to do that day.  the level of difficulty is clearly labeled, so any one can climb -- from 5yr olds to retirees.  i started out scared and shaky, but with each climb, my confidence and comfort grew.  if i can do it, you can too!service was brief and straightforward.  the facility was very clean, nicely ventilated and well-equipped.  however, it was pretty chilly that day, and many wore jackets during their climb.  this place is children friendly so bring your kids here and have them climb until they ache.  for those who do not climb, there's a gym upstairs and i believe they have yoga classes available.  belay certification is only $34.  i highly recommend getting certified esp if you go with friends or slightly more frequently because this will permit you to belay each other.  the people who come are respectful and keep to themselves.", "date": "11/28/2010"}, {"review_id": "rB1myeqc5_WHaI7CFVgtvg", "user_id": "CN8gwyZCygsLBYWHKqHENg", "user_name": "Jackie D.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 4, "funny": 4, "cool": 5, "text": "this is by far my favorite climbing place. ok, granted i've only been to the sunnyvale PG and fremont city beach, but still!the staff here is SOOO laid back. i love it. they are friendly and not intimidating at all. when they walk around making sure everyone is doing the right stuff, i don't want to run away and cower in a corner for fear of being scolded. it's awesome.i have to say i really like the routes here too. there's a chimney route that i have grown to like. it hasn't changed for the longest time but every time we go, someone HAS to climb the chimney. there's a speed climb you can try too with cowbells at the top to ring. that's always enjoyable to do. there's also a wall that has different levels, which you can sit and rest on since it is pretty trying. not to mention there's a ledge that you kind of just hop on when doing a 5.10a because you don't know where to go next. we're probably doing it wrong, huh?unlike sunnyvale, the stench of B.O. does not flow in here. i love it even more. when it's a warm day, be prepared to be beat down with the heat. there's no windows so everything is just built up inside. there are fans that they can turn on but i'm not sure if it will be enough to keep me cool. i'll still go here never the less.", "date": "3/22/2009"}, {"review_id": "zy2bfrk2qsSewTqkcNdEEQ", "user_id": "mqCSMgbedbPDpekrmU4e6g", "user_name": "Romeo C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 4, "funny": 4, "cool": 0, "text": "*** This is a review of the Planet Garnite Belmont facility and not a reflection of the Sunnyvale and San Francisco location which are far surperior.***I had no problems with this gym when it had only 2 locations, Belmont and Sunnyvale. Belmont just happened to be the lesser of the two. Belmont is closer to me so I didn't mind getting the crappier gym. Then they opened up their San Francisco location. And now it's way too obvious that Belmont gym members are getting the huge shaft. It ticks me off sometimes when I think that we are paying the same monthly rate as San Francisco and Sunnyvale gym members and not getting the same quality facility that they get. Slowly I have seen regulars in Belmont make the trek out to the south bay or the city eventhough Belmont is their closest gym. I don't uderstand how management could let this place deteriorate when it's in one of the most affluent areas in the bay. Can you picture a really old crappy gym in the heart of Beverly Hills or Orange County? Thats what this place is!But let me give you specifics because you guys have no clue of the things that I am complaining about.Weights: The main weight room has a slanted floor! So if u were to put a dumbell on the ground it would start to roll. GHETTO! The machine weights feel dated as well as the cardio equipment. Picture your local 24 hour fitness equipment and think about the equipment they threw away when they upgraded to new stuff. I have this theory that belmont just raided the 24hr fitness garbage can and stole all the old stuff that wasn't up to 24hr fitness standards. But its good enough for Belmont Plant granite I guess. they have this open weight room area that would be pefect for jump rope, lunges, or any other plymetric excercices that require lots of space. Too bad the floor isnt sound proofed and its right underneath the yoga room so any of those are out of the question.Bouldering: Small!!! The only bright side is that they have 2 caves. 1 cave has a larger concentration of V0s and V1s. The other cave has the harder problems and no one under 14 pears or age is allowed in. I like this seperation especially since the weekends have a lot of kids dangeroursly running around the place. But no highball bouldering or top out boulders that the other gyms offer.Roped Climbing: Small!!!! Sunnyvale and San Francisco both have lead climb only sections. Not Belmont. Since the bouldering and top roping are so small, this place gets old real quick! Think abou this. If they are refreshing the problems and routes in Belmont at the same rate as Sunnyvale and San Francisco. Then we are getting far less climbs overall. Their size is 2x as big. Y do we have the same refresh rate as them? 4 or 5 Bouldering Sessions and you're probably done with the amount of projects you can do. But you can be in San Fracnisco and still not finish all your potential projects when they redo the probelms.Yoga: If you're joining the gym just for Yoga purposes then you wouldnt notice a difference in quality. Each gym has different teachers and classes so its all different and a matter of preference. I do know some people that drive all the way to the city for Sarah's Mon and Wed vinyasa flow. And remember, the ceiling is thin so your yoga expereince could get distracted by the sound of people WORKING OUT IN THE WIEGHT ROOM! How dare they!Locker facilites: Homeless people live in more sanitary environments than this. This is the place where SARS was born. Plumbing is always an issue week in and week out. Small lockers so you cant fit an entire wardorbe without wrinkling it. How would you go to this gym before going to work? Filthiest Suana I have seen in my life. The light inside doesnt work which is probably a good thing so you wouldnt notice the true disgustingness of it. To many members doing naked bikram yoga in their. It does get hotter than the saunas in San Francisco which I like. But I think it gets so hot because its busted. The wall clock which was outside the suana room door is broken and hasnt been replaced in 2 weeks. You can buy one in walgreens for 2 bucks! I know, I've purchased one.Staff: OK so the staff is the only bright spot. Cool people.This place has the feel of a gym that could close any second", "date": "12/17/2008"}, {"review_id": "BnB6e_x8jbJuh_xDhakQmA", "user_id": "HXG2ziMARoc2BDvyKKd86Q", "user_name": "Robert H.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 2, "funny": 0, "cool": 2, "text": "We were introduced to Planet Granite by a friend and we have now started to come here from time to time. I use this facility to have some bonding time with my son and give him something different to do.  He likes to come here with a friend so they can clown around a bit in the boulder room which does not require a belayer in order to climb.", "date": "1/27/2007"}, {"review_id": "OUTa8_ptIE7YOjeM3JVY7g", "user_id": "bAscXiDcvAZfcNEsP2HnIQ", "user_name": "Ashlee F.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We booked a babysitter & took belay lessons for a date night. We had so much fun with the instructor & scaling the walls after wards. If it wasn't for our out of shape arms we would have gone all night. Definitely will be back with our kid when he is older. This would be a great family activity!", "date": "6/17/2010"}, {"review_id": "HBHij4bMPcAy22p6G96ULg", "user_id": "6hD8OmHzbS74OBWATpgO9w", "user_name": "Jesse K.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I'm all about this place, it's always a treat to climb here.  I used to climb at their Santa Clara location but this one seems to be quite a bit bigger and more up to date.  The bouldering section is always cool yet challenging.  This location also seems to have higher ceilings than PG Santa Clara which is always nice!  My favorite are the overhangs, they're hard, but not impossible.  I've only had a chance to check out the climbing area but I noticed they also have a Yoga room and exercise bikes (among other things I'm sure).  The staff is knowledgeable and helpful when needed.", "date": "12/31/2006"}, {"review_id": "XCLsYvJw6oJiXCabNK00fQ", "user_id": "7Mt-DvvF8nofWHSfZZcKSA", "user_name": "Alex H.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here the first time and the place was clean and well maintained. the employees very friendly and the rental equipment were decent. the climbing areas are spread out pretty well so that there was plenty of room to not be others way.", "date": "1/31/2010"}, {"review_id": "I7bE91gfBKFFFPX8mCbiKQ", "user_id": "iX_lqhcobUBvM2S671_RyA", "user_name": "Maria V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "This climbing gym is fun for beginners like myself but also for the pros that seem to be covering every square inch of the walls there... The belay class  is only $5 but if you are not a member you'll also have to pay $17 for the day and about $5 for shoe/harness rental. The people that work in this gym are very friendly and helpfull. On Fridays you can get in for only $8 if you are a student and it is a fun way to spend your Friday night with friends. Climb on!", "date": "3/1/2006"}, {"review_id": "X35E8BfbEv44eoLOw6cVSA", "user_id": "_Lqn94_h08KPgmxCf_iwRQ", "user_name": "cammy g.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "A great gym in the peninsula if you're a climber. I started climbing there but then one by one my friends eventually stopped going. My dilemma, no belay partner! Although you can always sign up and find one at the gym, I'm not much into having someone I don't know belay me. Now my poor barely broken in climbing shoes and harness are just gathering dust in the closet. There's a couple bouldering areas so that's always a nice option. The cardio and weight areas upstairs are fairly small but it never gets too crowded and you probably wouldn't really have to wait for a machine. You also get a good view upstairs of the climbers on the wall. Great entertainment. The yoga classes that I've been to were also excellent. Very well worth it if you take advantage of it. Not really worth it if you're just going to work out here. Well worth it if you climb or practice yoga.", "date": "10/19/2006"}, {"review_id": "MGb-2dLWcu2WEJfYQcWseQ", "user_id": "-4eBORWwLAOXgPYPaSpJHw", "user_name": "Irvin David U.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Reasonable prices, safety is required as they don't let anyone climb the vertical wall unless they pass a safety test, nice and clean facilities, wasn't crowded during the weekday when I went. I looked at pictures of the new site in SF, and I must say it does look impressive. I'm strongly leaning in getting a membership now.", "date": "6/3/2008"}, {"review_id": "dFUACg1qXQ53JCMmYJ4YcA", "user_id": "_ymekCp08eUxXlprucOaoA", "user_name": "A M.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The facility itself is great and the staff are really nice. Classes are good but noise can be a problem. I've been climbing here for 2 years and keep coming back. Not as big as the other 2.Weekdays are packed after 6:30 pm. Weekend mornings people bring their kids and there are birthday parties. I have no problem with the parties. The gym does their best to monitor them. The problem are parents who bring their kids don't keep an eye on them. It is a family friendly place but if you plan on bringing your kids be sure you have 3 adult climbers so your belayer isn't distracted from belaying. It isn't a great place to bring very young children but it is GREAT if your kids are old enough to climb.", "date": "7/9/2010"}, {"review_id": "yWF8TB2HCZBln99HY-6F0g", "user_id": "P23mk1BvIatvVlD6sBD5Fg", "user_name": "Sandra B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place rocks. i Love this place. people who work here are friendly and there is no better place to climb and meet new people. very addicting", "date": "5/23/2010"}, {"review_id": "nTpO3Bts2HCnefFdo_XSVQ", "user_id": "HvUXiTSN-Y8raG1pqQubtQ", "user_name": "Anya B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Definitely a terrific place to work out.  Besides climbing, there's a gym, yoga classes, and a sauna. Best gym in the area.", "date": "5/26/2006"}, {"review_id": "P4JYSaZeSvymQyTnuBFFXQ", "user_id": "Xp4kxWZRCCSNSYmhllCfhg", "user_name": "Tony C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Even though I hear this gym is way smaller than the Sunnyvale location, I love the feel and laid-back nature of this gym.  The smaller size lends itself nicely to a more productive climbing experience.  Also the caves are nice for fooling around on (another side effect of not being as crowded as Mission Cliffs).I was hesitant about a membership at Mission Cliffs (after multiple visits) even though I live in the city and one trip to Planet Granite has got me looking for climbing buddies willing to make the trip to Belmont ;)", "date": "2/19/2007"}, {"review_id": "XJX5-uo89kghz3qFueXGuA", "user_id": "UgqswHeTuvmil6_SylQ3XQ", "user_name": "Bonnie V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I organized a work event here recently, opting for the group to receive 2 hours of training with the instructors. The staff did a great job, considering a majority of the group had never rock climbed before. We learned proper belaying technique and safety before starting our ascension up the various routes. I think everyone left with a solid knowledge of belaying and a newfound appreciation for the activity. The facility seemed great, though as a novice, I have no other rock climbing places to compare it with it. I appreciated the fact the group had access to the rest of the facility (the exercise equipment and studio classes) following our lesson. From an event organizer's perspective, it's unfortunate they don't have a party room where you can bring food in, but there are several restaurants within a one mile vicinity of the gym to visit afterwards.", "date": "6/16/2010"}, {"review_id": "FKUHjTUo-tAXY4EzTwiVYg", "user_id": "ERKL9MPyiGCSQKk-k0aPMQ", "user_name": "A U.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "The gym and fitness equipment here are adequate, and being able to watch the climbers definitely helps the time go by faster when you're on the cardio machines.However, the real reason I go to PG is for the climbing.  The gym has a good variety of routes -- a bit of something for everyone, from the kiddie routes to the 5.12+ climbs with long overhangs to slabby climbs on the contoured walls that simulate natural rock features.  The staff are friendly and approachable, and the climbing classes were definitely helpful for me.  The people who climb here are a friendly bunch, and I've made some good friends (and climbing partners) here.It seems there are fewer climbs here than at PG Sunnyvale, but this location is also much less crowded.", "date": "9/15/2006"}, {"review_id": "SOXNoykE8rqL9o-bm4wEHQ", "user_id": "mytkOxFAZst4F0_WtsHp-A", "user_name": "Chuck W.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Ouch! is what I have to say after trying climbing for the first time here tonight.  Who knew climbing up a sheer wall could be so fun?  This place is big and well lit, has lots of room and lots of routes of varying difficulty, and it was pretty impressive watching some of the better climbers contort their bodies into odd, pretzel-like shapes trying to reach that one tiny little handhold off to the side.  The staff here is also friendly and helpful.  If you like pain or your forearms have misbehaved and need to be punished, then this is the place to go!", "date": "3/14/2006"}, {"review_id": "w2LTx4Oc0xYRmN8TBCBJ0Q", "user_id": "je0rWu3ZTRbpHfTUGMhjoA", "user_name": "mary l.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "love this place.visited once with daughter but was not able to take advantage of the membership yet.love the yoga and the fun atmosphere.Daughter only did bouldering for an hour but LOVED IT.We will return as soon as we get belay certified.", "date": "8/6/2009"}, {"review_id": "C43FHpJqbUJUZuRcWyNdwA", "user_id": "gCm9kmM8ILOLYDYesXLMow", "user_name": "Mon C.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "i was a gym member of the belmont PG while working in san carlos.  i never rock climbed but did partake in yoga classes and other weight training classes they offered.the yoga studio is a good size and the instructors are great.  the classes are small and personable.  i would always go in the morning before heading to work.  after yoga i would go up and do a little cardio and weight training.  because their gym is so small you don't get a bunch of meat heads running around, nor do you have to wait around for machines.  the changing rooms and showers are pretty clean.  they also have a sauna.i miss planet granite!", "date": "7/17/2007"}, {"review_id": "gXeYfwiZUZ5SWPXh5XVwlg", "user_id": "zvG-SCg4EMpsdKmzAIVU2Q", "user_name": "Bettina O.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have written previous reviews for PG Sunnyvale and San Francisco and I can only repeat myself for the Belmont location. The staff is very friendly and knowledgeable and so are the yoga and fitness teachers. There are plenty of classes to choose from in the morning and evening and as a member you can use their other locations as well. I'd recomend this gim definitively to any climber but as well without a doubt to non-climbers who like yoga and fitness!", "date": "6/21/2011"}, {"review_id": "xn3J17wldg4_QesAFUW49Q", "user_id": "9gMaA5X9aDYPl1uC8rczIA", "user_name": "Judy V.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'd highly recommend Planet Granite in Belmont if you're a rock climber or into yoga; both offer an intimate setting with knowledgeable and friendly staff.  But what I really love the most about this place are the circuit training and abs & core classes led by Harriete Estel Berman.  I've spent years happily turning myself over to her butt-kicking, fun classes that make me sweaty and strong with endorphins galore going off.   I only wish I didn't have an inflexible job so I could go to the circuit training class every Monday, Wednesday and Friday morning.  Its absolutely perfect for ADD types like me who would look out the window at a squirrel if left to my own devices in a room full of gym equipment.", "date": "6/18/2011"}, {"review_id": "ThxEMhZvx_McZjSYaNpeew", "user_id": "aCI62mM5y29ABM5_vCDINw", "user_name": "penelope t.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "in the summer for me this place is 4 stars with a couple missing for occasionally rude workers, and too many broken machines at one time. i luvd this place til winter, then it got COLD and theres no heat at all its FREEZING. if i wanted to work out in the cold i would just work out in the great outdoors...also they dont turn their lights on in the daytime and it is often so dark it is difficult to read while biking or treadmilling or whatever. its kinda depressing not having the lights on. in the summer when it was sunny it was almost ok, but in the winter when its dark and cold and theres no sun, the last thing i want is to go into a freezing place with no lighting. its just weird. i agree w some others that have postulated that perhaps they are on the brink of going out of business. i wonder if any of their locations have heat or if thats just the climbing culture? anyway im sad to have to leave but its looking like im going to have to head over to fitness 19. hopefully they will have the good sense to turn on the lights and heat the place. wish me luck. :)", "date": "12/11/2009"}, {"review_id": "gUNm2Ca6OTx5iYQ_MRqU6w", "user_id": "4N8PskMMl4OccXwdYnb-Pw", "user_name": "Jim B.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I joined PG about 4 months ago, the Belmont one at least. I would recommend going around 1 pm, when there is nobody there to climb. If you don't know anything about this sport, they have several types of classes. To do anything there you need to take a belaying class (I think it's $17). But belaying is only using the pulley attached to your harness to lower someone, and keep the rope taut as your climber climbs. The actual climbing is learned by doing. My advice, watch the girls, they have a tendency to use thier legs, men tend to try to muscle everything around. That and trust your equipment, if you do, how high, how hard, doesn't really matter. The rope you use has a tensile strength to hold 4000lbs, so it could hold a  Jeep Grand Cherokee in the air. It's pricey (I pay $70 a month), but it's $20 to climb if you're not a member, and another $5 for gear. If you go 3 times, you might as well join. It's also a great way to work out and not realize it.", "date": "5/7/2010"}, {"review_id": "PRC1GrGSquLk3eIpv6L9cA", "user_id": "lZsusXJjzStoi3vQmqzoMg", "user_name": "J R.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Another great Bay Area climbing gym.  Not quite as large as Mission Cliffs in the city, but still a reasonable amount of routes for all skill levels.  Planet Granite has a decent fitness gym, too.", "date": "4/26/2005"}, {"review_id": "EwMAIJUvTWK_v4vmfkrGDQ", "user_id": "PkuceN8zeO2PlqsqLaMi9Q", "user_name": "Maija R.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I tend to join a gym and quit a few months later, but don't plan on leaving this \"gym.\"  Its great that they have a large climbing facility with a gym and yoga classes, even a sauna in the changing rooms.  I have yet to take a yoga class or really use the gym upstairs, but I love the rock climbing aspect.  It always appears and smells clean (more than I can say for other gyms).  I look forward to being a member for years to come and eventually trying a Saturday yoga class.", "date": "3/28/2008"}, {"review_id": "x5lxX2W65lXfZC4UrhTNIQ", "user_id": "thm6YwmiYiIwRuxaZchFTg", "user_name": "Patricia E.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I have a fitness only membership to PG, and have been going since the beginning of the year.  This will mainly be a fitness/yoga review: To begin the review, I'll start with some positives:* The front desk staff are all really nice.  It's important for people to smile and greet you when you give them your card to scan in right?* The facility is well-maintained.  There are lockers to put your things in.* They have a nice fitness facility.  I can always get on the machine I want.* Unlimited yoga/abs/fitness classes, which comes down to less than five dollars per class if you go 2-3 times a week.Some things I try really hard to ignore:* The locker rooms are older, and showers can be disgusting at times.  * Bring your own towels.  Their towels have turned \"beige-y\" in color from too many washes, and are not soft at all.* The fitness classes are packed (due to them having great instructors).  There really should be a limit of how many people are allowed in the class at one time.  Classes sometime can be mat-to-mat, and can be an issue if you have long legs/arms, or just tall.* People like to come late to the fitness classes ALL THE TIME.  They seem to wander in 10-15 minutes AFTER the class has begun, lay their mats down, and start talking to the person next to them as if class hasn't started.* On a side note, there are a couple frequent members that likes to make noises during yoga.  We're not talking about quiet grunt noises...  we're talking out loud \"ahhhhhhs\" and \"uggghhhhhhhs\" continuously for 40 minutes.  I'm not into hearing other people moan, so it may just be me.Overall, great instructors, great staff, and you never have to wait around for gym equipments.  However, they need to limit the # of students per yoga class, and not allowing students to come in so late.", "date": "7/15/2008"}, {"review_id": "O75tsNaWIYK7bYSC2OGXZg", "user_id": "WYfnTPyfSH9ebt8J-TaGrw", "user_name": "Jeff L.", "business_id": "OJ1Pd42-T1oFIm2sqvy_hA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing at this gym for just over a year now and i think its great considering there aren't any other gyms on the peninsula. I climb mostly sport, boulder some, and use the exercise equipment every time i go. The sport routes here are pretty good under the lead cave and the only real problem i have is that they set routes that traverse the whole wall and climbers leading those routes end up taking up the whole wall. I know they restrict those routes during peak times but even off those times it gets really annoying. The ratings here are on the easy side and some times the consistency is off. There would be a 11a that would be incredibly technical and difficult and a 11- that would be like a walk in the park almost. Last thing about the lead climbing is that the lead test i think is to easy at this gym so there are a lot of people who shouldn't be lead climbing here. I think the minimum requirement for the lead test is to climb a 5.8 which is ridiculous. The bouldering is ok here. If you're really into bouldering go to the newer gym in Sunnyvale. The walls are much more \"boulder\" like. The exercise equipment is great at this gym, only thing is it gets crowded at the peak hours from 6-9pm. But overall if you're looking for a climbing gym on the peninsula this one is pretty good. If you looking to join look out for the membership sale. No initiation fee is great.", "date": "3/11/2008"}]