[{"review_id": "ySa9DuG3IueJngGGzDMxzw", "user_id": "I6AWrIw02WX4LGUBBkEquA", "user_name": "Crystal M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Guys/girls listen up! This place is AWESOME! Came here with my husband for a date night out... I have always wanted to try rock climbing but with my fear of heights was very hesitant.  I finally let caution to the wind and asked for a date here and I had the most amazing time.  Poem checked us is and got us set up.  Looking around at all of the experienced climbers saying that I was intimidated is an understatement but everyone was so kind and non judgmental.  At our safety brief poem had me do a short climb probably about 4 ft off the ground to get used to things.. I freaked out when she said to let go! I was terrified but eventually let go.  After the safety brief we were set to climb.   The climbing is the \"easy\" part(it's easier said than done) but coming down Oh my! My first time down I climbed by my second I was moreComfortable and felt like a pro(clearly I am far from it). Needless to say we had a great time learning, encouraging and spending time together! I would highly recommend this place for a workout considering even the best of athletes will work out muscles they've never known existed or a date night out to try something new and fun.  I am looking forward to taking my girls here on our next trip", "date": "5/17/2019"}, {"review_id": "RGFlYmZX7aPTJS8mhlzV4Q", "user_id": "9lFQWP74uZAl-QBeQFGJrQ", "user_name": "Gary N.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing for 20 years. Although it's been s year since I've been. I brought my 7 yo to climb for a day. Even though I've been there and belayed my son and daughter the guy said there was no record of my proficiency. He strode over me and made me to feel nervous when testing me and rather than show me what they wanted in thier gym he waited for  me to fail. Rather than help me he was only interested in selling me a training classThere are other climbing gyms in the area. I will go elsewhere and take my money to those places. I hope if I'm struggling they will build me up rather than make me feel like I failed.", "date": "3/30/2019"}, {"review_id": "4K_ngievTDiqRjw81elF7w", "user_id": "PICkufJlZDIpWpnR1onPUg", "user_name": "Brandon T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have really come to love this place! It is the biggest rock climbing/bouldering gym in the area and I have had a membership with them for almost 10 months now. Their membership tiers are great and decently priced. The place has a lot to offer! Their customer service is usually very kind and they are very understanding when you communicate with them. Rock fitness has the feel of a small family business while maintaining the largest rock climbing gym in the area.P.S. They have a lot more than rock climbing and bouldering. They have a basketball/volleyball court, cage ball arena, high and low rope tight walk, rope ladder, full weight lifting gym, bicycles and treadmills, workout/yoga room, workout mirrors, party/banquet room and lounge area with ping pong/billiard table.Only reason they get four stars is they need to upgrade/clean the bathrooms more. By upgrade I mean make them larger and include a changing area. Also the billiards table felt needs to be fixed/replaced. Otherwise this place is amazing!", "date": "2/25/2019"}, {"review_id": "VnaYy-CHjldBJt4p7zJ0qA", "user_id": "tbGHHZu5M6yGxn0Vnl40zQ", "user_name": "L I L S M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "10/10, love you RF. Been climbing here since I was 15. Best staff as well as the best climbing environment. Everyone is welcoming & you feel right at home whether you are new or a pro", "date": "5/15/2019"}, {"review_id": "7XD1Doqq1imH3PFJfRgQFQ", "user_id": "rQRFSFBDatSo0h1Jo5Xm_w", "user_name": "Amber B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Loving it so far! My family's only been coming about a month, but we are all enjoying our activity here immensely! My son is in the kids classes while the rest of us climb and it's the 1st time I've found something active we all love to do!", "date": "4/30/2019"}, {"review_id": "tO4zRKWj0GP5rjlAe0lbgQ", "user_id": "mPNkV-g1mmMIZ0moybzkKw", "user_name": "e d.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to take the family! All the kids enjoyed our time and will definitely being going back. Everyone working there was nice and helpful. Thanks!", "date": "5/21/2019"}, {"review_id": "K55jrfMBNYYmFPpB5VZnDQ", "user_id": "0pIu5JTjHIrArnPsZvAArg", "user_name": "Jennifer L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "I came here with a couple of friends who had passes. Coming from Utah where there are a ton of gyms to this one this is below average!There is not much routes and I definitely would not pay for a membership here if I wanted to climb as there are many other options and activities you can do.There was literally no one working besides the gal who had trouble charging me and giving me the correct pricing. I don't know how else to describe it but it's definitely not safe the way the gym is set up where anybody can go and auto belay or top rope themselves without any certification. I watched the one employee show a lady how to unhook and place the biner on her harness. It was the shortest and quickest overview. If I didn't know how to belay and use the self top rope I would NOT feel comfortable at this gym.", "date": "12/27/2018"}, {"review_id": "08xuJ5oP-VMWSqDypznqYQ", "user_id": "5UowAg35JaQX5DBQ4v7_Vw", "user_name": "Reta B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I came to Rock Fitness because my coworker recommended it. They have ladies night for $5 which is not bad deal. They have a form to fill out before being able to climb and sign it. The fee was good compared to their monthly membership fees. It was my first time doing rock climbing, its nice but definitely not easy. I would try it again in the future. But I highly recommend this facility to everyone, it was big enough, had a lot of walls to climb, also had gym equipment. As well as clean bathrooms.", "date": "12/5/2018"}, {"review_id": "9aTh0vXYZs-lYZ4VfNpMdQ", "user_id": "vILrRpaFYWe2lTe8qsco4Q", "user_name": "Kyle B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Pros: Good gym & Classes. Huge rock wall. Cons: Equipment can be a little dirty at times, no equipment wipe down supplies provided. Carpet is pretty beat up and stained.", "date": "2/5/2019"}, {"review_id": "UxRipVZvw4ux4n17Xo7zFQ", "user_id": "i2-tdexOIua7ClnTrSCZpg", "user_name": "Michael M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This gym has great variety. They offer climbing, basketball, volleyball and a variety of resistance training equipment. Rock Fitness even has a volleyball club team that practices there. In addition, they just started a Spartan Racing group by the name of AGOGE IE. The group meets weekly for training runs and other adventures. The gym also hosts climbing trips, daycare and a multitude of classes including yoga.", "date": "12/16/2018"}, {"review_id": "xZzBjvGEg0DIsp3idf1lnw", "user_id": "2t5FcdTfE4mzg2IFQGfvhQ", "user_name": "Lauren G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Love this place! Such a fun activity and environment. There was huge walls to climb and everyone was super friendly and helpful. I love that this has a gym and basketball court as well. I love the harnesses and that they over great deals on Tuesday's and Fridays. I love bringing my son here!!! I'll definitely be returning & recommending this place to all my friends!", "date": "11/10/2018"}, {"review_id": "GWII2s-zmy_ytO08MvYfEg", "user_id": "yBtHrK6ZN96rzUPGRCrUFw", "user_name": "Christine L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place has it all but be prepared to pay a price for that. I only go on ladies night, which is Tuesday for $5. It's got plenty of rock walls and fun wideout equipment", "date": "5/1/2018"}, {"review_id": "hnFnCbOiRDVKe1B5EDu7gg", "user_id": "aWaldD2i91Id0bIEqmLAtQ", "user_name": "Kelly H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym. Friendly staff. And amazing yoga classes free with membership or only $10 without (if that's still the same ‍)", "date": "12/5/2018"}, {"review_id": "lVK1clwmPL6XkamzZZiZ4g", "user_id": "7zMnIgzhw0xGt6iYgOT0Cg", "user_name": "Erica C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This place is AMAZING!!!! I drove out from Irvine to check out their routes/problems, and was greeted by so much more. Fantastic, caring staff. Approachable owners. Auto-belays, lead climbing walls, top-rope walls, and bouldering for all levels. The best part, and why I wished I lived closer - their gym provides racks!!! A weight lifters dream, and only $10/month for the gym portion?!?!? Most places cost waaaay more than that, and can only provide smith machines. Truly loved this place. Y'all should check it out.", "date": "8/3/2018"}, {"review_id": "q-koOjZLduKrLE0O5Y6x_Q", "user_id": "_60J0bNJZMWKAA8O8-nugQ", "user_name": "Arielle M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and son loved this place! I purchased the groupon and it was a great deal, I think after my discount it was $17 per person for unlimited climbing for 24 hours. It was there first time rock climbing together and they had such a fun time! We will definitely be back again.", "date": "12/30/2018"}, {"review_id": "9iKLPIrexiKrwcnMZxRILw", "user_id": "HsDFXJdBhzjNKdZJLCB-UQ", "user_name": "Michael P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place, great vibe and so much to do! My kids love it, we go pretty much every day. I highly recommend Rock Fitness, especially if you are looking for a fun new way to work out with the family.", "date": "9/21/2018"}, {"review_id": "-1j-ieXX29Tr_OH8hygtJg", "user_id": "qgSTn_sjWrPruMpFVmo07w", "user_name": "Shurie P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very first time rock climbing and it was so fun! The staff was great, showing me how everything worked and answering ALL questions I had, AND made sure I was confident coming off the wall before I was off on my own. Can't wait to go again!", "date": "1/7/2019"}, {"review_id": "pxX1qxW8Boyl_Z8IrMQD8Q", "user_id": "3etoteXzXp2YW4dyGP-URA", "user_name": "Veronica M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My sons love going here! A little pricey, but kids enjoy it! It's never been too crowded either. There aren't that many wall options for the little ones, but they enjoy going there and burning some energy. Very safe settings, and the staff explains everything very well for first time climbers. My 5 year old enjoys going there as well as my 8 yr old.  There's a few walls they can climb all the way to the top.", "date": "1/9/2019"}, {"review_id": "tg2ny1QYhbiDNOnGycfTww", "user_id": "vGSer5ULOn_jQdV43VLFQw", "user_name": "Brandi H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So much fun with family and friends!  The staff was very helpful and we had a fantastic time!   We look forward to going again!", "date": "5/22/2018"}, {"review_id": "tBltX4JzjfjM2alVs4BpnQ", "user_id": "KfqmSXOclAYmAc88AkSUaA", "user_name": "Mandy P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We held our daughter's 11th birthday party here today. It was a wonderful event! The employees were attentive, professional and kind. The facility was good as well. We had children between the ages 2-12 attend the party and everyone had something to do. We included the bubble soccer and Pizza Factory pizza in our party package and both were a hit. I would absolutely host another party at this facility!", "date": "12/8/2018"}, {"review_id": "SoCe7twPAGRw9G_p60SX0w", "user_id": "jjcg4nIX_hlECSIOau2-6A", "user_name": "Rebecca S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 1, "useful": 4, "funny": 2, "cool": 0, "text": "I am writing to let you know of the extreme dissatisfaction I experienced this weekend in hosting my son's 9th birthday party at this facility.  The website offers birthday events as a premium experience at a comparably higher rate of cost than other similar facilities and the event  was horrific.This party was booked online almost a month in advance.  Two weeks before the event I was contacted to verify my party information for the following Saturday, which was not the date we scheduled online.  I called back to confirm and fortunately the weekend I actually booked was still available as our invitations had already went out.The day of the party was admittedly the second hottest day in record history for Murrieta at nearly 113 by 11:00am.  Our party was scheduled from 10am-12pm.  We were told we could arrive at 9:30 to decorate and the upstairs room would be arranged with tables and chairs and all other equipment such as a ping pong and pool table would be moved out of our way.  At 9am we called to pay the balance of the party at $220 over the phone before our arrival.  Only THEN were we notified by a staff member that all three swamp coolers in the facility were broken.  On a day that was forecasted for record heat it was extremely negligent that no one called us beforehand to warn us and at least give us the opportunity to notify other parents that their 6-9yr old children would be rock climbing in temperatures over 110 degrees.  Some children have asthma and other conditions and it was dangerous for them to climb in these conditions and we were given no warning.  Given we had no time to make any adjustments we had no choice but to attempt the party or simply cancel it which would have been crushing for my son.  We also had no idea how bad it would really be.We arrived at 9:20am ten minutes before our scheduled arrival time.  THe upstairs \"party\" area looked like a storage unit.  All the table and chairs were pushed to a corner, unopened, unarranged.  The staff member told us \"we were early\" and went upstairs to place several floor fans around the room.  I waited another ten minutes and no one came back to arrange the tables so I had to move the ping pong table and pool table myself, set up all the chairs and tables before I could even begin doing decorations which we ran out of time to set up.This was supposed to be a guided party with staff members taking the children through a series of activities throughout the gym.  Other than an initial safety orientation, the children were sent out to the floor to figure it out on the own.  The two dads present had to take charge of helping the children try and climb, no instruction was offered, and there was no structure at all.  They basically just had free play for the next hour and a half.  We had to ask to have the Cage Ball structure opened for their use.  We had to ask a staff member to come help us with the High Rope.  I also paid an extra $50 for a Bubble Soccer activity which when I asked when that would begin was told we didn't pay for it.  I promptly brought up my email receipt and apologies were made only to be told with the heat it would be too extreme for the children to participate.  Again....no planning, no warning, and no discussion before the event so we could let our son know he would be missing out on this activity.The fans provided inside the gym had no effect on any aspect of the heat.  We had to run home to grab a cooler with ice and waters because no efforts were made by anyone to cool the children down.  Everyone was sweating profusely, it was miserable, one family opted to leave and by the time we reached the \"eating and party upstairs\" portion of the event my sons cake had literally melted off the table.I paid $270 for this event.  There was no structure, no knowledge of the service I had purchased, no set-up of the party room itself, no instruction for the children, and no recourse for not providing us any warning the children would be climbing in a facility with three broken swamp coolers which were the only source of air conditioning.  We did not even have the option to make adjustments of our own because had we not called to pay our balance, no one would have called us to warn us.  This is grossly negligent.  This facility should not have even been open if their swamp coolers were broken.  We measured (and photographed) the internal temperature of the gym at 115 . Even were it not for the heat, the lack of preparation and inability to know when our party was or what we had paid for were nowhere near the \"guided experienced by trained staff and our own \"party room\" we paid for on your website.  We should not have had to teach the children.  My party room should not have looked like a storage facility.  We should have been notified of the extreme conditions without having to call a half hour before our event ourselves.Update: the fact that the owners of the gym voted this review as \"funny\" only proves my point. Disgusting.", "date": "7/21/2018"}, {"review_id": "naOzAhT2oC4_zNrrLgiWEA", "user_id": "fKrgEh7Kq4LdYzJ5COmkww", "user_name": "Monique B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I purchased just the gym portion due to an injury that enables me from climbing,  to motive my fiancé and I to go to the gym together (he climbs). Anyway, I stopped going a few months ago because majority of the equipment is broken. I got motivated and came back yesterday with the hopes they fixed things and even more equipment wasn't working! A lot of people were making comments about hoping \"one day they'll fix this place up.\" I realize this is a climbing gym, but please do not offer a normal gym that people pay for if you aren't going to keep the equipment working and the place clean. The staff is friendly and I like going here, but please please update your floors and equipment.", "date": "9/25/2018"}, {"review_id": "vSkTwKVr8ECyfD2sKZq38Q", "user_id": "Xh79D3oxmdSH5486A1WiLg", "user_name": "Jolyn C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First and foremost the staff here are really nice and know their stuff, they have given me a lot of info which really has helped me to understand the sport. They all have been super patient with me and my questions. My son is also in their intermediate rec class and he has already learned so much in just a few months and because of it, he challenges himself. I can always hear the coaches giving the kids appraisal for a job well done, and they kick these kids butts into shape. It's not just climbing the entire time, they have to do many exercises to gain strength and endurance. It's great watching all the kids climb walls they couldn't do the week before, it builds their confidence and they are really proud of themselves. Best choice I could have made for my son. He is happy and I don't ever have to drag him to practice, he looks forward to them.", "date": "10/6/2018"}, {"review_id": "qwq6ZZjYI0Q7PJcDMdlsow", "user_id": "Wx--N0tggO41L2gr32BrnA", "user_name": "Brian P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. I'm a beginner and they give you a quick tutorial at the beginning so you can get comfortable. It's a real workout, that is for sure!! Alittle pricey for the one day so I can't go as often but I will definitely look into getting a pass so I can go regularly. The staff is very friendly and helpful. Would give it 10 stars if I could...", "date": "9/14/2018"}, {"review_id": "edJYiVprVUg2FOUnT_xMRw", "user_id": "SOFpJU5GMRCWd1CtiENLXw", "user_name": "Mark D.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place and a great staff. Friendly and welcoming environment with crazy reasonable pricing and everything.", "date": "10/22/2018"}, {"review_id": "b3ADO7Bb-PMIxnlLqzLysQ", "user_id": "GDjjtKd457mft8rVpOhYmQ", "user_name": "Kevin C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "I've been going to rock fitness for about a month now. What I love about rock fitness is that with an $80/month membership, you have unlimited access to the gym and you can bring other 1 guest for free per month. Their amenities include the rock wall, a boulder to climb without the harness, a basketball court, and a full gym. They even offer regular yoga classes to complement the rock climbing. The service at Rock Fitness is unparalleled. Every employee has been very kind and helpful. What's even more cool, is they change the rock climbing sets, and you start to see which and whose climbs you like or find more challenging. The membership is definitely worth the experience. There are so many things to do, and since the sets change every week, every workout feels novel and innovative. There's something for everyone here. Happy climbing! Update: If you cancel your membership and want to start again, you have to pay the $40 initiation fee.  To freeze your account you still have to pay $8 a month, which is a scam in my opinion. Changing my membership to Vital Gym cause of money, proximity to my house, and better cancellation policies. You only need to buy the membership card the first time for $5. Rock Fitness is good, but I feel like I'm kept hostage by return policies like this. Everyone is super nice at Rock Fitness, but you boy gotta eat, you know what I mean?!?Sorry about it! Rock Fitness is great if you aren't a struggling post-graduate student who can afford $55 a month!", "date": "11/22/2017"}, {"review_id": "NJxEBqkpbi3aiK3ZqGHOEw", "user_id": "_phaAZjiwDoqlXMM_JzhdA", "user_name": "Mary Y.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff, Alyssa was very helpful and accommodating. not a lot of people here on A Wednesday afternoon between 1300-1530. They were doing some maintenance on the bouldering.", "date": "1/17/2018"}, {"review_id": "yMd-QcE_PVO1Si-nHY850A", "user_id": "VnB-eWbe2kf21_c5dXGxhg", "user_name": "Naiven A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for the kids. Plenty for them to do here to wear them out. Great and friendly staff.", "date": "8/28/2018"}, {"review_id": "mwvBfvGWK5qPLlEUCn1t2w", "user_id": "b-PCWEkt0ousL1XZIMRBZg", "user_name": "Charles N.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I first found out about them through groupon, they had some good deals on there. I wanted to take my 5&7 year old to somewhere they can be active and build confidence and physical strength. The venue is nice, it's like part gym,with weights n part rock climbing. The staff they are all nice n informative.They are all patient too! Kuz I had questions and you know how little kids are. All n all great experience, we go all the time and with the pass my son got its good for 24hrs!!! So we go around 6/7 and can come back the next day after he gets out of school. I'd recommend this place. Also if you follow them on social media you get discounts on equipment as far as the rock climbing shoes.", "date": "3/22/2018"}, {"review_id": "JckRZhRkWxDOdNcloxnXOg", "user_id": "6vgSwuxH7mfjLXtyH7qoiw", "user_name": "Kyle A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to get some massive gains . Kidding. It's a nice place to try something different and be active. Try going to this place on Fridays because it's only $10 which includes everything. This gym is very friendly with a great vibe. Lots of challenging courses and it's a great alternative to a movie theatre. The staff is very knowledgeable and friendly. They also encourage you to just have fun and just enjoy. Make sure to bring lots of water!!", "date": "7/29/2018"}, {"review_id": "LdDhD6NKRmH4gcPHQCjrwQ", "user_id": "3pQgntNwyGglrWUMqmNu_A", "user_name": "Jesica A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went rock climbing for a date  good location and lots of fun but when I was finished I smelt my hand and it smelt like legit feces. Made me sick but I had so much fun I ignored it. Tip, wash hands before going in, and especially after.", "date": "9/16/2018"}, {"review_id": "5yr1KlsOB1fomGlfnfLQIA", "user_id": "XL4kuSeal7cw6LlKw2zqyQ", "user_name": "Jennelle C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "HIGHLY RECOMMEND!!! I love this gym!! So much family fun. If you're looking for a healthy way to spend time with the whole family...this is it. We love the rock climbing. Red and Amanda are great employees....very friendly and helpful.", "date": "7/3/2018"}, {"review_id": "LRRbjh9dSDX5W6NELmLqJQ", "user_id": "pjsCDFcM_ESC0m99aG-I2Q", "user_name": "Fain A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kids love this place. Great exercise with multiple obstacles to challenge the whole family. Super friendly staff, clean establishment and very professional", "date": "7/21/2018"}, {"review_id": "dPQ3YEJUdxJyi-tLl1s9rQ", "user_id": "isjKz2ZavKRUKfN8x6qDpA", "user_name": "Crom A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super place and a jungle gym for an adrenaline junkie.. I'd say you guys are better than Hngar 18.. 40$ for both my Son and I was a lil rough to rent shoes, a harness.. Maybe for an incentive make the visit half off if new climber makes all the climbs during their visit.", "date": "7/16/2018"}, {"review_id": "Wa7rCsVnr1IhcG_E3iu0vQ", "user_id": "aXRgSjf9vDFoaUXTVKepmg", "user_name": "Allison D.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice person working there helped me get my certification done and told us about the gym.  Routes were pretty tough compared to my regular gym at University of Nebraska - Lincoln.  Weren't hardly anyone there, but I went on Veteran's Day.  There was even a discounted price ($8 to climb)!  Had a ton of fun.", "date": "11/14/2017"}, {"review_id": "BWXknPlII6NDICkyxQ_MPw", "user_id": "SsN9O8vTptKrK5d-cQxuEw", "user_name": "Karissa H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great spot for field trips/birthdays/family fun and for a REALLY good workout. I've been there a handful of times for events mentioned and there is something for everyone: climbing, bouldering, tightrope, cage ball, plus a full size court to play some basketball, volleyball, or every kid's favorite: bubble soccer. They have so many different climbs and the staff are helpful and give you tips on how to master the climb! Bottom line: you will have a great time and most likely burn at least 500 calories!", "date": "3/31/2018"}, {"review_id": "tN7V2-6Lp8f_y2OeFA5D2A", "user_id": "yNABCxI1b8eSxZbulGCpCQ", "user_name": "Lexi L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This place was a-lot of fun once we dove in and got going, however the first impression was not good. We were helped by Lauren who was not friendly, did not make us feel welcomed or comfortable about our first time rock climbing and she's the reason for my downgrade from a 5-Star experience.", "date": "3/4/2018"}, {"review_id": "wJ11DL51PfN0Z1w_5n5icg", "user_id": "0fFRkp31G4bu9bMCBOPIxw", "user_name": "Rachel L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "We went in January and my kids had so much fun! Went today to possibly pick up a membership and paid $40 for the day (2) kids. Staff very friendly, very knowledgeable. Helped with everything. Problem is my kiddos jumped 5 minutes and it was sooooo hot. Sitting down I was sweating bullets. Asked if the a/c was broken and was told they don't have one. So great place winter months only.", "date": "7/27/2018"}, {"review_id": "W_Rnk-_Q8tPKOGHLijV7-g", "user_id": "hAi-a53db9inPc6c9ly9mQ", "user_name": "M V.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Visited for the first time with friends. We each got a groupon pass which was a great deal! It's a great facility and also a very good workout. Love the variety of offerings they have there. Climbing obviously, but also a slack line, extensive workout area, a yoga room upstairs, and a few other things. People of all ages were there enjoying the facility. Very pleased with the super friendly staff and their expertise. They give you a quick run down your first time. Don't forget to ask for the \"suggested climbing Technique\" it was very helpful and I'm grateful my friend asked since none of us had ever climbed before. Saved us tons of energy because I was planning on doing the opposite with my arms.", "date": "1/25/2018"}, {"review_id": "U6wyEozQsD0cN7GXWzcf_w", "user_id": "--Sy4d2WkUYhmeNglFdPRQ", "user_name": "Trisha J.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place!!! It's so much fun for the whole family. I can rock climb with the kids, slack line, take classes, use the gym. Everyone there is so incredibly friendly.", "date": "8/17/2018"}, {"review_id": "NeL-88a54gRZX2icwLMW1Q", "user_id": "LsKmEijDAS-eTZJ8miGpJg", "user_name": "Thomas B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent place for children.   Very positive people working at rock fitness     Safe", "date": "7/22/2018"}, {"review_id": "0RfDRiXj9Vu2LF8ddNVdHg", "user_id": "ir0gJ38qGkNG8EnjpnIw1g", "user_name": "Jessica S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I honestly should just get a membership here since I'm here every week. Maybe after I get my finances sorted out I can finally be a member here. The first time I stepped foot into this building I was excited and nervous at the same time. I've never been rock climbing before and my fear of heights have always been something that held me back. I nearly backed out of my cousin's invitation to go rock climbing that day but I am so glad that I didn't. They have great prices and discounts for students/military and the pass lasts for 24hours. For first timers, they guide you through the climbing gear and equipment and even have you do a practice climb and fall before they let you wander off on your own. The people that work there are pretty awesome and are easy to approach. They're really chill to talk to and the other climbers are really cool too. You start making friends with the other regulars and get tips and support from them. Honestly a more friendly environment than the guys ogling  you at EOS fitness. What's cool about this gym is the fact that they have so much to offer. Not only are their prices affordable for a daily pass and worthwhile for a membership, but they also carry climbing gear, have weights, fitness classes, a basketball court, slack line, etc. You could say that they have it all. Also, they're open 24/7. Don't tell me that doesn't have you itching to at least check this place out. They have an area for bouldering and an entire wall filled with so many different paths of varying difficulty. I'm still a novice climber but I've improved so much since the first time I climbed my first 5.5. They change the paths every now and then so you get faced with a challenge of solving a new problem. This is a great place to take your friends for something fun and new to do if they've never been rock climbing and want to try or if you just want to be a little adventurous. I'd give this place 10 stars if I could.", "date": "11/13/2015"}, {"review_id": "Y4rSEC9i4svQrafOCncl_A", "user_id": "dBb6gfCVmORoQ9xJa6drvQ", "user_name": "Michael R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I want to say this place is amazing for being able to  make it stand out to the  larger competitors in San Diego and LA region.  The fact that it's 24 hrs for members and are constantly changing the routes is always a plus. But the prices are also extremely competitive.   This use to be my home gym however I moved to LA and had to say good bye.  I left my harness with atc and clip at the gym and was still able to recover it back 3 weeks later. $100 dollars worth of equipment returned and I'm forever grateful.  Thank you for the excellent customer service and I would definitely make time to check out this gym.  Climb on !", "date": "4/2/2017"}, {"review_id": "dEgqi0trXEVc6gJ7JX1QSw", "user_id": "rut3tDtZEm4AzZJEGQ6YrA", "user_name": "Phillip O.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Just started. All the staff is very helpful and friendly.  Everytime I come its never crowded. I love that being you can lose your motivation quick like f your not able to access any equipment.", "date": "6/19/2018"}, {"review_id": "8KrwdjWXgc3Y8_W4V4LwSg", "user_id": "B2FkvXrrzu3M5qYvhlN9OQ", "user_name": "Raquel B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am updating my review of this venue. I originally posted that we experienced some customer care issues while trying to book a school field trip. I am happy to say that the manager has dealt with the situation and was very professional and compassionate.Can't wait to take the kids there to experience their awesome facility and staff.Would recommend this place for groups.", "date": "12/6/2016"}, {"review_id": "A_5ZTlyTvweORU0iNSS6Lw", "user_id": "jz1Xjarwgd9EtTFHjg-Dcw", "user_name": "Sarah T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I like this gym. The staff is extremely friendly and considerate.  We've had our children on the youth recreational team and the coaches work excellent with them. A well balance of proper technique and fun is emphasized.", "date": "3/29/2018"}, {"review_id": "t_x1EmE3sF_zjXlN55m4xg", "user_id": "pkuAycg1hnhpXYyzTyQm3Q", "user_name": "Erich E.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place!  We have four kids and love the kid-friendly atmosphere.  We like using the guest passes to invite a whole other family to come climbing with us :)", "date": "3/26/2018"}, {"review_id": "O-g_SNxCFw4Jcy9_dQvs6g", "user_id": "EdxeRXBRGVgZAMyMLBh95Q", "user_name": "Mars O.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "In comparison the the parkour park this place is no fun! We are just a family trying new things with our boys and and not slacker or rock climbers BUT did want to try it.  Its unfortunate they don't have any beginner classes for kids under 14 and just a day pass for all 4 of us was over $50 with ZERO instruction.  Yes. they give a safety orientation but the girl who showed us around seemed to really just be doing it for legal purpose and not with the intention to teach.  The Parkour gym give class and is far more organized.  This place is dirty and run down. Probably will never go back.", "date": "8/3/2017"}, {"review_id": "StUHQa8OlDPKiuXwVElqGA", "user_id": "ook--3QB2m9m1HzEZpycQg", "user_name": "Hong T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I can't even begin to explain how amazing this place is! There's something for everyone! My husband joined for the rock climbing and I joined for the classes. The trainers are so amazing! It feels like I have my very own personal trainer! They are always there to help and push us towards our goals!", "date": "7/28/2016"}, {"review_id": "vV-dF9nnzWGn-9bg6_wU4Q", "user_id": "LQRfEjGOVmSVEcSdUOOjVg", "user_name": "Windii R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love Rock Fitness!! I come here all the time with my friends. On Tuesdays after 5pm they have a discount for \"Ladies night\" and they have great discounts for military, police, students, and firefighters. They workers are always helpful and nice and the equipment is always clean! Highly recommend!", "date": "8/20/2017"}, {"review_id": "iHqBnn-4Qry-lDD3vW6r6g", "user_id": "jUt7vfK90-YCR4qwcgTuVQ", "user_name": "Vincent T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 5, "funny": 4, "cool": 1, "text": "Would be 4 or 5 stars but the front desk staff brings this place down.This is a great space to have fun, be creative, and stay active.  It's a great rock climbing gym in addition to functioning as a regular gym.  The two times I've visited thus far has been great, especially since it hasn't been crowded-usually just me and my girlfriend with some people trickling through once in awhile.  That being said, the front desk staff really drags this place down.The ones we've encountered have been stand-offish, rude, and unmotivated.  They are the first people guest and members encounter and set the tone in a negative way with their negative disposition.  The first is a short white girl that works Sunday morning, the other is a small Filipino- or some other kind of dark southeast Asian- guy that works around noontime on Thursday.  If they hate their lives and their job, they do a great job of showing it.  Those two are the weak link of the business, by far.  The only staff member that showed kindness and professionalism was Kary-she warm, helpful and generally awesome.  The owner was generous enough to give me a free day pass due to the first rude employee. I come back only to encounter another rude employee.  I will pass on this place and go to another rock climbing gym for now, until Rock Fitness gets their workers straightened out with some happy pills or weed or hire new faces.", "date": "11/13/2014"}, {"review_id": "sWoujkJn_Jv5WUMUln_c8Q", "user_id": "7epmITV0E6yWJNgV9caVpA", "user_name": "Grace C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "This place was really cool. The military prices are fantastic but there is also a Groupon if you're not military. The kids seemed to really enjoy themselves. I wish I would have brought workout clothes for myself so I could have worked out while they climbed. Places was clean and the customer service was on point.", "date": "3/24/2016"}, {"review_id": "TN6KsyHqClvhDrlUq7CD4Q", "user_id": "0HGehqjLmKNsD1MrkBzZIQ", "user_name": "Carly H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place rules the school ! Its cheap, fun , a great workout & the staff makeIt so enjoyable cause they are so nice & friendly !!!! Helpful too! Great place & reasonably priced!", "date": "2/16/2015"}, {"review_id": "Z0vHVlrTIoEzxOSpZOmduw", "user_id": "xtRgrEjYje5U4YUl4sYB0A", "user_name": "David N.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Kids had fun. I was not able to come in and watch them without filling out an insurance forms.", "date": "7/1/2017"}, {"review_id": "C7ZB48BKm9c--xKU_z4fWA", "user_id": "gldIFQyLlWNmCD7xcV2KzQ", "user_name": "Frank P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Dan and Amanda were absolutely awesome - I signed up my seven year old daughter for an annual pass! I plan to join as well - they offer military discounts!", "date": "2/16/2018"}, {"review_id": "favcBPg9vev5RGCpup-2iQ", "user_id": "_PPVP0AQAnqD-trizPI_YQ", "user_name": "Polly L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I've been climbing here for three years. Perfect place for families and those to just love having a good time. Lany and Andy are super helpful staff.", "date": "4/25/2017"}, {"review_id": "uWmx9ufAWnsCKbDsxwG7xQ", "user_id": "kFfOxBD67l0Vb43WTnXn1w", "user_name": "Mae H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "This place doesn't have an average of 5 star ratings for nothing!! They have great prices and if that's not good enough for ya they have a great groupon deal. They have something for everyone, and there are people of all ages here. (Those 7 yr olds show me up on their rock climbing skills every time):) As well as people of all fitness levels. They have a selection of things you can rent or purchase. They have a nursery for the younger ones and offer a plethora of classes from Zumba to Jiu Jitsu. I could seriously live here.I find something new to try every time I come. To top it off I have an amazing time and don't even realize I'm getting the workout of my life. I love this place.", "date": "9/11/2014"}, {"review_id": "EZ1VoZIzJ89Qzi9VFokUBw", "user_id": "0cqd4mXKenCoTu4KB7tXaQ", "user_name": "Nelly T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my four year old to go indoor rock climbing here. It's very spacious. They have two prices, one with harness and one with the harness. I paid $12 for bouldering, without harness for my daughter. They give you a 50% off your first visit.", "date": "5/13/2017"}, {"review_id": "fsYtVmm2KJOJiIpn9rNjIw", "user_id": "0YpkD5lIxH4RfyjRqk0ewg", "user_name": "FloydPam R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Just celebrated our son's birthday here; reserved the party room, and had just a little over 20 guests. Everyone really enjoyed themselves; everyone from six-year-olds to the teenagers had a blast with all the amenities RF has to offer. My son and his friends wanted a place to play basketball, and RF has a nice big court that they really enjoyed playing on. Apart from a small miscommunication about how soon we could come in to decorate, the event went smoothly. The manager- Brendan and the rest of the staff were super nice and helpful to the guests, and made the rock climbing experience fun and memorable.  A lot of our guests had never heard of RF, and they all agreed that it's an awesome birthday spot for picky pre-teens and teenagers, so I'm pretty sure my boys will be going to more birthday parties at Rock Fitness.", "date": "5/7/2017"}, {"review_id": "G5hXDMi0MdXD8RVn01gjKA", "user_id": "QTO_sYaxAr6bbzxGdbDl0Q", "user_name": "Nanette S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to be physically active! My girls are always excited to rock climb at rock fitness.", "date": "4/25/2017"}, {"review_id": "2VXJRQF8agco4eg8k_RIsg", "user_id": "J-uwqYS8Jk0vAilUXp2tNA", "user_name": "Mandie K.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! Everyone is very nice and never stuck up like people are at some gyms. The classes are awesome, I would highly recommend all of them except for Alex's classes. April and Katie are amazing. The staff changes the walls on a regular basis so the climbing is always great.", "date": "5/16/2017"}, {"review_id": "VahlljxxZEl6xL-2EOLkHA", "user_id": "v3fEX5Y_GD3XNSKdnVjptw", "user_name": "Robert R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This place is pretty cool. I was once a member here but had to stop once I moved to menifee but I still visit frequently. It has everything you need aside from rock climbing, basketball, cageball (my favorite), pool table, ping pong, cycling, weight lifting. You can't go wrong! I'd recommend any time you want to have a good workout or just for fun.", "date": "11/7/2015"}, {"review_id": "fEl5jwgXBtp6mWVYRhemew", "user_id": "kcGTIQuCwH0GHpVGSUAhBg", "user_name": "Ron G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a wonderful place to climb. For young and old alike. The people are great, and I highly recommend this place.", "date": "12/10/2017"}, {"review_id": "lyNoDQ6YH70W1hrcMim98g", "user_id": "A1aW40S4u5Vt_emAUw66YA", "user_name": "Red S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "A 24 hour climbing facility! ? And has weights? And it's 24 hours?  If I check in on social media,  free rental equipment ***AS A MEMBER****? ! Wtf!  Seriously this gym has it! The staff are amazingly awesome! the regulars and newcomers just brings out the good vibes. Just awesome.", "date": "10/24/2015"}, {"review_id": "D-No5na8xz4-oLwaN-p15A", "user_id": "Ur-_bYO0kfIBfxyhaK_x0Q", "user_name": "Nick C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been going here for a little over a month. This place is helping me change my life. I'm working on getting my weight down, and for the first time Rock Fitness is helping me do it. I lift weights and climb. The gym section is almost always dead from 8pm and on. That is the same for the climbing walls. Every employee I have come in contact with here is extremely friendly and helpful.The pricing cannot be beat for the value you receive. If you are looking to get your weight in check, come and climb. Try it for a session. I am always happy once I leave after a workout. Thanks to Rock Fitness for helping me get on track.", "date": "2/28/2017"}, {"review_id": "Lt6PqcRc5thAhve7W6CRVA", "user_id": "Id6EbEIHJ-na4s0yx7UXHw", "user_name": "Lea N.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 7, "funny": 2, "cool": 2, "text": "I'm a big fan of places that are open 24 hours-and getting your work out on is no exception :) this place is awesome! We usually come here for the rock climbing but they have other stuff like basketball court, tight rope,weights, Zumba and spin classes (offered at specific times) etc..Ladies night EVERY TUESDAY $5.00 admission", "date": "10/9/2013"}, {"review_id": "3fzN2b6pd6YDNyf5mQuArA", "user_id": "w6_nVUUgQLZLkLuCjlyWsQ", "user_name": "Nhu D.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had an excellent first time rock climbing with friends! Really comfortable space for folks at all levels. Rates are definitely reasonable!", "date": "11/25/2017"}, {"review_id": "9Vz5DVrepg-TF0_Aap8WEA", "user_id": "T5UzUUCJygzQbwm5cgxjzw", "user_name": "Chi L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kids love coming here. The can spend hours here. The staff there are nice and knowledgeable.", "date": "10/14/2017"}, {"review_id": "i3H4XeNjs6Ere80e4URqTQ", "user_id": "p-Luj-JLMMM2BiIojpzI4A", "user_name": "Brad Y.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My son went to a birthday party here and had a great time.  We have since gone back there and really enjoy climbing and trying to walk that darn tightrope!  It's a great place to be introduced to rock climbing because of how safe it is.  An added plus was being able to shoot hoops once the kids got a little tired climbing.  I highly recommend everyone try rock climbing and push yourself physically.", "date": "2/20/2016"}, {"review_id": "dpD_3ATI3_bUggkt9AyJkA", "user_id": "0Mg50mkXb6UunkcdJaWZ7w", "user_name": "Maddie S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 1, "useful": 8, "funny": 5, "cool": 1, "text": "The owner of this gym does not respect mothers nor does he have an understanding of their needs for childcare flexibility. His prices are expensive for his cheap treadmills and lack of working equipment. If your a rock climber this place is fine; but If your looking for a gym with childcare I suggest going elsewhere. He charges $55 a month plus $35 for the first child!! I recently quit and relocated to another gym and get WAY BETTER childcare for only $10 a month unlimited! At Rock fitness your limited to the time frame you can go to the gym with children. If your a mom or dad or other who would be checking a child in to the childcare i highly suggest going elsewhere. The owner is an idiot who has no idea how to own and operate a gym and has no knowledge of marketing tactics. I wouldn't waste your time with this place.My review is based solely on the rock fitness facility & should not reflect the views of Totalfit 180 because I loved the total fit 180Classes.", "date": "6/15/2015"}, {"review_id": "1efxNka1qkrWgxtMvKC5Zw", "user_id": "YgEz9dIsXffg5wYN2J3-gQ", "user_name": "Jason A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the few cool rock climbing gym in the area. Definitely would suggest everyone to come by and try it out for one day.", "date": "12/17/2016"}, {"review_id": "tRJcEVPhzT3eelQJ15ENgQ", "user_id": "5K96sCnTC997L2_qLl1iZw", "user_name": "Jaclyn C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Found a great deal on groupon, I love deals! My husband and our son went at night, and returned the next morning.  Great thing about the gym is you have unlimited visits for the 24 hour pass.  So why not make the most out of it.  Staff is always friendly, clean, never really too busy.  They have other things to do, other then rock climb.  Check it out, you will love it.", "date": "9/25/2016"}, {"review_id": "2gtXXp529-15hfmLo12M0w", "user_id": "kbV3yBm92e8qud5zM9vJGQ", "user_name": "Michelle S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you want to have fun & get in a workout at the same time, Rock Fitness is the place! The people here are super cool & personable. Staff members set new routes of various levels each week, so there is almost always a new climb to look forward to attempting. They also teach climbing classes and host top rope & bouldering competitions! This gym goes above & beyond...they even grilled up free tacos for member appreciation night. In addition to climbing, they've got fitness classes, weights, slack lines, basketball, & trampoline cageball.", "date": "3/7/2017"}, {"review_id": "rPQVNOq1pXlBdo1GSEskpA", "user_id": "qcCzymjpSlVmTN37X4wosQ", "user_name": "Sherri P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Not impressed at all!! Completely not worth the money if you are looking for 24 hour fun which is what you pay for. Rock climbing is minimal, all cardio equipment is busted up. However weight training info was decent", "date": "4/15/2017"}, {"review_id": "Ir_bydrFreirN0Ghjfu-ug", "user_id": "4r7qYLCS_PH-JC6ahmxIWQ", "user_name": "Ted S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Solid gym, fun climbing... great community.Most of the climbing gyms I've made it to in SoCal have been small, old or just not well run. From my couple visits to Rock Fitness I'd say they \"get it.\" 1. Open 24 hours. Just being open till 11 or 12 is rare and while you may not be thinking about climbing at 3am, not having to worry about closing time after a Friday evening session, or when things open on a day off, is great. 2. Solid climbs, variety & styles. To be fair the amount of wall space could be better with a building of this size but it's still bigger than most anything around and very diverse. There's a good range of bouldering with top-outs... top rope, lead, even a bunch of those silly auto belay devices (which are starting to grow on me).3. More than just climbing. If you've been to Mesa Rim in SD or Planet Granite in SF you'll feel right at home... Full weight room, cardio, various fitness classes (never tried any myself) and even a basketball court. Giant slack line and a super-high slackline add some fun high-ropes style diversity too.4. Gear, Food and Free Wifi. It seems like an obvious one but so few do this right and being able to grab a belay device, decent pair of shoes and more than just a candy bar when you're is awesome. Hopefully they'll keep expanding the snack options, maybe even bring in some fresh choices -- with that and free wifi you can definitely hang around.5. Supportive Staff & Community. If you read my other gym reviews I bring this up every time as it's really makes (or breaks a place). The staff actually climbs the gym; setters bring in other thoughts on routes, and people hang around for a long, long time giving beta / tips and just making it interesting to sit around on a long day. For regular climbers (I'm hardly amazing but definitely been to my share of spots) it's a great place to meet others, get some practice in and perhaps pick up a skill or two. For new climbers, groups, whatever, the auto belay setup means you don't have to wait for a special hour to come in and for those looking to do more than a single day, basic belay courses seem to be included.As a nice addition they're really integrated into new technology and give out free rentals to members who check-in, post events through social sites, and so forth.The place is pretty much brand new so there's some things I hope they add in like a set of hangboards (campus section is in progress) and showers. Not deal breakers but it would definitely be a nice addition.Overall the gym is worthy of a full 5 stars considering the other local options and they have the right attitude to get even better.", "date": "4/24/2013"}, {"review_id": "kOUSQpmaOZvcjKeGHYu5oA", "user_id": "cDtT1ARTslBiy2bioYYv0A", "user_name": "Beto C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Heaven on earth, only bad thing in my opinion is that paying on the 10th of every month can be a lil inconvenient.. but the ppl working are awesome and very helpful. 10/10", "date": "9/1/2017"}, {"review_id": "yW9XqIrT6C7m5r9Konom6Q", "user_id": "JytsMrASTZHKgsS3yNXwVQ", "user_name": "Kayla B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is so fun! Plus a great workout!There's a couple walls with auto belays, a big mound in the middle for free climbing, weights, cardio equipment, fitness classes, a basketball court, and smash ball! So awesome!", "date": "7/29/2015"}, {"review_id": "6Ba6BLczGwnE8miMfhxKKA", "user_id": "SEoX7fwWdJIx832zybNdtg", "user_name": "Linda R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Clean, inviting, and overall amazing experience. Their prices are fair, not to mention every Tuesday is $5 ladies night w/ climbing shoes  included. The staff welcome all questions and they make you feel safe.", "date": "9/2/2016"}, {"review_id": "QgrkH3y9xixU25QUtvO40w", "user_id": "f71QLYB2tSqixUneHAkYTw", "user_name": "Michelle L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We love Rock fitness! My son and daughter work out there. Great customer service! It is very clean and well taken care of.", "date": "8/17/2016"}, {"review_id": "N-hAIBlVJNFmDRO0RIHnDg", "user_id": "E5sak5KgcMQc-ZvLZKG-WA", "user_name": "Cher B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place has it all. Huge rock climbing walls, shorter Boulder climbing, rope to climb, tight rope to balance on, inside basketball court and gym equipment. We had a blast!", "date": "8/5/2016"}, {"review_id": "L3NoxM8ftsjuzJC7dC4HTQ", "user_id": "XtmAWBsPfvWNZbjKQy8ciw", "user_name": "Cendy M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Loved this place!! You can do it all from treadmill to weights to rock climbing to exercise!!!!", "date": "2/22/2015"}, {"review_id": "aZ2ozE97X2sIQgQN-NOP-A", "user_id": "CPb0J2JUD8FMm-IEqG5D2w", "user_name": "Tabby G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been a member here for about a week now and I absolutely love it! Everyone here is super friendly and approachable, and u meet and talk to new people practically everyday. People who go out of the way and show u different climbing techniques. I've joined a lot of gyms in the past and this place is my absolute favorite! So dynamic! Plus it's open 24 hrs so in case I can't sleep I can always count on this place to be open.", "date": "6/23/2015"}, {"review_id": "03E7_aLpKgyV375PJDftXA", "user_id": "yKm5J3NCzqwtVqWaKLZt8Q", "user_name": "Echo S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love the fact you can come in with your teenager and be productive - stay in shape and get away from the TV in the iPad", "date": "7/27/2016"}, {"review_id": "d_xMFDQ7CD2jOWrbTDps2A", "user_id": "gOWs9PV6Ai6eNNlhESiwsQ", "user_name": "John W.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place!! They have everything and such a great price!  Staff is amazing!  Dump your expensive gym and come here I promise you won't regret it!!!", "date": "10/31/2016"}, {"review_id": "W2UHnQCNl644KZnPr556GA", "user_id": "8-ZlB8qqtFQ_KqUYjei2Mw", "user_name": "K F.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Friendly staff and atmosphere. Great classes! Great for kids 7 and older- younger depending on childs independence level", "date": "8/31/2017"}, {"review_id": "UE1FL-_LvAHZlfEpPPYzeg", "user_id": "K7n5ZFGhd87mDSAEp1wImA", "user_name": "George G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "They are open 24 hours! That is awesome me and my buddy couldn't fall asleep so we decide to be a little crazy and went climbing at 1 am!  It was awesome!", "date": "1/20/2015"}, {"review_id": "m5gekT4oZEmKsPIiY0W6kA", "user_id": "Mw_aLLrTw1opH4E81oEgfA", "user_name": "Erika K.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I like coming to this gym because I like being able to rock climb. I like the building and what they have to offer. I do not like certain staff members at the front desk. There is an incrowd and since I am not apart of it, I don't get the special treatment. Sometimes they ignore me because they are talking to their friends. Or I've had times that they are very rude to me. Every customer should be treated equally. I've came here for over 5 months & I pay my monthly membership fee. I feel like they should stop their conversation to at least just give me my equipment. Other than certain staff members, this is a great gym. Have fun & Good luck.", "date": "3/23/2016"}, {"review_id": "HT2xG0EyjzhV_X86o5Y_1w", "user_id": "930YU51ZvuOQn4dWtZxj5A", "user_name": "Jen S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 10, "funny": 5, "cool": 8, "text": "Had a FAMTASTIC, fantastic time here last weekend! Staff was EXCELLENT!  This review is in regards to a private event for a boy's birthday party. Immediately greeted, then confirmed that all visitors signed their release waivers, not just our son the guest. Easy enough, took a couple minutes to use their computers on hand to finish our forms. While we could do the waivers prior to our visit electronically, it includes every person who visits their arena needs to sign the release, even if only a spectator, I learned. Safety first :) Visited for a friend's son's birthday. Perfect age group and venue to accommodate all their fun energy. Such a great idea to hold a party in this rock climbing and gym arena. The back wall of the main floor is filled with rock climbing ranging in experience levels, court to play bubble soccer, gym equipment, balance boards, rope climbing, free climbing with crash pads, tight rope walking (girls loved this one in particular) and even a \"slack line\" I believe it was called, an even higher tightrope line, all areas with the proper instruction and safety precautions given verbally. Seemed like traditional gym equipment and non-traditional equipment I haven't come across before. Really fun place. Kids (our group had a toddler with parents accompanying him or course, and other ages from 5yrs to 10yrs). AND adults all had a blast! Their party room was above the gym space in a separate area and it was spacious and bright. I believe Crystal and Hailey were the ones helping and another gentleman, but staff were very attentive. Front lobby has a shop as well, even saw my guy's favorite flip flops available. Rock climbing is an intense workout from my first experience here. I was definitely sore in the arms and shoulders and abs the next day. And I admit, I did a quarter of the activities the kids all did. Excellent FUN workout without seeming to be a workout. Look forward to returning.", "date": "11/25/2015"}, {"review_id": "i_4yZhpnFsWqT8X7aIbByA", "user_id": "Wnxoxdynve-t0PyuuYQfjA", "user_name": "Katie C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "I came here on a groupon and I'm pretty sure I'm going to buy a membership once it's up! I love the relaxed atmosphere and the staff are very genuine. There also are so many things to do here!! Climbing, bouldering, there are also two slack lines, a full gym with weights and cardio equipment, trampolines, basketball courts...what more could you want? I haven't tried any of their classes yet (yoga, Zumba etc) but it's so cool that they have all that available. Oh and bubble soccer. Nuff said!", "date": "7/15/2014"}, {"review_id": "Zi4xz-LwzbSnz5EyL55blw", "user_id": "S18xz5KLflxA_VSk0HTVRg", "user_name": "Douglas B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Very friendly staff took the time to show us the ropes...  Which was much appreciated since it was our first time at an indoor climbing gym. They have rentable gear and decent prices for one day passes or monthly subscriptions.  The cashier even recommended Groupon for our one day pass package that saved us a lot of money! If your looking for something different to do, check this place out!", "date": "3/6/2016"}, {"review_id": "2Ba0t5P7xHD4wLc6rvHjZg", "user_id": "v_xWjRIiudsaMGsYbMdcBg", "user_name": "Minnie C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Had a great day at Rock fitness! Austin was our belaying instructor. He was very professional and taught us the ropes. He was very encouraging and experienced. All the staff members were friendly and courteous. The facility was very clean and well equipped.", "date": "2/14/2016"}, {"review_id": "XkpPaGtjSINNkWQG-w-5ww", "user_id": "hW4hV-rXERQnC3hbC2dEhw", "user_name": "Miguel T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to burn energy and build hand strength, fun friendly environment lots of space always making new climbing routes", "date": "7/9/2017"}, {"review_id": "s5YrtxPRaYubS9xE6gB2iA", "user_id": "eNL5c0hbDGUK5sKm3J_Wpw", "user_name": "Garrett J.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a big fan of this gym. Routes are constantly changing but still leave you enough time to work on some of the more difficult ones. Perfect for experienced climbers or newbies like me. Worth every penny.", "date": "4/2/2016"}, {"review_id": "gFZhwW5WAyDD5Oc9cFk0Cg", "user_id": "tGgTg0fk-lG_JFQfmYQ8rg", "user_name": "Ryan D.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "A few friends and I drove down here from the north in San Bernardino County just to check out the cosmic climbing one Friday night (which is $10; regular day price is $15). The gym is open 24 hours and I wish all climbing gyms were open 24 hours.However, the cosmic climbing isn't so cosmic; it's basically just dark and there are flashing multi-colored lights. It made it hard to see which routes were which because the darker colored tapes simply all looked black, while the red, orange, and yellow tapes looked similar too. Most people spent their time climbing the more well-lit side of the boulder. It would have just been better to have all the lights on to begin with.===Climbing===Bouldering is mostly on a small/medium-sized central boulder that can be topped out on. You get down using a pole, or easy 'steps' made with jugs. Large bouldering pads must be pulled around boulder, and a sign states that a spotter is necessary for the taller, steeper white part of the boulder.The shorter side of the boulder is easier, but have unlabeled routes. I'm not sure if it's for training or why it's unlabeled. It would help beginners (some of whom were in our group) if they labeled the easier routes, as the easiest labeled route was a 1+. The rest of the boulder has decent, tough, and sometimes interesting routes, both on the slab and the steep sides. Other than the small archway, there isn't a big heavy overhang wall like other gyms. Outside of the main boulder, one small section of the main wall has shorter, smaller problems for kids, but are also good for practicing balance problems. Another section is for practicing dynos.The main wall is about 30ish feet and has several auto-belays and top ropes. There is also a part of the wall for lead climbing, but we didn't do lead at the time. A lot of the routes were unlabeled; I'm not sure why that is. The hardest labeled route was a 5.10b. There were some unlabeled routes that felt about the same or a bit harder, but it's hard for me to judge since I was pretty pumped and at the end of my climbing session. I was pretty underwhelmed with the routes on the main wall; they just didn't feel interesting to me.For climbing training, there's two campus boards, many climbing training boards (like they bought every one on the market and put 'em up), a set of monkey bars, and a few hanging balls and holds to hang onto.===Rest of the gym===The rest of the gym is actually pretty nice and fun to work out on after climbing. There's quite a variety of workout equipment, bike machines, and treadmills, which I didn't use. There's a slack line, full indoor basketball court, trampoline, rope, rings, and several balance boards. There's also a ping pong table upstairs. I'm impressed at the variety of activities outside of climbing.===Overall===Overall, the gym is a good all-around fitness gym, but not so great for purely climbing, as I wasn't too impressed with the climbing space. The bouldering was good, but I wish there was more bouldering to do, and that there were more pads, or it was fully padded. I don't know why a section of the wall was unlabeled. The main top rope wall was underwhelming, not interesting, and also mostly unlabeled. I'd give the actual climbing part 3 to 3.5 Stars. But for those into other gym activities, the gym does well, and I will admit it is great to hit other parts of the gym after climbing to workout. So together the climbing and the rest of the gym, I give it 4 Stars. If I'm in the area, I might drop by, but it's certainly not a place I would make a destination out of for purely climbing.", "date": "3/30/2014"}, {"review_id": "LMzrOT_QOyJzyoy4Eg5unQ", "user_id": "KedNkUktq7HEGeLkNFiUiQ", "user_name": "Justin B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome time. Definitely will return especially for the price. Has everything from rock climbing to basketball court and a full gym. If you're looking for a gym this is the place to go.", "date": "3/10/2016"}, {"review_id": "IHj9VVqOIfyWRkj9KxgU7g", "user_id": "UUx1Z8ZmYXB8lmJnf6_8Bg", "user_name": "Joe Y.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place and staff they keep it clean and maintained my daughters and there friend are having a blast it is a really good workout as well", "date": "4/26/2014"}, {"review_id": "AOyAFRraJHkZEDgM7_Pi7w", "user_id": "0JGU7X3w7wdnfYxRCF-V6w", "user_name": "Corina J.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 4, "funny": 1, "cool": 4, "text": "Very large facility, very clean, well organized, and there are special days for ladies only which is fun and relaxing without the kids. I would def take my kids here for some fun kid climbing time. Sign the waiver & go enjoy yourself!", "date": "8/18/2015"}, {"review_id": "QFJxc1GLFP1vUga0bNOgRQ", "user_id": "JyS3y3pOE2Iwhg3bovtxYQ", "user_name": "Jillian K.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "I really enjoyed my membership here. They give you good service for a decent monthly price. The gym is well equipped and the routes on the walls on fun and change often. My only suggestion is that they update their equipment when they can. Some of the machines are a little run down. Everything's well maintained but certain areas are showing their age. Overall, I'd recommend them as a gym for fitness junkies as well as climbers.", "date": "10/19/2015"}, {"review_id": "1oLgstD-mj-O2GGM_UyK1A", "user_id": "lXtu1yy2jvUc_3kHVw0fZQ", "user_name": "Rayhaana A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This is the best place I've ever been to in the inland empire. Ladies night just $5 bucks!", "date": "3/4/2014"}, {"review_id": "GYvF8D8xIO68eQ2xRaNRSQ", "user_id": "pBKXhHAoz7IYatpqDSQB1Q", "user_name": "Elise P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Sean is an awesome trainer, kids club has the nicest staff and the classes are the best!!!! Love coming here and so do the kids", "date": "9/6/2015"}, {"review_id": "zgFoSUcJ1PrPPP-xR6boUA", "user_id": "PxdMC9va64L0Z_PVM4YntQ", "user_name": "Steve B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "The only gear shop for adventurers and climbers open 24/7.  Really solid all-in-one package gym, staff is the best part of the gym IMO, the manager Carrie is like the nicest person in the world.", "date": "8/2/2015"}, {"review_id": "nBLu9EtbOWYX2j9wfqZNtw", "user_id": "qVELiqM9pdvPq4qlUCsrug", "user_name": "Cristal P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My precious review was filtered! Grrr Just wanted to say that this place is great! I'm not an avid climber but I would be if I could. If I lived closer, this would be my gym! So jealous that they have work out equipment, climbing, AND bouldering! Anyway, check this place out. Such a fun place!", "date": "8/24/2013"}, {"review_id": "xALYK6mYCl0eDstkIpmo_g", "user_id": "hFn_ZFnE4stFNNmbvmMyMQ", "user_name": "Emma H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. They have reasonable prices. The staff is very concerned about your safety. They have beginner walls and more advanced walls. This is a super fun and active place to go to. I would recommend this place, and make sure to check out the events.", "date": "3/27/2017"}, {"review_id": "hJzeLoenTLgBAM2Nr67fDw", "user_id": "MHCVXQMST-e64XsK6Py6jQ", "user_name": "Cade W.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "An awesome place for friends and family to have a joyous time! The rock walls are beyond awesome. The climbs teach you new moves to increase your skill level daily! Would recommend this place, hands down.", "date": "4/25/2016"}, {"review_id": "bRi7qtIx4vDt1A18OxlNig", "user_id": "pNTAqgkrsW7pLfEf7HIgZg", "user_name": "Shawn H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "Rock Fitness is an awesome gym!! Seriously, it is like an adult wonderland in here! There's something for everyone to enjoy including climbing, slacklines, ping-pong and more!I'm a novice climber, and I enjoy having access to bouldering walls and top-rope climbing under one roof; it gives me the chance to challenge myself. One bonus that RF offers is a bevvy of Auto-Belay Devices for top-rope climbing without depending on someone to belay for you. For those that like a more challenging workout, RF has a newly installed campus board and a moon board with over 400 boulder problems in one.Apart from the climbing is access to top notch gym equipment, some group classes and a relaxing area with hammocks and some table games. There's also a basketball/volleyball court and a new trampoline style smash ball court; I haven't tried that yet, but it looks like fun.The staff here has to be mentioned. They are always friendly and helpful, and don't seem to mind answering silly questions. RF also does a great job of keeping the gym clean and stocked with great priced snacks and beverages. I really enjoy driving up here from Vista for a 1/2 day workout/climbing/slacklining session.", "date": "5/16/2013"}, {"review_id": "0MBGoxJeyZaYw_Y-z2RS8A", "user_id": "0b7k6FSGjLIR6LsDpjPIUg", "user_name": "Skylee S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 0, "funny": 2, "cool": 0, "text": "The owner of this gym does not care for mothers nor does he care about childcare flexibility. I don't understand why the children under 14 cannot go on gym equipment. It is amazing to me because none of the gym equipment will injure anyway the children or Tweens under 14. That is why I give it 2 stars. Although the Boulder Rock climbing is fun I still rate two stars :(", "date": "8/4/2015"}, {"review_id": "5x2R3VH8DUPNaQcbCYogWg", "user_id": "5NJ4hNJmq5sDA3Lwm34_cg", "user_name": "Scott P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time with my friends last night and it was awesome! Lots of rock climbing walls and boulders of varying difficulties. Plenty of weight machines, a slackline, treadmills, etc. The staff is really friendly and went above and beyond to make us feel welcome, gave us a tour, and showed us all about the rock climbing. Check out the charge ball area in the rear corner of the place, you'll be glad you did!", "date": "1/5/2016"}, {"review_id": "CqmTF9l4zNcvKvJc7JWa5A", "user_id": "micLV1lBPBUV5oN9X34Hfw", "user_name": "Tera C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I just wanted to update my review since I became a member.Ever since I took a bouldering injury a couple years ago, I have been just dying for a top-rope gym close to home. Driving all the way to Riverside was no longer an option. My pleas have been answered!Rock Fitness is a 24 hour climbing gym that caters to all kinds of interests. Alongside the sport routes, top-roping, and free-standing boulder are the basketball court, exercise machines, slack line, crate stacking, and fitness classes. You simply can't run out of things to do!They provide a decent variety of drinks and snacks, as well as a nice selection of climbing gear.The staff has been super friendly since Day 1, if maybe a little disorganized. Seems to be par for the course for a brand new gym. No major complaints on my end.I can't wait to see this gym evolve into a climbing hot spot. :)", "date": "3/10/2013"}, {"review_id": "tTfkJAjq3m5HeuX9qmGhvQ", "user_id": "K6lgNxL5m7pd5BCGptZT9A", "user_name": "Travis E.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I liked it so much I became a member. They have three auto belays, a number of rope belays and a pretty big bouldering section. Plus free weights, lots of machines, and other equipment that honestly, I don't know what it would be for. That's part of the fun for me though.", "date": "6/12/2015"}, {"review_id": "Ush-wL1s2xqvNqXwLKSUbQ", "user_id": "BRTVEGT6z1mfJLtVTir1lA", "user_name": "Robby C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Great looking wall and boulder.  Probably the worst route setting I've ever seen.  They need to get a real route setter, not just someone who can throw a big dyno.", "date": "12/26/2015"}, {"review_id": "W2ljugUKFW_rd50fgmSR0Q", "user_id": "LL8hSpzyt4sz0i8QMiQZGg", "user_name": "Jennifer C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Rock fitness is like a big kids jungle gym. I go about once a month & would get their gym membership if I lived closer. The staff is available to help if you need it, but I like that they kind of let you do your own thing. Lots of different equipment to play & like how they change up the rock walls.", "date": "12/16/2015"}, {"review_id": "Jw1Fi9q8jPknQPXgppYn5A", "user_id": "EsmMW-2DiDYQwQqgAfjn5A", "user_name": "Jesh P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "While visiting a friend I wanted to climb. After checking out a couple different websites (I'm from Oklahoma) I decided to try rock fitness (only had time for one workout).RF was definitely the right choice! Not only do they literally have all types of workout equipment, but the staff is very kind and helpful. Had a great time!", "date": "2/24/2014"}, {"review_id": "8DwIUmkiPG8nLXOM7dDJ5g", "user_id": "1BAATuO2a8NdrFOUmMPTuw", "user_name": "Nancy A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My grandson loves the place. He was not into team sports, but likes the individual challenge. The staff are friendly and helpful with beginners. But we see all levels climbing.  They have a small gear store so you get supplies as you get more involved.", "date": "4/10/2013"}, {"review_id": "y3qQ8sObSdu3E_NhwryDpg", "user_id": "YOLyvKc2wuMMd-Ah1OWS1g", "user_name": "Jessica W.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is phenomenal! Between the 24 hours it's open and all the different classes offered it's truly the best all around fitness place. I love going here because I don't feel like I'm going to a gym at all. If I'm bored at home I can go rock climb no matter what the hour and get a great workout in while having fun. All of the different classes make it so easy for me to achieve my fitness goals and the trainers are so personable and genuinely care about who you are and what you're striving to become. It truly is a family friendly atmosphere that makes A healthy lifestyle fun to have!", "date": "4/21/2015"}, {"review_id": "bO5j6ysdHzyHfFYVxXgdyA", "user_id": "ASq6C-n1siCKPBXqYTPsjA", "user_name": "Mike G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Had an amazing time with my 3 kids. Friendly staff and great atmosphere. We are definitely going back and I will be getting a membership. Great workout and a lot of fun at same time! Highly recommend going!!", "date": "5/15/2015"}, {"review_id": "JNbiX3v6iiNnM2Pt2J19kQ", "user_id": "xo3NVBqydQ0cUVJa3ysrHQ", "user_name": "Daniel K.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. If you haven't gone yet do yourself a favor and go. They have it all", "date": "7/28/2016"}, {"review_id": "WX0zt0GDvk4sCdfldeo9Fw", "user_id": "cUewQu9VBHUoF69I2kxE0A", "user_name": "Ken M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is like Disneyland for climbers and people who like to have a workout and still have fun. I have gone here with my grandson and it's a blast.", "date": "12/28/2015"}, {"review_id": "1axkCBS_lu0SdS0zD3m4gQ", "user_id": "JbpiGad-miPoZPXbzCCGKw", "user_name": "Ed T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym with a lot of amenities.  My climbing friends always comment that they wish they had a gym like this by them. Love being able to stop in and work out or climb for a while and head home.  Great people to motivate you.", "date": "10/13/2015"}, {"review_id": "NgcXMS0SBE-1iqNWM-NjMA", "user_id": "K3nMuwX2y7u1tTAKd-GObw", "user_name": "Ace Y.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hello Yelp!This climbing gym is the full package!Complete with rock climbing (top-rope and bouldering wall) to get your climb on, a gym to get your workout on, a basketball court to get your hops on, a soon-to-be lounge to get your lounging on and THE GYM IS OPEN 24/7!The staff are friendly and helpful and the atmosphere of the place just gives you the urge to push to your limits. I love climbing and I like to workout so this gym is perfect and convenient for me. I recommend this place to anyone who loves to climb and sweat.RockFitness is where it's at. Rock On.", "date": "3/12/2013"}, {"review_id": "vwu9ex60inW6NL8mjAJm1Q", "user_id": "laLlkwXiyDDPNXNI5xDVYQ", "user_name": "Jaclyn O.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 0, "funny": 0, "cool": 1, "text": "Great gym because they have a lot to offer.. Workout equipment is old, but to go on occasion it gets the job done. Poor front desk customer service. Been going here off and on for two years. Ran out of my stamps from groupon and came to work out on my lunch to only be turned away. Didn't have my wallet on me to pay the 5 fee. You would think they would have let me stay for customer service. Guess not", "date": "1/5/2015"}, {"review_id": "NFervZFYYy1ZPMh5gJmF4A", "user_id": "a5Is7d7A5fmNLkgHv4jgNQ", "user_name": "Tyler W.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here several times, I have the greatest time everytime I go. So much to do. They got a trampoline, basketball court, gym. Everything. They also have the auto-climb thing for those that don't wanna take the class. They're open 24 hours!!!!!", "date": "5/7/2016"}, {"review_id": "Kjf_6KULPPFfSDsW7vkc9Q", "user_id": "t5QEf8DzvkVuwzvNqupIOQ", "user_name": "R B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "Came here for the first time last night. I got a Groupon for my 12 y/o son, but after last night I am going to have to get some passes for myself. :)  We were assisted by Andrew and he was really helpful. He was very friendly and explained the types of ropes, rocks, and holding paths. He also helped us with the adjustment and proper fastening of the harness. That kind of stuff is important for new customers whose only experience with rock climbing is once climbing a wall at the state fair (like us). This place is great, but a little hard to find if you're going there for the first time at night. There's very little lighting outside.", "date": "3/29/2014"}, {"review_id": "mK9OxWqnGyUdW8rwWchWTg", "user_id": "k9FiFHVj_-VlG23kzuYLmw", "user_name": "Karen S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This owner totally respects mothers. In fact, he had such compassion on me, a single mom, that he allowed me to advertise my business in his store. Thank you so much Adam.", "date": "8/2/2015"}, {"review_id": "JxqcjFtU3F8Vvts5dKzJhQ", "user_id": "gXdLKgastnWCP7OpFg7kHA", "user_name": "Chelsea P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 6, "funny": 1, "cool": 0, "text": "Our few experiences at Rock Fitness with the staff have not been pleasant. Our first visit, we were offered a belay lesson. The employee couldn't properly show me how to tie a knot, so my bf and his friend showed me while the guy stood there and said, yea that's right. Practice that. Our visits after that have been eh. Not good not bad. The staff are super unfriendly and don't seem to listen very well. Every time we've gone, we've all had our own gear (shoes, harnesses, chalk) and we've either been asked multiple times by multiple staff if we need to rent gear (while holding all our gear right in front of them) or they've taken the initiative to just charge is for it. We were reimbursed for the extra charges.  None of the staff smiles for some reason. When it's busy it is NO fun. The boulder is too close to the top rope wall which means falling can be dangerous for anyone involved not to mention the floor padding sucks. We would give up top roping/auto belay for only bouldering at VITAL.", "date": "2/5/2014"}, {"review_id": "139xQ537UOgRi8bW14Rj8w", "user_id": "iiI7eSD94CbczB9NTIfa-Q", "user_name": "Leticia M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place rocks. They are constantly changing problems on the rock walls to keep climbers busy. The place is both a regular gym and climbing gym; both open 24 hours. There is also a basketball court and tightrope. They offer fitness classes and childcare. The weekends are usually busy with kids' birthday parties but the facility is big enough to accommodate everyone. Overall one of my favorite climbing gyms, I drive over an hour just to come here as a member.", "date": "5/16/2016"}, {"review_id": "orE2VQwjG7iztCgFCnRC3A", "user_id": "K5jxYoYfs7WM_PqjHkk9Tg", "user_name": "Yeltsin G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Great for rock climbing. However, there gym equipment is terrible and dated. Staff costumer service is average. I really disliked the fact that I had a pass during they winter and the wouldn't turn on the heaters. It is either that or the place is not insulated meaning you cannot escape the heat in the summer of the cold in the winter. They do offer WiFi though which is plus. Overall an ok establishment.", "date": "2/18/2015"}, {"review_id": "y8FJFQaMuoOcfGijqj68bw", "user_id": "5UuQvjsXQWAgB3ougPQT5Q", "user_name": "Molli R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "REALLY like this place. What a breath of fresh air (yes even inside a gym)! It's a fun place not a meat market and not loaded with egos. In addition to the awesome indoor rock climbing there is a lot of variety including; trampoline, ropes, basketball court, cardio equip, classes, personal training, large weight selection and my new favorite slack line!  I'm a trainer with loads of my own equipment and we still got a membership here because of all the fun stuff! If you're looking for a very healthy hobby to take up... You found it!", "date": "10/13/2015"}, {"review_id": "yC1SvlsvAMSDpXuuHOvVdg", "user_id": "ViA-_dMod0GtsFrVOFoKlw", "user_name": "Luis P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "We had our team party at Rock Fitness this past week and all the children loved it. The staff was amazing and helped the children with all the things they had to offer. My boys were excited that they were able to make it to the top of the Rock wall. My six year old had no fear while he was walking on high rise right rope. All the children were harnessed in and it was very safe.", "date": "11/20/2015"}, {"review_id": "BDYr7GO0hUIpepIWn0YdTQ", "user_id": "iYXTL1kASLEzmGEZjYHrIw", "user_name": "Nichole Y.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Me and my BF had a great experience!! We bought the groupon and then came in to find out you get your first visit free for the month of January (except 6$ rental fee) and JAMES helped us figure out how to work it with the groupon to get the most out of it. He was friendly and extremely helpful. Gave us a tour and taught us how to do everything. We loved the friendliness of this place as opposed to vital where it feels a little snobbish/cliquey to newcomers! Will be back!", "date": "1/10/2014"}, {"review_id": "2m0WwBqMps0DstYxu_oTyw", "user_id": "JRJc3eRMYFeWI1bnvc0f0w", "user_name": "Nikko E.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Used the groupon for the $15 day pass.  Overall impression of the gym is good.  There are lots of climbing options from bouldering, auto-belays, to belays, etc.  The gym is also fully stocked with exercise equipment, a full size basketball/volleyball court, and slack lines, in case you get tired of rock climbing. I am a big fan of the many things you can do in this gym. I also saw that they offer a variety of classes such as yoga, mma, zumba, spin classes.  So you can never really run out of things to do ! Definitely would come back !", "date": "8/21/2014"}, {"review_id": "muS_lpYnP0pfXSzt8mdAtw", "user_id": "ZCG5ZXCTD_KdBM67lj6VcA", "user_name": "David R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Just finished some late night climbing. Had a great time and look forward to my next climb!", "date": "12/1/2013"}, {"review_id": "gaL7FPVXdtjUDcGtf3IoIw", "user_id": "I5S0CKjpzjPTO_Nob5wKkQ", "user_name": "Austin G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So much fun! So many things to do other than rock climbing! And the rock climbing is really fun too! Staff is also super helpful and nice. Great price for the amount of fun you have! Plus you can go back later because the pass is good for a full 24 hours!", "date": "7/24/2014"}, {"review_id": "Y0dLGe5ISrgzJK4zlWY_uA", "user_id": "C5CRhfsbak0FvmcpnDLYRA", "user_name": "Jesse G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome place and great stuff to add to the valley!  I wish it had locker rooms but the manager said they are coming and have plans but no timeline yet.  They have done a ton to make this place awesome!  climbing slack line weights and all types of conditioning equipment!  My wife uses the daycare.", "date": "2/10/2014"}, {"review_id": "Be7N6iNgVtS_wo73VulElQ", "user_id": "5A0-xjajgn2ebwVN8PDeEw", "user_name": "S V.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you need to relieve some stress and get a full body workout this is the place for you. I love this gym! The staff is always so approachable. When you're there you'll have a blast.", "date": "2/25/2016"}, {"review_id": "J514F0G_3yWLGY2KMI5n0w", "user_id": "SVwvo9ZI_xJZisodmP4yww", "user_name": "Victoria R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "This place is super awesome. I came here a Friday night which was 10 bucks until midnight giving us like over an hour which is plenty of time. The employees were real cool and approachable lots of freedom to do whatever you want and the basketball court is cool too. Fun place to go!", "date": "7/25/2015"}, {"review_id": "uoIgl0TxH1meUM0KLIYIWw", "user_id": "KDQBfGHjFjFPI1gw1df2mQ", "user_name": "Dan K.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the best climbing gyms I've ever been to. Tons of climbing surface for every type of climbing/bouldering and routes for every skill level/ability. Also have a lot of auto belays for the times I need to go alone. Definitely recommend", "date": "3/25/2013"}, {"review_id": "Pwh4Xp8pvu6hw80yYQFzVA", "user_id": "NSZYCJ_a5XswxY3BW_Po5w", "user_name": "Bernie C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 1, "useful": 6, "funny": 0, "cool": 0, "text": "Got one of those deals online for an introductory to climbing and a 24hour pass. The introductory included gear rental and belay lessons. I had spoken to someone over the phone the day before. He had informed me that it was better to come in mid afternoon, as they have more than one person working around that time. Went here the following day, again as stated mid afternoon. Showed the person at the front desk our vouchers, she had no clue what the voucher entailed. Had to explain it to her...she finally remembered the vouchers that they were offering...blah, blah! She showed us around, gave us out gear. She then stated that we can go ahead and look around, and someone will come and show us how to belay. We decided to just explore and look around. But in the meantime, we were still waiting for someone to show to a belay lesson. To make a story short, we never got that...we were left there just basically doing our own thing! Mind you, this wasn't my first time doing indoor rock climbing, I've done it once, and it's been a while and forgotten how to belay!! So, a little lesson to refresh my memory would have been nice, but didn't get that from this place! I was a little disappointed, not very helpful at all! I don't think I will come back here. If you're looking for a real indoor rock climbing place, I would suggest driving down to SD, there's better ones out there. And I can guarantee that you'll probably get better assistance!! Sorry, not a fan of this place!!", "date": "7/19/2013"}, {"review_id": "_zgqMyliz7h5grWCTFsNWg", "user_id": "W0ip77xA0UX1PwyRl3hw2g", "user_name": "Kira W.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great Staff! Loads of fun. I recommend this to anyone looking for something fun to do around town!", "date": "4/11/2016"}, {"review_id": "pf3o_6UuBrC5qz5RtL6Swg", "user_id": "-Kmn1N_ycwUfnPVH3Jl19w", "user_name": "Kate S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "all i can say is AWESOME lol love rock fitness", "date": "3/20/2017"}, {"review_id": "RiU2wUWrUfb08WagaojxDg", "user_id": "FcOiyt0guCoVjXzNsWATvw", "user_name": "Cody A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "You can do it all here.  Basketball, climb, gym, pingpong, pool, or just lounge.  Awesome staff and great prices all round.", "date": "9/11/2014"}, {"review_id": "jfqcgCUn4PGZOBdRwyCB4w", "user_id": "zSY5uNG-w60eFqBmGvmEDw", "user_name": "Charles T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Great facility, but very poor customer service. The workers at the gym do not seem so friendly--they don't bother to give eye contact, smile or say \"hi.\"When I first walked into the gym, I tried to get helped and was ignored, and there were two front desk people not giving a crap. During my visit to rock fitness I did not receive any customer service/help from any of the staff. If rock fitness had great customer service than I would give them 4 stars because the facility is great, the gym itself is one of the coolest gyms I have been too because they have a wide variety of things from auto belay, top rope, bouldering, weights, slack lining; great variety of fitness things. But there climbs are ok, there top roping is too close together and is potentially hazardous. Some of the climb areas are too close together, and when the gym gets crowded it not as fun to climb.", "date": "8/1/2013"}, {"review_id": "VA4y2uRSwWXLETf0e6o23g", "user_id": "cXKoE5vADFyeiHvAt0aMhw", "user_name": "Peggy M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for kids to have fun. My teens love the workout and the time they get to spend with friends. Safe fun environment!", "date": "3/8/2016"}, {"review_id": "UC1gf7V2GwPMvwrFmGXweQ", "user_id": "Vz5S7C0FrYdO4qkUIst7BA", "user_name": "Mark W.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place.  One of my sons does the free climbing on their rock \"island\" while my other son's MYBL basketball team practices.  Seems unique and well run.", "date": "12/19/2015"}, {"review_id": "AI5V9SOCT6Z_NHCYIylo3g", "user_id": "EbyVhY_OKnSgt6ADzBV_nw", "user_name": "Dani P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Rock Fitness has everything!!! Rock Climbing, weights, cardio machines, personal trainers, and a volley ball court.  I wouldn't want to go anywhere else!", "date": "5/7/2013"}, {"review_id": "SRJSG2mRLwnU_UIa1KCyUQ", "user_id": "BqseHifaXFRaHQPW9HlTKA", "user_name": "Melissa A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Too much fun for typing. Plus my arms are killing me from 3 hours of climbing. Really nice people and super helpful. Bought a membership after my kids have begged to return every day for a week.", "date": "5/14/2015"}, {"review_id": "itmnVvwr53ZSy8fL2SeXFQ", "user_id": "BknGOTHP3RegUxSwMg_zrw", "user_name": "Jessica N.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "This was a great place to take my nephew for recreation. The facility is huge and the rates are fairly reasonable. Adults are $15 and my 9 year old nephew was $9 and they also have discounts for high school students I believe? Lots of activities to do and its 24 hours! My nephew and I will probably start coming more often since there isn't much recreation to do in our area.", "date": "3/27/2013"}, {"review_id": "hrmsBL5i04DJe2No2a4Fdg", "user_id": "2o95QM7ih3m0nmf_NBgKwg", "user_name": "Jalene V.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "OMG! This place is amazing!! When  I want to go workout , my kids can go rock climb very safe and secure!", "date": "7/22/2013"}, {"review_id": "0GrwCmmgKs9UlAj1e7xA4Q", "user_id": "bP5OCN2uRXAlSPgnzlj-yw", "user_name": "Chad P.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Truly great climbing experience here at Rock Fitness. The climbs offer a wide range of difficulty for everyone to enjoy regardless of skill level. My wife and I are by no means climbing experts, but the staff here made us feel welcomed, comfortable, and encouraged. We climbed, did some crate stacking, and played around on the crazy high slackline (don't worry, it's safe!). I keep telling everyone it's like a playground for adults with the climbing, workout equipment, basketball, volleyball, ping-pong, crate stacking, etc. Yet it's safe and fun for the young ones as well. It really is the only gym membership someone would ever need...don't miss out!", "date": "7/10/2013"}, {"review_id": "tzI2HwoYfctvUoc079W3Eg", "user_id": "hC7lneCX-DzKFr74uttvLA", "user_name": "Leo A.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I recently started going to this gym. From my experience, it has everything you need to be in shape and also have a blast while doing it. Climbing wall is great, there is cage ball which is awesome, basketball, and other things to keep you entertained. The people are really friendly and the environment is just right. Definitely recommend this place to anyone who is looking to start climbing, who already climbs, or who just wants to have a great time while getting a good workout in.", "date": "8/29/2014"}, {"review_id": "1E9AmOjarGUJQ-22xyoKdg", "user_id": "S4O2Q9K3MyflbrX8jMwFCA", "user_name": "Sarah C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Got a groupon here and glad I did! A lot of fun, harder than expected. If your looking to switch things up look no further. : )", "date": "4/21/2014"}, {"review_id": "_m6Y8wtjIW5a9GwL03Ox1Q", "user_id": "7yP3whHdv6oeJMFTgv9BWQ", "user_name": "Kylie W.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My friend and I stopped by here to try out the rock climbing and let me tell you, we will definitely be back! Staff is super nice. Sean and Jason were so helpful with getting us started all the way up until we left!  I love how the place has a million different things you can do, oh and that it is 24 HOURS!! Definitely wish I can give more than 5 stars!!! Keep up the great work(:", "date": "4/13/2015"}, {"review_id": "-cGnsTamSv1QoJS9EKk4DA", "user_id": "2J8hfs-ydWBz4SUogSrNQg", "user_name": "Jessica G.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "This place looks amazing. So many different and fun ways to get in shape!!!", "date": "3/25/2013"}, {"review_id": "-XEN1ZKZ_8_SkDM-gkGLCQ", "user_id": "yHkmc5aNoSwx_uRR7QNiDA", "user_name": "Maricela R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "New Gym! Very rad! They have crack, sport, auto-belay climbing! They also have all kinds of bouldering! Will be coming back soon. If you've never climbed before come to this place great staff, good music, positive vibes.", "date": "3/29/2013"}, {"review_id": "oMxHUr-ebxqqRg6iIECyOQ", "user_id": "KOBzoG_g1mmapqeizxGVZg", "user_name": "Carina B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is so much fun!!! I got the 24 hour pass and took my little brother and sister. It wasn't too expensive and we actually came back at night for more! Everyone that works there is super nice and helpful! Definitely a workout!", "date": "6/24/2013"}, {"review_id": "u-VBOdtinll4Y9lJpxdXPA", "user_id": "w8W-26uxR63SihuQO1OA0w", "user_name": "Grae B.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Place is awesome, they have everything am adrenaline junkie would want, rock climbing, bouldering, trampoline basketball,  basketball full court, a gym,'ping pong, pool table, go!", "date": "8/2/2014"}, {"review_id": "SSx77syXglWz9D4Z7IKHHg", "user_id": "RttGpKD3t-Sg0zRb2tDv0Q", "user_name": "Ken F.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I saw it on the opening night but I didn't personally rock climb, I only went for support. Overall the place looks great and fun", "date": "3/18/2013"}, {"review_id": "Tb3aV-2dmFrUa0b_FWN2GQ", "user_id": "uMtJY5BQJq8ox4kWxeH_GA", "user_name": "Gino S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a really nice gym. Basketball court, gym, and rock climbing. What more can you ask for? :)", "date": "3/27/2013"}, {"review_id": "9ikDFUH_G34eZcpbnEbLSQ", "user_id": "KLb24bF5R3TMuvOUfhX0QA", "user_name": "Cameron H.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Big fan of this place it is the best rock climbing gym in the area. Open 24 hours and it's only 55 per month. Really good bouldering and fun climbing with multiple auto belay systems. Also full basketball court. And trampoline cage ball. It's easy to find yourself here for 2 or 3 hours. I would highly recommend that you come check it out.", "date": "8/1/2014"}, {"review_id": "M6BZ7hsyAovox_gegNCfFA", "user_id": "C22P5nBxMW62EmLyFiQAhQ", "user_name": "Amanda T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Such an awesome facility with a great, personable staff! The climbing walls have all different levels of intensity for any level of climber! Lots of other activities like basketball and slack lining!", "date": "3/27/2013"}, {"review_id": "rFPKWdXDhjRIGfflIcQBlg", "user_id": "Advq0kV_GgEuR_Cprx309A", "user_name": "Joseph R.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Cool spot to come and stay active. It's something different than lifting weights or jogging. But they have exercise equipment too so you're still covered.", "date": "3/27/2013"}, {"review_id": "wVFo4zxU6dQY-nPFNjJ4Mw", "user_id": "38jQsQIQUWqdvp_qpGfFtQ", "user_name": "Nick D.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for the family it's big and it's got great setters", "date": "3/14/2013"}, {"review_id": "w9UTdJJRGo8LVasbjxfu3w", "user_id": "Fn5RSTxFMxaIsQh5c-1JDA", "user_name": "Kendra L.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! It's a huge facility with great walls and lots to do. I'm definitely going to make this my new climbing gym!", "date": "3/27/2013"}, {"review_id": "FP3Cq0pADVH9kQHsUkR1-g", "user_id": "kvLBtBIcCY_oL7_vkgc9cg", "user_name": "Jackie T.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Went on the opening and boy was it crazy. I'm excited for the lead walls and auto-belay set up. Looks fun and tall. Bouldering was a blast, I love Callus sets!", "date": "3/18/2013"}, {"review_id": "mCyspFar19phHDqwCYpWHQ", "user_id": "9ahyRBrvl1fAllQThK-oPQ", "user_name": "Patrick S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "It's so nice to finally have a toprope/lead climbing gym in the IE. There are plenty of routes with a variety of different climbing styles and techniques. Lots of autobelays available but it doesn't seem like the walk-ins get very much instruction on how to use them or understand general gym/climbing safety upon entering the gym (I'll get to this later). However, since the gym is open 24 hours, you're able to come in late when the gym is less crowded and send some awesome routes. As a climber I don't see myself using the weightlifting equipment or bball court anytime soon, but the climbing atmosphere is SOLID. The boulder routes are spot on as well, with a pretty neat fire-pole after the mantle finishes. Also, RockFitness has high hopes in terms of future expansion and I can't wait to see where it ends up. Plans include: hangboards, outdoor walls, 2 slacklines, and more gym equipment. But after talking with some of the staff, plans to increase membership fees may be seen in the near future. Right now, pricing is.... comparable.... to bigger gyms, but if you plan to pay the $15 entrance fee and the $5 for gear rental, make sure you take it easy and just enjoy you're time there. All in all: cool gym but not focused on climbing, only half the gym (right now) is climbing, and the other half is misc work out machines and a bball court. The routes are awesome and it has a great feel.I'm giving it 3 stars because it is a bit pricey on the membership and day pass side for things I wouldn't really use as a climber. Certain staff don't patrol the gym and make sure people are safe and I even asked one of the staff members if I could use my personal ATC and she had no idea what I was talking about. The same staff member walked by a child (8-10 y.o) messing around on the assisted dip/pullup machine and said nothing. Since it is the only top-rope/lead climbing gym in the area, I will be climbing here often, but most likely when it's late. Maybe I'm being a bit harsh, but I'm HUGE on safety. Especially in a climbing environment, safety is no joke.", "date": "3/16/2013"}, {"review_id": "UvgwXvEXGaG4cpP2UqeJCA", "user_id": "MJbrPG_Levq0wMLC38yNYw", "user_name": "Kit S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. Never tried crate stacking but i'll have to next time. The bouldering walls are good, tons of space. Definitely worth checking out, and ill definitely be coming back again.", "date": "3/11/2013"}, {"review_id": "bYJ-5M2IiSFSdu1r2x7sNw", "user_id": "Kp5s8x5JC9jOdIRNrV0zCQ", "user_name": "Yelper S C.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "All this place needs in aerial...lets get a trapeze or some silks in here!!", "date": "11/6/2013"}, {"review_id": "6KvnA0U02VI2y5mCmM6RcQ", "user_id": "_Mu4J8vQ6erKDjQq3-cMYA", "user_name": "Kimberly I.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Gym got way better! The boulder routes are amazing, I love the settings, esp. Ciotti's ones.  High line, lead climbing, cracks, fun gym!", "date": "2/26/2014"}, {"review_id": "wC4k19OU9pxJOQ0az8sYMg", "user_id": "z-Y4fNHIp5HbN1nYQilElQ", "user_name": "Megan M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing. Huge wall and other things to do as well.  Only negative is the heat inside the building.", "date": "7/2/2014"}, {"review_id": "LY9f3hsl49LokNJpFGkbLQ", "user_id": "cP4ik1HJUE1g09tsUbpTgw", "user_name": "Ben S.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The thing that makes this place so great is the Staff.  They are always down to just come hang out with you and it makes it that much more fun.  This gym also has absolutely every type of sports/workout equipment you could possibly dream-up and high level route-setters which makes for extremely fun climbing.  Makes for an awesome day and the family atmosphere makes a membership a no-brainer!  highly recommend this place", "date": "7/27/2013"}, {"review_id": "wOEu0ixQQ2VJ40Fy_sjqyw", "user_id": "S79Er2fzVPbrQ_IfCMd6ig", "user_name": "april M.", "business_id": "Mzb2zyZFFQ1JekYK2kBxCQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Best place to climb in town - with fitness classes and a full gym you dont really need to go anywhere else", "date": "3/18/2013"}]