[{"review_id": "mjRa3e2CeTn-qFBZrYoP4w", "user_id": "EShila_Phh52X-IT1FuZZw", "user_name": "Trevor G.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my 4 year old daughter, we had a great time. We'll definitely be back.", "date": "12/9/2018"}, {"review_id": "9BET99PWj0Pk6zqT4NpU7A", "user_id": "VjTSGW0MYe5YdjMUyVG8aw", "user_name": "Corine C.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 4, "useful": 3, "funny": 1, "cool": 2, "text": "Ive grown to love this rock gym.  Climbed here three times already and still learning.  Unlike other larger and more sophisticated gyms, Rockzilla has a family friendly feel about it.  I don't feel intimidated by other veteran climbers.  There is enough beginner, intermediate and advanced climbing routes for everyone who wants a challenge.  Owner is funny and helpful too. Brought our ladies bible study group for a weeknight of climbing.  First time for most of them.  Owner helped us out a lot.  We'll keep coming back.", "date": "10/3/2018"}, {"review_id": "DR1ynikDcLwR_O9KadCUbw", "user_id": "pic-7JeFbjUIppBPbnUU8A", "user_name": "Amanda C.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I can with my nearly 3 year old twins to first check it out to see if they would like it. They are great climbers and I thought if even for a little bit it would be fun to try. Upon seeing a previous review where they have a photo of a similar aged child climbing we went. We walked in and without even getting through the door, the man just shook his head at us. I didn't even have a chance to speak. So unbelievably rude. I wish in retrospect I could have shown him a previous review and asked him what his problem was. We were referred to go by no less than 3 of our other family friends who know our children so there were lots and lots of tears and we were a shooed our the door. :(", "date": "1/28/2018"}, {"review_id": "Qp2EFw55o0Ypu05Mu7EvYQ", "user_id": "HpOJ3rvNB_JukvKzhnqCtA", "user_name": "Jody C.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A great indoor activity for the entire family. I have attended and held multiple children's birthday parties at this gym. The owner is very family friendly and does a fabulous job with the organization of the children. My boys love to climb here . There are smaller beginner walls and the advancement moves up as you follow through the gym. There is also a free climbing section for more advanced adults. You can either purchase a membership or show up for a drop in day . Harnesses are provided to you for a small additional fee . Perfect for rainy day family fun .", "date": "9/24/2017"}, {"review_id": "IS7Gw2OCc3GmAdvoeVH0PQ", "user_id": "iksFYDzmHfJU4NrlCQ_HaA", "user_name": "Alonso M.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Always a good time, even if it was only for one hour. I had forgotten how fun and challenging rick climbing can be. Owner nice guy always willing to help out. Plenty of options to climb and challenge yourself.", "date": "3/26/2018"}, {"review_id": "Y3tkDD7bzcHxsVI-GeTk6A", "user_id": "UT31ahvsb3Xuj6u7Y-r_Nw", "user_name": "Jena B.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "This is so hard. My daughter had her birthday party there and she loved it. However, it was a horrible start. I was told via email my nephew would be allowed to try to climb He's 3 1/2 and I was worried he would be too small but again the person emailing me said he could try. When we arrived they pretty much laughed at my sister saying it's a joke when people think kids that small can climb. I was shocked. Especially because I had emailed ahead of time. The main concern apparently is that the child must be safely secure in the harness. Of course I wouldn't want my nephew climbing if it was not safe for him. The owner would not give me his name when I asked. My daughter wants to go back but I would rather drive out of town so I can get better customer service.  You should have rules and regulations-and you should clearly state them and maybe have decent customer service.", "date": "5/6/2018"}, {"review_id": "8hQ7ncYUg8D3dYPk0lSrFw", "user_id": "8eo9QExFk3P30tBw364GzQ", "user_name": "Carol F.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 2, "funny": 2, "cool": 2, "text": "My seven year old grand nice and her 30+ mom were visiting here in Napa and we decided to take them to Rockzilla as an activity.  They both loved it.  The youngster had been once for a birthday party in LA, so she was over her fears and as soon as she was geared up she shot up the first wall, causing her mom to get into the mood as well.  They had a great time and the owner was fabulous, helpful and reminded us they could come back until 9:00 tonight.  We are going back shortly. Hard to find, as earthquake took their street signage and Napa has not allowed them to put up a new one, but once you find it you will return again and again.  Prices very fair when you think about having 11 hours in a day to use it.", "date": "7/6/2017"}, {"review_id": "ueBUtMQU4Dy_xRYMblB31A", "user_id": "Q_lHgjq6uKxkdSCC0t3nNw", "user_name": "Adrian R.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place, love it! Dwayne, the guy who runs it has set this place up beautiful. Funny guy too. They got rental stuff in good shape u can borrow. First time there and can't wait to go back.", "date": "8/18/2016"}, {"review_id": "WYPOWdDXvU5oeF6EhyFWGQ", "user_id": "hJeQYfE7pHnPowxpoBsx1Q", "user_name": "Lauren F.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "$35 for two people for the day.This review is specifically reviewing the bouldering section:We decided to check out the gym and we weren't that impressed, sorry guys. We've been climbing for 7 years now and we've been to indoor rock gyms up and down California and in other states and countries, so we feel like we have a pretty good range of rating experiences varying from gym to gym.However, I will note that they were putting up more new routes and some were unmarked, but the ones we went on were not anything to rave about.-Holds are spaced too far apart for even V0's-Encountered a lot of forced, awkward movements-Heavily focuses on upper body strengthI feel like this gym is geared towards families coming in to climb for the day and the bouldering section is set for the setters' projects. Other than the bouldering section, it looks like a great facility for ropes and has a great atmosphere for families. No weight room or training area. Good parking spaces outside and plenty of tables/chairs to sit down inside.", "date": "11/3/2014"}, {"review_id": "zgnCJFHVS-DUCpvYY2vuVQ", "user_id": "O2-Nq8aWcmseqhoiS6Kddg", "user_name": "Lisa-Ann N.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "We visited Rockzilla for the first time last Saturday afternoon.  We were disappointed with the owner as all the yelp reviews were so positive. He was gruff, not responsive to questions, and treated us like he did not want us there.  I am not one to usually complain but the service just went downhill from there.  The tipping point was when he kicked my 5 year old daughter off the kids wall 2 minutes before 5:00 as there was a birthday party in progress.  We were respectful for the hour before as their party was in full swing but by 15 minutes until 5:00, they were having cake and clearly packing up to leave.  We will not be returning.", "date": "10/4/2017"}, {"review_id": "VDnYqjaJ2apN3wh5T3NiCw", "user_id": "kX8iuEUpgrFjbiHG11WfJw", "user_name": "Alissa M.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I went to Rockzilla for my first time. I tired it and didn't like it. I went half way up a wall, so was probably there less than 5 minutes. I went to ask for a refund and Dwyane the owner, simply threw my $20 at me (mind you I paid via credit card, which means he didn't even refund me properly) and said I can't come back.Yeah, I don't wana come back lol", "date": "1/23/2016"}, {"review_id": "Wfen_L-PojFzlwV6mZ4hJg", "user_id": "LusCb4lgyZndepb48KeCLw", "user_name": "Julio D.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super friendly staff. Was our first time and made my son feel very comfortable.  Place is clean and safe. Will definitely come back, may even do his bday party here. Fun environment. Thank you!", "date": "3/22/2016"}, {"review_id": "4AtncxSr2nXqzLMTKZesMA", "user_id": "alAeUsdaxR4C_ZEVJgn2kw", "user_name": "Victor W.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 4, "useful": 2, "funny": 2, "cool": 1, "text": "I didn't even know this place existed. We took my almost three year old in to check it out. I didn't know if she would like it or not. The guy at the desk told us to walk around and checki it out. Our daughter said she wanted to do it, so she put on a harness and gave it a shot. She didn't make it up to far, but she hasn't stopped talking about it all night. The guy at the fron told us that she most likely woudln't be able to do it, but she did have fun and that is what counts. The price of $20 for the day seems fair. I am thinking if I bring her back more often she will start to be able to get up higher. She is already asking if she can bring her older family friend. If you have kids who are looking for something different this is the place.", "date": "10/4/2015"}, {"review_id": "wVwbGQib1wnDp3LtcgLwZg", "user_id": "80TPn9xoI5M3VRukEAfaKw", "user_name": "Chelsea S.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Beginner friendly. As a beginner, I love it! The owners are really friendly. There's always good music and good vibes. There are often kid parties on the weekends, in which they have their own section of beginner walls. Ideal for parties and for people to be able to climb without interfering with the children at play.Location is a bit tricky to get too with gps, it will lead you to a back end. Don't let this discourage you! Totally worth it. They allow you to leave and come back, which is fantastic. Being able to climb for a few hours, leave to get some grub and come back and climb. :)Like I said before, I'm a beginner, so this gym Issa great for me. I suggest giving it a try!Cheers!", "date": "2/22/2016"}, {"review_id": "8FQjLiUIv5JGf2Ja6xAx6w", "user_id": "N3BJWbNxanI7E2rLxdio1A", "user_name": "Nic L.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had a great time here!  $20 each for all day climbing.  The boys (Sky and Justin) were in heaven on the ropes.  Crystal felt nostalgic since she used to go rock climbing with her dad.  We will definitely be back!!", "date": "9/7/2016"}, {"review_id": "7IxWwQ7n5bbIMFOd1ql_Uw", "user_id": "ucNyKt4oXBX5L2vRgV9t6w", "user_name": "Felicia G.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 1, "useful": 7, "funny": 5, "cool": 0, "text": "Review regarding safety issues/jumpy house.I was at Rockzilla recently for a 6 y ear old's birthday party, the host had rented the climbing wall as well as a jumpy house that was set up in the warehouse.The jumpy house deflated not once, but TWICE, with children still inside! The first time we were told it was because the hose accidentally came off. The second time the owner, Dwayne, deflated it on purpose because the 90 minute rental time was up, however he neither informed the adults, nor did he check for children, before turning it off! His lack of concern for both incidents was extremely upsetting, and all he offered was an apathetic apology with an \"it happens.\"Completely unprofessional, rude, and a serious safety concern!", "date": "11/13/2014"}, {"review_id": "i_Ov1OT1XKTeVVxVc3mJnA", "user_id": "qhnmWkC0f9VcZv12rkw2Uw", "user_name": "Chris H.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Chatted with the owner a bit. He truly cares about his community and the kids seemed to be having good clean fun. But this is a review on the gym. Most gyms make the mistake of setting too easy and I see this reflected with a new wave of outdoor enthusiasts. Can't remember how many times I've seen people nearly die this year for getting in over their head. They set on par with outdoor grades. I started my journey 15 years ago on an outdoor artificial wall. Wish there were more gym owners with the same mindset as this guy. You build smarter climbers through humble beginnings. Wish I remember'd his name as it was 2-3 years ago that I passed through here with my wife on the way to Yosemite.", "date": "12/10/2016"}, {"review_id": "qM6U16pT_ojZeXw3fYBXEw", "user_id": "O1vs6sO48lmIOYjueBmJ9A", "user_name": "Daniel S.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time here, and it was a blast!  Spent two hours here, and it was A definite finger, arm, and back workout!  Our 8 year old daughter wanted to try rock climbing, found this place, and we went.  Zero experience rock climbing and the staff (owner?) was super friendly and taught us what we needed to know to explore the routes safely.  Some might think it's expensive, but it would cost the same amount to go to the movies or bowling.", "date": "9/4/2016"}, {"review_id": "yI-jBrXGJ2mAbL3jY2HmXw", "user_id": "eGqbSmdWvh6yAVuYGggi4g", "user_name": "James E.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Rockzilla is great. Not like there is many more options in Napa so I am not sure why other reviewers complain about the facility. Plenty of runs with varying degrees of difficulty. Wish they were a little higher but it's Napa - not too many 60' warehouses around. If you are in the area and want to have a great time check them out. Ownership and staff are very friendly and helpful.", "date": "8/28/2016"}, {"review_id": "m2Ic8_vYcPvKeN_PKmidOg", "user_id": "HmBEFsOfGs5xsJcdynWfIg", "user_name": "Will A.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great gym!! Nice people! Fun routes!! Good rock. Good rope. I'm in!!! Could use some weights and training equipment but maybe I just didn't see it. Will look next time!!", "date": "7/9/2014"}, {"review_id": "3EUEQUrNoMvz-ZJS2NYHRA", "user_id": "fBMWDoa8sRRj7QaLNSFIsg", "user_name": "Brook S.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 4, "useful": 6, "funny": 0, "cool": 1, "text": "Tips for enjoying Rockzilla:1. SHORT NAILS!! I always kick myself when I forget to file down my nails before coming out here. It's not about breaking nails, it's annoying because you won't be able to grasp the holds properly. 2. Saturday mid-day (probably Sunday too) is when all the children have their parties. I like to come towards the evening on a Saturday or in the middle of the week.3. Don't wear short shorts. The harness comes to about mid-thigh. You'll be more comfortable if you have longer shorts or pants on. In general stretchy-movable (yes, i just made up that word) clothes are the way to go.4. You can save money by bringing your own gear. They'll take money off of the entrance fee if you bring your own climbing shoes and/or harness.I've been here about 4 times and every time I have a great experience. The owner is very personable, we usually end up talking about one thing or another. And he is always walking around to make sure people are doing okay, which makes me feel a little safer. The climbing routes are changed regularly so that keeps things interesting if you come often. Great customer service and a fun way to spend a few hours!", "date": "8/3/2013"}, {"review_id": "Qcu5G_sKgvKOiegCZ0f3-w", "user_id": "ZiBZNqfUj-ADMqVFc8_c8A", "user_name": "Sailor M.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter had her 9th bday and she have a blast!!..she loves this place so much we are planning to come by again soon.", "date": "8/11/2014"}, {"review_id": "4bN1dMEoJgpaSa6GiwMoQg", "user_id": "TmiQyChekVYbBLKLVa3Dgg", "user_name": "Angela B.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym, but this review is specifically for the outdoor excursions.  We had a group of 7 out for a day climb at Mt. St. Helena, and it was just terrific.  Our guides were knowledgable and competent, and we had a terrific time.  Prices are very reasonable, definitely a great way to spend a day!", "date": "6/21/2014"}, {"review_id": "oEAX-NgeVmqnotXhfRET0g", "user_id": "dvSe6ZZhp6DNsHgycRKhIg", "user_name": "Omar C.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Wife and I went for a date, to do something different. Awesome experience. The manager was very friendly, taught us the ropes and the equipment usage quickly. There were several walls to climb of varying difficulty - most climbs were buddy assisted, but at least one of each level of difficulty was setup with an auto-winch system if you didnt have a buddy to work your rope. We spent about an hour and our arms and hands were toasted. If we lived locally we would most likely would return.", "date": "11/15/2015"}, {"review_id": "Q21LizB-GIWWk7kvXUIk4Q", "user_id": "STKZTdtrJVTdZtp7WjBQMQ", "user_name": "Aaron S.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My absolute favorite gym, though not for its walls but for its community. I mean, the walls are pretty good, and the location is ideal for me, but they aren't the best. The community at rockzilla, however, is amazing. What a great group of friendly, courteous, and safety-conscious individuals. Also the routes are changed often which is a plus!", "date": "7/4/2015"}, {"review_id": "ZgEw11B7g_undGOwg12uvw", "user_id": "LHCmkCW03XkAAzLjScEQ7Q", "user_name": "Wendy R.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "My husband and I were so lucky to find this place. Visiting in Napa for 5 days, we were looking for something for our son (4 years old) and cousin (5 years old) to do rather than watch us drink and be merry.We were actually heading our way to Scientopia Discovery Center but unfortunately it was closed to the public on Mondays and Tuesdays. However, the owner was nice enough to open the door while I was awkwardly trying to get someone's attention through their window. She then recommended rock climbing at Rockzilla located \"around the block\".In terms of location, the building was a little difficult to find. It is located next to a bouncehouse and a building that manufactures shelves or something like that. However, if you can get past your suspicions of whether you have arrived at the right place or not, you will be so pleasantly surprised at Rockzilla.The kids at first were hesitant to climb so the owner busted out a bouncehouse for the kids to play. Meanwhile, my husband and I spotted each other on various courses of rock climbing (this was actually the first time when we went to a \"formal\" rock climbing training area and were so pleasantly surprised by the fun we had rock climbing). We do suggest that, if you plan to go here, do so with a partner so that you can take turns spotting each other.Once the kids saw us rock climb, they wanted to try to do so as well. The owner was nice enough to let the kids try a climb or two before we had to pay for their climb. (Prices are extremely reasonable and passes are good for the entire day). The children had their own climbing wall where a \"suspension\" system allowed them to climb without parents officially \"spotting\" them. Overall, we had a wonderful time. This is definitely a place to visit if you need a break from the wine and food or if you would like your children to have a good time for a day.", "date": "12/30/2011"}, {"review_id": "ZxjC5Cj9trCXB0gSuEJL5g", "user_id": "tmivmXmzuo1if8kQZfTCuw", "user_name": "Allison H.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Bought half-off on Groupon and loved it. Although it was my first time climbing there were friendly customers as well as staff to help guide a friend and I. I found the bouldering area funner as it was more challenging. They also have a section where you have to wedge yourself between a two walls. Didn't try it but I will definitely go back and check it out!There was also a children's birthday party going on with a jump house. Looked pretty neat.OH! And this place was really hard to find. Since I didn't have a GPS or anything I literally circled for 30 minutes. My advice don't have an in-depth conversation with your bestie while trying to locate it. But it's closer to the train tracks and if you're on Lincoln and behind in the vicinity of other warehouses.", "date": "5/20/2012"}, {"review_id": "fc45dQoKYOoeKyQ-T4h9kg", "user_id": "MUJ44YhlZ69KjiLZfYt6Lg", "user_name": "JonCasey I.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Now that I've been to a few rock climbing gyms. I can say this is one of my favorites. The place is really fun. The climbing ratings are consistent, the place is really clean cut and laid back. Not to mention pretty cheap entry. I love the belay mounting they do a double loop at the top for more controlled descents. Also I've been once with my little brother who is half my weight (obviously can't belay me) so the owner graciously asked if I would like to climb a wall and he belayed me. Now that's great customer service. I will definitely be coming back time and time again.", "date": "4/1/2013"}, {"review_id": "NA0TArrtPE_ql41DNBYiNg", "user_id": "8ko5fTH4D7YwzOM875RA6g", "user_name": "Jasmin A.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 1, "funny": 0, "cool": 3, "text": "I'm still a newbie at rock climbing, and I only have one other gym to compare it to, but this one seems to be the best by far. Rockzilla got me really hooked on climbing. The route ratings seem more challenging than they should be, so the sense of accomplishment comes on stronger when I climb here. A day pass is 10 bucks with college ID, but rentals cost extra. The facility itself is very spacious and there are plenty of routes to go around. There's even a wall specifically for small children and beginners. The owner of the place is super friendly and encouraging... one time he literally pushed me up the wall to my next hold.  That's what I call customer service! One thing my boyfriend and I learned about this place - finish your enemy route of the day before you leave. Your may not be able to defeat it on your next visit because it seems they are constantly changing around rocks on the wall. But that's a good thing, right? I love this place so much, I'm considering having my birthday there!", "date": "4/27/2010"}, {"review_id": "Ts5aTWrkTpOYAOZdVWU8Vw", "user_id": "hrFkd8zCIDYypfbl_9mq3g", "user_name": "Melissa M.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time rock climbing there today. Took a friend for her birthday. Owner is extremely helpful and we had a BLAST!", "date": "3/7/2013"}, {"review_id": "TQ-2l5jOFN6i6GkbOgc_rg", "user_id": "IzzU5dF8GsN1Fw_FuELaXw", "user_name": "K L.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a little hard to find, but worth going to.  The owner is really nice and helpful.  Prices are cheaper than the other indoor rock climbing/bouldering places I've been too.  Admission includes them teaching you how to belay, some places require you to pay and take a class for this.  Overall, I would highly recommend this place for someone to try out.", "date": "9/9/2012"}, {"review_id": "ThZpTPffeOClQzgmIiQh_A", "user_id": "qCui3w0paQxrptgAgYDIMg", "user_name": "M M.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Cheap day passes and the routes were well set.  There were kids, adults and rest around but still enough room for serious climbing. My son was attempting rock climbing the second time and the xperience was A+++. If you are in Napa, you MUST try this place! Awesome host and very helpful.", "date": "2/20/2012"}, {"review_id": "m7kqAoU6oMYyGPKs3XuruQ", "user_id": "gOA3BatSTR71ciU3ucz95A", "user_name": "Mayla A.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am not a blogger. As a matter of fact this is my very first time to write a comment. I had my son's 7th bday party there last Saturday 12/28. The owner was cool and very accomodating. He set an inflatable jumpie for younger kids w/c was not even part of the package, Free!I informed him in advance that there would be about 20 kids total but eventually more parents decided to climb too so we pretty much filled up the entire place. One instructor assigned to us and his presence was visible during the entire 3-hr party.You are allowed to bring your own party food too! The best part is the price, it's very reasonable! I highly recommend Rockzilla, they ROCK!!! Definitely will come back very soon..", "date": "1/2/2013"}, {"review_id": "jxYlZIDm-ahNrXq0-8wwVg", "user_id": "B5wisDgsjoBe6ldaxTepdA", "user_name": "Italophilia M.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Cheap day passes and the routes were well set. Grades are harder than other climbing gyms, so a 5.10c was actually challenging.There was a kid's birthday party when we went, but still enough room for serious climbing away from the party area.", "date": "5/26/2009"}, {"review_id": "PfkJtpfB1Voe5wLPKU-9BA", "user_id": "bnnezAqNveK3twAmKAcEHw", "user_name": "Marcy D.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "We had our daughter's 6th birthday here last month. It was very fun and easy. The staff took really good care of our group and helped the kids with the climbing gear and walls when they needed help. They had a jumpy house up near the picnic tables and it worked out great for the younger siblings who weren't interested in climbing yet. We come here for play dates periodically and are always impressed. Since we have been coming both our kids have dramatically improved their skills and confidence. It's a gem in Napa and we feel lucky to have something so great for our kids. We only have to drive 5 minutes to get to it and we think it's very affordable for what they offer. We highly recommend it!", "date": "4/24/2011"}, {"review_id": "UT6kQKqkYkdsG2AZOH7KUA", "user_id": "cDa2Rrx4pkVyhZd3-qMAAw", "user_name": "J T.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is AWESOME!! There are tons of places to climb so you never run into people, everyone is friendly, and there are choices for all expertise levels.  They have bouldering, rock climbing and chimney areas, so you can do everything there.  The owner is friendly and personable.  We bought a 10 trip pass and have returned several times.", "date": "11/18/2013"}, {"review_id": "ao03Uz2RuH7JWcED9qbsMA", "user_id": "lqgTDNs08kyMR6642Nxljw", "user_name": "Lindsay S.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We just completed our annual company kick off at Rockzilla. I was soooo impressed with the place and the owner. I will come back and visit often. The facility is HUGE and the rock walls are expansive. It was a great value and I recommend everyone try it out. Not to mention great workout!!!", "date": "3/3/2011"}, {"review_id": "ZD7y3otlYoscoHjSsmVC6Q", "user_id": "eAyzgNKVZ3uur67AM-jvkw", "user_name": "Cliff N.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Tucked away on a backstreet in Napa, is a local's secret \"playground\"! Rockzilla, is a beginner to expert level indoor rock climbing facility that is the North Bay's answer to \"Planet Granite\" in the South Bay, though not a chain! Rockzilla is locally owned and operated by next door business neighbor \"PB & J's-which is a indoor \"jumpy house\" facility for kids, with successful summer camps programs for elementary and middle school kids. I found out about Rockzilla by word of mouth as they don't advertise much but are apparently known well in serious climbing circles. They have harnesses for everyone and scales of difficulty that start with beginner children even down to the toddler age on the boulder area with belay instruction and help and all the way up to \"V Hard\" rated overhanging arches on the main climbing walls, that were designed by expert level climbers! Day passes or memberships are available and cost is reasonable and big fun factor, they stay open late, have a workout-warm up area, classes and summer camps to. Me and my 9 year old son loved climbing like spiderman up the rock walls and repelling down, with plenty of challenges around each corner of this large facility. It can be hard to find as it's tucked away in Napa's old warehouse district but just a few blocks of Trancas St., a main business area and just up the street from the new Westin. Day treks to Birthday parties and corporate events, the weather is never a factor as you have lots of space indoors! I've not been there when it was too crowded and it seems like they make sure everyone has enough space on the walls and break/eating tables.Bottom line: It's a great workout, fun, good service and brings out the kid in us all! Go climb a rock today!", "date": "11/20/2008"}, {"review_id": "Cqw-bBHkk6eCxGxMapeGNg", "user_id": "M5A1XMl1H7PNTat5SLRv4w", "user_name": "Deanna S.", "business_id": "2W3pkmKyoqG6ayHFMQ-nww", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "love the cow bells at the top! this gym has great community feeling.", "date": "4/23/2012"}]