[{"review_id": "YDWThqev4nfy1FhfwMK4vA", "user_id": "zn0DpiOHdp-3IH8wxjjXDQ", "user_name": "Arica R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had my daughter's birthday party here and had an amazing experience. I recommend doing for anywhere from 20 to 30 people, because we had 26 people and the room was JUST the right size. Any more than 30 and it would have felt crammed. The pricing here for a party is such a great deal because the kids get a fun experience and you get the party room. You can bring your own food, decoration & they even have a fridge you can keep perishables in. However you get only two hours with the party package but Can add an additional hour for $75.  I wish I would have added that extra hour! I felt like by the time the kids started getting the hang of rock climbing it was already 1 hour down. If I could do this again the extra hour is a must. Again this faculty and staff were awesome! I wish I could remember his name but he was tall, tall flowy hair & was a pleasure to have host us.", "date": "3/24/2019"}, {"review_id": "XeuNHhutPh6DRChqq8sxzQ", "user_id": "JRma6K2em0OaoJNY2fhpFw", "user_name": "Kimberly S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 1, "useful": 4, "funny": 1, "cool": 1, "text": "So I have been to countless climbing gyms as it's a big part of my life. I have never heard of many of my friends coming in to this gym so I saw the reviews and figured I'd give it a try. I have never been more disappointed in a climbing gym. The owner was running the front desk, not friendly at all, and seemed bothered by having to check new people in. My friend had to rent equipment and it was old and DIRTY. Moving into the actual climbing area, I have never seen a dirtier gym. That place hasn't seen a good wash probably ever. The mats are old, lumpy, crusty, dirty, and definitely lack cushion. Now moving onto actual climbing. The holds are so full of dirt you can't even see the color of them. Doesn't look like routes have been changed in a long time. But the worst part, the ropes are OLD, sticky, and not adequately placed to ensure climbers are safe on different routes. Additionally, the ropes are anchored to the ground. You don't tie in as the belayer. You just pull the rope through the grigri that is anchored into the ground. It is very foreign to me to do that, and is not proper climbing technique. Getting the rope through the grigri is almost impossible because of sticky residue all over it. Overall, this place is not for avid climbers. I think it's more catered to little kids and their parents who don't know any better and are just looking for entertainment. If you actually want to climb and be safe and challenged at the same time, literally ANY OTHER GYM is better than this. It's a cool layout and has the potential to be awesome if anyone cared to maintain it and upkeep it.", "date": "4/5/2019"}, {"review_id": "INhW2lYRK9u_BVeRTPkItg", "user_id": "D4mYL3ijAenC_jHSKSFyPg", "user_name": "Chris S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great boulder gym in the area. Maurice's Customer is fantastic. Goes above and beyond", "date": "5/14/2019"}, {"review_id": "8Nbb4gEGOu8XDq089bI6sg", "user_id": "l4W3xaDR_z82Wv2skKk2pA", "user_name": "Elizabeth D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Spent an amazing hour and half of our Saturday evening at Rock City and we LOVED IT! My husband and I wanted to do something a little out of our comfort zone for our anniversary and we had never climbed before so we ventured in about 5p on a Saturday night. The guy working that night (I feel so bad I didn't get his name) was AMAZING! He was so patient, explained everything so well, and we still encouraging and fun! It was a pretty quiet night I think; only a handful of other people there. So maybe we got lucky because we basically had free run of the place and could try any of the routes and rocks. I would give this place a 10 out of 10 and would highly recommend it! We will be back!", "date": "8/6/2018"}, {"review_id": "DFWlxciRP9ehI3V2DZrgKQ", "user_id": "PxLJgFh0clPgZIBp987QUw", "user_name": "Annie L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Would not recommend!Threw a birthday party for my kids birthday and the place is dark, full of spider webs, dead bugs, and filthy. The party room was really dirty with an old fridge that hadn't been cleaned in some time- the restroom was so gross I decided not to use, the climbing area for the kids was small as there were only about 4 ropes that the kids could attach to their harness, and I really just expected more from the past reviews and stars. Oh yes, the tunnel they speak of is super dark and small- I thought it would have been fun but really- it looked pretty creepy. Should have checked the place out first- considering everyone drove over a hour to get here-  should have booked elsewhere. Not picture friendly- not clean- waited 10 min before someone helped me check in for the party - I guess the staff is nice though. Hence the star.I think the kids had fun nonetheless- maybe it should be 2 stars.", "date": "4/29/2019"}, {"review_id": "_ChfuBZAmUGROGg3BYnBbw", "user_id": "6GEBrkRaWkVflAP9vP0KUw", "user_name": "Sarah V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Amazing customer service . The guys are super nice and chill. Cool tunnel if you're up for some crawling! Great rock climbing place for kids and adults :)", "date": "3/24/2018"}, {"review_id": "DWerGDk-i0cXeiOu7E3lug", "user_id": "WT4Y6Ji7LdY8TfjvmzU-EA", "user_name": "Rae A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Came here on a Tuesday because my sister and I thought they offered free yoga classes. Well, if you paid for a day pass then it's free so we did. It was 15$ and we got to climb after. The service is excellent and the guy who helped us was really friendly and all smiles. He was very patient when we had no idea what was going on and told us that they had yoga mats for the session. Everyone here was actually really fun and friendly. My friend is a regular here so everyone was saying hi to her and she kinda told me the ins and outs of the place. That being said, yoga was intense. I had a lot of fun and definitely learned a lot. My sister and I went on the tunnels which, is kinda scary if you don't have a partner or if you're afraid of getting stuck in small spaces. Really fun though if you're with someone hilarious and ready to break their bones trying to fit in the holes. I suggest being the second one in so you can let the first person figure it out. Anyways, if you're bored in the YL, check this place out and maybe gain a healthy, cool hobby.", "date": "8/26/2017"}, {"review_id": "bFCKeWkW72myDf9FyARLWg", "user_id": "i0sDB30FPxEFM17blqJliQ", "user_name": "Jennifer G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 2, "funny": 0, "cool": 1, "text": "Nestled among business buildings trust your GPS that you've arrived at this fun, affordable rock climbing gym to climb up walls like Spiderman. Mostly bouldering but there is a section where you can use rope and belay on. Their staff is very helpful and knowledgeable. I agree with the other reviews; there is a pretty sweet and strong community here. It is a good place for newbies like myself to start learning the ropes or no ropes. Eat your Wheaties before coming here because it does take some upper body and leg strength. Tip: Try the tunnel if you are small enough! Tunneling through the walls and over the ceiling of Rock City is such a cool and unique experience you will not get at other gyms. However, only attempt if you are okay with exploring dark, small spaces. The staff gave us headlights to use which were definitely useful.", "date": "7/27/2017"}, {"review_id": "KId1xes5zDaw9dVG801dgA", "user_id": "H9Zy-iGDz9IR82K1Z0H7XA", "user_name": "Bethany A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "My two young girls came here to earn their rock climbing badges for American Heritage Girls. They had such an amazing time! They loved the boulder climbing the best. It was a little stressful for me because we had a large group of kids and there were other adults climbing, falling, and jumping, but the staff was so patient with the girls. Thank you!!!", "date": "2/5/2018"}, {"review_id": "bOsoLPXTuodfrE4hcp7ZfA", "user_id": "kK6YCOvtJ4kTJz0JURMy8A", "user_name": "Ocie M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've taken the kids here a couple of times and we had a birthday party here as well. The kids always have a great time and the staff is very helpful in explaining the safety and different difficulty levels. This place is a gem.Also, there is a lounge area with a Foosball table. If the kids get tired, they can relax a bit and then do some more climbing.", "date": "8/11/2018"}, {"review_id": "puswhUiikP5REi4n1eHrIQ", "user_id": "RCXasOHhAglZEoqz_hZIJw", "user_name": "Brittany B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This was my first time rock climbing EVER and it was pretty fun! I went here with my friend who frequently rock climbs on a late Saturday afternoon. Getting here was a little confusing (but most of the businesses in this part of Anaheim usually are). We entered through the back, through what looked like a warehouse door at first. Nope. Not an abandoned warehouse. \"That's the entrance,\" my friend assured me. It was ~$20 for a day pass, climbing shoes, and a bag of chalk. The front desk person was really chill and we had a few conversations throughout my time there because there were hardly any people climbing. I should preface anything else I say about my experience by saying that I'm really scared of small spaces and free-falling. Regardless of this, I still went through the tunnels and bouldered (free climbed, without rope & harness). It was still really fun though! I mean as much fun as this could get for someone with the particular phobias I have haha. Overall, I probably wouldn't come back on my own volition (but, again, that is because I have a lot of fears NOT because of this place or the people). With that said, however, if any of my friends wants to go rock climbing, I will definitely suggest this place first!", "date": "11/10/2017"}, {"review_id": "OrBDSC2wHyWLrmox5PxO_Q", "user_id": "7iE9bioifT-7gDsr36WeDA", "user_name": "Lisa L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Just had my daughter's birthday party here. Nice place and everyone, especially the kids, loves our party host Christian! He was really nice and very patient with 20 kids from ages 7 to 14. The place is not that big, you pretty much book the party room and bring everything else yourself, I really like the flexibility. Definitely a place for both adults and kids to have fun together.", "date": "2/17/2019"}, {"review_id": "UZfdBQcKL0bCb9wC_8oWVQ", "user_id": "UwnDzkmn1P4b8YjhqI7pgw", "user_name": "Ben L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Ever been in a situation where it's raining outside and you totally want to climb on stuff, but your mom won't let you? I mean c'mon, you're 32 and she still won't let you climb on stuff in the house?  What the heck mommy?Well you're prayers are answered if you happen to live or be around the Anaheim area. If so, you should hit up Rock City.Most of the gym is for bouldering, but there's a small area for top-roping, but if you're looking to rope up and have a harness strangle your boys downstairs (something only men truly understand), then you're better off going to SenderOne (LAX or Santa Ana) as the walls at Rock City aren't particularly tall.  Besides if you're going to strap on a harness and squeeze Jasper and Reggie down there, you might as well get on a really long climb which would not be Rock City.Ratings for the problems are easier than the Factory, but harder than Cliffs of Id. Sender would be between Rock City and Cliffs in my humble opinion. Being a smaller gym the route settings are definitely more creative since there are obvious roofs, slab top outs, and crazy overhangs.The staff at Rock City is very friendly and the it has a nice neighborhood gym feel. Not very corporate. What do I mean by that?  Think mom and pop small coffee/cafe shop as opposed to Starbucks. At Starbucks you're paying for flashy, hip and cool while at Mom & Pops you're paying for coffee. When all you really want is coffee why are you listening to Enya music and worrying if the water is gluten free?  Capiche?youtu.be/zKmDqXhxVOI", "date": "1/15/2017"}, {"review_id": "UNgWh8Q140ziyBVESVi14w", "user_id": "gNHzjTZUsFnSp7EcL9e5BA", "user_name": "Jory P.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great Place!! My girlfriend and I went on a double date here, and it was awesome for us... lol!!", "date": "2/7/2019"}, {"review_id": "vdSK-8ytwKJJp4DZL5XvcA", "user_id": "alu8c_w8uQsu0-UgCAkmTg", "user_name": "K V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hidden gem. It's a clean facility and all the staff are very nice. Kid friendly, will continue to come back!", "date": "1/30/2019"}, {"review_id": "Y7Jwy9vcO4AAPn2ed4kyWg", "user_id": "UtilaiZlc7OVzx63gpmLKg", "user_name": "Luz B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my friend Janet, we got some training and then left to ourselves. The adrenaline you get when you climb to the top is so addictive. It's such an amazing sense of accomplishment when you physically pull, push, and climb your way up. Definitely recommend to anyone who wants a challenge physically and mentally.", "date": "10/8/2018"}, {"review_id": "__EBi-4P5YY0P_SzQ3pIBw", "user_id": "xJewsOOS_q_Z-zKBmb2KLg", "user_name": "Jennifer W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "great and friendly staff. I had my daughters 10th birthday here and they were very patient and organized.", "date": "8/21/2018"}, {"review_id": "j9zQJe90OFeZljV0Xymxmw", "user_id": "uAxagyQVfPzohB9N9pCcQA", "user_name": "Max S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is simply the greatest !!!  Staff is welcoming and super nice. Atmosphere is relaxing and welcoming. It's not costly at all and spending an hour or two here climbing and exploring is great experience and a great exercise.   Whether your a new or experienced I would totally reccomend:)", "date": "9/9/2018"}, {"review_id": "y1lB89pLLI8M7fjvtkCL9g", "user_id": "fxcyt4lx9XDgTPoAwW7roQ", "user_name": "Christopher U.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Such a fun date night thanks to my novia! The employee working Saturday night was very helpful and took the time to demonstrate proper techniques and the right way to handle the ropes! Everything is indoors and the walls are sectioned by difficulty. Cost: $15 for a day pass and it includes a shoe rental. The day pass gives you access to everything inside. Difficulty: Not bad for my first time. At first everything seems impossible to do, but it's only a matter of some confidence and descent skill to get started. Every wall is rated by the difficulty level. 5.5 is the easiest and the hardest is 5.11. The rating measures the incline and level of rock grip. I have to admit, you do need upper body strengths and some endurance to handle the climbing. Experience: I had a blast! My greatest fear is heights, so I was a bit skeptical at first but with practice I got more comfortable. I didn't reach the top but I got pretty close. Overall, such a fun experience. They also have an indoor maze for CHILDREN. I'm a big guy and I wasn't aware the cave Maze was very tight. So I learned the hard way, I was stuck and didn't get far. Such a funny experience. But anyways, I highly recommend this place.", "date": "4/17/2017"}, {"review_id": "cLFiu1BRYP1NBsYqowhx-Q", "user_id": "5jGPnU7NlGfiD-D09oYwBg", "user_name": "Remi T.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Rock City is an amazing gym with a very helpful and kind staff. Maurice and the setters put up fun routes that take some thinking to figure out. This is an awesome gym for new and experienced climbers, and has a very cool tunnel that goes around the gym that everyone should check out. Overall, every trip to Rock City will surprise you with the excellent customer service, the friendly community, the different terrain, and the route setting.", "date": "8/7/2018"}, {"review_id": "uQ-Z9v8fE-CLkmOey7S89A", "user_id": "wQtaZZ54z-Bfc3HUV0fpFw", "user_name": "Tatiana V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My boyfriend and I went there like 2 years, because it was our anniversary. My boyfriend decided to climb these rocks because he did good at climbing but me not good at climbing and also for me slippery and falling. I will try again for later that day! Great Mild Service!!!!", "date": "7/9/2018"}, {"review_id": "cdVfQ-yfBfoTF3ptVhRKhw", "user_id": "mTwC6YaV7qNuk5dRaHB7Uw", "user_name": "Hannah M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The tunnels are awesome and the people here are so nice. I imagine this would be a good place for birthday parties, but coming from professional climbing gyms, it wasn't for me. I did have a lot of fun, but the gym is mostly bouldering, with a lot of confusing routes. There were a few walls that had top rope systems but no official routes, just an assemblage of colored rocks. Overall, I had fun, but it's mostly catered towards new climbers and parties.", "date": "6/20/2018"}, {"review_id": "yL49j70q6R5yOZBI8-D2nQ", "user_id": "zzI3_9owbBYoozToDmqjxg", "user_name": "Nicholas K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been climbing here off n on for some time now. Every time I step back into Rock City I wonder why I ever walked away from the sport. Love this place.", "date": "10/24/2018"}, {"review_id": "FhAWxtsYwGdopmQC6KzthQ", "user_id": "erwX12GUrinx8yrT8dlilQ", "user_name": "Mitch R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had a great time climbing here, Maurice is the man! Friendly people, good vibes, solid routes. We also had fun in the tunnels. Thanks for a good time, we'll be back next time we're in town", "date": "10/22/2018"}, {"review_id": "QAjXdxSYL8zbfl9p2P_tWw", "user_id": "954LjeI04TUwhnlJyHbLzg", "user_name": "Michelle R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "One borring Sunday afternoon my boyfriend and I decided we wanted to peel ourselves off the couch and find something fun to do. A quick Google search later, we found Rock City. I've never done indoor climbing before but after reading some of the other Yelp reviews I was reassured that this is a good place for all levels of climbers. Here are the important details:$15 day pass. You can come and go as you please all day until closing. Ask about monthly memberships if you're looking to go regularly. $5 shoe, chalk, and harness rental package. Good equipment, and you are more than welcome to bring your own stuff if you have it. They offer rope top climbing and bouldering. If you are planning on top rope climbing make sure to bring a friend to act as your belay (safety anchor & lowering person). They do not have self automated lifelines.I had a great overall experience. The staff were friendly and gave a basic \"how-to\" orientation before you start. The climbing areas aren't very big but when we went there weren't many other people there so we never had to wait to climb. Definately going to feel sore the day after, but it is completely worth it.", "date": "5/29/2016"}, {"review_id": "hxoEfLtBSI7lOJqIUqj1jw", "user_id": "R4eetEGSZq1THK6jRoCVQw", "user_name": "Jackie P.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 3, "funny": 3, "cool": 1, "text": "I've been to one other rock climbing place and I do enjoy both.This one has more bouldering than belay courses, so the money is worth your buck if bouldering is your thing. It's pretty challenging, (even the most basic ones) so I would recommend shoes and chalk, and if your hands start hurting, you can ask the front desk for tape! 15$ for day pass +shoes, BUT you can use your own closed toed shoes if you choose to do so! The staff is incredibly nice and welcoming, makes the rules quick and clear.What stands out with this place for me is the 'cave' like thing. If you're not down for closed spaces, it's not for you. At times I felt too close to everything and got claustrophobic ish, but it wasn't too bad. It was pretty interesting and fun, extremely dark, so ask for a flashlight or bring your phone!I had a great time and if I'm around the area, I would go, but other than that, I'm reside a lot closer to sender one. HOWEVER, the prices here are relatively cheap, so it's a great place to climb!!", "date": "12/25/2014"}, {"review_id": "SFCMlWiDkrT80l0G8LGJOQ", "user_id": "-IBAUAC6XZVwppFBBBuhWw", "user_name": "Geoff E.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came in with my 5 year old son for the first time. Mike was very knowledgeable about climbing and where we should start. He made it a really fun day.  Highly recommend.", "date": "2/8/2018"}, {"review_id": "WvHjppNasz8CxDzZFpqD8A", "user_id": "muFkhCi1V0KSh59paM0UFw", "user_name": "Alicia P.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We took our students approximately 17to this rock climbing facility. The staff at this facility is so kind patient and careful with the children. They were able to get some of our younger fearful students to climb it was an amazing experience. The owner Maurice is an extraordinary and experienced teacher.We are already planning as a family to go climb. Thanks again for the experience", "date": "6/22/2018"}, {"review_id": "WI1nWvK8_RhL_5XQXCdbzQ", "user_id": "y6xsor_2vUodyeWvpYjF7w", "user_name": "J K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff here is great! The facility isn't huge but they change their climbs often. And the people who come to climb are so cool and helpful. There are a lot of really good climbers who will help you along the various courses. Would definitely recommend!", "date": "6/10/2018"}, {"review_id": "9WJS3Bb_p_tlzEnD7aJRdw", "user_id": "pNZZJl3D5Cffg8vnACASuQ", "user_name": "Ryan M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love to go to this gym! Affordable, really friendly staff and environment, and good bouldering problems. It's one of the cheapest climbing gyms in the area so you can work on becoming a stronger climber or get a good workout in without spending too much. The staff is helpful and good at climbing so they're not afraid to show you the ropes and help you out if you get stuck. The community that frequents this gym is also really chill and fun to work on problems with. They are mostly a bouldering gym but their routes are designed thoughtfully with a lot of moves that help you get better at climbing. They change their walls pretty frequently as well so it's always a new and exciting challenge.", "date": "2/7/2017"}, {"review_id": "Ik3kkYs8OO-1xaO2tDTcbQ", "user_id": "Fz0g3QYKOKzFYLbQZY4hgw", "user_name": "Diana V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 2, "useful": 3, "funny": 1, "cool": 0, "text": "Sorry guys... I can't put you at 5 stars anymore.  I took a year off of climbing for an injury and when I came back, the same OLD routes were STILL up.  I tried sticking around for a few more months to see if new management was really going to bring in the changes that were promised but I kept hearing over promise and seeing under deliver.The updated paint job and taco Tuesdays are a nice new addition but beyond that, I haven't been a huge fan of a lot of the changes.   They moved the weight room upstairs for one.  While it's nice to have it's own spot, it's a little scary to me that an office space is being converted into a weight area.  I'm not an engineer by any means but I hope that floor can withstand people dropping weights on the floor after a power lift.  That and the air is really stuffy too even with the fans on.The cave that I so very much loved because it was the one area that allowed me to practice any over hang and major core intensive technique has been taken away and transformed into a lounge area.  I'm guessing it's supposed to encourage people to stop lounging and socializing on the mats but so far, it's been mostly empty the days I've been there.The final thing that really kept me at the gym was the interactions and the family feel of the regulars.  Now that most of them are gone (still climbing but at other gyms now I guess) the supportive feel and my ability to learn from stronger climbers isn't as widely available anymore.  On the bright side, the staff which looks all new as well, are pretty upbeat and do their best to be helpful.  The new manager/owner-- self proclaimed president?, is also upbeat when he interacts with the members.  I hope that in time with their expansion that the things I've missed with be replaced and/or improved but until then, I think I will find a new home gym.", "date": "5/13/2016"}, {"review_id": "zAOWKGx8RKOZJsBKeW2j4A", "user_id": "UEHr70AtTqYqxqUUHvzZxQ", "user_name": "Patrick D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been visiting Rock City for many years. My grand kids love this place. Maurice and his team go the extra step to please their customers.  Always kind and friendly.  Great idea for Birthday parties. I highly recommend  Rock City to all.", "date": "4/6/2018"}, {"review_id": "3pXQZ7cnxdStjK5NcBjg1w", "user_id": "NFpxkGAan-qUmI9kiEHLyw", "user_name": "Janice L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I came here for the first time with a group of 130 children as a field trip and it was amazing! The staff were extremely friendly and helpful in explaining safety rules and teaching other adults how to properly belay the children. They were constantly monitoring the areas to make sure that the children were being safe. When the children were not rock climbing, they had board games and television available for them. The children loved the tunnel where they had to use headlights to go through! With me loving to climb, I will definitely be coming back here on my own! They have a fairly large bouldering area and they are expanding to have an even larger bouldering space!", "date": "6/17/2016"}, {"review_id": "oX0hZWpCubB8_k7R2iCXVQ", "user_id": "1lEOPrnR9Hng6hflbH2iyQ", "user_name": "Truman J.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Small bouldering gym. Awesome management, unlike the bigger ones in town (Sender 1). Friendly staff. Owner is passionate about the sport and looks like consistently upgrading the facilities. We were there on Taco Tuesday night - about a hundred climbers there?!  Super cool crowd. Also Mad Rock was there to do a shoe demo. Lots of good vibes.Took one star off because not much rope climbing but if you are looking for bouldering, this is it. Fees are super reasonable!", "date": "1/12/2017"}, {"review_id": "fANN1-CR8i3eRH2tNE8BoQ", "user_id": "2PfI9cGXGRNnFn5gAazPVw", "user_name": "Joleena H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "This past weekend, I went to Rock City for my sister's birthday. We reserved a party and the owner, Maurice, took care of us. He showed us how to put on our harnesses, aka our Sunday pants, and made us feel really comfortable since we were all first timers, for the most part.I was very nervous that I wouldn't be able to do it, but it was surprisingly not as hard as I thought it would be and not as scary. They have walls for all levels of skill. By the end of our 2 hours, most of the group was bouldering, climbing without the ropes, and also trying some of the harder walls. There's a cave, which is more like a tunnel, that runs through the entire gym. I didn't go in it, but I wouldn't suggest tall people to enter. Overall, we had a great time! I'm definitely going to go back! Prices are very reasonable!", "date": "3/2/2015"}, {"review_id": "V-lJd30iN4Qa5K05jnRhPg", "user_id": "iGwXK00qQtdoNs7SxoTm3g", "user_name": "Jessenia A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Dave is awesome! He walked us through everything and it was super fun! It was my boyfriend's first time doing indoor Rock climbing and he loved it! This is my 2nd time here. Love the place and the environment. The obstacles course is really cool.", "date": "9/4/2016"}, {"review_id": "1dVan-RONGH57h6pXYd04Q", "user_id": "9-OM7RFtz7EvKdYxnPMqVg", "user_name": "Vivian W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "9/10 would recommendthis was my first time coming here and i had a really great experience i've never been to a rock climbing facility before so david was a great help he was able to help my boyfriend and i get accustomed to the ropes and how to use them to help each other out he was extremely patient and kind which added to the wonderful experience there's also a \"cave\" that you're able to explore which is super cool but wouldn't be recommended if you're taller than 5'9ish my boyfriend (5'10) was struggling pretty hard and i (5'2) was already having a difficult time so i can't even imagine how he felt haha also prepare to sweat if you go on a hotter day since there's no air conditioning and only a small fan (compared to the entire facility)", "date": "8/13/2017"}, {"review_id": "ujHuWkFbuES6msdRJSSQNQ", "user_id": "1fQ86DioG5-9Zulj7eSvzg", "user_name": "Heidi L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 5, "funny": 4, "cool": 4, "text": "I was craving some rock climbing excitement so I came here! Rock City is located in the middle/back of a business park so don't think you're in the wrong area! It is a pretty random place to have a rock climbing center. It was about $20 per person including shoes and halters. We haven't been rock climbing very much so they taught us how to us the ropes and everything. They also provided some chalk.This place does look kinda small at first glance but there are a variety of walls all with different levels of difficulty! They also have many bouldering walls, some where if you reach the top you can climb over and just come down using a ladder. They also have a cool tunnel that goes all around the center. It's pretty small so only kids could have fun with that. All in all, a solid place to get a good arm/upper body workout!", "date": "1/1/2016"}, {"review_id": "rkHc3kict0G27NAVx7-I7Q", "user_id": "5bgsQymr8HDT3tyC1N3Uhg", "user_name": "Sara C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 2, "funny": 2, "cool": 3, "text": "We came here with our Groupon deal and I'm already in love. I've been to a few other rock climbing gyms but this one has a more local-love feel to it. By that, I mean, its not a big commercial gym, so people here don't treat you like just another  customer. This is the average Joe type of gym where they care and treat you like a life-long member. Yes, its smaller and older but is sufficient for beginners and intermediate climbers. Plenty of climbing surface for bouldering and top rope. Their top rope is also different from any other gyms I've been to, meaning the belay techniques and equipment is easier and less complicated. It might be the older style of belaying but I don't mind it. There is a really cool tunnel that stretches across and above the entire gym, and you can crawl through it with a flashlight. It's fun for the first couple of times....mostly fun for the kids. it's usually never crowded here when we come climb which is nice. one of the staff members did tell us that they are planning a renovation soon to replace some of the old stuff, so i'm pretty excited about that.because it is cheaper than most other climbing gyms, we will likely get long-term memberships once our groupon deal runs out :)", "date": "8/27/2012"}, {"review_id": "0PHd6iQlEXPYg8FwHvxFZQ", "user_id": "JmVcJoduwRQHH6Z0E7g5kQ", "user_name": "Darren C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a blast here!!!! If you want to get great overall workout, and sweat a little, come check out Rock City Climbing. It was my first time to try bouldering, I loved it!!! Just a great place!", "date": "6/28/2017"}, {"review_id": "gcjylYzcEcQ4A01SDOMilg", "user_id": "1RMm71ZKmgzfHighJQaiJw", "user_name": "Justin S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is pretty bad ass!  Devin (sp?) is a cool cat and showed us the ropes (pun, obviously, intended).  First time here and we signed up for the 2 months for $40 Groupon special when we were done...awesome deal, considering one time is $20 with gear.Can't wait to come back!", "date": "11/23/2014"}, {"review_id": "W4IfbzrVbzHN0ROk6dBy1A", "user_id": "n8xxCFUMfUnsniqf50CGfg", "user_name": "Morgan M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It may be little, but don't be deceived. There's plenty of challenging courses and paths you can take. Whether you're harnessed in or free climbing, there's hours worth of fun. It's super affordable and Blake is extremely friendly and helpful. He was attentive to each climber and assisted each and every one of us with all of our needs. (A+ for Blake!!)", "date": "6/16/2016"}, {"review_id": "WCkYtoqZDYUQNg4KlPcP4w", "user_id": "vQZkzP12XMCTSgLL7IlRHQ", "user_name": "Jem R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was an awesome experience! Although this is quite small, you could easily spend 4 hours here without getting bored but it is very tiring (for me at least!) We went on a Thursday and it was quite busy especially for the one staff member that was there but he helped a lot! I highly recommend this place for anyone really. It's great for all levels.", "date": "5/11/2016"}, {"review_id": "iub1CIW979yudKoES30vUQ", "user_id": "MGBv4e-Z6lfyUcSVwPXQPA", "user_name": "Anthony V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here for the first time and this place rocks. The staff was extremely friendly and cool. This place offers free climbing, rope, and they got an awesome tunnel to explore! They got something for everyone at any level. Totally recommended", "date": "4/14/2016"}, {"review_id": "OvBvtvPuLcPAhHoysgb0yQ", "user_id": "9u1ad0h4JY5pWr8sM9dgZA", "user_name": "Albert L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 7, "funny": 2, "cool": 1, "text": "I was introduced to Rock City through a groupon deal and despite my fear of heights and lack of upper body strength, I found Rock City to be the perfect place to build my endurance and get a bit healthy at the same time.Rock City contains a good balance of indoor rock climbing obstacles that include bouldering (no rope) or belaying (w/ rope) courses. All courses vary in difficulty that can be distinguished by the colored ribbons of the \"rocks\". If you want to traverse the dark tunnels with a flashlight, you can but only two people can enter at any given moments. Of course, if you've rock climbed at an indoor facility before, none of what I just said should be unfamiliar.What makes Rock City awesome is that the people who work and climb there are very friendly - the regulars convey a sense of community. While the actual square footage of the area isn't large, you would be hard pressed to be bored with so much to do. There's plenty of parking outside and be sure not to pass this place by when you are looking for it for the first time - Rock City is located in an industrial park.Rock City comes highly recommended by me if you want a great indoor rock climbing arena in Orange County.", "date": "12/4/2013"}, {"review_id": "8K9Pze7QCVnqlVWjQ8Q1QA", "user_id": "KMIODUvtOZvytuJQhazwYg", "user_name": "Liz N.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The OC Ropes Obstacle course is a definite must try for team/group bonding. It helps you channel your energy towards course completion and helping your teammates complete, as well. This course is inside an RV park. Not that hard to find if you just follow the road and see a tall obstacle course. The staff - Shawn, Josh, and David - were professional, funny, and super careful in making sure you have a SAFE and GREAT experience.If you are hesitant, do not worry. I did this to overcome at least the fear of heights. The evil clown fear may take longer to overcome... I digress. As you are working the course, you will forget about the height and focus on what to do to get to the other side. Teammates cheering helps. And breathing and following the rules outlined before you begin is important. The zip-lining part at the end is the best! Most important rule: have fun. ;)", "date": "8/23/2014"}, {"review_id": "p75MIx4vJg3rMh6bA8zJzg", "user_id": "ofMESFOXORl9Ng5KGGf4kg", "user_name": "Sammy B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 4, "funny": 3, "cool": 2, "text": "I went to this place firstly after my friend introduced me to bouldering on the hot rock plains of Joshua Tree National Park. I really enjoyed myself out there, albeit the scorching sun and dry weather. Still, I didn't want to drive out 200 miles into the desert just to climb some rocks. Sure, I could go to a cliff somewhere and try to do that, or pretend I was a gecko at work and try climbing the brick walls (not that I did). Instead, he pointed me to this place and after a year of absence, I came back here and it felt like I never left.ATMOSPHERE: 4 starsThe place is located inside a business center and if you weren't looking, you would completely miss it. Who would think to build and place rock climbing walls inside a business building? The fine people at Rock City did. The place is great. Open space, crash pads on the floor, and walls to be climbed. Even if you're new, the place is welcoming and invites exploration. Don't be afraid.STAFF: 5 starsThe staff is chill. Maybe it's because they enjoy their job. Maybe it's because they're helping people who are also chill. Or maybe, just maybe, because they get paid very very high wages. Nah. I'm pretty sure it's the first two. Whatever the reason, the staff is knowledgeable and completely there for you if you need something. Just don't be afraid to ask, especially if you're new.COMMUNITY: 5 starsLike most communities, the common interest of people really get them friendly. Here is no exception. The rock climbing is fun and if you ever have difficulty ascending a path, there are plenty of people who will give you advice. All you have to do is look. Here, even if you come alone, you don't have to feel alone.VARIETY: 4 starsIf you come here often, you might get bored after a while if there aren't challenges for you. Luckily, there are plenty of paths to be had, and they change out the grips into different paths every month or so. They could use a little more work on labeling some of the path difficulties, but overall, easy to use.CONCLUSIONWhether you are an avid rock climber or just an enthused noob, the place is a great find for all those who enjoy climbing. Although you might not be sure at first, give it a chance and I'm sure you'll enjoy it (even those who just want to see some eye candy). They even have rappelling and paths for kids. Also, they have free climbing for up to 4 people who are friends of a member. With so much value, why aren't you there now?!", "date": "12/5/2011"}, {"review_id": "csuYey9zZPY2iF9Nl-CEFQ", "user_id": "nhoGni6Bar7M1VMb5N1JHQ", "user_name": "Seven W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Definitely my first time with this kind of activity but the experience was well worth it.  The instructors were great and the atmosphere was cool.  If your looking to train for #nextamericanninjawarrior or just to get in some exercise I highly recommend this place.", "date": "6/1/2016"}, {"review_id": "NTu2e8GUmPuDGj4fC56RWA", "user_id": "yLW8OrR8Ns4X1oXJmkKYgg", "user_name": "Kimquyen L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 18, "funny": 8, "cool": 14, "text": "Great service. =)This place would be 3rd biggest after Sender One & Rockreation Sport Climbing Center but it's not as new/ nice as Sender One is.Climbing fees are $12 per person plus $6 for climbing rentals. Climbing with belaying area is pretty small but routes are harder & not as high as the routes at Sender One. Great place 2 climb or boulder if it's your 1st time. Good for newbies to learn how to & practice climbing.People are very nice & friendly here so don't feel too awkward if you've never been here before.Tip: there's a Groupon deal right now going on for this place which is a good deal.", "date": "10/20/2013"}, {"review_id": "MnYvU1O5U3OT_Z7r2MrQhQ", "user_id": "3F_rh2bWDryMpZGqPUrxHA", "user_name": "Khamille S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "Three words to describe Rock City: Fun, challenging, and unique! My sister and I visited this weekend and found the walls very fun and doable considering this was our 2nd time rock climbing ever. Rock City was challenging because we tested our abilities by bouldering and going on slopes that leaned towards us (these walls are so challenging!). Lastly, we found this rock climbing gym as unique because of their tunnel! After going through it twice, we felt victorious. Pricing was not too bad for a day pass but what bummed me out was that they didn't have any student discounts to offer at the time when we went. For this reason I knock down one star.Over all, it was a fun experience and now I'm sore but in a good way.", "date": "8/29/2015"}, {"review_id": "dBLaQwvHOaLnBPnZZtSI0Q", "user_id": "S75poMk8KJ_UVgJj3aKuwA", "user_name": "Pixari F.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I really enjoy climbing at this gym. It's inexpensive and super fun. I am constantly finding new routes to challenge myself with. They also have these neat cave sections that are really challenging and remind me of the tube play spaces when I was a kid. I love it.", "date": "2/5/2017"}, {"review_id": "0LIRKRIw3IIZUtkO8VMQoA", "user_id": "R4fsipbu1N8FcqiaFqACcg", "user_name": "Adena H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A great indoor place for kids to climb on the walls, the staff is very friendly! Very affordable and the kids had fun", "date": "4/9/2017"}, {"review_id": "h8LrokB8r7t4bdEmwZjTqA", "user_id": "KkbAUzlrhFl5ib3gpEQeOQ", "user_name": "Jess K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 3, "funny": 2, "cool": 1, "text": "The stars don't reflect anything about this place except my disappointment. Some friends and I wanted to go on the ropes course. When I called I come to find out they don't own it anymore and it's run by a different company, but the guy over the phone (who was very polite) said it was a $385 minimum for a group of around 15. bummer.", "date": "5/9/2015"}, {"review_id": "RyhL78ejsMvvwsgFrImVPw", "user_id": "yGpuSutseQS9FROvlv-0qg", "user_name": "Justin S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 7, "funny": 0, "cool": 0, "text": "This is my home gym so I might be biased. They have G R E A T membership rates and are really flexible. The day rates are $12 for the day with $3 for shoes and $1 for chalk. I think they have a full gear and day package for $17. This place isn't the cleanest, chalk everywhere (the bathrooms are clean though!) but the people are the friendliest and the place has a lot of character. A lot of people hang out before and after climbing just to hang out. The routes are changed often enough. There are a lot of walls with different terrain angles. The place is probably better for bouldering but plenty of people are top roping and belaying here. The gym is separated into sections. The left most side of the gym is for top rope with some of the same holds used for traversing. The pillar is a big pillar with bouldering routes on the sides and front but with a back acting as a top rope head to head racing area. The side wall is a nearly straight wall with a triangle feature jutting out. The cave is next to it and is a room with concave walls like a cave. Hang upside down in here! Then comes the front wall. It has mostly straight walls but with a large feature in the middle making some routes angled ones. The far right of the gym is the top put room. Part of it is for top roping but most of it is for topping out. You have to climb to the top and climb over the wall on to a walk way area then climb down stairs to return into the gym. It's s very satisfying achievement. It's a great place to climb!Every third Tuesday is free with a member so come make friends! It's also not a bad place to bring a date ;)", "date": "1/12/2015"}, {"review_id": "-bhgDROxBh672sO7YWV5xw", "user_id": "MF2hyQHEu1Kzyb2IgcLuPg", "user_name": "Ivy W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 6, "funny": 3, "cool": 5, "text": "I grew up with ballet, ice skating, gymnastics, swim, track, and any and all sports they offered at our school when I was a kid. It's safe to say I was blessed with supportive parents who provided me opportunities to compete, but when I competed, it was rare to find what I've found at Rock City - friendly and encouraging spirits! I was rather hesitant to visit being that (1) I hate crowds and (2) I have a moderate-severe case of acrophobia. However by the end of the night, I was glad to have gone even though I was shaking by the time my feet touched the ground. Rock City is a solid choice for beginners like myself to start. I was a little turned off by the crowds and all the heat trapped inside, but being as how I went on the 3rd Tuesday of the month with a member and only had to pay for the $3 shoe rental, I can't complain too much!I haven't been to other climbing gyms to give a fair comparison, but Rock City wasn't at all what I had imagined. It's in a small, warehouse type space...and there didn't seem to be too much space dedicated to top-roping. When walking in, make sure to sign in and complete a waiver!", "date": "11/15/2014"}, {"review_id": "5keczxU3gWv7d5gaKkHNhw", "user_id": "3z_lnCPq7lgeNlOzKLBLfA", "user_name": "Eric L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Nice little place that is really efficient with the room that they have.Pros: There's plenty to do and it's cheaper than most other places that i've been to. $20 per person with shoes is pretty great. Includes the harnesses, chalk, and etc. The people working there are really nice too. There's this one older guy there that had no problem climbing everything there. I hope when I get to that age that I can still do all that lol. That was pretty impressive. Anyways.. plenty of walls to climb up that vary in difficulty. It'll keep you busy. I really like the bouldering and free climbing area too. You can actually climb over the wall and on top and walk down to the other side. It's really neat and I wish I could have spent more time there. Then there's the long rope climb to the ceiling. It was easier doing this as a kid lol, but I got up there with a little effort. The tunnel is a MUST. It's this awesome small tunnel that snakes around the warehouse with a few different exits and entrances. There's also a gym upstairs too and a waiting room with board games and what not.Cons: It's pretty small and can get a bit crowded. Could be a little cleaner.Bottom line: I really like this place. Some of the climbs were actually a bit challenging lol. I finished all the ones I tried, but damn it does a number on your hands and fingers. Climb till you bleed literally lol. I wish I lived a bit closer because i'd totally come back here more often if I did.", "date": "3/22/2016"}, {"review_id": "rtwYr_BHAawIefGEcy0HNg", "user_id": "shTVQJhu-NftZfRTUxYxrg", "user_name": "Claire S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Is it strange to say I'm nostalgic about a gym? I was only a member for a few months, but Rock City is where I first got into rock climbing. It's a small gym, but the space is well utilized, and there are courses for every level. It's such a friendly, open environment, where you don't need to feel bad about yourself if you're a beginner, or act snobbish if you're a seasoned pro.The walls are high but not terrifyingly so, and there's a huge variety of options and routes every time. It's very well priced, and has a no-frills sort of energy.Compared to my new gym (which feels like I've upgraded to some ritzy version that I'm so lost and confused in), it's a great place to start out/practice/hangout, and if it were closer, I'd probably still be there.", "date": "7/5/2013"}, {"review_id": "NVoV0EiuT6tKvkMVQ-bLQg", "user_id": "47BfAFyLpGflmR-pn7gmJA", "user_name": "Olin C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 2, "funny": 2, "cool": 0, "text": "No AC is a big turn-off during summer time. Small center, about 4 rooms. Difficult climbs. Got confused over how they classify/organize the colors. Good price though. Dont even try the maze, its so small, you could get stuck inside the maze hole.", "date": "9/9/2014"}, {"review_id": "e1AdWhPdD2OehOc3ctY8SQ", "user_id": "iX8eHn-yhhPuLhpV3xxu-w", "user_name": "Laura H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Staff is excellent and super nice. The climbing tunnels are fun and something I haven't experienced before in a climbing gym. On initially entrance it appears small, but there are so many different areas to go to, and different problems to do. A part of the gym has a climb up and over which is fun as well. I'll go back for sure.", "date": "7/30/2016"}, {"review_id": "y-lLA7Aa1MS4N2fp0_Dh4w", "user_id": "vaNAcg_W_lN2dh1helUKpg", "user_name": "Andrew B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I went to Rock City for the first time in grade school with my Boy Scout troop and have been going once or twice a year with friends ever since. It's always been welcoming and a great environment for us novices. The staff are never shy about answering questions and are passionate about climbing.Recently I went with some friends and the man at the front desk, Gavin showed us around and was super cool about introducing my first timer friends to belaying and the basics of climbing. Really great guy. The gym never seems crowded, even on weekends. $20 gets you an all-day pass with a harness and climbing shoes (climbing shoes are a must, your tennis shoes simply wont do). I'll always come back to Rock City for the occasional climbing thrill.", "date": "1/6/2015"}, {"review_id": "ljucaTdHpygDbgZXEPBJwA", "user_id": "DLrKOMUBBH7rZ1oNkx-vKA", "user_name": "Alex M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The people there are wonderful.  My wife and I purchased an annual pass...a month after that I had a serious accident and was in the hospital for 2 weeks and had major surgery.  I called them weeks after the fact to place my membership on hold...they readily agreed and placed me on an indefinite hold till I could come back...just great people and great customer service...", "date": "6/27/2016"}, {"review_id": "w13jx0K-Y2pP2TOOF9-zqA", "user_id": "9sdu-m075T6qdB46wXP46w", "user_name": "Austin C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "It was my 2nd time rock climbing at an indoor facility like this one. The price was fair ($15 for free climbing and shoes), the pads were nice and comfy to jump on, and the climbing routes were neither discouraging nor too hard. If you go inside the \"cave\" make sure you bring a flashlight! The front desk guy said it wasn't necessary, but I can tell you that if you hate smelly body odor, tight spaces, and/or temperatures that will make you pour sweat, you should DEFINITELY bring one.Four stars for the bad air circulation :[", "date": "8/11/2012"}, {"review_id": "9FJJBwGkOOMkLUt9F5FB8w", "user_id": "b16ACOfRZoKh2v9raomm9Q", "user_name": "Andrea R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 3, "funny": 3, "cool": 1, "text": "I decided to try this place out as my first place to ever do bouldering. I came here to practice secretly with my friend because my boyfriend has been wanting me to climb with him at his favorite Bouldering place lately. Shh. The first thing I noticed was that it was pretty small and crowded. The guy at the desk was nice and helpful though. The pink tape was for all the beginners, yet there was hardly any of that color. The best thing about this place is the secret maze. You go through a small crawl space filled with obstacles such as poles, ropes, ladders, slides, ect. which is all inside of the rock climbing walls!This place is pretty fun, just wished there was more space for everyone and more walls to climb. Rock City won't be my main place to go but I'd still like to stop by here time to time.", "date": "4/22/2014"}, {"review_id": "PxoNVOWUK_ARhjMGBQuRJw", "user_id": "Ce0OOcgwFGGWQkzUzioSFg", "user_name": "Braden A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Went a couple days ago and it was $18 per person without shoes (much harder to climb without the shoes btw). The staff was very friendly and really helpful in teaching us how to climb (guys name was David). It's a pretty small warehouse type place with only a few walls to climb, one of the smallest climbing gyms I've been to. However, they have some great bouldering walls. Everything from beginner climbs to upside-down crazy bouldering. Fun environment and a great way to spend the afternoon. Would definitely go back again and recommend this place to friends.", "date": "3/10/2016"}, {"review_id": "9IvTSky1_JznktSKRc0VVQ", "user_id": "3uROkUN1tekJ2AZZgxSdhQ", "user_name": "Jenna M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A little intimidating at first. Helpful & knowledgable staff. Will definitely be coming here more often.. Just wish it was closer to home.", "date": "4/14/2016"}, {"review_id": "V6R4R197qfBzYdFAo9Jn9A", "user_id": "4bQp5jnqpoQpNfxMg1y_xQ", "user_name": "Margaret L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I absolutely love this place, I have been here about a dozen times and with a bunch of different people with different climbing abilities. I love that the employees here are super friendly and helpful. From what I have seen, this is one of the larger indoor rock climbing gyms in the surrounding area. The walls can be as challenging as you like since you choose which path to take, which makes it perfect for all climbers.If you are planning on coming here with a big group, definitely make a reservation ahead of time, especially on the weekends, as it can get kind of busy in here.Also if you or your friend's don't have any experience with climbing, please ask the instructors there to show you how to belay properly! This is important for your safety and those around you. My boyfriend was dropped from the top of the wall because our friend didn't check the belay.... we got lucky, but it was a painful experience.Happy (careful) climbing!", "date": "5/2/2012"}, {"review_id": "JwGGShK1UFHQIVYr2zm9sg", "user_id": "BynUZhAOUZAVILzAONdIog", "user_name": "Amanda M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, friendly helpful staff, laid back atmosphere. A place to build your skill,  as an advanced climber or beginner. I will definitely recommend this place to others,  and I hope to return soon!", "date": "11/7/2014"}, {"review_id": "k8jJVW4FYzzhLYK8-a_vNg", "user_id": "bmYP5FTjxnhj4axqkv-H2g", "user_name": "Lee L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The location is a little nondescript as the majority of the parking is by the rear entrance.  We arrived at approximately 1030 on a Sunday and it was relatively empty.  The guy at the desk was super helpful as we were all newbs.  He went through the basics with us and it was just fun fun fun from there on out.  By noon, the place got busier but it never felt crowded and there was plenty of different walls to challenge ourselves.  The other patrons were all very courteous and friendly.  It was a lot of fun and we're definitely going back.", "date": "4/24/2016"}, {"review_id": "5_BSnuspfVN-GNTzbiWJEw", "user_id": "KIaI3SBNeYhNtBT3n2uJPA", "user_name": "Debbie H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We went here last night for my sons birthday! Everyone in our party had a wonderful , very memorable experience!The manager was very friendly and gave us a great deal for my sons bday, I really appreciate the personable service we received. I highly recommend Rock City!", "date": "8/17/2014"}, {"review_id": "tHEH21-2i5bsDyX3FJWW1Q", "user_id": "-3dYYtlTDEcshFnHKw1KNQ", "user_name": "Addie M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 2, "text": "My first time climbing here! I've always wanted to go rock climbing, but it was always a) I wasn't wearing the proper shoes (i.e., the wall you see at fairgrounds), b) never found someone to go with, or the most often c) I absolutely have NO upper body strength. My boyfriend and I scoured around the area for fair-priced rock climbing centers, and we decided to go to Rock City only because it was super close to home, and they did offer harnesses. I wasn't paying attention to the fees, but I think it was $17 per person incl the harness. We also had to pay $3 for the shoes, absolutely not paying attention to their current deal on their board ($5 for shoes, harness, & chalk...but wasn't sure if it was for members or non-members).Anyways, I feel that it was a well-sized gym; I think the walls stood about 25 feet give-or-take. Lots of routes and I think they had about 2 small rooms with very acute angled walls (like, 45 degree angles), which stood at about 12-13 feet tall. My bf and I didn't dare go into the caves, haha. It's super dark, and according to the signs, about up to 11 ft drops...and it reeked of musk and sweaty feet--on top of that, I am slightly claustrophobic anyways lol. This gym has a great atmosphere, I feel that I was NEVER judged by other climbers, even when I fell off the wall so many times )= I was complaining to my bf on this one wall on how I couldn't get up right, and despite that I was cheered on by another climber that I should still give it a try--what great sportsmanship!We spent a good 2-3 hours until our forearms and hands felt tired. I think about $15-18 worth to climb for the whole day, opening til' closing of the gym, is an excellent deal. They do offer memberships varying from monthly to annually. I'm thinking of coming back here again in about 3-4 weeks. Super satisfied! -1 star because I think they could definitely open more windows or at least create some...I have to agree with a previous reviewer's comment regarding ventilation.", "date": "8/24/2012"}, {"review_id": "3FRZHUs1l3G-b93S1-zxRA", "user_id": "5oGReAoRlJTLbz1713f0Ow", "user_name": "Julie K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have a fear of heights but always wanted to try rock climbing. My friend came to visit for few months (from korea) and she's experienced climber. We found this place and tried it out. Its my first time climbing and I was super nervous and scared. The employees were nice and helpful. Made jokes while I was climbing up that way I wouldn't be too scared. LOOOL For first timers they make you wear the harness and use the ropes so you can get used to the feel. My first try I was too scared so stopped half way and came down. Second time my competitive side came in and challenged myself to the top. Once I reached the top \"WOOHOO\" but when I looked down ...\"oh dears\" lool but I managed to get down skip the ropes and started to climb the walls without the ropes. Overall I like the place it fun even the climbers you don't know are nice they'll give you tips and encourage you! Minus one star is that its not a big place so it can get crowded if theres lots of people and when yo get sweaty you have to wait till you go home to wash up.", "date": "4/4/2017"}, {"review_id": "41URqhGD0n2jNwrXLEkLAg", "user_id": "hIoHQ8k2M5buFo9FWIO5Fw", "user_name": "Mena P.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My 10 year old little brother and I were looking for something fun and active to do and decided to try rock climbing. It was the first time for the both of us and didn't know what to expect since we both had zero experience rock climbing indoor or outdoor. Upon arriving we signed a waiver and the guy at the reception desk kindly walked us through the rules, showed us the different walls we could climb, and taught us how to belay. We rented some shoes and a harness, which I recommend you do because it's kind of difficult to get a grip with tennis shoes. We ended up staying there from 6pm - 11pm. It was pretty cool that everyone was just doing their own thing and I felt like it was a very accepting and non-judgemental environment. My little brother absolutely loved it, I also thought it was super fun and a very good workout. It is quite challenging but it feels great when you actually make it to the top of the wall. If you're looking for a fun new sport to try or looking to find a new hobby I'd definitely recommend trying out Rock City.", "date": "4/19/2017"}, {"review_id": "bd6Q50R_1kXsuWloLXLUkg", "user_id": "qH2C2nckBQdlmc2mtdcCCQ", "user_name": "James C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What I really like about this place is how friendly everyone is.  The bouldering problems are challenging, but there are always fellow climbers or even staff members that help you out.  This place has been a source of frustration and soreness for a good two months, but in a good way.On a side note, I'm really sad I didn't get finish that orange-dot problem before the wall had to be changed :(", "date": "10/19/2014"}, {"review_id": "r4YscZObw_2mGZg1kMVfaA", "user_id": "ndHp2aM8bU1tZnGU829bNg", "user_name": "Sophia C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 4, "funny": 1, "cool": 3, "text": "If you're just starting rock climbing, this is a great place to go. I came here thinking it was just climbing up over an over again but it was actually really fun. They have rock climbing and bouldering for $14 a day. The guys working there were really helpful and nice. The place also has tunnels that you and another person could crawl through. Really cool! They also offer this thing that is like a tight rope that they'll set up for you if you want to try. Overall, great place!", "date": "8/14/2013"}, {"review_id": "W8FKNfrM6Tj3LNJ-MDCGUA", "user_id": "XbMMfaLlyvCfrVdgLMGcGg", "user_name": "Scott A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My teen son and his buddy got a 2 month membership here.  Great customer service and a nice bunch of folks here.  The staff helped the belay and they really enjoyed the free climbing areas.  If you want to wear out your teenager, this is the place to take them.  I have never seen two more exhausted kids.  They had a blast, but couldn't stop whining about their sore muscles and strawberries on their knees.I hope to get them back out their soon, we'll see!", "date": "2/7/2014"}, {"review_id": "NeJos5tv6d3WVQ_lflXrtA", "user_id": "haykF4GoVTet-osVK1Hrng", "user_name": "Ev L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Wonderful experience :3 garret was such a sweetheart, and made for a great experience. Lots of walls, good community and the tunnel was amazing.", "date": "9/19/2015"}, {"review_id": "6Sh5LoHyX_QECR_h1xpWGg", "user_id": "CbfFwbuRfrOtW0X55U8HFg", "user_name": "Jon B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I started coming here a little over a year ago with a groupon I purchased and it was certainly challenging! The first time is always rough for anyone  just getting started. Anyway, I didn't immediately buy a membership at first, but I did miss the experience! I also enjoyed the friendliness of the staff and even the others who climb there are all great people! I try to come here when I can and I am still learning new things to this day!", "date": "9/16/2015"}, {"review_id": "5Q-BEkj3ml1vFp5PImc5kg", "user_id": "bImgbp4W-s8BAHyTWSDQxQ", "user_name": "Melissa C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my friend Miriam. We were helped by a delightfully sarcastic guy named Blake. He explained everything to us noobs, and was incredibly reassuring. Being incredibly afraid of heights, this was greatly appreciated. After a few tries, we were feeling much more comfortable. This was a lot of fun. I would highly recommend this. I would definitely come back.", "date": "1/26/2016"}, {"review_id": "jFTINq71SYDE2yZWlCfr4A", "user_id": "jC4GF4qGakKviK75b8wFRQ", "user_name": "Jennifer A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "LOVE! LOVE! Must go! It's so fun and adrenaline rushing, boyfriend and I checked it out, after staying in Cali, and the female at the Front Desk greeted us very friendly and warmly on a Taco Tuesday night, so everything was half off! It was an amazing experience, and Scary after knowing my life was in my boyfriends hands, it's really as good as it gets, Oh and be prepared to get lost in the tunnels, my boyfriend had to come to the rescue.......Yeah saved me twice. Fun experience never too old for this!", "date": "1/16/2017"}, {"review_id": "XBZuURp-ab5S1Jjj4jwAqA", "user_id": "ymrKIDXJG2Pp1QfN-5EuGg", "user_name": "Brandon D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice and super helpful staff! A nice variety of routs depending on your skill and a very clean gym! They also have deals that come up with used shoes and chalk bags. I got a used chalk bag in really good condition for $3 so I am stoked about that! This gym does not have a competitive vibe which is also really nice! All around great gym and will defiantly be climbing here for a long time! Definitely recommend this gym!", "date": "2/5/2017"}, {"review_id": "l0Td9seG5ihtWF3V8F14JQ", "user_id": "K3KMfjsCQdtwmXexqBUssw", "user_name": "Tragedy D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 3, "funny": 3, "cool": 4, "text": "Great place for beginners and intermediate alike. There is a narrow area, so try to avoid it when more people get there or you'll feel claustrophobic. Get in early on the weekends to beat the herd.Last time I visited the mats needed some cleaning because it stunk.", "date": "2/14/2013"}, {"review_id": "dp9jzGfFbkkAvHV1K2xdVA", "user_id": "Kn0bCqExVtb0VKcc4efa5g", "user_name": "Memo U.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My Son and I just recently found the world of climbing, and we love it, and a big part of that is due to the amazing experience we had at Rock City.  The staff, and the owner Maurice are amazing, and really go out of their way to make you feel at home.  The members have all been extremely friendly and helpful as well, lending to that feeling of family and community.  They have problems for all levels, so If you have been thinking about possibly giving indoor climbing a try then Rock City has to be the first place you stop.", "date": "11/3/2015"}, {"review_id": "sJugjoE48Muyi1Zx3wThGQ", "user_id": "bN25cOkFDluT1NjMNkWqAQ", "user_name": "Kat K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Thought it would be a great deal to get a 2 month unlimited pass for $40/per person.  My friend and I got the deal, but we lagged so much because our schedules conflicted.  She ended up being unable to redeem and it and sold it to our other friend.  Finally when we activated it, my friend and I were excited until we realized how difficult it was.  There were a couple walls you can climb up on with the rope, while the rest of the half had no support.  Since it was our first time, Gavin instructed us on how to put on our gear that's supplied to us and told us how to maneuver through things; he was very helpful and friendly.  If you're new at this, make sure your partner has good coordination.  I didn't really trust my partner and was scared for my life (kind of serious about it too).  I already have a fear of heights as is, but I'm down to try anything new as long as it's safe enough.We climbed different parts of the walls a few times and then called it a night.  After that, scheduling another time to come back was a hassle.  Things always came up.  In the end, our schedules always conflicted, or one was tired or got off work too late, etc.  Needless to say, we never made it back during the two months after we activated it.  So lame...Also, if you're a newb, I'd say do a one day thing and see how it goes.  Some of you might not like it.  I had friends who purchased the deal too and they were over it after day one.", "date": "4/23/2013"}, {"review_id": "aEIXWI3_s6qTG6lLgRXz9Q", "user_id": "JI8j3huwrDfiRtRLePFxpw", "user_name": "Sam P.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my 3 1/2-year-old son who loves to climb everything. He had a blast. The staff is very friendly and informative. He had a really good time going up and down the walls. Very safe and clean facility. Recommend to anyone who has young children who need to burn energy.", "date": "10/13/2016"}, {"review_id": "l2k1tnLUdUts8XtOVwJEdA", "user_id": "PhmMWBBQda24K9z6b9R-sA", "user_name": "Jeff K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "They have a special; if you come here on the third Tuesday of each month with a member of rock city, you get in for free.the caving experience was awesome.  if you are claustrophobic, do not go inside!  i warned you.  it gets stuffy and smelly inside the man build cave, but the experience was well worth it.  i could totally see a horror movie getting filmed inside the cave.  with blood on its walls, and a monsters lurking around every corner...  yeaaa... sorry if i scared you, but i swear i'm not psycho.as for the rock climbing walls, they are legit.  there are an equal number of free climb and rope assisted walls for the beginners to the advance users. the staff are friendly, and everyone is super helpful at the place.  its like a mini community.just remember to bring water.  it gets HOT inside.  if you don't sweat, then you are just rock climbing wrong...  lol", "date": "8/8/2011"}, {"review_id": "8WPiKl80EPPgWtX6ZktJOA", "user_id": "bhKR-RcsqZgbABImMy2IBg", "user_name": "Mary L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "*** High Ropes Course Review***I've been to Rock City a few times and have always enjoyed it, so I decided to book a private party for my leadership class at their off-site ropes course.  My students loved the high ropes course and conquering their fears. My favorite part was the zip line to the bottom.I was really impressed with Rock City's ropes course They charged only about $15 each and it was a truly memorable team-building experience. Thanks!!", "date": "2/17/2011"}, {"review_id": "MxEYrI5j52OQhVOtkVPVMw", "user_id": "XDQqnJcInKC9h7zPrx7DAQ", "user_name": "Diana J.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 3, "cool": 1, "text": "I was kind of dragged here by my friend.Originally we planned to go hiking so I was wearing short booty shorts, basically, and a tank top. I'm quite sure if anyone looked up at me they could see my booty cheeks.. And my friends were guiding me on the rocks and holding out their arms to help break my fall sooooo X.xI've never gone rock climbing and the first one I accomplished (the closest to the cashier area) I just clinged against the wall because I did not know how to get down and did not want to jump down (no harness but there was foam at bottom). Imagine those stupid cats that climb up a tree but can't get down and some nice firefighter has to go retrieve them. Except I had no nice firefighter and did not want to make a scene :(Rock City has slanted walls and I think this place was not made for amateurs. There were mostly guys with big, bulky arms and they climbed the walls so gracefully. But I accomplished all the challenges I set myself up for that day. :) Three different climbs total.... In a span of 2-3 hours..1) The first one was a straight wall up and down and was a good one to overcome at the beginning.2)The second one was slanted and being only 5'3 I had to grapple and jump for several rocks. I had to do this one several times because I'd miss or arms would die on me. After so many rests and attempt it was so great just reaching out my right arm and touching the tape at the top. I almost couldn't support myself and touch that tape. It'd be such a shame!3) The third one was climbing up a slanted wall and then going over the top and getting to the second story. With some guidance I got to do this one. It took so many tries and just swinging mindlessly and hopelessly on the rocks to finally get this one. Ahhh, small accomplishments but nevertheless I was surprised at myself for being able to rockclimb. I honestly imagined myself just hanging one feet from the bottom because I would suck at it. It's such an advantage to be tall and have buff arms. The guys basically did pull ups the whole time and didn't need to swing and jump to grab rocks -_______-$15 got us a whole day pass to rock climb to your heart's desire with rock climbing shoes included. I was satisfied with 1.5 hours, 2 hours was pushing it.Also.... we went on a hot day. It was pretty humid in there and smelled like feet. Another also, the owner is not very professional though he is nice. He threw shaved iced at me for fun when my back was turned.... I was slightly irked but cooled myself down (pun!). He could've just given me a free shaved ice cone.", "date": "10/16/2012"}, {"review_id": "2_eNBhumphjqDXQBXOpZNA", "user_id": "fHqEjcCn2R5WVR9otfdSBA", "user_name": "Jessica L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "I can't say much bc this is my first time going rock climbing but i LOVED it.  It's quite cheap ($15 incl shoes).  I believe it's another $3 if you want to get a harness and the chalk bag is $1 (we didn't have to get this bc our friend is a member here and already had a chalk bag).  I think there were 3 diff rooms and there are diff paths marked w diff tapes.  The vibe is very friendly there.  They also have tunnels inside.  It's very dark so you'll need a flashlight or get a glow stick from them. It was really hot inside but there's this one point where the air goes off.  It's pretty narrow too.  Overall, I would most def go back again.  This time, I won't be wearing jeans -_- (I wore jeans bc I didn't know we were coming here so don't shake your head at me!)  Y'all should def try this place out~", "date": "7/7/2012"}, {"review_id": "cEvk7XVM65Aqqlfc9kgIOw", "user_id": "QaIrM6CxrWArGBxinbJmcw", "user_name": "Christine K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 4, "cool": 0, "text": "Friend:  Why are your hands so jacked up? Is it from climbing!?!Me: These aren't peasant hands!! I'm breaking them in!!Everytime I walk in  here I somehow find myself singing Tyga's \"Rack City\" Rack Rack City B*tch..City( Bleeep*)...Rack Rack Rack City (Bleeep*) (Get it? Rock City? Har...har.. )So why do I succumb to all the skin ripping, callousing, and pain? Because climbing/bouldering is addicting!  Thanks to Groupon, I was able to start a new hobby.  Rock City Climbing has great staffs.  The people who climb  here are also nice and great.  However, in terms of cleanliness I must say it's not the greatest.  Don't get me wrong Rock City Climbing Center is a great place to get your climbing/bouldering on but after visiting a few other climbing centers, I felt that Rock City needs to do something about their tagging system.  Other places I've been, the walls were well kept, organized, and tagged.  You were able to see the grades for each climb.  However, with Rock City it's all over the place.  Actually, they don't even have grading tags on the walls.....but it's ok just climb! Go GO GO!", "date": "12/7/2012"}, {"review_id": "aBhYw4HqJYpmDREMiDMJ7w", "user_id": "ogXbtFvgABAY7BGrBCqnaA", "user_name": "Megan V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I was really excited about this place. Been climbing for 2 months now. I love climbing. I loved the music they play and the ambiance. The people are certainly very helpful and cheery. They're supportive and it's always a good time.", "date": "5/17/2015"}, {"review_id": "EjiI5CnIGYDFtZ1DVeZisw", "user_id": "d1JaO5eOP63TtwGIT7wlAg", "user_name": "Lena S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "Walked in and walked out within 5 minutes. Stood at the booth waiting for someone to help us and nothing.  Couldn't even tell who worked there. I even called ahead to check if it was busy, the guy on the phone was totally nice and told me to fill out the waiver online.", "date": "2/14/2015"}, {"review_id": "BS6OJpsSlU2qe8qIyoJHgg", "user_id": "Z9ES5GOrnpVOlBithqzYPA", "user_name": "Travis G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place for bouldering, crazy amount of routes to take for all skill levels.", "date": "7/13/2015"}, {"review_id": "-7NalPltRKZ_Z-JgFSQYPQ", "user_id": "4xmsmz4HDg7NqVe7KcFOWw", "user_name": "Bonnie H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "outstanding place for kids and kids of all ages! staff is outstanding the price is right and what a way to exercise for fun!", "date": "6/3/2016"}, {"review_id": "sHYiLOIBn_EAYr8EUoYfpw", "user_id": "DFQ_65a1qs3SvkiDW9LvKA", "user_name": "Yudi C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "The place is ok, but too hot during the hot day.  And the place is not that big, thus it would get crowded easily.  It might not be a good place for beginner if they want to do bouldering since there are not lots of pink tape for the beginner.  The obstacle course looks fun, but too bad it's on different location.  The good thing is that it's less expensive than other places.", "date": "9/10/2014"}, {"review_id": "Ybq1U-P5moQx3UJ4yFXWwg", "user_id": "lKnF4MitVC7dEcrhQEinHg", "user_name": "Danny T.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 5, "funny": 3, "cool": 4, "text": "Rock City is freaking cool!  My friend has been really into recreational rock climbing as of late, and he brought me in on member's night to check out the place.  As long as you came with a member on one of these nights, you get to climb for free.  Shoe rentals, however, are $3; but that's a steal.The place was pretty tricky to find.  It's a warehouse in a pseudo-dark alley setting.  The insides were different types of rock climbing walls and of different difficulties.  There was an area where you can go climb with a harness and plenty of places to just climb without.  The rule is, if you climb above 15 feet, then you have to wear a harness, if not, you're in the clear.I had a freaking blast.  I'm a fairly fit guy, and I managed to do fairly well, but there is definitely a lot of technique involved.  How it works is, all the rocks are color-coded, and once you pick a color, you have to stick with that path.  I stuck with the harness-free climbs.  When you clear every rock in your path, you end up over a wall that takes you downstairs to the front door.If you haven't tried it before, come on a member's night and give it a try!  If you end up liking it, Groupon has a good deal that comes around every once in a while.", "date": "1/6/2012"}, {"review_id": "1-KaVY4LGYfnz0hfS8Jhfw", "user_id": "e_lAMPl-gS4-3Ekb-EmgjQ", "user_name": "Megan F.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Went here with a few friends this past weekend! It was a great day activity for groups at reasonable price! ($18 for the day). We had a lot of fun learning how to properly climb the rock walls! I would definitely go back!", "date": "3/1/2015"}, {"review_id": "YOkkhlEDDgALT593-Id88Q", "user_id": "zK_rBPQthJXwzd-tkLwjjQ", "user_name": "Henry H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place for rock climbing! All the rocks are labeled clearly with proper difficulty, Most importantly, the people here are awesome! They would teach me and give me tips even though we don't know each other. I love the friendly atmosphere here! It's perfect for beginners !", "date": "9/20/2014"}, {"review_id": "BsV5gdujQTCW2nD_h9OSDA", "user_id": "DGszSnRNWoAOtD8WGf9wpg", "user_name": "Kevin C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Well it has now been over two months since I visited this gym but I have fond memories.I only came here once but the layout of routes, friendliness of staff and over all feel would make me come back everyday if I lived closer. They have a good selection of various levels of routes with interesting problems moving from one room to another. The bouldering is pretty low so there were no height issues with the moves as in many gyms, and by height issues I mean both the reachy problem issues and the crux being too high off the ground to want to attempt the moves. I have been to BCR, ARC, Hanger18(both), Arizona, Seattle and Vegas gyms, so I have a few to compare to in that sense. Sure some of the other gyms have been a little cleaner and some have been a lot larger but overall I would choose this gym over many of the aforementioned gyms just because of the staff interaction and friendliness. I will be back soon.", "date": "3/19/2010"}, {"review_id": "3BOavT0JFvL24qiDaQ-gzw", "user_id": "gSt52u89EZ2MPzrY0smq2A", "user_name": "James L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 2, "cool": 1, "text": "I really enjoyed myself at this place. They're really creative with their \"caves.\" When you go, make sure you ask for their flashlights so you can go into their caves, but be warned, as long as you're in the cave, you're going to be smelling feet the whole time. Their price is decent. If it's your first time there, you'll most likely have to sign their waiver and go through the tutorial on how to belay.Their \"rocks\" aren't that easy, but if you're like me and you like a challenge, you're going to have a good time. Like other rock climbing establishments, the temperature in there isn't going to be cool. Make sure to dress accordingly (I saw a guy wearing jeans, flip flops, and a sweater. If you don't dress accordingly, you're going to have a bad time.)", "date": "7/15/2012"}, {"review_id": "FY-OzFT9ZDkqok7d73eH_A", "user_id": "LKz29KBNUQLSvoV6JJcjAA", "user_name": "Rachell V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Absolutely love this place. I've been to Hangar 18 and I definitely favor Rock City. Better crash pads, friendlier environment, smaller and more welcoming.", "date": "8/9/2014"}, {"review_id": "FaDxO8oLiH87Aj9OcY7oqQ", "user_id": "o4AJoiOcHk7KGZfhdpOL2Q", "user_name": "Sara P.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "One thing I LOVE is getting a work out in with out having to be in a gym. I had never been rock climbing (in or outdoors) and this place proved to be a great challenge and an awesome time. Did I get in a killer work out in an hour???? I'm sore today, so it must be true!Everyone is friendly and encouraging. Can't go wrong in that environment. I finished two routes and can't wait to go back and increase my skills.Definitely worth a try if you are tired of you current work out routine. Note: They have doors on both sides of the building, which keeps any odors at bay.", "date": "2/8/2012"}, {"review_id": "vxVo3EQ_FeA46hbfWaKb1w", "user_id": "Q8ricFpgPjYkVLbw0vKP2w", "user_name": "John L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is awesome. With more and more options for gym climbing opening up day after day, and trying out many of them after three years of consistent climbing I have Stayed at rock city. There are several reasons to climb at this gym over others. 1. Community - I have never climbed anywhere where the community was so welcoming and helpful. There are more than a handful of people that will show beginners the ropes, help intermediate, and suggest new things to people that climb at higher levels. When I first started I found it very easy to ask for help and advice and progressed quickly because of it. Now I am happy to be in the role of a helpful climber to anyone who needs it. If you are just starting out or even looking to climb harder this is the place to go.2. Price - You cant beat the price of Rock city it is a few bucks cheaper than anywhere around for a day pass and a whole lot cheaper for annual membership. at the time of writing there has been several groupon deals that allow for cheap monthly access as well. The groupons happen often and I can only assume that it will stay that way.3. Staff - The people who work at rock city as well as the owner are all helpful and friendly. They can and will help you with anything you need. 4. Music -  small point but always good music ranging a huge scope depending on who is working but its always upbeat and good for climbing.all and all if you are looking for a place to call home or even just a place to try out climbing rock city is the way to go.", "date": "5/15/2013"}, {"review_id": "Uz9WZV8vtNyoQOxt4cTabQ", "user_id": "S9vScnVh3FzOoVTShhKiiA", "user_name": "Brandon D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Rock City purely for the bouldering and wasn't to happy with it.When I arrived I was shocked by how small it is compared to other gyms. When I started climbing there were maybe 4 other people in the gym. About an hour later there were about 10 and it felt very crowded. I don't know how many times I walked under someone climbing or ran into someone on the wall. Following the routes can be difficult at times due to trying to find which hold you need to move too. They use colored tape rather than holds which are the same color. However the tape can be hard to see, sometimes there's holds with no tape at all. Even worse few of the routes are labeled so good luck trying to find out where to start. especially with the routes that traverse across the wall. the rope climbing section is limited and short. Besides that, this place is ok. The prices are decent, 12 dollars for a boulder pass, 14 for the ropes. They play good music and have a variety of routes and the staff are awesome.", "date": "1/2/2013"}, {"review_id": "wHadJ_TkacIOyh-uRLjK-Q", "user_id": "_eIIdqM89r6CEgbc2HSJ3g", "user_name": "Joshua G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Staff is great and the cost is to value is excellent. I have climbed at several other gyms and have never found the individuals to be so helpful (both staff and fellow climbers) The gym is small enough to feel personal but large enough to have your own routes that are not bombarded by other people. If you are looking for a new gym or just want a place to go with some friends for a climbing outing, this is the place to go.", "date": "12/30/2014"}, {"review_id": "_5nzJNsf0Up3eFljaEkuGw", "user_id": "5H63d3cWYEYe1CbVt2OWwA", "user_name": "Tina B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 5, "funny": 0, "cool": 0, "text": "Saturday, July 30, 2011First time rock climbing and it was quite the experience.The guy behind the counter was really nice and chill. He pretty much new we were new and showed us the ropes. He really did a good job teaching us how to use the top rope and told us we could feel free to free climb if we felt ready.Pricing per person was about $14 for the ropes, $3/per harness, and $3 for shoes. It came out to around $40.We tried out top roping first. I thought I was so BA top roping my first wall until I got to the other walls. Man! It is tiring stuff. My arms sometimes didn't have the strength to hold on so I just hung in the air for a minute before I got back on the wall. The walls aren't that high but it's good for beginners who aren't trying to out do themselves too much. I think I definitely like top roping more than bouldering.I tried to free climb, what a fail. These kids after me made me look like a joke! They climbed so easily!The mats are bit worn and sweaty from the countless shirtless buff men, but as long as the mats do what they're supposed to, it doesn't really matter how it looks. Some of the flooring was torn as well.It was definitely fun and tiring! You'll really get a good workout", "date": "8/24/2011"}, {"review_id": "TscK0ESxHfSuIr44LS0arQ", "user_id": "VlhWNmzuLq425ZUD_fzvmg", "user_name": "Peter R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is less than a 7 minute drive from my house and provides a great, quick workout to keep my fa-husky self under control.I came here on my own for the first time and lucked out when they had a groupon advertising 2-months membership for $40.  WHAT A STEAL!While it's not as large as the Hangar, there are a good amount of routes ranging from beginner to expert.  There are also a good mix of bouldering routes as well as top-rope.The staff here is great.  Always friendly and willing to give tips and advice.  I suggest starting up a conversation with the staff if you find you enjoy the hobby as they have great information on outlets etc where you can find great gear at discounted prices.  This is especially true of Gavin (Im 90% sure that's his name) who's always cheerful and never fails to ask us if we had a good time on our way out the door.Friendly atmosphere keeps me coming back and bringing back as many people as possible.", "date": "2/18/2012"}, {"review_id": "2NDJbT71ufJlqscx6xcFRw", "user_id": "Qb73Tuxdv7uGc_B5mO6Zzw", "user_name": "Angel R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Better than Hangar 18. Staff are friendly and accommodating. My friend took me here since I was in his neck of the woods. I had fun doing the mazes. We did boulder mostly, some traversing. Good place for beginners like me. Try to get there early. It got crowded towards the afternoon right when we left.", "date": "9/12/2014"}, {"review_id": "V3mSWlElFenJ3c0XpIiMjA", "user_id": "EYP0TSgOMkWDEAgWr_RSHQ", "user_name": "Christy B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I went to rock city with a friend last night and just to get it out of my system, *rock city b**ch*. Anyways, this was my first time rock climbing and the instructor did a great job explaining how to do each type of climbing, bouldering and belaying. Bouldering does not require a harness whereas belaying does. The facility was spacious and had a good amount of variety in the level of difficulty. They even have a cave you can crawl through with headlamps. It was a really cool, fun and slightly terrifying. I don't recommend the cave if you're claustrophobic or scared of the dark. You may even have to slide down a pole to get out so choose your path wisely. Everyone was super friendly and helpful, even those who didn't work there. It seemed as though there was a wealth of people there who had been rock climbing enough to boulder with just their arms. Phew! Intense. A day pass is only $20 with shoe rental. I would definitely like to come back again!", "date": "1/4/2014"}, {"review_id": "NWQlfK6N7_nSgKapNeIKKA", "user_id": "0NqVnxpByjib6LkZxLRLWg", "user_name": "J Y.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "rock city - a place to climbcan get a little busy on the week days, but staff is friendly and climbers are nice. good community of climbers if you're new - staff is readily available to answer any questions you have. only thing is i wish this place was bigger", "date": "9/5/2014"}, {"review_id": "1m7TEywZzu2uoyPeCP_gyA", "user_id": "ZMJhoOPhdZ0igTFqj0xxEA", "user_name": "Tim E.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 3, "funny": 1, "cool": 2, "text": "I love rock climbing, but my dad WORSHIPS rock climbing. We went here once and had a pretty enjoyable time. I thought the climbing area was a bit small compared to Rockreation in Costa Mesa, but none the less I enjoyed my time here. If you are in the area I recommend Rock City, but if you are a die hard climber hit up Sender One off the 55 South freeway.", "date": "8/1/2013"}, {"review_id": "T5JD2yEFPxynOyt-8EQP5w", "user_id": "SatUUg8a8Z4QICsdpXZGVg", "user_name": "Kenneth N.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I just finished my groupon membership and I have to say this place is awesome!  The people are super chill and cool, staff and regulars.  Everyone here is really helpful.  I love the routes they make here and the difficulty always just seems like it's the way it should be.That being said this place is on the small side and it does get crowded sometimes, especially after work hours. But truth be told it was never a problem because I always rested between climbs anyways.  This place doesn't have the most beginner climbs, but guarantee they got the variety when you can move on and push yourself to the next level.If you want a place where almost everyone is friendly and helpful you should give this place a try.  And hey if you're a member you can bring up to 4 people in for a free pass every third Tuesday of the month.", "date": "9/20/2011"}, {"review_id": "GAla4ddnXB6QBNttA6VmsQ", "user_id": "ei6Z52YF1UyTVaMQOYubPw", "user_name": "Deborah C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Super cool, chill, relaxing, friendly and great customer service! The owner, Sean, sets the energetic and friendly atmosphere for the whole gym.  He knows how to talk to both new and regular climbers. He's really polite and nice over the phone and in-person too.  My very first visit was so pleasant because he told me to boulder for the day and to see if I like it or not.  So, he allowed me to pay after my climbing session. (I was like, \"Really? Pay afterwards? You don't want my money?)  After a few hours, I loved the walls because the problems are more stiff than other gyms I've been to. (I like a good challenge!) So far, I've been going here for almost a month now.  I have made new climbing friends who goes here regularly.  It's nice when you meet \"chill\" people.  Also, I have brought a few friends to go climbing with me for the first time.  They loved it because the venue is spacious and fun.  {Side Tips}*This climbing gym is good for mostly bouldering rather than top-roping.  *Don't get freaked out when you see 8493207472 kids all around the gym.  They do a lot of after-school programs. *You can use the back rooms to do some \"ab\" workouts. :) *$40 - monthly pass, no initiation fee (Totally worth it!!!) {Perks}$1 - cold big water bottle, not those 16 oz one.$2 - chalk, form of a brick$3 - rental shoes (Brand: Evolv)3rd Tuesday of every month:  Members are allowed to bring friends for F-R-E-E!  Valid for the whole day too!Last bit, enjoy climbing at a friendly place! Say \"hello\" to the person next to you because I'm sure you'll run into them again. Happy Yelping & Rock On! :D", "date": "7/20/2011"}, {"review_id": "LsHZKxbQQRem8BjlGF_rCw", "user_id": "gs3BmIJLlgY7OydkycrdSg", "user_name": "Syerra A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went here with a freind, and wow can I say this place is awesome! It was a great experience! The owner shawn is super cool and very nice. MY friend and I were the first ones in the place and Shawn showed us how to use all the equipment. Overall great experience! I am definetly going back!", "date": "1/26/2015"}, {"review_id": "oRqPNzexY0mnkQr0EVsG6w", "user_id": "WFllrIdL4044FcLBJamIOg", "user_name": "Matthew M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If your ready for some fun this place is the place to have it. With the numerous rooms of climbing and caves to army crawl through this place is awesome. Will definitely come back soon!!", "date": "10/8/2014"}, {"review_id": "rXBHOBPhceHYmfvf1Zu00Q", "user_id": "0hG78Qk3BQx33la2nxq0lA", "user_name": "Anthony L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "As a lot of people have said this is one of the more \"cool / welcoming\" gyms that I've ever gone to. It seems like every time I go to a different gym I have to prove myself on a harder grade climb before people start coming up to give a little extra beta (advice) on the route. This place is very concentrated on bouldering, and actually has much tougher routes (in terms of grade) than other gyms I've been too. There are enough \"easy / moderate\" routes that help you learn form and technique so it's pretty good for someone to learn. The top ropes range from amazingly easy to damn near impossible, but the selection isn't as grand as Hangar18. There are also a few lead climb routes, but again not as much as Hangar18..I signed up on my own in the beginning of 2011, but I honestly can't think of a day when I've actually climbed alone... Everyone is really friendly and will walk up and give you advice if you want it, or even show you a couple different routes that you might like.Just go and have fun...", "date": "10/4/2011"}, {"review_id": "1oqve78w-s66-fB-_rsPYQ", "user_id": "PVyZXgOkVtnU6966FDFhuw", "user_name": "Christi K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Rock City is a solid rock climbing gym! After our experience at another gym in the area, we weren't expecting much... We walked in on a Monday at around 7:30pm and it was PACKED!! We were a bit concerned because there were people just everywhere. We made our way to the front desk and talked to the guy there. He was super friendly and totally understood our concern. He said that someone had double booked boy scout troops thinking they were the same group. He told us to just fill out the liability waiver and climb away, saying that we could pay him at the end if we ended up climbing for a while. Wait... Really?? That's awesome!! He made us feel like he genuinely cared that we had a good time and wasn't just trying to get some $$ out of us. So... About the problems. We only bouldered, so I can't judge the top rope/lead routes. Just as a note, the walls are pretty short, at least compared to what I'm used to. There were multiple bouldering areas - including a top out boulder, a small low hanging bouldering cave and various other surfaces ranging from slab to over-hanging. All the problems were taped, holds weren't overly greasy or chalky and the problems were FUN!! There was a wide variety of difficulty levels. Most of the problems were graded because they had recently had a competition that used points instead of a V rating system. The only problems that were clearly graded were the pink tape (VB) and yellow tape (V0) problems. Everyone that was there - staff and climbers - were very friendly. The environment was chill - after all the kiddos left - and encouraging.The cost of a bouldering only day pass is very reasonable ($12). We had our own gear so we didn't have to rent anything. The place is a bit difficult to find. There is a map in the parking lot that we used to find the right building. Overall, Rock City is my pick for the best climbing gym in the area!", "date": "2/28/2012"}, {"review_id": "10yKW08Yr1pat_NF4m8S0Q", "user_id": "A-apTF3JfkUPR_oeazZC1Q", "user_name": "Mike N.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 2, "useful": 3, "funny": 4, "cool": 0, "text": "We went here for a kids' birthday party the other day. Good place for the kids to get excited about, but not really the best experience from a parent's perspective. Place was really rundown. Had lumpy, torn and exposed carpeting that the kids trip over. It was in the back corner of a business lot and so it was hard to find. The gym was really crowded and gettin a litle dangerous with all of the grown men climbing and jumping around the kids and not looking at all where they were climbing around the kids. We waited forever to be helped and we were just dumped into the back party room until the employee had time to deal with us. He was really short and impatient with the kids and then completely ignored us. It was a bit frustrating and chaotic and the guy behind the counter could have been more helpful. It would have been more helpful if there was more than one person working that day.Thank God that the kids don't really care about anything as long as they're distracted by the fun climbs and tunnel system, which was pretty neat. My kid had fun and it was an interesting experience but I don't think I'll be doing this again, at least not for a kid's party anyhow. Maybe better to just take your kid there by yourself instead of booking a big party because the gym just isn't equipped to handle that many kids. Also, it was kind of a rip-off when you consider that you only get the gym for a couple hours and only HALF of the gym to climb so that you stay out of the other climbers way. The price of a normal climbing pass gets you an entire day and the whole gym access.I'd recommend Rockreation over this place. Rockreation is much more professional, knowledgeable (aka SAFE), friendly, and fun!", "date": "4/20/2011"}, {"review_id": "STLF0tmQI8BD9GrbuYOhZw", "user_id": "9nYGi-5vHUIUbr8t6cPX2w", "user_name": "Jojo L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Lots of different walls depending on your expertise and the people here seemed really friendly and supportive! Theres also huge mattresses all around the floor so you dont really have to worry about having a hard fallyou have to borrow the shoes that they give you and youre not supposed to wear socks w/ them. theyre not the most comfortable shoes either.. =/the only thing i didnt really like about this place was that i felt like it wasnt that ventilated. it felt really stuffy in the room with all that sweat and hand chalk everywhere.i believe if you have a pass, you can invite up to 4 people on the 3rd tuesday of every month and your guests all get in for free.", "date": "7/21/2011"}, {"review_id": "bq4fqmVTtTE4soWMc37wkw", "user_id": "M4xj01jYHLlw6l3AJk84UQ", "user_name": "Frank M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "If there was a closer one in the Westside id go. But the closest one is this one which is close to job.The place is smaller than Hangar18. People are friendly but the workers seem to keep to themselves in the booth. Seems like they bring their friends along to hang out and just talk. Boy there are some strong people here. Dam little kids beat me on some of this stuff! but i am a noob at this. good trails.", "date": "4/10/2011"}, {"review_id": "5J_4LE3RyEP3mRGhxpXfBw", "user_id": "MemRJ7L9jS3BOngZnWeYlQ", "user_name": "Sarah R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "A nice, but small gym best suited for kids and those looking to boulder. Pros - friendly staff, relaxed atmosphere, tunnels for the kids, tons and tons of bouldering problems with a wide range of difficulty.Cons - this is not for those looking to top rope - few routes, short climbs, those annoying levered belay devices, and difficulty is overestimated.  very little supervision or safety oversight, and at times difficult to find the one person that seems to be working.  very crowded feelMy disclaimer is I only climbed indoor the day I visited.  I've been to several other gyms, all of which I would pick before returning here.", "date": "12/28/2009"}, {"review_id": "wpT-PlSUjce7G9p7V64G3g", "user_id": "L8Fhhek3IyahRuVnITS_jg", "user_name": "Jeanie D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I bought a groupon for this place and it was money well spent. My friends and I are hooked. This place is decent size with many routes at different skill levels. Everyone there is super nice and wants to help you succeed. I never heard so many \"there is no trying, just do it\" in my life. It gets crowded on the weekends and tuesdays, but the workout and the company is worth it.", "date": "3/5/2012"}, {"review_id": "-gZ6IG-ptPse8zWxBEpNiA", "user_id": "NOmAy-MwUgr_v8dwKBAJNw", "user_name": "Mike K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great exercise, it's fun, open 7 days a week and challenging.  Down side, it's a bit stinky...like lysol and rank feet, stinky.They have a cave like tunnel you can crawl through, have a flashlight as its pitch dark and you can drop a pretty good way if you aren't careful.  If you're claustrophobic uhhh hahaha don't even think about doing it!", "date": "8/14/2011"}, {"review_id": "n03C0WTiUwuxixs1XaISkw", "user_id": "O9dJ38LAuj0dC7Pbaaq-5g", "user_name": "Annie D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Been climbing here with a Groupon. I started out at ClimbX. The staff is super friendly. There's a lot of bouldering and some you can reach the top and climb over. They don't use ATCs here for climbing just the Grigris attached to a rope anchored to the floor so climbers just clip in. Very easy to use. The routes here are challenging and fun. I've haven't really encountered super crowded nights except when they just had a class. They also have some fun tunnels that you can climb through with a flashlight or glow stick. I thought the place was clean enough as rock climbing gyms go. Everyone is very friendly and welcoming and as a beginner that's really encouraging. Would definitely recommend. They are also much cheaper than Rockreation.", "date": "12/1/2011"}, {"review_id": "kaDzn9IZTXUb9h5QbIGHHQ", "user_id": "PmzJFkLOZfHA820OMNXs3A", "user_name": "Linnie N.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I've been going here for years and I absolutely love it!This is an awesome climbing center in Orange County.  The routes are fun and challenging to your liking.  I climb until my mind is clear and my grip is weak.  I leave feeling refreshed and wake up the next day feeling satisfied and sore -- well, maybe being sore just tells me how unfit I actually am.  In any event, you get a total body workout with upper body, core, and lower body.  On top of that, you get to have fun!  I highly recommend making a trip to Rock City.  Good for groups!", "date": "5/12/2011"}, {"review_id": "qs3AwulKv2g3OY9QoVJtuQ", "user_id": "3mhdWROwjuXm5RlH-VuwHg", "user_name": "Grace L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Rock City is Awesome.  The staff is as friendly as it gets.  There's a reason this place gets so packed!They change up the courses and difficulty every couple of months so it doesn't get repetitive, you'll always want to come regularly since each climb is always a little different.They have affordable annual passes so that is something to look into if you live locally.  Invest in some rock climbing shoes and you are all set! Rock climbing is a great way to exercise, build some muscle, and exert some energy!", "date": "5/1/2009"}, {"review_id": "zyk5JIQrVNsrTOZmRoo_kQ", "user_id": "ioLQrCvCBz3HmlKZeFxbJQ", "user_name": "K W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 2, "useful": 13, "funny": 5, "cool": 6, "text": "Now that I've been to 7 or so rock gyms (others: UCI rock wall, Rockreation Costa Mesa, Hangar 18 Signal Hill, Hangar 18 South Bay, Mesa Rim San Diego, Planet Granite Sunnyvale), I feel a little more comfortable with reviewing them. Rock City is thus far my least favorite rock gym, for top-roping (I only top-rope right now, though I hope to learn lead sometime next year).I was aghast by how run-down and dirty the place was, first of all. They needed more cubbies too. But more importantly, the Gri-gris there were difficult to use, leading to very unpleasant, jolting lowerings from the wall. They seemed old and were also attached to the floor in a strange manner. Next, the walls across from each other were often situated so close together that descending or falling climbers would swing into other climbers or belayers. I haven't really seen this issue elsewhere. I don't want to hate on children, but there were a lotttt of children here as well, which made the climbing experience very loud/noisy. The rock walls were short and lacked features, and the holds were often insanely slippery; they were probably decades old...or sweaty? In addition, it was hard to see the route while climbing because routes were indicated by tape rather than the color of the holds. The placement of the tape (under the rock) inhibited the visibility of the tape.The routes themselves were difficult, to say the least. The 5.10s were mostly not marked by subcategories. I tried all the 5.10s and managed to complete maybe 3 or so (this was back in July/August), while totally failing on most. 5.9s weren't too easy either. I slipped off the rocks several times during my climbs. On the plus side, I enjoyed the climbing rope, as well as the relatively cheap prices (I believe it was about $14 for a day pass)...but I would pay a couple more dollars in a flash to go to another gym. I see that this gym has an overwhelming proportion of very positive reviews, and I have wondered why. After perusing the reviews, I believe that positive reviews may be from boulderers or from new climbers (when I was there, I noticed that no other top-ropers were actually climbing routes...). Verdict: Hate the gri-gris here, the slippery rocks, difficult-to-see route markers, noisiness, and spacing issues. Pass.", "date": "11/5/2012"}, {"review_id": "UcVZHqId-kA3uw9MIkkDsQ", "user_id": "qP19Bb4CG024ZlqESTkfpQ", "user_name": "Katy R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So awesome! Everyone is really nice and always helpful. There's a ton of paths of all skill levels. So fun!", "date": "3/17/2014"}, {"review_id": "3ot09M60WwWteJQDjmA2jQ", "user_id": "_-pvGUjCHAnfMlPRObpJcw", "user_name": "Jill E.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "This place holds a special place in my heart as this jump started my love for bouldering in 2009. The owner, Sean is hella chill. And yes I'm very biased towards bouldering so of all the indoor rock gyms, this is the spot for bouldering. It has a homely feeling to it and everyone there is super friendly. Yes it's a tight fit for everyone but it allows you to bond with everyone.Oh go in that tunnel maze thing by one of the bathrooms. Super fun in the pitch dark. The only con I can think of is th real lack of top roping", "date": "4/7/2011"}, {"review_id": "FAdjCRDrRZTh_cXv1l3ntw", "user_id": "_HwaWJ7WpRqrcYSpwkL-cA", "user_name": "Paul W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Got a great deal on a two month membership! Includes shoes, harness, and all the climbing you want to do!", "date": "4/30/2014"}, {"review_id": "R5wrzxJ6WBaK7vSUaOllCg", "user_id": "r9DlYpwSZsw3rrUKfY6u3g", "user_name": "Andrew S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. Great prices and awesome workers. The gym itself is smaller than other places I've climber at but other places are typically much more expensive. A day pass is $12 and rental shoes cost $3 if you don't have your own. If you are a beginner I definitely recommend this place because it's not too intimidating and the prices are good.", "date": "6/23/2014"}, {"review_id": "XIFCNFcQhSwwwUgSEPOfgg", "user_id": "lbAfreT4rzlx2cL9UhNkQA", "user_name": "Zarin S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Well the climbing is good.got 2 months of membership.that was cool pretty nice gym.however moved away and tried to cancel my membership 3 times and all 3 times got told they would do it but never have.so 200$ later they still haven't.gonna give them one more time and then report them to me credit card company", "date": "11/9/2015"}, {"review_id": "7Cm5SCTu7LePBCXTUaEiwQ", "user_id": "z21AHVg-9N9WcH0-WY3-Jg", "user_name": "Jerry T.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I first got into this when a friend of mine told me about the Groupon deal for a 2-month membership for this place.I've always had an interest in rock climbing but I've never had an incentive nor the money to do it, but after I started I instantly became addicted to rock climbingI didn't care about climbing alone because of two reasons.One is that I love the sport and it's ridiculously fun.The second is the community here is absolutely fantastic from the employees to the regulars. It really is my second home.No regrets whatsoever!", "date": "1/12/2014"}, {"review_id": "mVcgPyWHhJeBS1gMHdxdPQ", "user_id": "7A2PkBQpaZbxlgm5eHIf8Q", "user_name": "Victor X.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "My background: beginner at bouldering and intermediate at top rope.  I've been to Mesa Rim at Mira Mesa, San Diego and Rockreation at Costa Mesa.  Rock City's atmosphere:Out of the three gyms I visited, Rock City is a perpetual college party - the equipment are abit worn, floor mats ripped up, and the atmosphere is very casual and laid back.  There are lots of climbers who not just go there to climb, but socialize as well.  There is definitely a scene going on, which can be quite fun after getting to know the people.  For some reason, the people are generally younger than the community at Rockreation.  It has a \"classes are out\" vibe.  I go there after work, and I felt like I am the \"old man who is no longer cool\" in Rock CityRock City - a great bouldering gym - ok for top rope, and avoid lead climbing :Rock City Climbing Center is a great place to boulder.  Its top rope walls are fine, but this is a boulder gym first and foremost.  Rockreation's top rope walls beat Rock City by variety and height.  At Rock City, most of the people at nights and weekends are there to boulder, leaving the top rope area open unless there are kids / boy-scout / girl-scout parties.  This gym uses the automatic locking belay device, which can be very handy.  When the place gets packed, lead climbing becomes hazardous - there are only a few (2-3?) lead climbing paths, and those paths run directly on top of the main room.  At any given time, there would be 2-3 people below the lead climber.  The boulder routes are re-done once every 2 months.  Which means there are always new problems to solve.  For beginners, there are plenty of VB, V1+, V2+ problems.  There is also many challenging routes (V6 / 7 overhang problems).The gym is quite small - think of three Starbucks put together.  Pricing: This is the most affordable rock gym I've visited.  However the routes are more challenging than some of the other gyms.  Overall, I think Rock City great training center for bouldering, if one doesn't mind the crowd during prime time.  I would go to Rockreation or Mesa Rim if top rope and lead climbing are my thing.", "date": "10/30/2010"}, {"review_id": "WDtNtvB-qrA-SvhKaAuzVA", "user_id": "JAKZbvUHdCNfUALF0x9StQ", "user_name": "Felly C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a complete reality check for me.  I thought what a great deal on Groupon, let me try it out, it shouldn't be that hard...boy was I wrong. I like to think of myself as a buff chick but I was proven wrong. I lack in upper body strength period...haha!!! Aside from the lack of cool air seeing that it is inside a warehouse, it was a great workout.  Rock climbing makes you use muscles you weren't even aware were important , such as your fingers.The instructors are very nice and helpful and layout is pretty intense.  The people there are helpful and more then happy to show you the ropes.  I have seen this deal on Groupon several times. I would recommend purchasing it or even signing up and joining.  It's a great workout and definately different from the day to day goings of the gym.", "date": "7/15/2011"}, {"review_id": "_SZT_OD9hxT98ZqKpoAGpg", "user_id": "1ECiEtWCgiorfje2BUArMg", "user_name": "Emma W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here quite a few times and I have to say, I get a good work out every time. The workers here are pretty lenient and are super friendly. They give you a quick five minute lesson on belaying. This place plays good music and has a really cool tunnel system. I really like the bouldering terrains; some routes are easier than others. This place is definitely an interesting spot to hang out and you can watch people with hot bodies be Spidermen. The atmosphere is really easygoing and it's kind of secluded so there's usually not too many people, aside from little kiddie parties.", "date": "7/4/2011"}, {"review_id": "jYB_JpELsl8Rqg5GiU43Cg", "user_id": "zOUREnr330oUUujejHl-dg", "user_name": "Amanda T.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great place to start out climbing. The staff friendly and very helpful.  It felt like climbers of all levels are welcome. The only problem is that in the evenings it tends to get to busy.", "date": "2/14/2013"}, {"review_id": "JVtii0hhJgTAJeg8zPdDsA", "user_id": "yFXoklmC1faPYYEZI3DUlQ", "user_name": "Phil L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is my home gym! Looked for a few local Orange County and north county gym and this has been the best! It's fairly spacious and has a lot of routes, but sometimes it'll seem like you can't climb any routes! It's bigger than rock recreation and climbx, but it stinks and it's hot.", "date": "4/21/2013"}, {"review_id": "dDj_zLF3wVR36Nv_tZVreA", "user_id": "fpRjFpHQLcmHF0VuDDdkxA", "user_name": "Elizabeth K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Quite impressed with the facility and the staff.  The equipment was in good condition and it was well worth the $15.  They offer free climb, their own cave maze, and of course, harness assisted climbs.  Only complaint is that the place smells like a well used sneaker :(", "date": "4/19/2013"}, {"review_id": "V2swTIajJH9KI8-r8mbRxg", "user_id": "yXUq-c1JbQKz1Lt4RC8fPA", "user_name": "Michelle W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 4, "funny": 0, "cool": 4, "text": "Ive been climbing since 2010 and Rock City is where I started. Since then, Ive climbed at both Hangar 18s, both Vital locations, Threshhold, Truhold, and several outdoor climbing spots.Unbiased Opinion (sort of)This gym is the best climbing gym to get your feet wet in the climbing world(If that is something you choose) for the following reasons:-Cost: You wont find a better deal for a membership anywhere especially for what you can accomplish at this gym.-Atmosphere: The crowd is fun, and a great place to hang out with your friends before you go out on the weekends. For the most part they play great music, and people go OUT OF THEIR way to help and encourage you. Personally I havent seen that at any of the gyms I listed except for 1(Vital). It makes your climbing experience that much better in the beginning. -Staff: The owner works most of the time during the day, so he's there to see and meet his customers. The Employees are all educated climbers, who can give you endless advice on all things climbing on a begginer-expert level. No one is there to nickel and dime you, and they take the time to teach you the basics of top roping/bouldering.-Route Setting: I personally climb 3's with an occasional hallelujah 4 climb. They have some of the most thoughtful and unique settings that I have yet to experience anywhere else, and on every level of climb. I say that with confidence because I have dear friends that are climbing animals and a few that climb professionally. The top ropes are a nice change up on occasion but the focus of that gym is bouldering period.Rock City vs. Other Gyms:From what I've experienced at my level of climbing, I get a great workout at the other facilities and have never felt so pumped. BUT my sessions are just that.... A workout. I learned all of my technique from the challenges at Rock City, and the advice from the experienced fellow climbers and staff. I live in Mission Viejo/Lake Forest area, and OF COURSE I can climb regularly at a closer facility but I wont. I climb about 3 or 4 times a week (which is a whopping 175 miles on average) if I can, and the cost to drive there has paid for itself for what this gym has given me. If anything I owe them :) I personally feel that if I started anywhere else, I never would have stuck with climbing, which is the trend for my athethletic ventures. Ive made such great friends through Rock City who have helped me become the climber that I am today, and built my confidence to take my experience outdoors. I also owe it to Rock City for helping me find a sport that I would give anything for, and will try to climb for as long as my body can stand. Thanks Rock City for building me into a Climber!", "date": "4/11/2012"}, {"review_id": "dRY62djvjQJDL2QCeHtKjA", "user_id": "PMSaoh6ej_SzJaCoWgSJLA", "user_name": "Jeeae C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym in the oc. Routes are fantastic, you get to watch scrawny kids flash your project, get beta from some amazingly friendly climber regulars and the staff is always on par. They do everything with a smile, help you out when you need it and scold running children when you're about to barndoor off your route. CLIMB ON BITCHES.Minus one star for lack of top roping. I understand they don't have the space, but a 5 star gym (personally) will have the best of both worlds.", "date": "3/29/2011"}, {"review_id": "2MYa0I3NyF3d8Ru1O66_CQ", "user_id": "vj40nsstbwTQ-rF538YiaA", "user_name": "Cynthia J.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been coming here for over a year. It is my favorite place to go climb. Friendly staff and everyone is chill and nice. I always introduce my friends to this addicting sport! :P Glad i got hooked.", "date": "4/9/2013"}, {"review_id": "OqOfoUHnXWhLOckx-y00-w", "user_id": "jQ9QO5gCmq38RyE0xFZaug", "user_name": "Cat K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 5, "funny": 4, "cool": 5, "text": "WOW.  This is by far the best indoor rock climbing place I've ever been to.  I'm still learning, but overall I love this place.  Pros:- Awesome staff- Great hours- Huge facility- Lots of space and even resting areas- A wide range of walls (fun, beginner, to of course advanced)- FUN- They have an indoor cave/tunnel that's actually made for adults... I was shocked at how I really had to work it through the tunnelCons:- Far from my house  :[- It was a little hard to locate at night.  I used the GPS on my Droid phone and it was absolutely wrong.  GRRRR!Also I've heard it can get really crowded, which I don't like... but what can they do... when you rock... you rock... literally.  ;)", "date": "2/8/2010"}, {"review_id": "9p6AgY5yPKp_YCrq1FteNQ", "user_id": "nPkTidQvXdVPZH7dgDWarw", "user_name": "Kay D.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Over the years, I have gone to three different climbing gyms, and this one is by far my favorite.The top rope routes are always expertly laid, and the ratings assigned to them are reliable.  They mix up their routes quite often, so regulars don't get bored.  I usually prefer top roping because I like to go up really high, but their bouldering routes here CANNOT be beat.  I actually enjoy bouldering at this place!As far as price goes, it's standard to all other rock climbing gyms, but the friendly staff and great routes make all the difference!", "date": "10/21/2010"}, {"review_id": "XirpaSXZVsuMMIAwAyG6vA", "user_id": "_kr5koa0xYfCb2xKrQCrxg", "user_name": "Jocelyn H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This is where I first went rock climbing! It was a pretty fun experience. They even have tunnels going around inside the walls that you can only go in with 1 other person and a headlight. Be forewarned, it's pretty cramped, so larger people might want to rethink having a go inside their tunnels. The only reason why I'm docking 2 stars is because this climbing gym is really small, seems less clean than other gyms I've been to, and is NOT air-conditioned - a huge downside for me since I realllllly get hot & sweaty when I'm exercising, and having to be in a more cramped space, with lots of people, and just a couple of huge fans placed throughout the space...it's not very conducive for the most optimum indoor rock climbing experience. The people you encounter here really are very friendly and welcoming, though - love the atmosphere of encouragement and affirmation from other climbing enthusiasts.", "date": "8/28/2015"}, {"review_id": "u30vUpYufQg46VBh2_Zqvg", "user_id": "e-5rPyejoNnqrVD0UpC8Ow", "user_name": "Jun H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "My friends and I purchased a 2-month unlimited deal from one of those deal sites and made it a weekly ritual to climb and trust each other. It came with harness and shoe rentals each visit so that saved us a lot of money. If you've been to Sender One, you'll think this place is super run down but the supportive community vibe here is jammin'. The walls aren't nearly that high and there's not much opportunity for lead climbing but there's several different rooms for bouldering and top roping. Also in the main room, there's two ropes for climbing and a bunch of other apparatuses hanging from the ceiling to just dangle off of and work on your arms/shoulders. It may just be the summer weather but it gets really hot and poppin' at night. If you go on a Sunday morning, you pretty much have the place to yourself. I'm not sure how often they reset the routes, but they completely redid a room during our two-month stay. There's one guy at the front \"desk\" during any time; Gavin was usually the guy running the show while we were there and he is an extremely affable guy, very helpful.", "date": "9/22/2014"}, {"review_id": "Sqm62wVv2-FNaG9vKh_Sfw", "user_id": "CWNUkabGRIGdguoHotpnaA", "user_name": "Amy W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "First, I want to say, I'm not a boulderer. I actually have a fear of heights, so when there's no rope i have to deal with sucking it up and trying to get to the top. I came her cause this was my friends gym. They have a great community here. I'm not even a local and I met 3 different people on the first night! The staff is super chill and let me in for free! The members of the gym all know the staff personally and would consider them friends! The routes are a bit on the tougher side. They definitely have a lot of negative walls/over hang and only had a couple VBs. The routes seemed taller then what I am used too. I suggest if you love bouldering, check this place out!", "date": "7/21/2010"}, {"review_id": "5TNNeF0xkHYWNeuORtJx_Q", "user_id": "RYs5WsgkcCrH7zESwLHc_w", "user_name": "Steve G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "I called the day before to ask about a family outing at the ropes course. Was told to fill out the waiver in advance and that we could show up the next day. Drove an hour to get to the wrong location. Ropes course address is not in the website. The staff at the gym said the manager doesn't give information on the ropes course. Finally found the course by accident and then no one was there. Turns out the ropes course is in an RV park but that staff knew nothing about whether the course is staffed. Might be a good course but get better directions and information before you venture out.", "date": "4/16/2014"}, {"review_id": "0mFdslMB8hapIygetSWelA", "user_id": "FCUCW7qxBH4FoEJJ3jgECQ", "user_name": "Tim T.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've climbed at ClimbX and Rockcreation and they both have nothing compared to the atmosphere here at Rock City.  Everyone is cool here and the staff is friendly.  The atmosphere here is supportive and can push you to climb better lol.  I havent tried any top roping or rock climbing as I mainly boulder.  I got in with a group and saved a few bucks for an annual pass.It costs like $15 for shoe rental and a bouldering day pass so not too bad.See you there!", "date": "9/8/2010"}, {"review_id": "TuiV46mvFAyfh5tGZDEjZQ", "user_id": "zkwvGp9_wjVRUMAp-GusBg", "user_name": "Kevin F.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 2, "funny": 1, "cool": 2, "text": "Been to three rock climbing places, and this is pretty nice.  If anything, I liked this place a little better than most just because it had a wide variety of walls.  There were definitely beginner, low intermediate, high intermediate, and advanced wallls.  I'm at the most a low intermediate, meaning I can do a vertical climb, but anything with a slight incline backwards is difficult for me.  My friends were knocking out some of those, and I managed one, and therefore, the fact there was a decent amount of beginning walls meant I wasn't just regulated to 2 climbs or left watching everyone climb.  So I appreciated that.A few things unique to Rock City was this tunnel crawl that at times was pretty scary; essentially, you are climbing through most of the walls in the place, and that means some drops and some tight spots when you have to manuever yourself.  It's interesting for sure.  There's also a wall where its like crawling up the crevice of a canyon....another unique thing I haven't seen anywhere.  And as at most rock climbing spots, there are bouldering walls, and those were a tough challenge as well.  In the end, not a bad rock climbing spot for beginners.", "date": "3/9/2010"}, {"review_id": "ENhZUoamLD3USgHpCJAM1g", "user_id": "QAsF7k4LOH7TtxY97xo75Q", "user_name": "Harrison S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've only been here three times in my life. Two from friend's night and once on a date. So does three visit equate to a sufficient review? I would say so, since I've rock climbed for 2 years both indoors and some outdoors.Whereas other places would mark the paths based on color of the holds AND tape, here it's just the tape color and the difficulty level is rated..lower but it's in fact harder than some of the other gyms out there.It's laid back, it's a workout, and it's near some food places to grab some drinks. Recommended? Yes with blisters to go with it.", "date": "3/1/2011"}, {"review_id": "mvaDq2zcmn83vzc78cpvig", "user_id": "zYXDSWYHqkbgmJmOaj6d4w", "user_name": "Wendy L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Oh man, am I sore today!Never realized that this could be such a good work out, and it doesn't feel like it at all! It was my first time ever doing something like this, but it is something everyone should try at least once!This is place is super cool not only for the bouldering and rock climbing, but they have these built in tunnels in the walls thats like a cross between a obstacle course and tunneling for treasure! There is also a rope you can climb, test out how crazy athletic you can be! By the way, I uh, freaking suck at climbing rope, like a fat kid. Prices are cheap, $17 for all day plus $2 for shoe rental, but you don't have to shoe rental.  I was there for about 2 hours.", "date": "6/14/2010"}, {"review_id": "cEo0PvCVyxjpl45eROSVtw", "user_id": "dcSsesSUrWHWEvCOIiCCOQ", "user_name": "corey m.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Today marks the death of my annual pass to Rock City. Tis' truly a day filled with tears and satisfaction. It was the best purchase of 2010. If you can round up a total of 4 people including yourself to go in on an annual pass, it will only set you back $160 each. Once you are a member you can get discounts on climbing gear to get you started. Buy $50 evolv shoes, $20 on a chalk bag and some chalk, and you are set for the entire year.The bouldering at this gym is beyond EPIC. They add fresh routes constantly to keep your hunger satiated.The friendliest crowd I have ever come across including the staff.", "date": "1/17/2011"}, {"review_id": "5RGBPmKM7RHbB8fzjL9eYA", "user_id": "JCh8Kp_2eHu2M-w0pLwMdw", "user_name": "Linh R.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I have never been Rock Climbing before and decided to take my little sister after reading Kevin C.'s review. Rock climbing is definitely harder than it looks. It is a good workout especially for the arms. This place was definitely good for kids. My little sister really enjoyed the caves they had around the place where she can crawl in and out of. A great family activity since there were a lot of parents who took their kids there to wear them out. I will definitely come here again if I'm in the area. The staff was helpful since it was my first time. Climbing with shoes and harness is $19/person and if you decide to go without the harness it is $14/person.", "date": "3/22/2010"}, {"review_id": "tCg7DvdUb4Y_gRtc0KdLVQ", "user_id": "1j0t5NJkRVAruWlVvTxXEQ", "user_name": "Mackenzi B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I visited Rock City as a guest on my best friends year membership. It has been over a decade since my last rock wall experience (not a positive one), and I developed a fear of heights shortly there after. Needless to say I was terrified as we began scaling the perfectly color coded paths up the walls, no harness or gear other than shoes and hand chalk. With encouragement from my friend and one of the staff members, I gradually got higher up the wall, and eventually made it over the top! I can't begin to explain how triumphant that moment was, to tackle a fear, and test my limits as a person. The thick pads on the floor made me feel comfortable enough to fall if my arms where about to give out, and the scariness about climbing suddenly went away. We spend an hour and a half climbing that night, and I accomplished way more goals than testing my physical strength alone. I feel that this could be a gym of sorts in its own, and will personally look into getting a membership for myself.", "date": "4/24/2015"}, {"review_id": "f_ul8GxJdAq7l4HZG9tbng", "user_id": "uLthrQwJFUYvfNzsB45iHA", "user_name": "Yan W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This has got to be one of the best climbing gyms I've been too.  The staff were really great, the people who climb were really cool and gave tips, the prices were cheap, and the walls were really challenging.  What else is there to a climbing gym?", "date": "9/6/2010"}, {"review_id": "8gp3py3xCRMK2KsGpzAqng", "user_id": "AAPKFubbky2g5aZ8IeJVsQ", "user_name": "Cesar A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Best rock climbing gym in So Cal.  I've been to the ARC in Arcadia and Rockreation in Costa Mesa, both in terms of availability for beginners and for advanced climbers I recommend Rock City.  I may be a little biased having been a member here for the past couple of years, but any friends I've brought out to try rock climbing have agreed they like Rock City best.The gym consist of a top rope wall, a cave for inclined routes, a top out section, lead routes and lots of bouldering.  As well as a tunnel system that is great for the kids, and even adults.The staff is awesome and very helpful, all of them are climbers themselves and are more than happy to offer beta (climbing advice) for anyone that ask.  The people that climb are great as well, whether it's asking for climbing advice, or letting you bum some chalk.Weekday evenings can get pretty crowded at times, but people are really friendly about taking turns on the wall.  And it can even be helpful when you are working the same problem as someone else.The best part though is the variety in climbing routes.  I've been to other gyms where you can tell there aren't too many setters.  Routes seem to have similar moves or styles to climb through.  At Rock City there are multiple setters, allowing for multiple types of climbing styles.  Big strength moves, crimp routes, delicate balancing routes, campus routes, and some way out of the box thinking routes make for a great selection to choose from.The price is pretty cheap.  $15 for a bouldering pass and shoes, the average gym is $18-20 for the same deal.Lastly, third Tuesday of the month is free for friends of members (up to 4).  A great way to bring in your friends that might want to give it a try.  This is how I actually got hooked on Rock climbing ;).", "date": "5/5/2010"}, {"review_id": "vV5xKIDL5-21TcO_UM-YDg", "user_id": "1YySJaAgbtLZUfT-qua2Jg", "user_name": "Randall T.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 4, "funny": 3, "cool": 3, "text": "This is a great place to go climbing. The staff is very friendly, and all of the people who climb there are really nice.They do top roping and bouldering here. Bouldering is more of my thing.The best part for me is taking a break and watching the more experienced climbers attempt more difficult bouldering problems. A lot of the holds look impossible to a newbie like me who can barely finish VBs and V0s.What worries me sometimes, though, is when they have groups with a bunch of little kids. The staff keeps telling them not to run in the gym, but sometimes they do. And then, when they walk around, a lot of the time they don't look around and they walk directly underneath where you're climbing. When you're bouldering, you don't have a person on belay if you fall. When you fall, you fall, and sometimes I'm afraid of falling onto one of those kids.If you're looking for a workout but bored with the usual gym fare, give rock climbing a try. Invest in some good climbing shoes and a chalk bag. Oh, and some tape. Until you develop some calluses (and even afterward), your fingers are going to get pretty tore up.\"I found out today that blood and chalk create cement.\"", "date": "9/14/2009"}, {"review_id": "iuB9l1XNNgfcqZiFn7r8pg", "user_id": "u-y5Mx-ECwEV4Aljuoyngg", "user_name": "Jackie G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had such a great time here! It was my first time, and the worker who helped us was so friendly. It was overall a great experience.", "date": "2/3/2015"}, {"review_id": "LjRHtboKBAuYps4kaVjAwQ", "user_id": "eGjalrCPOYQp2RQ5M3mVcA", "user_name": "josh G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Love this place! Been going for about a year, and love the challenge and work out.   Beginners: This place can be intimidating, but there are plenty of beginner problems to work on! The staff is nice and willing to point them out if you ask. In fact, most of the regulars there are nice enough if you ask. The place might look small, but there's plenty of wall to climb.    For a few bucks, it's worth getting the rental shoe's, so go for it!   You can learn a lot by watching others and coming back a few times.", "date": "3/25/2010"}, {"review_id": "rLuKJssqbTnAHnBn6mJTFw", "user_id": "CMwSOrfL1m4Pel1XnCMJjg", "user_name": "Cris B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "To start, I love everything about this place! The staff is very nice and helpful. They don't make you feel inadequate when you ask questions. The gym itself has everything I need to help me become a better climber and possibly take my show on the road/on the real deal Holyfield mountains and such. They have a couple of those finger pull-up stations and a huge one at the roll-up door entrance...which is cool because you need to continue to build strength to improve. We purchased a groupon, and I have typically noticed that you're treated a little different when you do. However, this was not the case at Rock City. Everyone was really helpful and for lack of a better word, cool. I particularly enjoyed the instruction received from Gavin. He is a nice and knowledgeable young guy who was our instructor the first day. The other climbers at the gym are nice and helpful also. Everyone is trying to help you find the holds and teach you better ways of climbing, which made it really fun. Some people say that the place smells and its run down, but I didn't think it was any different than any other climbing gym. You get enough people that are sweating in one area and of course it is going to smell :) I didn't have a hard time finding the place either. I'm guessing that most people have some type of GPS or google maps or something anyway if they are on Yelp so shouldn't be difficult. This is a place, while I have climbing gyms much closer to where I live, I will definitely keep using after my groupon expires because of the good atmosphere and nice people.", "date": "7/14/2011"}, {"review_id": "Tm6vWp6PCQHSyZiLVJhxaA", "user_id": "tBF2XItePad2gJJF9JtC7g", "user_name": "Tiffany K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "ROCK CITY is my bouldering temple. Anyone who is an adrenaline junkie like me needs to visit this place. I first went a two months ago when I was invited by my friend who is a bouldering enthusiastic. I've tried rock climbing a few times before and I always liked the experience so I tagged. First off, I have to say that everyone ( staff and rock climbers ) were super friendly, helpful, and supportive! For anyone that isn't very familiar (which I wasn't at all)- bouldering is climbing the walls without harness. The walls aren't hazardously high and the floor is padded pretty well so if you fall, there isn't much danger but still alarming when your up there. This gym has various routes in different colors (you must go up the wall with just the rock in your color) and variation of difficulties ( VB[easiest] to V9 [hardest]maybe even 12 or higher). I could do up to V1, I blame my stubby fingers but I'm working up!They also have imitated caving tunnels that are pretty fun and kinda scary if your claustrophobic. I wish this place was closer to where I live or else I would be there every week. However the distance isn't going to stop me from going there as frequent as I can. I love this place. Staff- 5!Fun factor- 5!Atmosphere- 5!Overall- 6! FYI- there is a 2 day after rule with muscle soreness. I go on Wednesday, feel fine on thursday but... on friday my muscles are screaming for icy hot. Teheh no pain no game", "date": "2/10/2010"}, {"review_id": "Yf29gY-65Bt0FRSX7jLRkQ", "user_id": "VAEpd2AwPXWvolobfr_xiA", "user_name": "grace k.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 3, "funny": 3, "cool": 3, "text": "This place was pretty coool. It was my first experience rock climbing so i had an awesome time! The staff that trained my group in the beginning confused the hell out of us so after our \"training\" we just started doing our own thing. The walls don't go up tooo high but its cool for beginners i guess. There were some that were pretty impossible for myself to climb but all in all i had a good time. Pricing isnt too bad. I paid 15 bucks for 2 hours including a harness. I believe they sell shoes there too but i just came in my regular tennis shoes and i was fine. I hear the shoes they have there help give you a better grip so im sure itd be better to have those. Its also good to have power or chalk in handy in case you get sweaty hands! They also have little cave mazes you can go through. But you definately need some source of light in there cuz its VERY dark. i couldnt see anything so i crawled back out and grabbed my cell phone for light (:  it kind of smelled in there cuz im sure its mostly little sweaty kids that go in there but it was cool. This place gave me a pretty good workout tho. I was sore in places i didnt think was possible! I'll probably check out some other rock climbing places b4 i come back here..its kind of in the middle of nowhere between office buildings so its a bit hard to find. All in all i had a great 1st experience here (:", "date": "5/15/2009"}, {"review_id": "Mt2VIf7zFHYYvF3nIZSlDA", "user_id": "upfx0-qA6RHkDNzT36kIHw", "user_name": "Caesar M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 5, "funny": 2, "cool": 0, "text": "Please Ignore the reviews about the smell and the carpet,It seems these individuals we're expecting a climbing gym owned by Hilton Hotels. Who complains about a bathroom? Take a dump at home before climbing. Anywhothis place is excellent for bouldering problems, and a bit under par with top roping (which is what I did the first few climbs). Yeah it has a bit of a sweaty feet smell, and some of the carpet covering the padding is slightly torn, but trust me the carpet wont eat you up. Overall the experience my gf and I, as well as my other homies have had was Great. From what I understand the bouldering problems change after a few months so they have fresh routes regularly. I had questions regarding footwork and the regulars were more than happy to answer my questions. As far as the guys working the front desk I only have a complaint about 1 person, and if you go often you'll know who i'm talking about. Anywho I am a beginner and may not know a whole lot about bouldering, but keep in mind that the obstacles in the beginning are what can discourage those starting to climb, and so far my experience climbing at this gym has been beyond what I expected. If you are expecting a luxurious hilton hotel vibe when you come through those doors leave the bitching at the door and just enjoy yourself. I will be returning and hoping to begin a membership soon.Price for bouldering (all day pass) $15.00Shoes Rental $3.00Chalk bag freeChalk $0.50 in a candy dispenser Woo!Sore muscles and blisters: PricelessP.S For those beginning to climb don't invest in expensive shoes since you wont be using your feet correctly and will wear out your shoes quickly.I asked a number of experienced climbers and they suggested either the La Sportiva Mantis, or the Evolv Defy.Happy Climbing my friends.", "date": "3/22/2011"}, {"review_id": "Ou_-sDmD5L3ELfACHjD0jw", "user_id": "1ft3dF37U2SXNok6vPiBWw", "user_name": "Lyle A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 1, "funny": 0, "cool": 2, "text": "My employer recently booked a corporate team-build activity here and we had a blast!We had one instructor for 40 of us and the class went by smoothly.  The day began with stretches as I could hear creaking in my bones from the long-overdue flexing and pulling.We followed that with a team-build ground activity.  We passed with minimal casualties (only lost one rock) and dignity intact.  On to the ropes course!Instruction was brief: climb up, make sure you're always clamped into place, and make your way through the suspended cables some as high as 50'!  My favorite was finishing off on the zip-line, my least favorite was the tight-rope like dual cable where I tried to be slick and nearly dangled 50' above the grass.  I was clamped in, but I lost my footing and scrambled like a cat in a swimming pool.  Phew!A 4-star review could have been earned, but some of the equipment was starting to show signs of aging.  Nothing too serious, but one of the helmets provided was strictly sized for the Jolly Green Giant. This is a great place to go if you've done all sorts of other group activities and are looking for a more physical and exciting challenge!  Way better than amusement parks, and much more interactive than a game of bowling or similar!", "date": "8/10/2009"}, {"review_id": "0HODhSHtThegycrzKYb1tw", "user_id": "LnClHGGIs-q823V3XSeedA", "user_name": "Chris M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Im a fan of this place...this was my first time ever doing indoor rock climbing...and me and my friends had a blast...theres different routes you can go up and the're all color coded...the whole vibe is real chill...everybody was real friendly...staff and other people climbing...I really look forward to coming back soon...", "date": "2/5/2012"}, {"review_id": "NGLt0Uz4pz39eDbhgbF6cg", "user_id": "9wa52Eb-ozRB79azYpUwvQ", "user_name": "Angel G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I love this gym!  The people are super friendly, everyone is willing to help you learn new climbs and the owner is chill.  Definitely the place to go on a rainy day when you want to wiggle", "date": "12/11/2011"}, {"review_id": "F3967TB19YD3yqbzecMKCA", "user_id": "MBvC-NkoMUbN5Kh9BWr8NA", "user_name": "nancy r.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 2, "useful": 1, "funny": 0, "cool": 1, "text": "Loss of one star due to the location being hard to find. It is in the back of a business area. Also the guy that answered the phone didn't give us proper directions. Loss of second star due to lack of customer service. My friend and I asked for assistance. No one was in the front desk for five minutes. A group of guys were sitting in the front so my friend and I decided to leave and take our money elsewhere.Loss of third star for not even being able to try out the climbing center because no one was willing to help us. Could have been a bad night but I was looking forward to coming here since it is the closest place from my house.Fortunately I found a better place to go rock climbing. I would give this place a chance if only next time someone were to be there to help.", "date": "1/16/2009"}, {"review_id": "ld4m8hg9j7GM6AHuBjBF0Q", "user_id": "HyTv5K1RbLeJ3JWmV_WUwg", "user_name": "Andy G.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Beware: You'll be addicted.  This place is friendly, it's nearby, it's a place to get your climbing on.  I've been to newer, larger, more impressive gyms, but you know, this will likely be the place where I'll stay for a while.  The price is right and it's just relaxed.  I've yet to see them change the courses much, but being somewhat of a beginner, I have plenty to go through before I get bored.", "date": "2/1/2012"}, {"review_id": "w2RnVqofKoHeW-iQpQx7ow", "user_id": "REMyIi7SSFmpWEhdN04j9g", "user_name": "Parker W.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "If you are sick of the pretentious nature of some local indoor climbing gyms,  Rock City is the place to go. Shaun, the owner, hires some of the friendliest staff around, Matt, Ken , and Sam, just to name a few are always willing to go the extra mile to help the wayward neophyte climber. Members receive wholesale prices on most gear, so shop what you want at REI then buy through the gym. The gym just opened up an over 3.000 sq. foot extension to their climbing area. There are routes for all levels, extensive amounts of bouldering, top outs, lead climb routes, and top roping. Also there is an super cool cave system that goes all around the facility.  The rates are  more reasonable than other gyms in Orange County making Rock City the cool place to climb locally.Final note the map to the right is incorrect, the gym is off La Palma and  Kellog, between Lakeview and Imperial exits off the 91 freeway.", "date": "11/1/2007"}, {"review_id": "_fi8aSg6miqOgLdmuKFL_A", "user_id": "oYcC84dw-z2lYt3JyB9XQw", "user_name": "Michael A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Can't beat the environment! Awesome people, awesome instructors, and awesome courses for beginners through advanced. If you've never been climbing before i recommend rock city! CJ is awesome :)", "date": "5/29/2014"}, {"review_id": "220i6SjHB9FCtTN_1eL7OA", "user_id": "zGpaD7OAjfHtAwM9ZhEo-Q", "user_name": "Takeshi C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Plenty of walls to climb and not that much people when i came on a weekday afternoon. Price is $15 for all day climbing, they even have a mini cave area where you can climb through but it is not for the claustrophobic as its a very tight small vent area.", "date": "8/26/2011"}, {"review_id": "W4wbTCeeHbNv0acdR7lxog", "user_id": "yLhe0EqYknbWKa2PBgqxjg", "user_name": "alli c.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm one of the annoying people Justin P. talks about :)  I take my Junior High students here on occasion and let them go crazy on the courses for a few hours.  What an unbelievable value it is!  Rates are posted on their website, but in general, they are more than reasonable.  Their staff is always friendly and accommodating.  The first time we went, I came with a dozen sugar-amped kids on a Friday night without a reservation, and apparently smack dab in the middle of little Mary's 11th birthday party.  They did not turn us away (haha, I would have!) and seriously bent over backwards to make sure we had a good time.  And it wasn't those scowling-FINE-we'll-take-you responses because we were walking pockets of money, but really sincere, goodhearted service.  They did a great job going over all the safety issues and kept a constant eye on that during the night.  My kids loved the cave system that they had snaking throughout the place, and had a good time testing the waters with the beginner walls, working up to the moderately hard walls, and marveling at the rock climbing gurus that inhabit Rock City.  I think they must have a few rotating apparatuses other than walls and caves in the gym.  The first time we were there, there was a large rope ladder, and now they have this crazy never-ending treadmill wall.", "date": "5/14/2008"}, {"review_id": "U874td3qqsscjlnbXhDU2w", "user_id": "JFigD0tojrQG22GBitQGWw", "user_name": "Alia C.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Honestly, I have nothing to compare my climbing experiences to but I can say that this is quite the facility. We have now gone twice and the second time was more enjoyable because I gained a bit more confidence. I recommend purchasing at least the $100.00/10 visit deal because it can get pricey if you pay visit by visit. Pleasant way to spend the evening with your other half.", "date": "2/3/2011"}, {"review_id": "tEjpr3NjQXLGFmscq9HQYQ", "user_id": "EnarL2WfWyEfCE2HVg_Yrw", "user_name": "Doug V.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This isn't my regular gym but my friends are regulars here so I climb here once in a while with them. I wish I lived closer so this could be my go to gym cause this place is awesome! The routes here are way better than routes at other gyms. The climbs here are fun, challenging, and unlike some other places, you don't have to be super tall to finish the climbs.My only complaint is that its a small place. When it gets crowded, the back area can be kind of dangerous to stand around at. They're also VERY limited when it comes to sport climbing. There isn't too much room for top roping either. If you're primarily a boulderer though, this place is for you.", "date": "2/10/2012"}, {"review_id": "bE7vSuXBctIU2atG8kZAaw", "user_id": "yg51nbiQ59Fxjm8Q-PYXNA", "user_name": "Kevin B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here because I got the groupon deal with a friend. We decided to try something new that would keep us active and was fun. This place is great. This indoor rock climbing center has different climbing paths for people of varying skill levels, so anyone can do it. This also allows you to gradually build your climbing skills as you progress to the more difficult routes. They also have an indoor cave route which I didn't try but would like to checkout one day.The staff here is also very friendly and knowledgable about climbing and climbing gear. I don't remember the name of the employee, but he took the time to give us suggestions on climbing since it was our first time and even recommended good affordable gear for beginners which could be purchased at a rock climbing warehouse nearby. I really enjoyed my experience there and plan on getting a yearly memebership. iBottom line: this place is fun, affordable, and a great place to get some exercise.", "date": "2/10/2012"}, {"review_id": "x3pV-nTAiYLchECnjydZwQ", "user_id": "DjE4KPGG73bZBtzrPIqMDw", "user_name": "Nima H.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My first time there was great. They really took time to show me & my wife how everything works. I went a second time and invited a friend too and it was good times!!! I have 10 passes now and will be using them soon. Price is good, courses are challenging. Try the cave too. Great work out.", "date": "1/29/2009"}, {"review_id": "DUU86PJH7d-0XSiKw43fCA", "user_id": "f2zW0L-V1q359KhWvzclmg", "user_name": "Sam S.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 1, "funny": 3, "cool": 1, "text": "this place was siiiiiiiickwent here for a friends 25thb day party! HAHA i know!!this was my first time rock climbing of any sort--it was extremely difficult for several reasons:   1. i'm asian and short...so um short arms and legs don't make reaching for rocks especially easy   2. i was not properly dressed. Most ppl were in sweats and bball shorts. I was looking cute, not comfortable :D   3. i figured out later, in order to climb more efficiently, you should keep your body close to the rocks   4. i was also terrible at holding the line for other ppl when they climbed. MAN i'm awesome!!!", "date": "5/2/2010"}, {"review_id": "KRT56ZROkvQdAeXpgQR7Ug", "user_id": "fmcnDowzWw_SCeAnNDUKWg", "user_name": "Anne N.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Rock climbing Rocks!! This was my 1st experience with rock climbing and I loved it! It's a great place for beginners and super advanced climbers. The facility doesn't look too big at 1st, but there are more than enough walls to climb and some fun caves to crawl through. The harness and ropes are extremely secure and you feel very safe climbing the walls. The floor is also heavily padded for extra safety! An all day pass w/ climbing shoes and harness rental was $19/person. I would highly recommend this place to anyone looking for something fun and challenging to do! It's a really good workout!", "date": "2/20/2010"}, {"review_id": "m5JJpDd4WQ3TlxYdIQjTbw", "user_id": "xRT3FkWpiN6cxEAv6cvRBQ", "user_name": "matt g.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "i have a pass and enjoy the comradely. helpful staff/climbers that offer up suggestions and teach technique.  friendly ppl but compared to other climbing gyms equipment seems to be a lil old. although i find if far more fun to just climb without ropes or harnesses.If your going for the first time, don't fret if you only last 30 mins climbing. youll be using muscles you dont use often.  if i recall correctly its about $12 to climb and $3 to rent shoes.  Avoid the 3rd tuesday of every month. Passholders can invite 4 ppl for free.  It can get very congested.  Weekends seem light turnouts with occasional group or birthday climbers. There is a small japanese joint in the same lot that has great cheap chicken bowls :)", "date": "11/15/2010"}, {"review_id": "yRg1NrAvJcfAmxwMItYMPQ", "user_id": "keznqnyQXqIGDcmJw10v-Q", "user_name": "Billy P.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "i dont goo all too often, but ive been to a few others that are better. the walls here are not very tall, but fun for beginners. Its pretty small and a tight fit, especially if ALL of the USUALS are there. This place has a bunch of groupies, which is pretty cool, but also intimdating when you want to climb the walls theyh're climbing. Eh, good for a local place.", "date": "4/28/2010"}, {"review_id": "H09a3mn3Edof3P7DxyzCXA", "user_id": "Y5t_eFAxNLIyjplhy-wetw", "user_name": "H K.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 1, "useful": 0, "funny": 4, "cool": 0, "text": "I had 6 months of novas rock climbing experience before I moved. Came to CA and discovered Rock City. The Facilities are extremely small and cramped. The trails that they consider to be for beginners have unrealistically small toe rocks....to the point that it made the path unusable. :( I will continue to look for a place to rock climb as it is one of the best work outs bar none! Sadly .....It looks like I will have to look a little further away. This facility is NOT for those learning to enjoy rock climbing.", "date": "7/7/2011"}, {"review_id": "d1ZG491aTz8zqc1Wx6_nPQ", "user_id": "cNnskUCX2ZH4vGResE85Dw", "user_name": "J M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Place is fun. However, do not buy a membership. It is a $100 to cancel and the memberships are for a year. Will never go here again.Waste of money", "date": "8/21/2012"}, {"review_id": "q_HM7Ivqjcy2Peo4UuPFjw", "user_id": "660jXM9TO63zMX6EKveqzg", "user_name": "Jeff A.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you are looking to try out some rock climbing, look no further, this place has a friendly staff, awesome equipment and an all around great and welcoming atmosphere.  Came here kind of on a whim after eating in Brea, and am sure glad I did.  When you try to find this place at first it is a bit difficult because it is hidden in a sort of \"industrial\" section where it looks like there are only warehouses everywhere, so if you are looking for it, don't give up.  Anyways, I walked in with my girlfriend and was immediately greeted by two men behind the counter who were exceptionally nice to us.  We explained that we had never done this before and they seemed glad to assist us.  When we started, one of the guys helped explain all the safety procedures, then proceeded to let us have at it.  The area had a decent amount of people for a Monday, but we were able to find sections for us to climb no problem.  The facility was relatively clean(as clean as you can expect a gym/workout center to be).  We climbed for around 2 hours, and it was an awesome experience.  If you are thinking about trying this out, take the time one weekend to give it a try, trust me, you won't regret it.", "date": "4/23/2012"}, {"review_id": "QvNnp3_4fISewHHZ2hus8A", "user_id": "6ntWgPibXmlGww1rl8r1dA", "user_name": "Jared B.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "As an on-again off-again member for nearly ten years, I have to say that I love Rock City. They have a great staff, great facility, and best of all great clientele. You get to know your fellow climbers and make some great friends, and pretty soon you go not just because it is a great way to stay in shape, but because it becomes a social experience.      At some point in time I've been to almost every climbing gym in Orange county and Riverside County and I can say with surety that while Rock City isn't the largest, it has always had the best set-up as far as routes are concerned. They have a wide variety for all styles and ability levels.      Its always been an enjoyable night when I say to myself \"I'm hitting up Rock City tonight,\" and I've never regretted it yet.", "date": "3/1/2010"}, {"review_id": "nfcDnY66uaUhVAWIdOR9Aw", "user_id": "eK9JrOpk36wYzlP3yKsMQQ", "user_name": "Chang L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I just started this rock wall climbing thing about a month ago...and already I'm hooked. For years, I've tried to find exercise/workout that wouldn't bore me..and I've found it now. The first gym I tried was Thresh Hold in Riverside. That gym is definitely fun; but it's too far away from me. So I was looking at all my options for a family membership in OC. Rock City has the best deal. I think it's somewhat more challenging, at least from a beginner's point of view, than Threshold. Nonetheless, I have enjoyed it every time I went there. The tunnels are a big hit for the kids. L", "date": "8/27/2009"}, {"review_id": "O_G9nZ5dp_G8myHjYZz7OQ", "user_id": "I9gfo5tIvyCkzOzy1f6siw", "user_name": "Makayla M.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "OMG this place was REALLY fun! I went with a group of friends and some family and we all had a GREAT time. We really liked the harness climbing, but we still enjoyed the harness-free climbing. The employees were all really nice and helpful and the owner was GREAT! We will definately be going back!! :DDD", "date": "1/22/2012"}, {"review_id": "9xMwAvuAo89_Oh9EfK70_A", "user_id": "vDezKfm9LDVDLIpSNg_9kQ", "user_name": "Sarah Y.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a first time boulder so I don't have anything to compare this experience to, but that being said, I felt very comfortable here. Staff were nice and it was a casual and relaxed atmosphere. There was a kids' party going on. The place was smaller than I expected. Another reviewer mentioned it being the size of 3 Starbucks combined. That's about right. Despite the size, there seemed to be a variety of levels of walls to climb. I came with 3 friends and one of them is a regular so he was guiding us on technique and foot placement. All in all, a great workout and reason to get outside the gym (sometimes you just get tired of hamstering on machines or the routine gym classes, right?). This is a breath of fresh air. Also, I felt that it wasn't stinky when I went (on a Friday night). They had the doors open and fans going. Don't expect floral scents, I'm just thankful it didn't smell like feet.", "date": "4/4/2011"}, {"review_id": "wgpQN2exNXVlyR79-_Zczw", "user_id": "j_C-_NPUiC3zzmSOn5G8fg", "user_name": "Davis T.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "really fun place with a ton of walls to climb. this place is a cool place to go to for birthdays or to 'hang' around", "date": "7/8/2011"}, {"review_id": "FheZyIFKZ68dw82rTc6QUw", "user_id": "cTS6tBJ_AkNX1AZhYsdacg", "user_name": "dan b.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym has a ton of different bouldering terrain that keeps the problems interesting.  I was just visiting for the weekend and decided to check out the gym.  The staff was friendly, the routes were fun, and the other climbers were nice once I brought up any conversation.  The owner mentioned that they completely change the routes every 3-4 months which is a huge plus because our gym still has routes up from last year.  The bouldering pads were good enough to fall on, but weren't shiney and new.  But that is what you would expect from a real climbing gym that is being used for climbing.  I never noticed any smell or anything bothersome like that.  Lastly, the price is VERY fair.  Most places charge more, and charge you to do the belay test, etc etc etc.  I thought they were fair in just making sure everyone is safe without the worry of nickels and dimes.", "date": "7/4/2011"}, {"review_id": "tK7RudDd8OBuIEulIkAiTA", "user_id": "KWCGQRCXbveiwwd9HiHWSg", "user_name": "T. N.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "i can't get enough of this place. the workers and climbers are so friendly. great for beginners, great for pros.", "date": "5/18/2010"}, {"review_id": "sKJMw3vu0bhoUQjs1NbvTQ", "user_id": "3HGJp-KlQSsPT8AxbHQiRg", "user_name": "Leandra L.", "business_id": "i_bedMZOzBBQIJjW-mF_3w", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "lots of fun routes! bouldering is more of the treat here, as sport climbs top out at 20 feet (thats a guess). recently expanded, this means more fun!theres an awesome tunnel that runs throughout the gym, sweet!", "date": "1/15/2009"}]