[{"review_id": "wF8PCetk41HBCw6SqgSeTA", "user_id": "1Ux2xgezyVY_r8PFbYm-HQ", "user_name": "M N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Solid climbing gym.  Big lead wall, big bouldering section, lots of auto-belays.  Nice regular gym.  Wish they had a military discount.", "date": "1/5/2019"}, {"review_id": "4Agw9o7vJb80SVpZhw2KJQ", "user_id": "FPyfBpnrtt6Amdi88oPbQQ", "user_name": "Minh T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My first time rock climbing I went here during their national climbing day when the entrance fee was waived. The staff well extremely helpful and helped create such a positive experience for customers that will have you coming back for more. When you first enter the facility you will have to fill out an online waiver and pay the entrance fee. After that you will be given a small orientation on how to use the facility. The facility has a gym, yoga studio, auto belay (a safety rope for your harness that lets you down slowly) rock walls, and staff who are willing to help you belay up the rock walls. After your orientation you will be suited up with a harness and you can rent some rock climbing shoes if needed. I recommend you renting a pair of rock climbing shoes if you would like to climb the harder rocks but it is not necessary. When you finish up with suiting up it's time to climb! The rocks have difficulty labeled on them starting at 5 (which is like climbing a ladder) to 11 (the really advance stuff). I recommend starting at 5 and working your way up. Alternative if you don't like climbing high they have a side of the gym designated for bouldering.Overall I had a positive experience and was really thankful for the high energy staff who made me feel comfortable belaying me up the wall and guiding me from the ground. Give rock climbing a try at Rockreation, you won't regret it!", "date": "8/18/2018"}, {"review_id": "hXkbEIRl_yjxcSro9oLbbA", "user_id": "R4eetEGSZq1THK6jRoCVQw", "user_name": "Jackie P.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 4, "funny": 3, "cool": 3, "text": "I actually really like this place! I've been to 2 other rock climbing gyms and size wise for bouldering, its pretty good. I came here because it was closer to me than sender one. It was my friend's first time bouldering as well and they had fun (especially for someone scared of heights) LOL. College students!! Fridays they have a special for 10$ day pass and 5 dollar rentals (shoes) I'm not sure how much harness/chalk is for rock climbing. I checked in for free chalk so it was super cheap for the day pass!! instead of 18$ day pass. I'm pretty newbie with bouldering, I can only do v0-v1. I don't know the whole cross over, finger strength, \"on/offs\" what have you for finessing this sport, but it's still a lot of fun for me. I prefer bouldering over rock climbing because you don't really need another person there to do the rope for you, BUT, I did see a kid climbing on an area where the rope is attached for you?? So he basically was able to rock climb himself safely, which I thought was cool. The facility is clean, I like the mini gym in the back. Yoga courses available, etc. The restrooms are IMPECCABLY clean. The cleanest restrooms I've seen in a rock climbing gym (actually cleanest restrooms I've seen in any gym..... lol) Lockers, showers, even a complimentary station for hair spray, lotions, and a blow dryer?? LOL I thought it was a nice touch! Would totally come back!!", "date": "2/25/2017"}, {"review_id": "GBGoJsxHFQeAG6cKxIyWSQ", "user_id": "7vEautNvV11DkPRyxtzZwg", "user_name": "Kendra A.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is truly incredible. They have an amazing college student deal on Friday's for an all-day pass for $12, which doesn't include the equipment. The rentals for the equipment is $5, making the total come out to $17 per person. Very reasonably priced and very fun as well. They have beginner paths if you have never rock climbed before and they also have very advanced ones as well. They also include a personal gym in the building as well for anyone to use.", "date": "12/30/2018"}, {"review_id": "wnG_XOU8gyNdRp8Q8X6FdA", "user_id": "_FCj3Dcr_QvaTm2PYex7RQ", "user_name": "Nader M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic...good for any level of climber.  They have 4 auto belay machines. Bouldering for beginners and advanced, top rope and lead climbing. Christian was very attentive, as much or little as needed.  Great place to bring family or friends.  Love the music as well.", "date": "12/28/2018"}, {"review_id": "4g_j6ukSw4oNSN4K84DEqA", "user_id": "1nOTOtA40EmQbAAxyJdk6Q", "user_name": "Rachel I.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "First off, it smells extremely bad. It smells like sweaty feet and BO. Everything looks dirty. For what it is, it too expensive. The walls are too small and and paths aren't well thought out. The people that work there seem to not really care much about what they're doing. It seems like they don't care about keeping people around. It's not beginner friendly. I haven't taken any of their lessons but I would stay away. The rock climbing area I would rate one star but for the tiny gym they have and the restrooms I give it a 3. The bathrooms are overall the best part... not going back", "date": "9/30/2018"}, {"review_id": "uLnsE4JrIJg97XQm8D2u6w", "user_id": "7iqgvN8M9KhB3rFPLimuEw", "user_name": "Janelle V.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "As someone who is afraid of heights this was a good baby step into conquering the fear. I decided to take my boyfriend for Valentine's Day and we had a blast. We came in as walk in's and didn't know what to expect. The people at the front desk were so nice and helpful! Neither of us knew how to belay but we really wanted to get on the wall so Alan, one of the staff members, kindly belayed us. He was super nice and patient and made the experience great. Definitely felt safe and had a ton of fun. We will be coming back in the future to take the introduction class and learn how to belay.", "date": "2/14/2019"}, {"review_id": "btqYCDB5p3rCcfLnHI4BiQ", "user_id": "jDRD-gCyUiSkGR8j0WEoKw", "user_name": "Ashley N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "The rude guy at the front tonight should find another job if he doesn't like informing new customers (:", "date": "1/31/2019"}, {"review_id": "D2FxcxiOArrn7NvH9kYRqA", "user_id": "um_ebCU8SoN6IkZtRJscyQ", "user_name": "Julia J.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "A cool place for a birthday party! Had my son's BD in here and all guests including the birthday boy had a blast. I brought most of the food so I cannot comment on their food options.", "date": "6/27/2018"}, {"review_id": "kl2unsSwhmCp0OwV3bmSrw", "user_id": "BXakI72Kaa5I0LzIxXLihg", "user_name": "Shannon H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing gym! Nice community & amazing lead area. This is the first gym I've gone to where the staff is welcoming and not condescending to beginners. Highly recommend if you are looking for a family friendly gym! Going to try out their yoga and fitness classes next month. Top rope- 4 auto belays and there are plenty of routes for beginners and more advanced climbers. Lead - It is a large lead area with a complete arch. I definitely get my workout in when I lead because I am afraid to fall so I hold on to dear life and forget my technique. Will need to work on that! UPDATE: The kickboxing class w/ Ibok is a lot of fun. You burn a lot of calories in that hour and definitely will be sore the next day if you've never taken a class with him. This class is fast paced and extremely tiring. It is a wonderful workout. Yoga- I am terrible at yoga. It is difficult, but the Classes and instructors here are patient. I am now doing acroyoga. You should check out acroyoga if you have the chance to do so. It is different an extremely fun.", "date": "8/18/2017"}, {"review_id": "Eh9XHG8WyA0IdsnbuK3DbQ", "user_id": "EebIIcoDdqH6WF2COxFipg", "user_name": "Leland S.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "I am not much of a rock climber but my sister had some down time and managed to find this place on Yelp. Parking | We got here on a Sunday morning and it wasn't packed. In regards to the space itself, it had about 40 spots.Feels | Pretty spacious place with a lot of activities to do (harness or free climbing). Great rock music to listen to as you climb.Climbs | I've only done a few beginner free climbing and rope climbing. The names on the climbs were creative and fun.Customer Service | Employees were helpful and friendly. I enjoyed how they assisted us with the price without trying to upsell stuff.TL;DR4 stars. Pleasant experience for my first time climbing. Price was about right for an all day pass, the climbs were pretty fun, and the employees were helpful. I wouldn't mind picking up a hobby here.Tips:* Check-In for a free chalk bag", "date": "5/21/2016"}, {"review_id": "wGYbmrstcBnJzJ_sPw4lxA", "user_id": "C4AN8sRB0Pwgfv9D6D2x5A", "user_name": "Patrick S.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "It is expensive when compaired with gyms like Hanger 18 but has fewer locations, less hours, fewer and shorter climbs. Futhermore, when I went in to climb today most of the gym was closed for more then 4 hours so they could set but they weren't even working in most of the areas, they were just closed. Not worth the money.", "date": "4/19/2018"}, {"review_id": "CIOF4rzeHXX0fEbOEUsU9w", "user_id": "nAxFMdRNnUlo6ZJwVZBNnQ", "user_name": "Vivianne M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My friend has a membership there and it includes climbing, yoga and gym. I think it's a great deal. She got me in using for friend pass. Shoes were $5 to rent (I think). It was my first time ever climbing and I'm glad I went here! Next time I'm up in the northern part of CA I want to make another trip.", "date": "7/8/2018"}, {"review_id": "92K-cQTiBq42H50j4qV-8Q", "user_id": "wvxISFyzh0e-pDJiZ8SMcw", "user_name": "Lauren N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Rockreation is the best! I got a membership back in December and it's been great! Everyone there is very friendly. The routes change consistently, so I never feel bored. The great thing about the gym is that there are yoga classes, a small but decent weight room, locker rooms with showers, and cardio machines available for use. Also, with membership, you get to bring a guest monthly for free! I love climbing here - it's a fun way to work out and make friends along the way.", "date": "3/25/2018"}, {"review_id": "PhHyklq9J_OfQ-zB5Q833Q", "user_id": "Erg3Zc6YjdJq8jLaJtbjqw", "user_name": "Susan G.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "So much fun! And the staff was amazing to the group of 5 newbies that I went with. I will defiantly be back to this location!!", "date": "4/11/2018"}, {"review_id": "J29skL1usz32MQ4GwKQw_g", "user_id": "QMo89FPDcTADdrw5lqSQ7g", "user_name": "Ana D.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Really good workout. The front desk boys were nice and explained everything as first timers. The only complaint I have is that it smells like sweatty socks, needs to be aired out but overall its nice for a climb.", "date": "10/20/2017"}, {"review_id": "eFxin1FCqSSIo_CFyw76Ag", "user_id": "1XbS0Oa7f5uUO3NHClDy4A", "user_name": "Dean C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Really nice community. I'm more of a boulderer, hence the 4 stars because the bouldering section is somewhat small and limited. They do have an interesting style of setting which I enjoyed very much. The rope section looks super fun, I'm sure if you enjoy top roping or leading, you'd have a blast at this place!", "date": "4/18/2018"}, {"review_id": "sl2UMlXC8t1XMlcZArY7Xg", "user_id": "pVVCowSOhIK1kVsrkVnEWg", "user_name": "Diane C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 4, "funny": 0, "cool": 0, "text": "My 12 year old son really enjoyed this place. The girl at the desk was pleasant. Drawback, this place smells terrible, looks dirty, and lacks ventilation. I would hate to be here on a crowded day. When we went, there were only 3 other people actively climbing, and it smelled pretty bad (like dirty old socks).", "date": "6/20/2017"}, {"review_id": "lP1pEOU6wCmZL_DA_phMYQ", "user_id": "RK_zk9zAyoW8ahII-g_YMg", "user_name": "Eric M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 2, "useful": 3, "funny": 7, "cool": 1, "text": "I've travelled and climbed all over and this is easily the second worst gym I've ever been to in the country. It's small, has short walls, and just feels old and dingy. The routes are poorly set, and there were a ton of screaming children there for a kid's birthday party. They have an arbitrary \"gym policy\" of no gri-gris. They say gri-gris promote \"inattentive belaying\" but this is old-timey, backwards thinking. Studies have proven that you are much less likely to have an accident using a gri-gri versus a tube-styled belay device.The reason I gave this place two stars instead of just one is because they recently remodeled their bathrooms and they're beautiful. If I had to rate just the bathroom it would be 5/5, I would definitely poop there again. Who would I suggest this gym for? Parents who are looking for something to do for their kid's birthday. They won't notice the difference that it's a terrible gym and they can just add to the yelling and screaming. Or maybe if you're new to climbing and don't have any friends you can go to use the auto-belay. Or if you need to use the bathroom. But besides that I'd stay away from here", "date": "3/13/2017"}, {"review_id": "IL3xqGwnEL8kkqKBU3KOOQ", "user_id": "_iSpVgRi0gQzhIXlN68Z2Q", "user_name": "T T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Nice cozy rock climbing gym located in Costa Mesa.I used to come here often a several years ago when the price of the day pass was very low. Unfortunately the price of the day pass here has since increased but totally understandableFor having such a small space, rockreation fits a surprisingly decent amount of variety into their gym. This includes bouldering, a few auto belays, top roping, and even a section dedicated for lead climbing.  The nice thing about this gym is that you get to engage in a lot of different types of climbing and the staff is friendly.The main downside of this gym is the size.  While the variety of routes and problems keeps it interesting, the walls are way too short for top roping or lead climbing. The dedicated lead climbing area is a very cool addition but the height is pretty borderline if you're looking to lead. If you come here to lead I suggest you climb vigilantly as if you take a big enough whip you can definitely get pretty close to the ground.Overall rockreation has a pretty nice atmosphere and good variety. I wouldn't recommend this gym if you're new to climbing and used to more commercial level rock climbing gyms but definitely come give it a try!", "date": "1/15/2018"}, {"review_id": "r4SAlG-Ve6FOIkxW26OGvw", "user_id": "IqLRec062oV-EX-sEuo5Ag", "user_name": "Average A.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A smaller gym than where I've been to, but the workers here are quite polite that they're one of the reasons I like to come back here. The routes here are also quite interesting and fun to climb!", "date": "8/20/2018"}, {"review_id": "T_Cuqmkh98B5MT19QH8Ajg", "user_id": "iKD6_7ULCNt3DuuWeSOf3Q", "user_name": "Mariel C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 4, "funny": 2, "cool": 4, "text": "I bought a groupon for a belay lesson and an unlimited week. The staff is so friendly our instructor, I think her name was Lauren was really sweet she took the time after class and showed and gave me some bouldering tips. Great gym, great people!", "date": "6/13/2014"}, {"review_id": "mUpl6luCQCgULbHme6fZ2w", "user_id": "saHul2YocYeCjdXHR5Lltw", "user_name": "Kaelin C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Our office had a deal with opening an account at Rockreation, which included all of the Kickboxing/Yoga Classes, and the full Gym they have in the back.  Joining, i was stoked to take the intro classes to learn more about climbing.  I ended up ending my membership due to lack of extra time, but definitely would suggest the gym to everybody who does climb.", "date": "7/31/2018"}, {"review_id": "3AXYraNc8wA_5Dpwux2-XQ", "user_id": "AOH1c-tLs2V3Ws4vCY9DMA", "user_name": "Eugenio V.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I was looking for a place to get my teenagers shed some energy.This gym is decent, has a good vibe and very friendly staff.They have a \"Friday\" college special.", "date": "12/31/2016"}, {"review_id": "zbAyhWHxJn__sy0y6-P5iA", "user_id": "tqJhT1jnLatLu5I6GYXsiw", "user_name": "Anthony E.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome spot if you wanna go bouldering /rock climbing. They have very friendly staff yet the space is a little limited. The gym offers gravity classes, has a small gym, and cardio equipment, and is very clean. The space itself is a little limited so if you usually like a lot of space, this might not cater to your needs. They have belay and auto belaying mechanisms on a few taller walls and they have a horizontal wall that goes across the middle of the gym. Would recommend this spot for a more intimate crowd and if you like super nice bathrooms :)", "date": "6/24/2017"}, {"review_id": "KhGjmXI5QrcGroK3Wc9uMQ", "user_id": "O9dJ38LAuj0dC7Pbaaq-5g", "user_name": "Annie D.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 4, "funny": 0, "cool": 2, "text": "Took the Fight Gravity 3 class series here. After taking my first rock climbing class over 5 years ago through OCC with ClimbX, I mostly recreational climb for fun now and then. I usually climb with my friend Steven L. and we like trying new gyms. However, even though we weren't new to climbing, the classes really helped to make us better climbers. I definitely recommend this class to anyone interested in climbing. The staff are friendly, experienced and knowledgeable. The first class is basics: safety, belaying, knot tying, equipment, etc. The second class is feet; how you should be moving your feet and using your legs. During this class we had to climb with tennis balls in our hands! The last class is hands and technique. How to deal with those nubs,choosing the best hold and how to flag and balance your body weight. I also like the auto belay devices they have here. Very cool. The routes are fun and challenging and true to their grade. My only complaints are facility could use a little upgrading, especially the bathrooms and sometimes it difficult to see which color belongs to which route. But all in all, a wouldn't mind getting a yearly membership here if I had more time to climb,", "date": "9/16/2014"}, {"review_id": "8-MNwoR5eQHB3wf66Xdrvw", "user_id": "gKydIG_sXbLkh-PHmSPAJA", "user_name": "Patrick I.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Came here with friends last weekend to practice for an upcoming climb. Have visited previously 2 times prior to remodeling. Felt compelled to finally write a review. The staff have always been friendly and helpful to me. As a novice I appreciate the range of challenging climbing routes, well maintained climbing rental equipment, and the newly remodeled bathrooms, and small gym area. I would love to make this place my home gym if only it was closer. Look forward to coming back another time.", "date": "2/15/2017"}, {"review_id": "XU3M8q9pYBBmhGRziSTIMA", "user_id": "0U_i3TKyHGraMnWiBLkUfg", "user_name": "Leanndra R.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "awesome bouldering setup & was hesitate to use the self belaying machine but once you trust it & let go it's awesome", "date": "3/28/2017"}, {"review_id": "jiTIzNR6ZnIu5EF5d8Lqng", "user_id": "yLW8OrR8Ns4X1oXJmkKYgg", "user_name": "Kimquyen L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 23, "funny": 10, "cool": 19, "text": "Came here for free climb for their 20th Anniversary =)Great layout; big spacy area to climb & boulder. The even have a workout gym area too =)They even have 2 auto belay devices which is very cool to use. =)They have 3 locations: LA, OC (Costa Mesa) & Salt Lake City.2nd biggest OC climbing place after Sender One. One-Day Adult Visitor Pass$16.00 One-Day Child Visitor Pass$11.00 Rental equipment is a separate charge depending on whether you are a member/ not.There was a Groupon deal: Introduction to Rock-Climbing Package or a One-Month Climbing Membership which is expired right now but it might come back again so be on the look out for it because these deals sometimes come back again.TIP: There's a $99, you earn all three Fight Gravity Classes (a combined 6 hours of training) as well as a FREE One Month Membership (includes FREE equipment rentals).", "date": "10/20/2013"}, {"review_id": "UJft-keKD-d0Na3zesrH8A", "user_id": "BLvbYtlZ4HZDykUJZXV2uw", "user_name": "Khoa L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Pretty cool climbing, with all things u need: top rope, leading climb, bouldering. They also have auto belay which is great if you go climb by yourself. I love a place with auto belay. The walls are not too tall and the holds are all a bit worn out though. Still I think it's a good place to practice on. The grading is a bit more difficult than other gyms I've been to.", "date": "1/27/2016"}, {"review_id": "LvQYksEJxtKh9w_2uv6r-w", "user_id": "nNUEtgiiGnDw3fZvmiRcdw", "user_name": "Dee C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 4, "funny": 0, "cool": 3, "text": "Since my last review, things that have changed:-I am now a member of Rockreation. -I got to know the awesome staff and other gym members. -Their awesome cross-training and yoga classes which are currently offered for free while they are renovating their facility (how exciting!!!). -They have A/C!!! (part of their renovation)Just overall great experience and atmosphere. Thank you Rockreation, proved to me that the flashy & whistles of other climbing gyms don't mean a thang if you don't have a good and warm environment to grow in!", "date": "7/17/2015"}, {"review_id": "uQw7RMBQl67iEova6GthGA", "user_id": "S-3VkmAgF8OnxxdWArEQjA", "user_name": "Sandy T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "One of the best Groupons I bought in a long time. My friend and I scored a Groupon for $39 for 2 for their FG1 class. We came in one day to get started on climbing but we had to make reservations for the class first. The guy at the desk was accommodating since we were already there he gave us a quick tutorial of how to use auto-belay and allowed us to climb for a day, free of charge aside from our Groupon. We came back the next week for our FG1 class and Charlie, our instructor, was super patient and understanding. Class teaches you basics of belaying and was very easy to pass the test thanks to Charlie! Unfortunately we only did the week membership. I would reconsider a monthly membership because they have a little gym with classes you can take that come with your membership!", "date": "8/5/2015"}, {"review_id": "hwWIYlv_6iFI7SzPfmsbJw", "user_id": "li-a4_-upzuMY_vAKMNPSQ", "user_name": "Dennis L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 4, "funny": 1, "cool": 3, "text": "Thanx, Christian for a fun and informative class. I was very impressed with the facilities, and with the staff. Everyone is very friendly and helpful. I would recommend this to anyone interested in this sport.", "date": "4/5/2015"}, {"review_id": "zj8qLU9qdAw42EFZFU5aFg", "user_id": "MnNIKaossrKMP-hFPVLUAA", "user_name": "Blake C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of my favorite gyms in the Southern California area. Climbs are always changing and being updated. The staff is super friendly and helpful. I train here to get ready for all of my outdoor climbs. They have a great bouldering area but my favorite is the sport climbing routs right by the front door.", "date": "12/25/2016"}, {"review_id": "aLc8jUUgOWJT_wVv7OI2Hw", "user_id": "AE8nHSRPFlB4nh7CP8PlGQ", "user_name": "Tiffany Y.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 3, "funny": 2, "cool": 4, "text": "I came here on a Sunday afternoon with my friends. It costs $16 for a day pass for adults, and $6 or all the gear ( including chalk) They ended up just giving us a chalk bag for free to share. It's expensive for annual passes $514 for students, $612 for adults. If you went everyday on an annual pass it'd be $1.50 - $1.70 per day .It was my first time rock climbing ( one of my friends goes quite frequently and I was lucky to have gone with her)  I think this kind of sport is more fun if you go with experienced people.  I've gone rock climbing at fairs, but I never made it all the way to the top. This place is huge inside!! They have a huge area for bouldering, a wall for scaling, and a whole other section for climbing.  They also have a gym here!!!! Which is great for getting your cardio on before doing some strength training. They have Groupon specials which are $20 too! Everyone here was nice and helpful!  I had soo much fun, my forearms, and upper arms were sore for days after.   I also have lots of bruises on random places from banging against the wall. I also did not cut my nails, so it was hard to grip many of the wall grips.  It was a super fun and great workout !! Definitely coming back", "date": "1/29/2013"}, {"review_id": "uALjNZ7x1QG5beL-jZDyww", "user_id": "3z_lnCPq7lgeNlOzKLBLfA", "user_name": "Eric L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 2, "useful": 5, "funny": 13, "cool": 1, "text": "Just okay..Pros: Has a couple auto belays which are pretty neat. Decent top rope area if you've taken a class with them or else they won't let you use any of the two person belay options. It was a close drive for me. Has a gym with showers. The bouldering side is okay.Cons: $50 for two people including shoes is a bit high compared to other places.. especially due to the fact that my significant other and I were limited to only the auto belays and bouldering. The auto belay climbs were way too easy for me. I don't rock climb very often and when I do it's generally not that difficult regardless of what I do, but the climbs here had me bored before the first hour was over. The only thing I could do was to see how fast I could climb up the rocks or try to make it slightly more difficult by using only a certain color or something. Ended up just helping the gf figure out how to climb up certain climbs because she was having trouble with a few. Bouldering is pretty limited as well. I spent a little bit of time there, but there just wasn't that much. You're forced to take a class to use the other stuff. So more $$ to spend. Never had to do that with the other places that I've been to.Bottom line: I think I'll go elsewhere. My fault for coming here out of convenience. Oh and one more thing. There was this other couple there.. or I think they were a couple or something, but the guy kept looking over at me especially while I was climbing and I felt like some of the stuff he was saying out loud while talking to the girl working there and the girl that he was with had more intention besides just for conversation between the three of them... Plzzz... how old are you?... I rock climb maybe twice a year. I came here with a tshirt and jeans and you're here with your workout stuff and walking around without a shirt like you own the place lol.. This is rock climbing.. not 24 hour fitness.. trying to size me up doesn't prove that you have a bigger wiener... if that wasn't the case then my bad, but after they left.. it was a typical rock climbing experience besides having limited options.", "date": "2/15/2016"}, {"review_id": "luvY4XdlR3Li-HBkRaG1Yw", "user_id": "HJ2gknt7SbQvoFRAIMNHvA", "user_name": "Tony Y.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "The staffs at this place are the best.  They were being very patience giving instructions to my nieces.  Everyone here are very friendly.  I want to thank a particular female Asian staff for helping my nieces.", "date": "8/10/2015"}, {"review_id": "qUK9l9RT5QEOMeairtEREQ", "user_id": "fdwJxZVmAlWQsceMZT0eIw", "user_name": "Eikuu H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "I came to Rockreation because there was a great deal on groupon for takin the Cight Gravity One class--learning the basics of belaying and top-rope climbing. Our instructor was Christian and he did an excellent job of keeping the class fun and teaching us the do's and do not's. I like how this place had three auto-belaying machines too, especially if you tend to climb alone.The place was clean, well-organized, and I especially loved how there was great air-flow here! Some places can get stuffy pretty quick during the day, so I was glad this place had wonderful ventilation. Loved this place and will definitely go here again.", "date": "4/5/2015"}, {"review_id": "1FcN6Wnv-21MU1ekGZyd5A", "user_id": "TAYjT8R6M0aJ3O5Da0zgKA", "user_name": "Anne Q. T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Always wanted to try rock climbing, but never got around to it. Truth be told, I was unsure if I could haul my body up the side of a rock. The idea seems intimidating - thought it was just another sport for adrenaline junkies.Then, the 15yo insisted we do something different over Spring Break. So, I bought a class through Groupon. Had no great expectations. But was pleasantly surprised. Reservation process was efficient, easy. I didn't feel like a second class citizen when I'd mentioned Groupon. If you do the waiver online, you'll save 10min at check in. The class was informative (Figure 8 knots. Good communication: belay on? On belay. Climbing? Climb on. Etc).  At our initial session, there was enough time to learn the basic and get a few climbs in. The 15 yo really liked the auto belay machines: \"That's great, so you don't have to worry about someone belaying you, if they're paying attention or not.\"Hey! I was paying attention ;p", "date": "4/13/2015"}, {"review_id": "rmkK-J4cc3DWygxNs7kdxg", "user_id": "K6s0VehLGmxOpKdg_wXXpA", "user_name": "Chelsea C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 1, "cool": 3, "text": "Last night Crossfit Vibe visited Rockreation for a little after hours fun. We set up this event a few weeks in advance and were able to invite 45 of our adult friends and family to join us. The climbing gym was closed to the public and we had our own private climbing extravaganza! The friendly staff was more than helpful when it came to showing all of us the basics and giving us tips as we climbed. Most of them spent 2 hours belaying us (which looked like hard work while we were all having fun!). Overall it was an awesome experience and we all enjoyed getting out and trying something new and adventurous. A big THANK YOU to Devin and the rest of the Rockreation crew for helping set this event up and making the night so much fun! :)", "date": "2/23/2013"}, {"review_id": "Q7EuJFhBiYu-_xmvHPPTqQ", "user_id": "IVXPsRCJwcHAQjz4a25SHg", "user_name": "Katy C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 4, "funny": 0, "cool": 3, "text": "Friendly staff and great atmosphere! I was disappointed at another rock climbing gym which I left unhappy and felt unwelcomed. Here at Rockreation I was greeted by Tyler and he took his time explaining to me all these things about rock climbing with patience even as basic of a question like \"what's is belay?\"I bought the three sessions through groupon. My first session was with a large group of 8 others. It was more than just fun! I have gone a few more times after the sessions and the staff are friendly as ever.I love it here. I have taken two friends here and I will bring more :D", "date": "8/14/2014"}, {"review_id": "eBgOtlwdknq4hm6NonhFzQ", "user_id": "XpWVgMaNUrGiDAWLai2N3w", "user_name": "J. H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 5, "funny": 0, "cool": 3, "text": "I did the intro Fight Gravity 1 with a friend yesterday and had a good time.  The instructors (Sean & Lauren) were really helpful and friendly.   After the belay tutorial, we were allowed to continue climbing for the day.   I'd recommend them if you want to try out rock climbing or in for a fun physical challenge.   It's conveniently located, big enough, and has enough to offer for those new to rock climbing and bouldering to keep you interested for quite a while.The only snafu when I showed up is they didn't have my reservation in the system even though I called in and confirmed almost month ago.  Luckily,  it wasn't a big deal and we were allowed to take the class.", "date": "6/15/2014"}, {"review_id": "YCaeMIaNUXJR1eTJtRqCKw", "user_id": "wyTWXt761Qfm7x1rL-h2cA", "user_name": "Minji H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 5, "funny": 2, "cool": 3, "text": "The first time I've been here was with a group, and let's just say everything from signing in to getting geared up went smoothly. The staff here are really friendly and even coming here as a group they were attentive and helpful throughout the whole time. If you're a beginner, the staffs are really good about teaching/guiding you at you're own pace. They make sure you're comfortable, safe, and of course that you're having fun! The facility is REALLY nice. The locker rooms are well kept, LOTS of climbing walls to choose from (even when you go solo) and I love how they have a big opening that let's in the fresh air from outside. Even if you came on your own, chances are you're going have a good time climbing surrounded by cool people and a passionate staff who love what they do.", "date": "5/26/2014"}, {"review_id": "WPZ7QNB0DohKE801lfy1HQ", "user_id": "5Af5mVbYDRQ_24dBFfMgmg", "user_name": "Aaron L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 5, "funny": 3, "cool": 4, "text": "Rockreation is a great place for both newcomers to the sport and experts!  I am the former in that equation, but got to meet and briefly talk to a few of the experts.  It seems that everyone working and climbing at this gym are friendly, welcoming, and easy going.A visitor pass, shoe rental, and harness will run you about 20 bucks.  Well worth it for a fun and different experience, as well as a great workout!Once inside, there are several sections available:-  Top roping:  Where you climb straight(ish) up a wall while a partner belays you.-  Bouldering:  Sort of a \"freestyle\" section where you don't tie in, nor need a partner.-  Horizontal climbing wall:  Allows you to climb horizontally for practice (again, without a partner).-  Lead climbing:  Expert method of attaching clamps for your rope as you go.-  Gym (small):  A few weight and cardio machines are available.-  Yoga studio (small):  Yoga classes are offered.With the assistance of a very trustworthy belayer, I made it to the top of one of the \"top roping\" walls on my second try!  Working against me was my fear of heights, but my upper body strength and adrenaline were on my side and made up for it.From what I understand, this is one of the best rock climbing gyms around.  One climber let me know that she travels all the way from Ranch Santa Margarita to use this facility.I heard that Rockreation will occasionally offer a Groupon, and that may be the extra push that gets me to be a regular.  In the meantime, I'll use it to keep my workouts diverse and fun on an occasional basis.", "date": "4/16/2012"}, {"review_id": "4uoybArO9rAYpiJyZ4kuOg", "user_id": "QSTgnExQcJojY42k98W-1g", "user_name": "Jacky I.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 2, "cool": 2, "text": "Hosted my husband's surprise birthday party here last week and all 25 of us had the best time!The staff was incredibly helpful and made sure everyone was safe and had fun. The gym was in good condition and the back area for the private party was the perfect size for the group. We look forward to going back soon.", "date": "11/16/2014"}, {"review_id": "Wgsy42ADgKDAxmHPY4kz1A", "user_id": "g9F_pCZ1P-QAnGQFQP99CQ", "user_name": "Marc D.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place is great. This was my first time at a rock climbing gym since I was a little kid and I really just had an urge to use the no rope bouldering area. The guy working there was really helpful and helped get me started. The price for day use is reasonable and on Fridays it's college night which means it's much cheaper than normal if you have a student ID. The bouldering area was quite large with plenty of different types of walls and slopes. I will definitely be going back soon as soon as my forearms aren't sore!", "date": "4/28/2016"}, {"review_id": "dshmdxNzq-93cQ3TeYppHg", "user_id": "nT9hrb0nJ0CIox17zsyd9w", "user_name": "Jason F.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 2, "useful": 4, "funny": 3, "cool": 1, "text": "For a bouldering guy like myself, Rockreation was a downer. It's great for people who love to belay, but their bouldering section is horrible. It's pretty much a giant rock with the inner gone, and all the routes are cluster f*cked and hard to see due to improper lighting. Furthermore, everyone seems to want to play camp and just sit in the middle where the inner is and just chat.It's definitely not beginner friendly in the sense that you don't even know where to go and what to do.If you go to the ARC in Arcadia, or Thresh Hold in Riverside, you'll see why this is 2/5 stars.", "date": "3/6/2012"}, {"review_id": "GAkrIkTmOBky5DEU-Zi89Q", "user_id": "qKaAoPpeCsJ7BPrjDHTEUA", "user_name": "Amanda S.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great gym! I took a group on a field trip today. They had a great time! We had a two hour slot and the staff members stayed with them the whole time making sure they were safe and having a fun time. They were so VERY patient!! 5 stars to the staff members! I am very grateful. I will definitely bring my group back again. Thanks Rockreation!", "date": "4/8/2016"}, {"review_id": "d5WUSMswtDACAch5bGBqmA", "user_id": "lSdOTQ8YP4SUzT6JmTyM5Q", "user_name": "Keri P.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I took my Webelos Cub Scouts here for a den meeting last night. The boys had a blast, and so did I. The check-in process was simple and easy and we were all climbing in a matter of minutes. The staff was extremely friendly and gave really clear instructions for the boys. I think we will all be back!!!", "date": "12/8/2015"}, {"review_id": "Hlb8LaoTNCqHk9YJEaqXuw", "user_id": "F4kWTX7xr_L71DZG3_aY5Q", "user_name": "Sabine S.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "I've been climbing at Rockreation for 5 years. I was a member of the competitive climbing team, and I learned so much from the coaches and all of the staff. I'm so happy I was able to meet such great and supportive people, and I highly recommend signing kids up for the competitive team! Everyone here is a great role model, and the team helps kids have fun while getting exercise and also prepares them for climbing outdoors. I'll miss having Rockreation so close by!", "date": "7/25/2015"}, {"review_id": "7NJHGItESmpVmNYTLDKeJw", "user_id": "nzsv-p1O8gCfP3XijfQrIw", "user_name": "Anita L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 8, "funny": 4, "cool": 5, "text": "I brought the kid here with a friend to do some indoor rockclimbing. The staff were pretty cool, they harnessed the kids and they have a person spotting them and guiding them the whole way through.It was only $12/hour for the kids and I thought it was a great experience for them to try it out to see if they like it or not. They don't hard sell or push you to buy anything which is always a plus.Would definitely come back again if the kid wants to do it again. They are offering summer camp for the upcoming summer holidays so if your kids are looking for something like this, by all means check them out.", "date": "5/27/2011"}, {"review_id": "yIhLPvSuO4K5Ue1MtJ7BYA", "user_id": "rE8zEf8_M6OYCabKvE6Ylw", "user_name": "Christine C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "I really enjoyed this spot while I was in town for work.  I bought a day pass to boulder at $17.  The staff were all very friendly - Tyler checked me in and bestowed genuinely friendly service.  I left my suitcase at the airport so did not have my shoes and chalkbag, all of which you can rent there.  I noticed a massive chalkbag in the gym and was wondering if that was community chalk...very cool if it is.  I came in on a Sunday, 4th of July weekend around 2 or 3; there was a decent amount of folks there.  They are currently renovating so there were no actual bathrooms but they accommodate with porta-potties out front and also pump sinks.  It was totally fine to me and was not an inconvenience as they are probably updating the gym.  They have temporary tents inside in their weight/cardio room for people who want to change.   I climbed easy problems VB-V4 and enjoyed the setting....all types of techniques used from crimps, slopers, juggy steeps, underclings, etc.  I loved the featured walls which I don't have at my home gym...it allows friction like on real rock.  I also loved that they had a separate traverse wall - I really enjoyed this and especially that it's not part of routes on the wall.  My gym has a huge traverse; however, you end up having to stop to allow climbers to get on the routes...but here, you can go back and forth as much as you want undisturbed.  It's a small gym but you can be entertained for hours.  They have autobelays and also a finger crack and hand crack in the gym.  I didn't climb routes so can't speak on that.  Staff was nice enough to come by and tell me they were putting up a slackline which I enjoyed as well.  The patrons were all friendly as well.  Good vibes all around!  Would come back here next time I'm in town.", "date": "7/7/2016"}, {"review_id": "4ECluRJGL5hvXAln2_BCAw", "user_id": "-Tj4e-zW67MXj9Z7-Zkzpw", "user_name": "Mike L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 4, "funny": 0, "cool": 4, "text": "A fun activity for the active sportsman and for the whole family.I was invited to a rock climbing a year back when I was a little bit more limber in doing these stuffs. It's in a converted warehouse with high ceilings. There are several types of wall to climb upon. They divided the walls from beginners to a much more challenging course with inventive ways to climb. There was an arch where you can climb upside down. Safety precautions are taken at this place. You will need a partner as a backup for the latitude for the rope. I'm glad that someone is holding the ropes while you climbed up.Yes, the activity is draining of energy. The excitement  of it and the rush will contribute to that. Just don't burn out all your energy on the first climb. It's a little hard not to get nervous when you are doing it for the frist time.There's a kid's version of the course where they also hold birthday parties. A great way for the entire family to have fun.One drawback is the place might be a little bit hard to find at first, but just make sure you plot out the routes before heading there.", "date": "11/2/2006"}, {"review_id": "hq0dbPPIwCu9Ma0CVsKfpQ", "user_id": "IF-miz07oeLt9_A4JWGaAg", "user_name": "Lorraine K.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Rockreation has been my rock climbing home for the last year.  I started out knowing nothing, but with rockreation's excellent instruction (FG 1, 2, and 3) I have become a much better climber.  I never imagined that I'd be able to lead climb at all.  The staff are always super friendly and they give tips and encouragement from time to time.  All the climbers are really down to earth.  I often feel intimated going to \"regular\" gyms cause I am so lame... that I feel all the \"elite\" people are just wondering what I am doing.  It's the opposite of that at rockreation.They recently updated the gym area with new equipment and made an effort to tape some of the holds that were hard to see.  Routes are regularly refreshed.  So it's with great sadness that I have to say it's just too far for me to come to this gym from work - there's always heavy traffic on weekdays.  It's like saying good bye to family.  All those who live closer, I hope you enjoy it for me!", "date": "7/23/2013"}, {"review_id": "1n4Es4afUHf1fPTftx7Sbg", "user_id": "BTyTqs28vcZ1OrW9hrDkww", "user_name": "Greg N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Just finished their fight gravity series. Christian did an awesome job conveying the concepts in FG3. I have climbed over the years and I wasn't sure how much I would learn from the fight gravity series. FG 3 really  brings it all together. They cover a ton of information.  It's hard to remember it all especially if you can't get back into the gym for a couple days.", "date": "8/29/2015"}, {"review_id": "eZk32MwSX7AmVsqewJyXpA", "user_id": "_Q7yFAcDAJxlPjTx1YacDA", "user_name": "Anna C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic place for a beginner (like myself)!The staff was super helpful and encouraging; they fully understood what they were doing and explained pretty clearly how to start. There is quite a bit to climb here. I started off bouldering, as this was my first time, there was a lot for me to explore - so I didn't get bored. The one day pass was $20 & they take cash and credit. Fun, inexpensive experience. I'm definitely inspired to climb more & I'll probably be coming again.", "date": "5/24/2012"}, {"review_id": "V0kYm6br-u8eB22Vnq83kw", "user_id": "Xpyd6PL0P-1Dr4p6Fgpfbw", "user_name": "Jovel C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This is my local gym and I enjoy it a lot.  I've taken both the FG1 and FG2 classes and the instruction is top notch.  So I highly recommend them - especially in terms of establishing a solid rock climbing foundation.  I come here at least twice a week.  The nights do get crowded with regulars coming for their scheduled training.  What I like about this gym though over the other gyms is the community - most people are seriously trying to work hard and improve their skill so it's quite motivating.  The staff are also nice and would from time to time give some advice.   Also, the routes are regularly refreshed which is nice since we  visit so often.  But it's especially fun after a competition when majority of the routes are updated.  Recently, the floor paddings have been replaced and the gym equipment have all been updated.  Overall, I would say this is a great place to train.", "date": "6/1/2013"}, {"review_id": "YS3HA3rTEQyM71M2MZiR1g", "user_id": "R9fjuKy0UDCNt9IyoOm39w", "user_name": "Heather M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I bought a groupon for $39 for 2 for their FG1 class. My boyfriend and i tried it out and thought it was alot of fun and a good upper body workout. They spend a lot of time teaching you the basics with knots/harness etc but its all essential. The two instructors were so incredibly nice and helpful. We live too far away to get a membership but i highly recommend this place. I would definitely get one if i lived closer!", "date": "6/15/2015"}, {"review_id": "NhL_YLb85mdwWI9MPjvQcQ", "user_id": "IxSEFw5AlHqNCbueWkRxKQ", "user_name": "Alex C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "This rock climbing gym is the first I've been to in California. I plan on checking out Rock City before I leave.In comparison to Earth Treks in Maryland...Interior: A LOT smaller. Climbing walls are a lot shorter (35-40ft?) and space is pretty limited.Routes: Very different. I like that they have a wall just for traversing. The top rope/lead walls have no tapes on them, so difficulty measuring isn't very standardized. The bouldering problems are all fairly more difficult that what I'm accustomed to - even a V0 is a pretty good work out hah! Lots of walls are inclined :( (90% of them are) They use a color tape/writing system to tell what kind of V it is, which can be kinda confusing after a while. Overall experience: Price is also cheaper than in MD, 16 for day pass, 4 for shoes, 3 for harness, 5 for everything. I would give this place a 3.7/5. I'm rounding up since I feel particularly generous today", "date": "11/10/2010"}, {"review_id": "Fx7GM5lE5cp60o0Ki_Umsg", "user_id": "5hwj7sIw2FC8yrS90Qjrgg", "user_name": "LuCy t.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Rockreation is one of the better rock climbing gyms in the OC area. It has plenty of rock climbing walls laid out with different ratings from easy to expert.There is also a gym in there if you want to pump up your arms to make them rock climbing worthy. Most of the people working there have been there FOREVER. Ya, has been there since I first started coming here 4 yrs ago. Also, if you come alone, there's also a bouldering area you can traverse if you don't have a belay partner. Good to get some practice in moving around the rocks.Every now and then, they'll have a Groupon special for $20 that gives you a free intro class, 1 weeks use of the gym, and all gear. Pretty good deal IMHO.  GREAT WORKOUT TOO!", "date": "1/7/2013"}, {"review_id": "Bh3dWM52YBqCVlIIfk2jLw", "user_id": "lhyCZ18dfi4eWaBUnmjaUw", "user_name": "Stefani M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love this place! The staff is soooo amazing and helpful. We have become completely obsessed with climbing since the first day we came here. I tell everyone I know to come climbing here with me. The community in the gym is really great too. Everyone is very friendly!!", "date": "1/12/2015"}, {"review_id": "U02pB8DP2zOtshoZHfm-_A", "user_id": "B_qMOhAnVnjIx10PPqc8dg", "user_name": "Scott A.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very cool place with very nice people. I went in for one of their beginner classes and was very pleased with their professionalism and patience. Definitely worth the time and money.", "date": "6/8/2015"}, {"review_id": "4vd3owhPLPS9fGFY9bd_Vg", "user_id": "nPkTidQvXdVPZH7dgDWarw", "user_name": "Kay D.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I LOVE this gym, and it definitely satisfies all my climbing needs.  The reason I don't come here anymore (SAD) is because of the price.  I can't come often enough to warrant a membership, and the price for a one day pass is way too much (especially since I can only climb for about an hour or two before collapsing from sheer exhaustion).They used to have $5 Fridays, and I used to come every Friday with my friends.  They got rid of that and I have not been back since...so sad.  They need some sort of student discount; I cannot afford a climbing gym.The staff is super friendly and helpful, and I always have a blast here.  They are expert at setting routes and I especially love the bouldering area.:-(", "date": "8/18/2010"}, {"review_id": "lMQFVDLtIvg3mrNG-7saRA", "user_id": "pqXbUCy4pD0GUc3HQdAKVg", "user_name": "Ryan H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Went here today. This place was sick. bouldering area was huge and tons of fun. I wanted to climb on the big walls but was a little bummed they didnt offer on the spot classes. They offer scheduled daytime classes on certain days and times. It's a small business so I understand if they cant have staff there all the time no biggie. They had a cool gym set up too if you wanted to do any pre or post workout! thought that was cool and different.", "date": "8/19/2012"}, {"review_id": "MXRtFBeMhhaXAb3oac298A", "user_id": "BkXW7RhQ4P17IagHYBB1CA", "user_name": "Lm H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I have only been here twice but we are definitely going back soon... I will keep my review short since there is a lot of good information below. What I love about this place is... 1) Friendly, low-key staff always willing to help. The people really make it for us here. Some rock gyms are filled with stuck-up climbers who really don't care about anyone below their level. NOT the case here. They are extremely friendly and knowledgable.2) Great prices. For $12/hour of climb time with someone to belay you or $16 for a day pass, to me this place is a steal. 3) All abilities come here and you'll find variety on the climbs. Becuase the prices are so good and the staff is welcoming, you see parents here letting their gradeschoolers try it for the first time on up to lead climbers who are clearly experienced both on real rock and in the gym. I like a place that doesn't feel competitive and elitist but doesn't feel like Boomers rock wall crawling with kids either.The atmosphere is fairly chill and peaceful with natural light, good music and not a bunch of rules. I always feel great after going here and can't wait to go back. Thank you, guys!", "date": "10/3/2012"}, {"review_id": "epwnNiR1cpYW0jKa9YQfAA", "user_id": "bqZZIjWe3u-01zIC3gs0iA", "user_name": "MR. T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Been here twice.  The first time was better because they were nicer and the salesperson patiently walked me through how to belay.  Then they didn't charge for equipment either.  Very cool.  Now everything is a little more strict and not as \"cool\".  But the climbing is fun and there's many different places to try for all levels.  They also have the self belay devices which is great for kids.  A little pricey with all the equipment though.", "date": "3/26/2015"}, {"review_id": "RpghnH_jFy8K_vqC0XYYIw", "user_id": "ioLQrCvCBz3HmlKZeFxbJQ", "user_name": "K W.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 8, "funny": 5, "cool": 8, "text": "I've been here quite a lot, probably around 20 times. It's a pretty decent rock climbing gym, I would even say that it was the best place to toprope in the OC/LA area prior to Sender One's opening. The membership here is still a lot cheaper than Sender One, but the day pass is comparable so I am interested in how business will go here.It's quite spacious and clean compared to Hangar 18 and Rock City, and members have access to a gym. There is a pretty decently-sized lead, bouldering, traverse and top rope area. I've only toproped so I can only speak to this. They have some pretty good routes here and a lot of interesting wall features, including slabs, overhangs, cracks, and chimneys. Some of the holds are older but most of them are still quite usable. I find that Rockreation is good for getting stronger--it's definitely less technical than UCI (where I most often climb), but those overhang moves are quite challenging. They put up new routes fairly often too. I'd say that Rockreation is pretty beginner friendly. In terms of the grades, it's pretty standard, so slightly harder than Planet Granite in Norcal but easier than other gyms in the OC/LA. I find that the difference between about 5.10c/d, and 5.11a is pretty steep though. I usually toprope at 5.10c or 5.10d here.There are some downsides of Rockreation as well. The staff is not always professional, though it is really just one person whom I am thinking about who is veerrrrry slow and out-of-it all the time, I think he is on drugs. Also, the walls are pretty short, about 30-35 feet. Verdict: Best top-roping gym in the OC/LA prior to Sender One. Walls are short but routes and holds are decent.", "date": "6/29/2013"}, {"review_id": "wUcwZ9pA-KJ0De1y6XsAzw", "user_id": "1T3xLRGMVzsY-7EtgD4fuw", "user_name": "Karl G.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Rockreation has been around for 25years, so of course Climbers in the OC know of it and I've been there in the past...but in recent months I've seen lots of subtle improvements that you may want to check out!Most recent and noteable is the Updated Gym , free weights and Cardio Equiptment. Looks really nice. Ive trained at private studios and other gyms in HB and the OC and this updated area really makes me feel like Training. A retractable wall was open allowing fresh air and sunlight in on the Friday afternoon i was there. Unless you utilize the Bouldering area the second improvement may go unnoticed? The entire flooring/padding has been upgraded and replaced in the Bouldering area, go see for yourself!Every time I have been in Rockreation over the past 90 days it has been open and bright inside. The retractable doors / walls / ceilings were open and you could see blue sky while Climbing and Lifting in the Gym/Cardio area. Not sure what time of day/year previous reviewers who stated it was \"dark\" visited?I would certainly recommend to anyone interested in Rock-climbing, but also anyone who is interested in Fitness that lives nearby.I am holding back that \"fifth\" Yelp review star for the next improvement...Climb on!", "date": "4/15/2013"}, {"review_id": "W9abaNm_KppPQG9BBoKm3w", "user_id": "9RTRZ6we5KiostfczKIrQQ", "user_name": "Chris C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I am not an avid climber; the extent of my experience was climbing that 3-story rock climbing wall that used to be a the GameWorks arcade in Vegas near the M&M factory.A friend suggested RockReation to a group of us, and went went to check it out not really knowing very much about the facility or what else we'd be in store for.  We went on a Saturday afternoon, and it wasn't busy at all.The prices for everything are pretty much for day-passes, or for memberships for a certain duration of time (month, years).  My friends and I didn't have the proper training to be able to belay ourselves or each other, and to get the harnesses you have to have the training (which was about $40 for 2 lessons).  Not wanting to bother with that, there is a small area for \"boulder\" which is basically rock climbing without the harnesses, meaning you can definitely fall down onto mats, but you'll only fall maybe 6 or 7 ft down (as opposed to 30-40 ft maybe when you have the harness).The facility is GREAT though.  The people there are helpful.  You rent their shoes for $5 for the day, and for us doing bouldering for just the day, you spend $16/person (not hourly, per day).  So within an hour or 2, you'll get your workout, but it's something different, and it makes you excited to want to really train when you see people rolling around on the rocks and even when they fall and yell and their partner catches them, it's pretty much a huge adrenaline rush.Bottom Line: didn't seen too expensive, was a fun and something different to do, and lots of different \"courses/routes\" to take, and all in all a very fun experience.", "date": "6/8/2010"}, {"review_id": "CvYY1Ju3DqJFHp4wxY5b7g", "user_id": "BH5llT-_RBnOhGJ8lG7_UQ", "user_name": "M H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I love Rockreation! My son started climbing here a few weeks ago and is absolutely in love with it.  The guys are SUPER nice to him and the other kids, they don't talk down to them, and they are friendly and informative.  I had no idea this place has been here for 20 years!! The best kept fitness secret in central OC and probably the whole county for that matter.  Rates are cheap, hours flexible, this place is great.  I have a fear of hieghts but after seeing how much fun everyone's having, I am going to try it too!PS - the 20th anniversary party ROCKED! (Pun intended.)", "date": "9/23/2013"}, {"review_id": "gVdN5SD1xNZhSjDrtwp_lw", "user_id": "4r7qYLCS_PH-JC6ahmxIWQ", "user_name": "Ted S.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "It's too bad the reviews can't be separated between those who went climbing for the first time and those who climb frequently as both groups are looking for something very different. If you're coming for your first climb or don't climb often just be open and when in doubt ask. Climbing can be nerve racking at first, and for those who come to do a kid's party or such I imagine even more so, but you'll have fun and if you want, you'll leave super sore... You may  just get hooked.That said, if you're looking for a great workout or already climb and want a local gym, Rockreation is the best choice in the area that I've found. 1. The staff. They don't just check you in... most of them climb regularly and everyone that I've met on staff is friendly and recognizes familiar faces.2. The climbers. Super friendly, very helpful [including for new climbers like myself], and just fun to be around for a couple hour session. Climbing is about the community and this place gets a solid 5 for having such an open one.3. Bouldering. It's not the biggest area I've used, or the most cleanly marked, but there's a ton of different style walls, a big variety of problems and frequent changes to keep things fresh. One of the most unique features is the features built into the wall... I've never seen a gym with as many natural holds as this place has.4. Wall Climbs. Unfortunately this just isn't what it could be... The walls are pretty short for when and there isn't enough space to get a huge variety of climbs in at any one level. Seems like most of the setting is in the boulder area then lead rope and top rope here and there.5. The Gym. I doubt many people sign up for their weights but they do have a solid assortment of machines, free weights, even some cardio. If you're a member it's enough to cut it unless you really want some serious size or special machines.Could the place be bigger, newer, or better maintained? For sure. But the community and the staff make more than the most of what's here and while it's not the best argument, you won't find better anywhere near by,", "date": "12/9/2011"}, {"review_id": "khRDG3ljlUFQvb_CaZQRhg", "user_id": "xT7RQksnkdGnDiu9EiPsWw", "user_name": "Michelle K.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun! We went with someone that knew what he was doing so he kind of showed us the ropes (haha) and helped us out. The people are super friendly. Definitely a good time.", "date": "10/22/2014"}, {"review_id": "XsKPKHkSNruftJ41RoF_JQ", "user_id": "7DTgTdladrhV9psI4qW2PQ", "user_name": "Jason J.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Just celebrated my daughter's 15th birthday at Rockreation, and I have to say it was a blast! None of the teens had climbed before, but all had a great time. The birthday party package included 2 hrs of climbing, and 2 hrs was plenty of time for us all to make several climbs on a few different routes. They have a party room that is adjacent, and the bathrooms are clean and the gym wasn't crowded at all. The cost was pretty good ($99 for 10 climbers- we had a Groupon deal, otherwise its $200). All the staff was very pleasant and helpful. Our party had two staff assigned, and Jeff and Sara were AMAZING! They were encouraging and helpful, and always had a pointer to help the climber reach the top! I have to say customer service here was outstanding! We will definitely be returning!Thanks.", "date": "8/5/2012"}, {"review_id": "137F-ucq-_lR0d1lTRKXhg", "user_id": "gQc_DweBmS1Qm3-lHheX8A", "user_name": "J M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 19, "funny": 6, "cool": 12, "text": "Make and Schedule Reservations a head of time!--We arrived at 11am on a Saturday hoping to get a spot.... but the schedule was packed. Although the facility opens early, the only people that can climb any time are:1)  experienced climbers and experienced belayers (who have to undergo a small test beforehand to certify their skill)2) people who just want to do bouldering (climbing without ropes)Our party of 4 was about to give up when the staff said there was a spot for 3 people for 1 hour of 'Climb Time' (Climb Time is belay-rope climbing with staff assistance) at  2pm through 3pm. CONS:Our staff was nice. The facility was nice. The only thing I really didn't like was that they tried to squeeze in too many people with one staff. With our one staff, he assisted us my two friends and I in climbing, so we spent most of the hour we paid for waiting our turn one after the other..... AND in addition to that we had 2 other people being assisted by our staff through our entire \"one hour session\"So, instead of a one hour of climbing that we paid for, it was a TOTAL of 10 minutes of climbing, per person. We paid 12 dollars for this session, which included the climbing shoes rental. Minus 1 star for that.In conclusion,  convenience-wise-- this is probably a great place for experienced climbers. For beginners who want to climb, its recommended to make reservations ahead of time, and probably sign up for their 'Fight Gravity' Lesson series... which I think trains beginners to belay on their own.... and costs a bit more.Will I probably go here again? Yes.", "date": "3/4/2011"}, {"review_id": "UqSNa5_7b2EWLKia_FTXRg", "user_id": "9FtzSaT7JGJG88FQ0p-QCw", "user_name": "Kylie C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent staff and service! I first purchased the Groupon for the Fight Gravity series and eventually upgraded to 3 months of membership.  I thought the classes were really helpful and the instructors (I think not Rockreation staff) were awesome and fun, very helpful, even on subsequent visits outside of my classes.  The front desk and admin staff also go out of their way to make sure you know what you are doing, have the supplies you need, understand how to use it and be safe and have fun!  Many of them remembered my name on my return visits for free climbing.  Only reason it doesn't get 5 stars is that if you go often, the climbing walls are repetitive, they change the climbing routes every few weeks to months, but I eventually climbed many of the same routes many times over on the auto belays. They are making an effort to get single climbers partnered up with others to help add variety and fun which is great!  I also have another gym membership otherwise I would have continued my monthly membership as they have a small workout gym in the back and also offer yoga classes!  This is a great place for a new climber or current climber looking to have more variety in their climbing activity.  I will certainly return again in the future!", "date": "2/1/2016"}, {"review_id": "dI0j_vE0VxaMggG2FC183A", "user_id": "haqn1uavhA7iFjqziGaIrA", "user_name": "Ferdinand T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Back in the days at college I was a maniacal mtn and rock climber. A vertical road runner of sorts. Climbing gets you in such good shape if you stick with and overcome. Nothing compares to pulling your complete body weight up sheer cliffs..just saying. Though shall respect the rock", "date": "1/11/2014"}, {"review_id": "y6bhDZqBxzKc4DE_oZQXkw", "user_id": "VJHeIGEWeUEnnmDn6k3IXg", "user_name": "Rico O.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place!!  A few of us went last weekend, many of us for the first time.  Our instructor (Collin?) made the experience very fun & easy, even though some of us suffered from the fear of heights!!Great place to test out your climbing skills and to see if it's something you'd like to pursue.", "date": "5/18/2010"}, {"review_id": "MVrY5ESZnurJuDxubh1zcQ", "user_id": "Dm6QWjloZXuZEONFKLAdlw", "user_name": "Del C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 3, "funny": 4, "cool": 1, "text": "We've been to the one in West LA and we thought it would be fun to go and do some indoor rock climbing here.  The first thing we both noticed:  This place smells of feet.  I have no idea what the deal-io is here with the feet smell, but guys, please do something about that.Other than the smell, it is a lot of fun and even though the space isn't too big, they have a lot of different levels you can try.I would definitely bring my own chalk next time because they basically ran out.  It's always better to reserve lessons, which is waht we'll do next time.  Overall, a lot of fun, but would be better if the place didn't smell of feet.", "date": "2/22/2011"}, {"review_id": "9YjZ9yyPAlXK54oYNdm5PQ", "user_id": "QL9PANNs0Usj3usgqzgblA", "user_name": "Katie R.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 2, "useful": 2, "funny": 3, "cool": 2, "text": "I was disappointed with Rockreation. I hail from SF where, with far less land to spare, somehow we have a gym 3 or 4 imes the size with higher bouldering and top roping walls. With so much space in OC. I figured this gym would have more to offer. The gym area is modest to be kind. The bouldering area is quite small but has a nice range of difficulty.", "date": "4/25/2013"}, {"review_id": "ZmjScXkBVWOd0pURIiNgAw", "user_id": "5FKTWDUkohvNzQjBPA1tPA", "user_name": "Victoria Y.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "I came here to use my living social coupon and found the staff and the instructors to all be really nice and helpful.  I had a lot of fun in the lesson even though I climbed before.  Hence the four stars.The gym is a little smaller than the one I climbed with in the bay area but it still has nice routes to climb.  I think this would be a good place to start practicing and learning to climb, after awhile I could see the lack of height in the climbs making it seem repetitive though.  I still have two more classes to take so I'm really excited to see how it goes.", "date": "2/17/2011"}, {"review_id": "hgxQ1haglrcZw_yne5nnEQ", "user_id": "CNSpvd1UmX0cGWN4hSAvDQ", "user_name": "Trisha F.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My 11 year old daughter had her birthday party here June 13, 2015. She and her friends had a wonderful time climbing. The instructors were positive, encouraging, and switched routes when the girls requested. I suggest bringing decorations for the back room if you have a party. Otherwise, enjoy Christian and the wonderfully helpful staff. They were all simply awesome!", "date": "6/14/2015"}, {"review_id": "299LUdvQ-iDBc_gQZ_0Amg", "user_id": "MozLjc7iwsL2c2LpJM9oaQ", "user_name": "Jordan B.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "Don't get me wrong this is a nice gym and all. But the staff that work there is the three times I have went are completely rude! I must have gone one two days where they had the grouches working, but if you can handle the horrible attitudes of the staff it's a great gym.", "date": "2/13/2014"}, {"review_id": "5xLGrUxQVXSRkdlnTJnmww", "user_id": "nI-3tPc7lPySfW-EACKO4A", "user_name": "Olin B.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 10, "cool": 1, "text": "The nicest and most helpful staff around:I walked into Rockreation and was greeted by an open, honest, and pretty face.  Her name was Allie, she was dressed in pale blue - her favourite color I wondered - a loose shirt and pants, with matching blue headband propped in her thick blonde hair.  She looked like a creature of light, a creature made out of sky and clean, white light.  She could sense that I was new and welcomed me with a smile as big as a gambler's promise.  She answered all my questions with caring detail.  Like a hero returning from battle, I have never felt more welcomed in my life.  Thank you Rockreaction staff!BTW: the climbing is good too.", "date": "1/5/2011"}, {"review_id": "I0b_NiMtdiF_-DWyvq77Mw", "user_id": "ZAfQEyVZ9yerd7lgRKlGkQ", "user_name": "Jackie N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "More like a 3.5I went here for OCC's rock climbing class.  When I first looked for this area, it looked pretty ghetto and dark.  Not a good place for a girl to be.  The parking lot was seriously horrible.  So small and barely any parking spots.  It also had a creepy feeling especially when there's no parking spots and you're forced to park on the streets.  It was seriously scary.The gym itself was pretty small on the right side of the gym.  I thought it would be bigger.  The climbs were seriously squished together and everyone were all climbing all at once.  This place can seriously get packed in no time.  But it was still fun and the climbs were a nice challenge.The staff is pretty friendly.  If they see that you're doing something wrong they will assist you in any way, which I really like.  Btw, it smells weird in there, like dirty socks.  But it's nice when they open up this place for the fresh breeze to come in.  Still smells weird though.", "date": "7/1/2009"}, {"review_id": "2xYfw6vlNNafP-lkPpCq6A", "user_id": "kHXSgt_3_TRP2vfoBq3xEQ", "user_name": "D C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Our family is a huge fan of Rockreation. We have been coming here over 10 years. The staff is great. Customer service is great.  Everything from the classes to the climbing routes to the bouldering cave is fantastic!  I would highly recommend this gym!!", "date": "10/30/2015"}, {"review_id": "cHWAWO1F5ADzOF3MPhh8Dw", "user_id": "5E3eQEhltrAZJASk14LdDQ", "user_name": "Sunny T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 3, "funny": 1, "cool": 0, "text": "Prior to going to Rockreation I had only tried indoor climbing like 3 times and thought it was fun but nothing fantastic--NOW I LOVE IT!! I purchased a one-month membership through LivingSocial and ended up driving to Costa Mesa from Long Beach 3 or 4 times a week, rush hour traffic and all! --The instructors and employees are all super friendly and helpful. --The walls are challenging but not impossible; there are enough levels that you keep pushing yourself to do better. --They are constantly adding and changing the courses so even if you've been a bunch, they'll soon replace it with something new to try. I didn't realize it until I started going to ClimbX in Huntington Beach, but Rockreation also has a really nice facility and is way bigger! They offer cardio equipment, yoga classes, lockers, and showers which ClimbX doesn't offer.", "date": "1/14/2011"}, {"review_id": "y2OLfFR1yNiTrG3N9tUqrg", "user_id": "qPQX5D6QYH3dRlBozadfQA", "user_name": "Myles A.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "Nice gym. Helpful staff. Good variety of obstacles. They had a traversing wall, nice bouldering area, lots of different climbs and another wall to practice on the different grabs and techniques.We liked this gym a lot when we went and since we had some experience, the staff was great at just familiarizing ourselves with their gear and letting us do our thing.The only thing that I found on the (sort of) negative side is that the levels seemed to jump back and forth. The easy to intermediate and slighly above climbs seemed really easy for me. But when I tried some of the harder ones there seemed to be a big gap in the experience/climbing level between say a 5.9 (which I found easy) and a 5.10 which I couldn't complete. Could just be the fact that I haven't been climbing that long, but that's just my perspective.", "date": "1/6/2011"}, {"review_id": "LfX4dpHFOdx9cKiSc5v5bw", "user_id": "s2juw5HoD4lKp-0PZj-rUg", "user_name": "K B.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "I read the review below and am super bummed i didn't see the living social deal for this! They make you take a test before you can climb here, so make sure you practice! You have to be able to tie a figure 8 properly and show them a correct belay technique. If you don't pass this test you can only boulder climb. They have a pretty good boulder area, so it's not too bad... but it's definitely more fun to belay (in my opinion) :) . Great work out and fun activity!", "date": "5/23/2011"}, {"review_id": "gU_UVVtTNH4DvZ6lIrS65A", "user_id": "eijSbsCGz_frhDkd41KjfQ", "user_name": "Kim B.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 2, "useful": 4, "funny": 1, "cool": 0, "text": "I never write reviews, but had to in this case in hopes that the management at Rockreation might read the feedback and consider making a couple key changes. Having been to a lot of other climbing gyms in other cities/states, (moved here from Colorado & also enjoyed climbing in San Diego at Solid Rock) there are two huge drawbacks here: 1. Single-looped rope on top rope routes 2. They don't allow use of Gri-gris (auto-locking belay devices) These two issues combine to make climbing extremely dangerous and frustrating. My husband weighs about 100 lbs more than me, and though I've been an avid climber and safety nut for 10 years, I don't trust my ability to belay him without a gri-gri and such little tension around the top rail. The management seems to feel that these policies are good for the pureness of climbing, but I've never heard of anything like this in the top-notch gyms I've climbed at in Seattle, San Diego, Denver, or San Fran. I will have to look for another gym option now in SoCal that meets \"normal\" standards. If you've never climbed elsewhere before and never knew anything different then I'm sure this gym would seem great, and you'd be used to having bigger falls and raw hands that are unnecessary. \"Joseph F's\" review is a very fair one as well.", "date": "6/20/2010"}, {"review_id": "GMfY4UxSGPZnDcw2YnqtnQ", "user_id": "gGIYcCo5MvgKlUJ4zGU9OA", "user_name": "John M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Don't expect a long review here. I had a decent time here, however I couldn't overlook the fact that they don't allow gri-gris. I know this isn't a big deal to many climbers, but as someone new to this, and as someone who doesn't exactly trust himself to never get distracted, I have to use that as my sole reason for not coming back here. Gri-gris (auto-belay device in case your belayer messes up) are for safety, why not let people use them? Just stupid, and unsafe, IMO. If I didn't have climber friends, I wouldn't know any better, and would accept this risk as normal. Just unnecessary...", "date": "2/14/2013"}, {"review_id": "qSs5AAj-2Sbf5UQJEbuAMA", "user_id": "Hh5yiTukMcFGh1iXFpFV4A", "user_name": "Kristi A.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place!  I recently started backpacking, which led to an increased interest in mountaineering, which brought me to Rockcreation to learn a bit about roped climbing, belaying, etc.  What I found, in addition to some good training for mountaineering, is a really fun sport and a great gym.  We now come about two days per week and find something new to climb every time!  Rockcreation has done a great job with their gym, catering to everyone from complete beginners to expert climbers.  I've seen little kids barely able to walk scramble up a wall and grown men and women climbing a wall for their very first time (that's me!) and everyone in between.  And, the staff at Rockcreation are really great - you never get attitude from them and they're always really willing to answer questions and help you with your climbing.  I really like that the whole place has a relaxed 'vibe' and it's not full of egos.  No one who's learning wants to feel pressured or cajoled and I've never felt even an inkling of that in this gym - and I've had some tough days in there! :-)The Rockcreation 'Fight Gravity' series of climbing classes is a great deal, even without 'Groupon' or 'Living Social'.  For $99, you get three classes and a month of unlimited climbing (classes are normally $40/each and climbing is $16 a day if you buy individually).  The only challenge is their FG 2 and 3 classes are really valuable, but if you are brand new to climbing, you may not get as much out of FG 2 and 3 in your first month as you would if you waited until you had some additional experience.  I have only been climbing 2 months and still think I'd like to retake FG3 in a month or two to reacquaint myself with the great techniques they teach you in the class - but I am a slow learner in this sport!  Either way, it's still a great deal!  I highly recommend this gym if you have an interest in sport climbing or just want a different type of workout.", "date": "9/19/2011"}, {"review_id": "1kOfJzQh39gEf2ho6wsPVQ", "user_id": "lWfnUt5U2Mlz6K_sl1QGXQ", "user_name": "Kevin Y.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "I came here on a Fridayat around 3, so it was completely empty besides another pair that was there. The half off Friday deal was a good surprise, as I was prepared to pay full price. However, after spending a few hours there, I'm glad I didn't pay full price because I don't feel like Rockreation is worth that. This was my first time going there, I knew getting certified to top rope belay and lead climb would be a time consuming process. Since there was only one person at the desk, he alternated between testing the three of us and checking people in. After the top rope belay test, he told us it would be a few minutes before he could test us for lead. Every 10 minutes I would ask again, and eventually he told me that he was waiting for another employee to start at 4pm to test me. Keep in mind this was at 3:30, and If I had not asked, I would have been awkwardly bouldering up and down the top rope corner waiting to test indefinitely.After eventually finishing the lead certification at 4:20, we tried a few of the routes. And I like them. Lots of unique features and sufficiently long. The top rope on the other hand, was pretty poor. A lot of the routes felt awkward and not very smooth to climb, and very short. Overall, a decent gym if you live close by and need a place to train, but I went to Sender One the next day and that was miles better.", "date": "11/23/2014"}, {"review_id": "qazQdgyWv0RDJACwAWfveA", "user_id": "8twTrXmgGXC3pGLj8Ou0zQ", "user_name": "Rony H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 2, "funny": 2, "cool": 0, "text": "Although I've wanted to climb for forever, this was the first time ever climbing.  I got the \"fight gravity\" series, went there on Saturday to try it out.  You need to make reservations for a spot in the classes, so call ahead.  Fight Gravity 1:  There are six people in class, and you'll be paired up with someone so you can either be climbing or belaying.  The teacher I got, Bill was just awesome.  He took the time with you and was patient with you.  I'm a quick learner, but there were some people who couldn't get the figure 8 down even after the class.  But he was right there teaching it til you got it.Fight Gravity 2:  Different teacher this time.  Cool chick, but she wasn't as thorough as Bill. She would teach you to practice some moves on the warm-up walls, for instance, but she wouldn't really correct you while you were doing it or see to it you're doing it correctly.  I think there were too many people in the class, 9 I believe.  Fight Gravity 3: Last of the series.  Same teacher but since there were much less people, she was able to spend a lot of time with us and we were able to really ask questions and get answers.  The people who work there are usually pretty cool and friendly.  I don't know what his name is, but there's an asian dude with long hair who is awe inspiring watching him boulder.  There a girl there named Ally though who would look me up and down every time I'd go there.  Even when I said hi, she's really standoffish, and curses when she climbs.  I tried to stay away from her.  Even besides that, I really found myself enjoying climbing more and more.  I went out and got all my gears to learn how to lead climb so I can do it outdoors.  After my flight series were finished though, they didn't talk to me and try to keep my business.  Which I thought was odd since I went at times when not many people were not there.  As I said, I bought all of my own gear.  The first thing I went to purchase were shoes because they suggest you wear socks in the rental ones.  Guess why?  You really shouldn't be wearing anything in the shoes, you can't get a good feel and grip.I give them a three star for location and all the good people that work there who made me feel welcome to climb there.  They could do better though.", "date": "7/11/2010"}, {"review_id": "8fKejDOSPeazzcwS_i1J4w", "user_id": "uA0_VO_mvVeVSl6Sfj_MBA", "user_name": "Artie L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Just had a birthday party for my daughter here.  Staff did a great job.  Very pleased with them.  Only thing is that their party room is some tables and benches.. nothing great so if you are going to have a party here, some decorations or table clothes might spruce it up a bit but the kids had a blast.  Great place for a climbers.  Interesting hard climbs, great variations.  Huge sport climbing area, GREAT bouldering area.", "date": "2/2/2013"}, {"review_id": "HgLZ2D63F8cdusPlCO0RXA", "user_id": "lTnaYu6LcL4jVOZirR3Xtg", "user_name": "Tabitha H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My friend and I decided to purchase the Groupon deal which included one month unlimited membership including equipment along with a  Flight Gravity 1 class and 2 hour private instruction. The private instruction was really beneficial because they focused on technique. The instructors are patient and supportive no matter what your climbing level is. I'm inspired and motivated to continue climbing.", "date": "6/3/2013"}, {"review_id": "iozwunD55gsxIpYZZur_bg", "user_id": "6ATfXxQLQuRAQ30-nLI6Yg", "user_name": "Joseph F.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 9, "funny": 3, "cool": 0, "text": "OK... as I have for the other rock climbing places, I'm gonna review this place as a climber, for other climbers, and NOT as someone who thinks \"yay! i love rock climbing! 5 stars\".  I mean... if you like swimming does every pool get 5 stars? no!I was down in Irvine for work, and made it here basically out of the blue.  pretty different feel than the norcal gyms, so I'm going to touch on the differences.First to note, this was an older gym.  it's been worn down for a while, and you can tell by the gear, the walls and from the feel of the place.  Nothing wrong with it.. but it did make me slightly more nervous.  They color code the rocks (no tape) but half the colors were indistinguishable... purple, black, and dark blue are allt he same color when you cover them in chalk.  The place is a bit smaller than I'm used to, but apparentely it's the biggest in the area... guess I'm spoiled (woohoo norcal!).the bouldering kind of pissed me off.  Instead of straign V ratings, they had a weird color coding that they used... so I had to keep running to the side to figure out what I was climbing.   A couple other things to note:-features galorewoah woah woah.  Eevery wall is loaded with them. plenty of tiny ripples, little knobs and even a couple crimps you can use mostly for your feet, but your hands too.  it adds a much better \"outside' feeling to the climb, but it makes the ratings ALOT harder.  I dropped down like 2-3 grades and was barely hanging on. Ropesthey Only wrap the ropes once around the top... so, when your partner falls, you feel it hit you ALOT harder.   I belayed with a guy a bit heavier than me, and I was jerked into teh air time and time again.  Good practice for lead climbing I guess... but just uncomfortable and unesseacry.Other than that the place was fun.  I'll definately be back next time I'm in town, hopefully with my own gear (rental shoes suck).", "date": "10/6/2009"}, {"review_id": "DqC-imworzER-DL2FogvFQ", "user_id": "vapvB_XSv52HOSCsJEJdzw", "user_name": "Joseph C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First timer here and the experience was great. Informative slow instruction with easy courses and a fun atmosphere. I was here for a friends birthday so I assume they cater to parties very well. I have a fear of heights but this was even a blast for a wuss like me!", "date": "4/13/2013"}, {"review_id": "ZveSGUquAWKY2hCsjwmmEg", "user_id": "bjklldLHD0UBUpAuv16pfw", "user_name": "Alisha M.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I started rock climbing for the first time about 1 month ago.  I love this place!  The staff are very nice and very helpful.  I've gone to sender one and they aren't at all as nice as the group of people I met or talked to here.  Great group of people and this will continue to be my favorite place to climb!  Thanks for not being snobs and welcoming a newbie climber to your place.", "date": "3/3/2014"}, {"review_id": "Fs49PUA0iFThhA__SQ8L0w", "user_id": "2vZSnGNU2iycYcQgl64X0g", "user_name": "Helen P.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My BF and I came here for our first time indoor rock climbing, and we had such a great experience! The staff are very knowledgeable and friendly. The gym was big with different levels of difficulty including different obstacle types, which I dont know how to describe. The only issue I had was the smell of the shoes I borrowed. Maybe it was just me, because my BF said he didn't smell anything and he is kind of a germaphobe. Otherwise, thanks Groupon for the $19 deal for a class and week of climb time and big thanks for the helpful and friendly staff :)", "date": "2/15/2013"}, {"review_id": "ID6CmtPQIpb7WsOPtc4WWw", "user_id": "V0qwAiyCh8iDkOIccO-FgA", "user_name": "Kat N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 3, "funny": 7, "cool": 4, "text": "Totally love this place, haven't been in forever. The thing is, I'm a selfish rock climber. All I want to do is climb. I might be the worst belay-er (is that a word?) ever so if you ever see me here, RUN, don't let me hold the ropes for you because I can almost guarantee that I will leave you hanging or slamming into the wall.Oops, sorry Miss Laylan. Love you. Thank you for taking me here.", "date": "7/11/2008"}, {"review_id": "iRG8I6BwFm0N2bkdPByKGg", "user_id": "_fV2cxP-HFGoJ8-HVs-ouw", "user_name": "Scott T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I think people's reviews of rock climbing gyms says more about the gyms they've been to previously than anything else. Given this, I have to say Rockreation is solid, but not amazing. Things that are awesome:- I was blown away by the quality of the features on walls. I haven't had much experience with other gyms (3 total), but the technical possibilities on these walls were wonderful. Such a refreshing relief from yet another gym of carbon-copy flat walls. Go climb a bouldering route where you don't have any feet for half the wall and tell me you can go back to having set feet again. - For an average sized gym, they pack in a ton of good climbing. There is a decent amount of bouldering, with good variety in the type of route. There's even a crack in the corner, and a traverse section for practicing along the wall. Toss in your standard top roping and dedicated lead-climbing section and you have something for everyone. - Staff is friendly and helpful, as you'd hope. Routes are set in interesting ways, although you should be aware that the bouldering may be graded a good deal harder than what you're used to (I dropped by 2 grades).Not so awesome- Not much here, except it just isn't that large. I will admit to having been spoiled by Sunnyvale Planet Granite in terms of sheer size and number of routes. - If you're new, don't expect to be able to boulder unless you have serious athleticism. I can climb V3 maybe even a V4 elsewhere but couldn't initially get up several of the \"V1\" routes at Rockreation. Leave your ego at the door. Overall, it is easily the best option in the area. If you want all around exercise, there is a (small) gym in the back with the basics, showers, and a free yoga class on a few weekdays.", "date": "10/28/2009"}, {"review_id": "6i_gzm8wfe7nZm7K6ucmNw", "user_id": "iue0tvITPmgmDD6K_0ArEQ", "user_name": "Jenny C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 3, "funny": 2, "cool": 3, "text": "Heck yeah, I finally went rock climbing yesterday and I'm freaking feeling it today.  Ohhh yeah baby, the pain!  Of course mostly in my arms because instead of using my legs to push myself higher I used my arms and boy did I get tired out.  Ah, must work on that! Staff and members were friendly and the super regular hard core members were a treat to look at.  Forget 24 Hour Fitness, I signed up with the wrong gym yo!  I was very tempted to sign up for a membership here on the spot haha.  Anyways, it's pretty amazing watching them boulder.  It's like they are the stunt doubles for Spider Man.  Just insane!  If I could just do even a quarter of what they can do, I would be stoked.  Yes, they don't have AC, but it's not too bad.  I mean I live in Riverside, so I kind of felt like I was right at home.  What got to me was the ropes in the top rope area, is it just me or do they smell like a smelly wet dog?  I would smell each rope I used too and I wasn't ninja enough because some people noticed :x  haha they probably think I'm weird.  Whatever, at the end of the day my hands smelled like I rescued a crap load of dogs.  I rented equipment and the only thing was my chalk bag barely had any chalk.  I plan on buying my own ish ASAP though.  It's just too awesome not to continue the fun.  You can get a package online for like $150, which I think isn't bad.  Get gloves too, if you plan on belaying because my hands got F-ked up.  I'm rugged, but not that rugged.", "date": "8/10/2008"}, {"review_id": "PNi2Scl3emKA8E3be1zGZg", "user_id": "dL_NiYO3sQ2YWMccbI32-A", "user_name": "Nikki T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "OK, so as you know.. I am totally a climbing addict. This place is the first gym that I have ever rock climbed at and from what I hear, around Orange County, it's the best. I really like the staff there and the routes there are pretty decent. As for like top roping, there's a good amount to climb, but the fun part looks like the lead climbing wall. I spend most of time there on the traverse wall, and I just starting tapering over to the bouldering part. There's also a gym in the back, which is nice because I know I don't have to invest money into a regular gym membership also to get my cardio workout after I climb.Although my boyfriend is a avid climber and really only goes outdoors, he does also admit if he can't get outdoors he does enjoy going to rock reation. Invest your time, whether you're basically starting out, or been climbing for years, they have a variety of good climbing for both.", "date": "8/5/2009"}, {"review_id": "OeceWjI7_5DcgbcSmeL-Kw", "user_id": "WAxio19XFGhmTEs-1xPo1A", "user_name": "B. ..", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 2, "funny": 2, "cool": 3, "text": "great place for a good full body work out, an adrenaline rush, excitement and fun:) Indoor rock climbing experience with several different levels. training  on how to use the harness and stuff was very detailed and well instructed.  Place does smell a little bit of sweat due to  lack of perfect ventilation. Great idea if looking for something new and different to do.i'm itching to go back again some time:)", "date": "2/8/2008"}, {"review_id": "lRJ56uGKY6lSxpo69FfJyg", "user_id": "YGqe6X4Xb1g3xnb3jOTfCw", "user_name": "Prachi P.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "I took the Fight Gravity (FG) lesson package and it was pretty good. The instructors are all nice and laid back. They are very informative and thoroughly explain concepts/answer questions. The good thing about  the three-class package is that it includes a month of membership and free rental equipment. Having gotten a feel for the place and deciding I like it, I now plan to sign up for regular membership. And after FG1, they give a coupon for a sweet discount off of shoes and gear from Evolv's factory store in Westminster.The climbing gym itself is split into three parts: a lead climbing area, top rope area, and bouldering area. There is also a traversing wall which most people use to practice technique or warm up. In the back is a small gym with some basic machines and weights.The members are also very helpful when I have questions. Sometimes they offer help when I look lost or confused. So yeah, people there are really nice.There are also small yoga classes on Mon/Thurs. The instructor is really down-to-earth and encouraging. The only thing I disliked is that the rental gear and some of the equipment smell gross (like the yoga mats and crash pads). Most people use their own gear and yoga mats.", "date": "10/21/2007"}, {"review_id": "PpGZCV4yVCBUEJIUmXc8tw", "user_id": "jwHYVA4Lu-Y_ckuPhxOHvg", "user_name": "Sandy H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We just threw a birthday party for our 10 year-old son and our group of 17 climbers all had a fantastic time!  Everyone had fun while getting a really great workout!", "date": "9/23/2012"}, {"review_id": "boBPbOzqGUxQvRabVvlktQ", "user_id": "I9nz8t9uzQ_O6-mzEmQutg", "user_name": "Tami R.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "So don't get me wrong, I love me some West LA rockreation, but my friend lives in Tustin so I came down to her gym.... gots to love reciprocity. Very nice, very cool chill people like my own gym, by way less of them. The place was pretty empty in comparison, and the walls are taller and the arch is a bit cooler.", "date": "6/4/2007"}, {"review_id": "IuNoq2BO4FBjRBWRMctV9g", "user_id": "e1L-fispN322qToZPLEuSg", "user_name": "Ron H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is great for newbies and...ok I can't claim it's great for experts because I am far from an expert. But it *seems* like it would be. Watching people climbing on the ceiling is almost surreal. And the pricing is pretty good. I would think it to be a great contender to completely eliminate one's need for a traditional gym since the facility includes a regular work out room. It's small, but I have never seen it at full capacity (probably because the bulk of the people are, you know, climbing). The newbie packages are good deals too, especially if you do it with a friend. With just the first class, you'll be belaying up and down the rock face with confidence. I think it's a good sport for women to one-up the menfolk, too. I'm still a noob (and not very buff), but from my experience, arm strength is not a huge factor (like Jenny C's review). Rely on it too much, and you'll be done in just a few sets. That combined with their typically less weight, and you have my friend racing up and down the face side like spiderwomen while I'm wheezing on the side.", "date": "1/27/2009"}, {"review_id": "nRLf9mwRNxlh5_jjGy66Pw", "user_id": "jjatTaFIQM7N4CQx2eIwpw", "user_name": "Amy L.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Tried it out through OCC's climbing class. It's a fairly small gym and I feel like the routes are a lot easier than they're marked. The staff is friendly and there is a good variety of routes. Parking sucks - there's a small lot in the back and street parking in front of it. A little expensive I think for the size of the gym.  There is a large lead climb only area which looks really good.The top ropes are also a little too close together in my opinion. Avoid peak times (7 or so) if you can!", "date": "2/21/2009"}, {"review_id": "wqJX86arjXvYBXFK2IKfHQ", "user_id": "KIaE3EiaJRjE3VPX_tg2XQ", "user_name": "Matthew B.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great, especially if you are just starting out.  The intro packages are really good deals, and the staff is very helpful.  The class package teaches you the safety requirements for top rope climbing, gives some basic and intermediate pointers for general climbing and gives a monthly pass I believe for a pretty low cost.There is a tiny gym in the back, and I think some yoga mats where they also offer yoga classes though I have never taken any so I can't comment on them.The bouldering wall is pretty nice and the routes change fairly often.  A lot of friendly people are always around helping each other and having a good time.  I almost never do top rope climbing and I am not good enough for lead climbing but from what I have seen they look great as well.  Overall this place gets 5/5 from me.  There are no obvious cons to it for me.  I consider the gym in the back a bonus so if I blow out my arms I can just stay and do some cardio.  The prices seem reasonable, the parking isn't great but street parking is super close and is always a backup option if you go during peak hours, otherwise there are always spots in the lot.", "date": "12/20/2009"}, {"review_id": "WtmcykIoJ_wRtwNKTI5gbg", "user_id": "_gcDdPUVA9wwSynicxcpzw", "user_name": "Jonathan Y.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "YES. So addicting. I'm taking the 3 Tier classes. 6 Months from now I'm going to be climbing Cimmerian level. Who is nerdy enough to know what is?", "date": "9/14/2010"}, {"review_id": "BKUKKuasL_Dmb8b0QNfJ7g", "user_id": "WwZZFCDeP_IEUDbolZxMLQ", "user_name": "Sarah K.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "While I am not the best climber, I do enjoy the challenge and fun of it. I thought that this gym had a great variety of climbs. I was impressed by the three completely different sections for each type of climbing: top roping, bouldering, and lead climbing. The staff were friendly, the gym itself was very clean and nicely set up. They even had a work out room in the back for the members. I had a ton of fun there. The one bad thing is the price. Maybe I'm just used to cheaper wall, but for me $16 dollar day entry fee seemed a little steep. Still if you are in town for the weekend and you want to go climbing for an hour or five, I highly recommend this place to do it.", "date": "10/29/2011"}, {"review_id": "EXh5G44aMclCrkVLVEjBrA", "user_id": "t-1PreNEuzCILkeQCSLMCw", "user_name": "Amador A.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Back in my younger days I used to frequent this gym in preparation for our climbs out in Idyllwild's Tahquitz rock...There were two indoor gyms we used to go to - this and another place called Alpine something...Rockreation was the better of the two.  The climbing walls here look more like actual rock.  Most other places you see will just be plywood walls with different flat angled surfaces and climbing holds bolted on.Before you can enter, you have to be certified to get onto the climbing walls - you demonstrate your ability to tie-in (using a double figure 8 knot), your knowledge of vocal belay commands, and your rope work as you belay someone.If you don't pass, you can still come in, but you're limited to the bouldering wall (a traversing wall that you climb horizontally, rather than vertically.When I went, it used to be $12 for the day, or you could purchase memberships for like $560 annually if you think you could go enough to make it worth the costs.It's a fun and safe way to learn how to rock climb, each climb is about 30 feet, and if you get really good, you can give a try on the leading wall... that's where you're climbing \"on the edge\".They even have holds on the ceiling so you can make it as challenging or as easy as you want.  If you're tired of going to a regular gym and want to try something a little different, give Rockreation a try!", "date": "4/20/2007"}, {"review_id": "xFyjia_xwwoV1zDXjdBSPg", "user_id": "PUe9gYxQNbEDhDWRQFNqaw", "user_name": "Jay J.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for messing around!  Went for a company meeting - the staff is really nice - Rick and Mark were funny and seemed like they really enjoyed what they did.It's in a warehouse, so the OC location gets warm (no A/C), but they do have two roll-up doors to let the breezes in.I'm sure I'll be hurting tomorrow....", "date": "4/29/2008"}, {"review_id": "pxUvtsgCbpH5aB5Mn4MesQ", "user_id": "YgiWTaxRNyTymUuQ9qhmlA", "user_name": "Lilie N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Cool indoor gym... different type of workout. The people are very cool and willing to help you out. The price of admission, equipment, and classes are very reasonable in my opinion.", "date": "4/4/2011"}, {"review_id": "0W8gMbFPLUcJKqt-OBxvJg", "user_id": "nyOE_DMwAnrjhe3puLl4mA", "user_name": "Ricky C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "What kind of people work at the front desk of this place? I tried to reserve a birthday party that is one month away. The person (male) who answered phone gave me the available time slot then demanded a head count for the party and told me that I am NOT allowed to go over that head count. Well, how would I know the head count for a party that I just go the time slot for? Then he went on and read the Terms and Conditions. After actually listening through that, I heard in the T&C that I can make change to the head count as long as it is 7 days before the event date. So I pointed it out. He read it again then admitted that it is fine. Then he went on and demanded $50 for deposit. I informed him that I have already purchased a Groupon and paid $99. He didn't know how that works and replied that he CAN NOT continue making the reservation without a credit card. I advised him to have his manager call me. I see no point of giving someone my credit card information when I had already paid. He said fine. Before I had a chance to ask for his name, he was talking to other people there... quote 'What the F*ck. Fine. Don't give me the damn credit card info'. I am waiting for their manager to call back, if I ever get one. Needless to say, we will not have our party there.", "date": "5/16/2012"}, {"review_id": "1-hcFkdW6qcrv6INmQBxHA", "user_id": "XKgw_Yx4j3tn30UPJE_Wqw", "user_name": "Jennifer H.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "So I packed up all my climbing gear to return to this wonderful gym on a recent SoCal trip.It's a small place relative to what we have in the Bay Area, but the routes are better for training.  They are short but very challenging.The lead wall made me want to do something climbing friends couldn't do for 5 years - convince me to sign up for the lead class when I get back to SF!  This gym makes climbing accessible.The weights area is decent, and there is a magazine rack in the back for those who just want to chill.  Got to love the chilled water fountain v. the room-temperature one.  They also heat the locker area, so it's toasty after the shower.The only drawback is the belay testing.  They have an actual climber \"pretend\" to fall, and that was dangerous!  What if someone wasn't able to stop in time?!!", "date": "12/11/2007"}, {"review_id": "TRGSfPYNTZESMAMzv9ZFKg", "user_id": "A-apTF3JfkUPR_oeazZC1Q", "user_name": "Mike N.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This gym is very mellow and professional. The facility is the best by far in Orange County. It has the most lead climbing space and isn't run down like the other one I've been to in Orange County.", "date": "11/24/2010"}, {"review_id": "uzU03G0h7eSDUjroVJ20UA", "user_id": "iTnT6HMIYcHXgMOcNs5e8Q", "user_name": "Vickie J.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The facility and staff are AMAZING!  We recently had our son's 10th birthday party at this location and they did a fantastic job!  The staff members were friendly and got all the party-goers involved with games ... plus offered plenty of climb time. The kids all had a super fun time!  Can't say enough nice things about this place!   They're helpful, polite and terrific with kids!   We'll be back for sure and know others from our party will too!   Thanks so much!", "date": "4/3/2013"}, {"review_id": "JwUbddR9-DGDZ2k4-ai4Vg", "user_id": "6JTu2hcy-pm8X3jtqQi5qg", "user_name": "Sean W.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to learn rock climbing, I took the OCC class which is the better deal, especially if you're unsure whether you want to start doing the sport.  A lot of routes are pretty advanced since members have been climbing for years.  It's one of the better rock climbing gyms I've been to in the area", "date": "11/20/2010"}, {"review_id": "GZ2bn1tmz7c6p0AMpzWdjA", "user_id": "TwbaiXjOyxfZnnJlI9VZ3g", "user_name": "Jun T.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I got a gift certificate for this place and finally had a chance to check it out. I'd been indoor rock climbing before in San Diego and really enjoyed it, so I was really looking forward to this trip. The instructional class was very helpful, especially since you had to tie knots for your security as opposed to just clipping into your harness like other places do. Safety definitely comes first here with the instructors, so beginners will feel very comfortable. Our instructor was a really cool and patient guy with lots of great tips. The facility itself was more than adequate with lots of room for people to climb but not feel crowded. And if you become a member, they also have a full size gym for you to use. Overall, a great time and if you're looking for something different to do, I highly recommend Rockreation and their staff. The only bummer was renting climbing shoes. Kinda smelly and gross, but you gotta expect that!", "date": "10/13/2010"}, {"review_id": "whilhX14uNA5NFCj98bEUA", "user_id": "ShFnQsA1grdsk_p8b9H5xA", "user_name": "Goldie J.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "i have a friend who loves rock climbing and brought a group of us here.  we took turns climbing the walls while he belayed us.  it was a lot of fun, although a little tiring.  the trick to rock climbing is using your legs and not your arms to go higher.  i pooped out after 2 and a half walls, they're pretty high.hopefully, you know someone who can belay you, or else you'll have to pay for that.a fun way to get some exercise.", "date": "10/2/2006"}, {"review_id": "RblUW69cuY7Le5I4INR6Hg", "user_id": "c1zOHPB8iLF-FVuRK7wK0w", "user_name": "Johnny S.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This was my first experience with rock climbing.   Some friends invited me to take some lessons with them, and I couldn't turn down a little adventure.  I had the time and workout of my life!  The instructors and staff were very helpful and provided an atmosphere of both safety and fun.  I am excited to return.", "date": "6/11/2007"}, {"review_id": "sGc9SZwonQbtUHEQeCHHPg", "user_id": "ek5nkp9BsBOUZFN_sJga9A", "user_name": "William C.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "This is an ok place.  I think I'm spoiled by Planet Granite in Sunnyvale and MIssion Cliffs in SF, but the walls here are shorter and there aren't as much routes.  I like how they have features on the wall though, Planet Granite doesn't do that.  People here seem pretty friendly.  Seems like an overall nice place to climb.", "date": "7/21/2008"}, {"review_id": "ROrPioTEf4EYKF9n26pazQ", "user_id": "km-97dk9zyblQzEvGu3twA", "user_name": "Lily P.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So I'm bumping up my review to this place, I am thoroughly addicted to rock climbing now, even though I am quite terrible.  I've invested in my own gear and look forward to turning this into a wonderful, safe, new hobby. The employees are pretty nice and the people that come here are pretty down to earth (outdoorsy, you can tell).  I just hate to feel so physically inferior to all of these flexible, strong people - but that's ok - something to aspire to so long as I don't injure myself.", "date": "5/17/2009"}, {"review_id": "5HVMBJHclLZx5vZ3tCne3w", "user_id": "kk8l06czcLKfHzsFaXiBDA", "user_name": "Pat V.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Tried this place once, my butt is too but to climb those walls ... however I think its a good sports for active people ...  climb on guys", "date": "3/21/2008"}, {"review_id": "vusYU1VGdG77wrFffvF3RQ", "user_id": "thHucBlbtBKbFqVBef_sQA", "user_name": "Jenny Q.", "business_id": "kf8ordnk5kN1Cz5s5R98BA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's the best rock climbing gym in the area. The staff are friendly and don't mind helping.  They change the routes reasonably frequent and a decent variety although most of it is in the 5.10 range.", "date": "5/7/2008"}]