[{"review_id": "xI4o7W--O57OpK3cIjdcIQ", "user_id": "17_oiYd0TC4xie2Gdjbi_g", "user_name": "Darwin C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The employees are great and work to help the guests.  It's a great place to chill and you can work out with weights in the upstairs area if you're all climbed out.I took a lesson with Jake and was blown away by his quality of instruction.  He carefully observes your technique and earnestly tells you your weaknesses and strengths.  He then offers critical advice on how to improve your conditioning and climbing skills.  If you want to improve at climbing, see Jake!!!", "date": "3/10/2019"}, {"review_id": "1RHpLuc3atcOMpahQ3dVxQ", "user_id": "-FZBTkAZEXoP7CYvRV2ZwQ", "user_name": "William G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 19, "funny": 12, "cool": 20, "text": "It's been a while since I first set foot in here. Back in the old days, I was taking a rock climbing class at Santa Monica College. The class met at this gym, Rockreation.This place not only has a good number of climbing wall of various difficulty levels, but also has some the the same equipment you'd see in a standard gym. To climb, a partner is needed to hold the rope while you make your way to the top. I don't climb often, but when I come here, it is a fun experience. Of course, climbing in this gym and climbing real rock formations are very different experiences. This is a good place to get your foundation.The staff here is cool, and the experience has been fun ever since I first came here. If climbing is your thing, or if you want to get started in this fun pastime, then give this place a try.", "date": "10/27/2018"}, {"review_id": "LQs64JqHIapTxwOIFLo67A", "user_id": "vNsoiLGrUY98YnZu5JEQAw", "user_name": "Carey H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I'm sure the gym is great, but I had a nightmare experience with the person at the counter. Wasted a half hour getting the song and dance from her about the belay system to find out my daughter couldn't climb.  And on top of it the gym isn't set up with any auto belay so I wouldn't be able to climb anyway. The whole experience was lame, and they way I was talked to made me feel like you had to be a seasoned pro to use their facility. I'd avoid this place if you don't want to be frustrated with an unhelpful staff.", "date": "4/12/2019"}, {"review_id": "OO8Hn3QyVtv1pwJKetkLFA", "user_id": "cgGfwnSPJQe68EZUwYNwIQ", "user_name": "Alex D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty cool location!Went there for one of my son's friends birthday parties.  The good place was pretty clean and organized.  There is the scent of \"stinky feet\", but hey, it's a physical activity place.  There were different walls for varying degrees of difficulties.  Some walls had the auto valet which catches people if the fall or go down.  Others need to have someone hold the rope.The staff were pretty attentive and took care of all the kids that were there.  They were really focused on safety which was reassuring as a parent.The event room was a good size and had tables and chairs probably good for 30 comfortably.All in all, good experience and makes me want to try it out for myself one of these days.", "date": "5/23/2018"}, {"review_id": "v4jP796scfcOlImqe_g0EQ", "user_id": "TOtzgPfZ4C6TMhcTzro0jQ", "user_name": "Hanna L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had a fantastic experience! My daughter threw her 8th birthday party there and everything went smooth. It was her best birthday. I only gave it 4.8 stars because we had little help except for making sure the payment due was paid. They helped with assisting in the climbing for all the kids and putting on the harnesses. We had about 17 kids, and 10 adults. The party room was a great size and clean. I'll post pictures, but it was a great party. 2 hours was more than enough time. Parking is limited to 11 spots and most are taken when you get there. There is street metered parking.", "date": "2/2/2019"}, {"review_id": "5It5zE4zCDUbY1-Gjgb-nw", "user_id": "avkMWZoixUQWzEHeQcSiog", "user_name": "Collin B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Only downfalls are they dont open until around noon and the bouldering area is small compared to other gyms.  Great staff, community, and weight area.  Everything I need.", "date": "2/27/2019"}, {"review_id": "eDwT2MOsIAjpzeMPkyS1jA", "user_id": "y7YVhbOM3zpj5lbYHgq4dA", "user_name": "Paria S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 4, "funny": 2, "cool": 3, "text": "Great indoor climbing gym. There are only three auto belays but plenty of space for bouldering and a great variety of routes for different climbing capabilities. They offer classes and usually have great deals offered on Groupon if you're checking it out for the first time. I'm also pretty sure that you're first pass might be on the house, and if you're a member you can take one guest for free each month. Super friendly staff. Street parking only - parking lot is not for guests.", "date": "2/2/2018"}, {"review_id": "vqjno1qT3K2nWJExZ2TVXQ", "user_id": "GwmOgwMTlOHV1GiqiPZ8Cw", "user_name": "Doreen M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "I've been here 3x.  Twice about 10-15 years ago to climb with friends and once a week or two ago to take a 2 hour class, which went for about 2.5 hours.  I love indoor rock climbing, but did not come here for a long time because as soon as you walked in, it smelled like feet.  Upon returning, I didn't really notice that problem.  Maybe it slightly smelled of sweat?  The class was about safety - tying knots, spotting, the gear, verbal commands, etc.  I never had to learn all of that except the verbal commands since I would go with friends.  My only job was to climb since it was my first time.  They are so nice.  LOL So I was like UGH I have to listen and pay attention in class on the weekend?!  So I did fairly well in paying attention and it wasn't too bad.  However, I pretty much forget everything after I left.  I did enjoy climbing.  I can't speak to price since my friend gave me a Groupon.  The staff was very friendly and nice though.  They also have a small gym upstairs and offer yoga classes etc as part of the membership. There is always a ton of parking.", "date": "8/5/2018"}, {"review_id": "jKWMyxZs9MrED_y1d-of3A", "user_id": "Suo83azgZKqWYsrv9x_2iw", "user_name": "Chris D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "For two years in a row, we've had a group of students come to Rockreation for a couple hours of climbing. The students come from a few different schools and while some are eager to climb, others have much more apprehension. The team that recently hosted our event was fantastic. They met each climber's needs, kept them safe, and challenged them appropriately to get the most out of the event. At the end, they played a fun game that engaged them all and was the perfect ending to a great evening. Thank you for your combined effort, diligence, and patience in making this a worthwhile experience for all involved.", "date": "4/9/2019"}, {"review_id": "XcLZ4I0rtRLXnXTt5ql8bQ", "user_id": "3n3N9Oh2qfMxvLtItjZaUQ", "user_name": "Will L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It's been a while since I last was here. I first came here as part of a SMC class for a semester and it was a fabulous experience. Big place with lots of walls. The staff here are wonderful and eager to help you get off your feet.", "date": "1/14/2019"}, {"review_id": "3jDWEVZJEmyzuV_YLfVrKg", "user_id": "sno9HkL13dks96sev_R1cQ", "user_name": "M N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My 6 year-old had a great time, he was very comfortable after his 2-hr session which is not bad for a first-time climber. The staff was very helpful and patient with him. I wish they had a gym just like this in the valley. Highly recommend!", "date": "8/14/2018"}, {"review_id": "OBG02regJkAAd7etvG2mMg", "user_id": "9k2et25tG8kSj9Q3hqj9xA", "user_name": "Jerome N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "Walk in was about $18 for day pass. You can rent out gear if you want. This place has pretty good routes. They don't have a lot of automatic belays so you may have to wait awhile to be able to use one. I came in on a Sunday at around 4 pm. There were a lot of kids which is great to see that they're into the sport but also you may have to wait for the automatic belays.Their bouldering area isn't as great as other places I've been. The routes aren't as extensive so after you've done a few, it gets kinda boring. They are making the most of the space they have which is understandable.They do have a gym which is pretty nice. I didn't get to see what kind of equipment they have. The bathrooms were clean.I would come back here again if I were in the area.", "date": "10/18/2017"}, {"review_id": "1FKf4BvjCeRJPfZ0MuWnvQ", "user_id": "P4JNir_Ay9CWbjBqo9cRpw", "user_name": "Michelle A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Five stars is not enough for the amazing instructors and other staff members at Rockreation. I have been coming here twice a week for adult climb time lessons for almost two months. I went from never setting foot in a rock climbing gym or anything climbing related and being scared of heights to being very comfortable climbing.I HIGHLY recommend adult climb time classes. It's very reasonably priced and the instructors are all so nice and helpful. It's also basically a private lesson.I will continue to come here with joy!", "date": "4/27/2018"}, {"review_id": "m1sml39cOfQ7nW0NzvDDCw", "user_id": "2e5HpTEjzuY57xGtWCMI1A", "user_name": "Rachel S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 13, "funny": 4, "cool": 7, "text": "Rockreation rocks! I recently worked with the team at Rockreation LA to organize a fundraising event for a climbing organization that I volunteer with. Everything went very smoothly and all of the staff members were extremely friendly and easy to work with. I only have good things to say about booking them for a private event. The gym offers a variety of classes for both new and experienced climbers. They have plenty of climbing routes along with bouldering, self-belaying, and both cardio and weight lifting equipment. They even have a small studio for yoga and exercise classes! Rockreation feels like a really community, and I imagine that people who climb here regularly climb together outside of the gym as well. I would definitely consider signing up for a membership here in the future. It's so close to UCLA and I like that they have exercise equipment and classes in addition to climbing. I can't wait to come back soon!", "date": "5/23/2016"}, {"review_id": "MuAKQYNp-96G_9yeT88K0A", "user_id": "Hu1WpSYb6FwdOFbJPvEqUw", "user_name": "Kerry N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We had a birthday party for my son here yesterday and it could not have gone better. The staff were attentive to the kids, checked in with me, communicated, took the lead on making sure they followed the rules, kept them entertained, were encouraging and the kids had a BLAST!  The room for the party is private and separate and located right next to the entrance. It's bare so you bring in whatever you need. We booked the room for an extra half hour, at the end, to feed the kids and sing happy birthday and it was perfect.  The staff was courteous, considerate, and worth every (expensive) penny we paid for the party. Although you are for sure paying more than a party somewhere else that includes food, gift bags etc I still felt it catered to my son's personal enjoyment and was way safer than a trampoline park.   Thanks for a great party!", "date": "3/26/2018"}, {"review_id": "v9lZT_OUOmxJuUNd2IPvDQ", "user_id": "5gr2rMrUVb5vQH3iI5hDqA", "user_name": "Brynne H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "This is the friendliest and most welcoming rock climbing gym in the US!  The staff is always super kind and willing to help out.  It's a wonderful gym for the first time climber and advanced climber alike! My favorite part about this gym is the genuinely welcoming community that they build.  Their manager Jenn Tanaka is such an honest, welcoming, empowering leader and her sincerity shines through all the staff, instructors, coaches, parties, and community events they hold.  I've been climbing here for two years now and have met some of my best friends in LA here.  The team here knows how keep everyone safe, motivate you to get better AND have the most fun.  I highly recommend taking personal coaching classes as the one-on-one instruction is the best, most supportive, and friendliest you're going to find.  The class instructors are super, and the yoga and rockfit classes are phenomenal.  Definitely a great spot for the whole family, they have kids birthday parties and the staff know how to make those parties AWESOME , I've even seen them get the parents in on the fun too.  I've seen their teambuilding courses and kids birthday parties change peoples attitudes from fear and self doubt to empowered tears of joy and happiness as they conquer their fears.  This staff knows how to make conquering your fears fun and safe.If you are looking to try out climbing for the first time just go in and say Hey friends! I have no idea what I'm doing but this looks fun! will you show me the ropes? and they will take it from there introducing you to the best sport/meditation around :) (Granted you or a guardian fill out a waiver for you, everyone needs a waiver )I cannot recommend a gym more highly.  There is no sort of \"snobbery\" or anything of that sort.  I know all of their staff personally and If anyone corrects you its only because they are trying to protect you, and they take your safety seriously.  So swallow your ego, listen to the rules and enjoy learning an awesome new skill.  Everyone wants you to be the best climber you can be, and the best climber- is the one who's having the most fun! P.S. GET TO KNOW THE STAFF, THEY ARE RAD!!!!", "date": "12/15/2017"}, {"review_id": "TVAazhaRUv2BtTvfqWw92Q", "user_id": "ILtAof4aIZrdZOaKFcUIgA", "user_name": "Paloma B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Rockreation is amazing! I've been coming steadily for the past 5 months and I can't say enough wonderful things about this gym. The staff is beyond friendly, knowledgeable, and eager to show you the ropes (ha get it). Anyway, overall there is such a welcoming community all throughout. P.S. it's open for Memorial Day. Special shout out to Lucy at the front desk.", "date": "5/29/2017"}, {"review_id": "ubNdMV93kWUUD0r0Z3MtEg", "user_id": "3jikK3gKIflSPGgM0Ro2Ig", "user_name": "Laleh J.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "This was an awesome rock climbing gym.  Friendly staff and lots of variety in the climbs.", "date": "6/17/2017"}, {"review_id": "AEgI8fPOKlY7roDQFdtp5w", "user_id": "9xbtGngafI3nNyt-1h4sRg", "user_name": "J C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "This place is awesome. Clean, nice locker room and restroom. The staff is really friendly and knowledgeable. They also change the courses frequently, so it's always challenging. We do private lessons with Ben, and he's an amazing coach.", "date": "7/11/2017"}, {"review_id": "869BfuUlFCVSIO-mdVN_aw", "user_id": "DHKM-21rmm2Jk1lymvWp5A", "user_name": "H M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My son took a rock climbing class here.  The staff and facility is amazing.  Love it!", "date": "8/12/2018"}, {"review_id": "ZDxJXn0SZgCZ78MSVb4pCg", "user_id": "TmKW9WZyvRXv7v9e9GORPg", "user_name": "Chi T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 5, "funny": 0, "cool": 1, "text": "I've been spoiled with the gym close to my house so this one is just average.  It's a smaller gym with a small parking lot, although there is street parking.  The routes are short and closer together than what I'm used to.  There are fewer options and the ratings are true to the difficulty level. We came on a Friday evening, and the gym was not at all crowded.  I'd say half of the climbers were kids under 18 that day.Although the routes being short is a con, there is an advantage to that as well.  Some of the routes have overhangs and I'm not a strong overhang climber.  With the routes being short here, it's easier for me to make the climb because once I get over that part, I'm almost done with the route.  Whereas, with my regular climbing gym, once I'm past the overhang, I still have half the route to go, which wears me out.  There is also at least one self belaying station for those of you who don't have a climbing partner. Climbs using that machine vary ranging from the low 5s to at least a 5.10, so it's good for all levels.  I've yet to try that out as I'm not too keen on the feeling I get from being lowered on one.  They also have routes set up for lead climbs, but you'll have to bring your own rope, which we didn't do. Of course, before you do any kind of belaying, you'll have to pass their belay test.  Once you pass that, you're in their system and you're good to go next time you're here.  Also, there are lockers in the bathrooms, but not locks, so you'll have to provide your own as well.  Overall, I'd come back to this gym, but I wouldn't go out of my way to make it here as I have a gym much closer to home.", "date": "1/19/2017"}, {"review_id": "8nfpG3AMXiguH-UebRA-Zg", "user_id": "6oBAvuzQxfFEbus3PMrC-Q", "user_name": "Lucia C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 7, "funny": 2, "cool": 4, "text": "Just signed up at Rockreation. They have an great Black Friday deal where you save $100 on the initiation fee. With unlimited family memberships of $150 per month, including yoga, meditation and cardio classes plus use of gym equipment it really doesn't get any better!Rockreation is very well maintained and conveniently located. And the staff is friendly and helpful.I'm so excited to master this new sport!", "date": "11/29/2015"}, {"review_id": "9O20mmbby8dKaBOT7y1DEw", "user_id": "87jqR0u-jZEG3plqv8Yyug", "user_name": "Zoe L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "After reading the reviews, I was excited to meet the famous stinky staff person, but alas, so far I've only met clean, friendly staff people who seem happy to help me rethink (bouldering) problems. Also I love the music- sometimes\"indie chill\", sometimes hip hop, but thankfully never classic rock. It's a smaller gym in an office park, so the routes are squished together, which can be visually confusing, but your brain will figure it out. Cardio machines are older, but functional. Hours vary based on the day, check the schedule before you go. Limited parking lot spaces.", "date": "9/9/2017"}, {"review_id": "VHorluP2IGRXLwT_kD21TA", "user_id": "NueOEVvYdKfCPCGoQ-Y2og", "user_name": "andrew a.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 2, "funny": 1, "cool": 1, "text": "i don't like writing a negative review, but sometime service is so awful and individuals demonstrate pride in the level of rudeness and disrespect they can project. CHRISTIAN (played by the Pharmacy-Bro) at the front desk of of the West LA location took great pride in turning me and my girlfriend away on her birthday. he did not want to honor the groupon we purchased despite very clear terms on it and once he felt a little empowered over us, would not even honor the pricing on the menu on his desk. all this mid-week AM and not at all busy. CHRISTIAN was clearly being aggressive for no good reason and even though cost was not at all the issue for us (we just wanted a proper explanation), sometimes you reach a point were you just don't want to give such ugly people your money.in the scope of things it was so unimportant, but the more we thought about how aggressive and mean CHRISTIAN was we felt we needed to provide some sort of record or warning. particularly as Jacob the manager albeit a good listener and polite and clearly embarrassed by CHRISTIAN's conduct was unwilling or unable to address the situation. when we looked up the yelp and saw so many bad reviews to this location many of which reference the same CHRISTIAN and others at the front desk being rude and disparaging to others, it really shocked us and made us very sad. it is amazing Rockreation allows it and has not addressed such a clear issue on their yelp. allowing someone to go on with such conduct is truly awful. As they say evil is when good people say nothing in the face of bad behavior.we hope this lovely facility gets better people and clearer leadership on service and kindness. we certainly were looking forward to some fun climbing. BE WARNED as there are so many good and decent merchants that better deserve your patronage and will offer you at the least kindness, honesty and respect.", "date": "9/14/2017"}, {"review_id": "zkdEAxBOV6tC6ylZRJ5TIg", "user_id": "xrGLy0dRQIeBm4jKmFsRjQ", "user_name": "Isend R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This gym has everything you need. Bouldering, top roping, lead climbing on a 1 of a kind arch, and a work out area upstairs. Definitely a good way to spend your time. I climb regularly and Rockreation has all I need to stay in shape for outdoor climbing. Also I enjoy the staff. They're always down to chat about climbing even if you've just met. Joe and Christian have always been cool, and maybe if you're lucky you'll get to catch one of Guy's fitness classes.  Thanks Rock for the good times!", "date": "9/27/2017"}, {"review_id": "POnqrD-kiwTlNoN2bqxygQ", "user_id": "eghacKa9wBb4gLDNreRvkA", "user_name": "Robin C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Had a really good time taking the FG1 class recently.  Great instructors & fun experience!  I had bought a groupon for a friend for her birthday many many months ago.  Because of our schedules, we had to reschedule our class numerous times.  Every time I called, the employee on the other end, (mostly Jake), was super nice & very understanding & accommodating.  Even after the groupon had expired, they still let us change the date yet again due to schedule conflicts.   It was well worth it!", "date": "9/24/2017"}, {"review_id": "5weq7LM0qbBcvXwR3KFx3Q", "user_id": "k4saDaVuNdJzDhMXimB4lQ", "user_name": "James R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "I've never felt more unwelcome at a gym, or a business for that manner. We tried this place out to find out that their staff are completely unwelcoming and actually got irritated when I asked for basic directions around the gym. I even asked for something simple like a different shoe size  and the \"instructor\" (who looks like he hasn't showered in months) was making rude comments to his staff about us. Sorry that I haven't been here and didn't know my way around? Honestly do you have half a brain? I'm a customer and you make us feel that way? I have an idea. How about you take a shower (or 10), and come to Open mat? I'm sure your attitude and body odor will be a revelation.", "date": "8/14/2017"}, {"review_id": "kLH2zoMoQf4z4Llf-gsbqg", "user_id": "ywQdfUDRc677t6b90SlaFw", "user_name": "Laurence V.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Perfect membership for the whole family. Kids love to climb, mom does yoga, and dad goes to the gym... unbeatable prices !", "date": "10/3/2017"}, {"review_id": "KqxBwLK_olFeRQVm_OnICw", "user_id": "hUGZpZzAiCw96ZkD78ve8A", "user_name": "Linda R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I had such a great experience at Rockreation last night in their FG1 class, and was so excited to learn to belay, something I was very nervous about before taking the class. Jake and Peter were fantastic instructors - fun, engaging, and highly effective at teaching. My friend and I had a great time!", "date": "9/20/2017"}, {"review_id": "4t6kW26atHwz2Gi2jz6k1w", "user_id": "Qol3htarDOkFGNeT3nuGIw", "user_name": "Joseph R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I give this place a solid 4. My friend and I are not experienced climbers but wanted to try something different on a recent, hot, Saturday. We picked Rockreation because in addition to bouldering, they offered some auto-belay courses. When we arrived, the dude checking us in was very friendly and helpful. We had a blast on the auto-belay courses but definitely wish there were some more options. Next time, I definitely want to learn belay with my friend so we can try out all of the other courses. The bouldering section is awesome, but be aware, it's no joke. This isn't an \"easy\" activity but it was super fun. Your day pass gives you access to the entire gym, which is great for a different workout. I will certainly be back sometime soon and will update this review.", "date": "7/26/2017"}, {"review_id": "4w0DeAQvPrPjgEgLE1TvLQ", "user_id": "mj1EqfGhcjoILAqeA5tcRQ", "user_name": "Lia S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great 6th birthday party for Jayla at Rockreation! Exactly what I wanted, only wish we could have 3 hrs instead of 2.Jenn, Jenny and Pablo were fab. They were knowledgeable, patient and encouraging to all the kids and adults who wanted to climb. 2 kids in particular were very scared but by the end of the party, with the help of the staff, they were climbing too and enjoying  themselves. The place was packed but our party ran smoothly.I would highly recommend this for any age. We will be going back.", "date": "8/3/2015"}, {"review_id": "wmWrf4rhZYMIsUAYUSmsjg", "user_id": "G-ddixWX_pYMLVsqh_Ucmw", "user_name": "Suzanne R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I've been climbing on and off since 2005 and I really like this place. Great route setting and welcoming, chill vibe. I meet so many awesome people here. Plus Von offers a cardio hip hop class that is SO MUCH FUN. See, it's not aerobics and it's not like a performance class or anything. You follow his moves and everyone has a blast.The Rockreation description says it like this (and it's super accurate) ...\"No rhythm? No problem! Von's hip-hop class makes it easy for anyone to jump in and get moving to a mix of old school hip-hop and pop jams. Class will include dropping it like it's hot, shaking it like a Polaroid picture, and dippin' like dots! Whoa!\"", "date": "6/26/2016"}, {"review_id": "ggMAVOZ1I-UCRGaroiUvkw", "user_id": "0QWg3fr3krMQLg1eHs9Ajw", "user_name": "Marie H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "At one point I wanted to just buy a gym membership here since it was so conveniently located. They have a small gym upstairs with a bunch of fitness class offerings.  However, they told me they no longer do that, you must buy a climbing membership as well. They have a lot of great deals and partner with various companies month-to-month, so be on the lookout if you want to sign up as a member.Other than that, I've climbed here on occasion with friends, and taken their Flight Gravity Series class once, which I thought was good.  Not the biggest rock climbing gym, largest bouldering area, or highest top ropes in town, but good enough for me.  You do have to take a belay test before you can belay your friends.I've found that parking isn't too bad in this area.Overall, this place is great.", "date": "11/24/2016"}, {"review_id": "IvPcniOFrkBXIK8yoKeLGQ", "user_id": "lHwQWb4dAVQfnKvx1D2yJA", "user_name": "Cameron P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Had a very good experience. Spent about three hours there climbing with friends. Eric helped us out and was very pleasant. Would recommend.", "date": "12/31/2017"}, {"review_id": "1sTN047AszOuClyZFr_jzQ", "user_id": "A1iWTXLViXBsKDqdILPMSQ", "user_name": "Alana C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Walls aren't very high, and the place isn't very big. Top rope walls arent labeled, but instead have a chart where you vote for what it should be labeled. bouldering routes were all labeled, and the ones are labeled would be labeled \"v3/V4\" not just one or the other. Staff was nice for the most part, one staff member belayed for me when he was off. But another staff member was clearly annoyed with me when I asked for a belay check and quite rude throughout the check.", "date": "2/27/2018"}, {"review_id": "edn9Egxvp9d48qgPSJAzDg", "user_id": "Nsu9HoJHMWH3H7-IzHKN2Q", "user_name": "carla f.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My son has been learning to climb here with experienced and knowledgeable instructors for several years now.  He really loves it and has really progressed in his abilities. The gym is clean and well laid out and offers an incredible variety of courses and classes for people of all ages.  The staff is very helpful, warm and friendly. I would recommend Rockreation to anyone wanting to have fun while working out or learning a new sport!", "date": "10/2/2016"}, {"review_id": "l6sM0qkzWrOmHpD-CtX3JA", "user_id": "WTULsgO9OEc69e2pI0igBw", "user_name": "Andrew M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Rockreation is awesome! My friend and I have taken two classes there and have been stunned both times by both the facility itself and the people that work there! There are enough walls and paths there that beginners and pros alike will love this place. It even features bouldering, which I though was a nice touch for  people who want a little different rock climbing challenge.But by far the most amazing thing about Rockreation are the employees there! Everyone there is so kind and considerate, from the front desk to instructors. With them, Rockreation a thousand times better! I cannot recommend this place enough to anyone!", "date": "7/11/2016"}, {"review_id": "VCYRqMWNEExl1jrUV3z_vg", "user_id": "qNczqc3Kc7CSt3oSRjCgpw", "user_name": "Jake D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great place been a few times now. Really friendly staff ask them a question they offer loads of advice. I'm new to climbing so took the group lessons with a mate. Very good lessons, relaxed and fun and now me x my mate are climbing on our own in less than a week. Also hoping it wouldn't be one of those places where if you're not an expert you're in people's way. It's not got that feel at all. There's clearly good climbers doing crazy things I can't but fun to watch them.  If you're interested at all I can't say enough good stuff so just go try it.", "date": "3/3/2015"}, {"review_id": "XKERMllvueFNtThP0al39Q", "user_id": "FXgJTjdVotlVSIJQmmhhHg", "user_name": "Rico T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 1, "funny": 2, "cool": 0, "text": "The worst climbing gym in LA hands down!! Also , the dude at the front desk with the glasses , thanks for being an super unpleasant, unprofessional, unhelpful, micro-aggressive racist jerk. I won't be back to this stinky gym ever again.", "date": "2/25/2017"}, {"review_id": "24pYjPa6p1RmyQV-MPsOdg", "user_id": "RV1mwV2sebVjEu75gcPcvw", "user_name": "Anh T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I took the Fight Gravity series. Super helpful for my noobie self, and basically started my most recent obsession with rock climbing. I learned to belay and some general climbing techniques from class, but am finding it all comes with more practice. The staff here is wayyyyy cool and the community is also friendly. My only issue is the equipment is a bit old but I hear there are renovations coming shortly.", "date": "1/5/2016"}, {"review_id": "OrY841Ce4cCpgxIp9yQqYA", "user_id": "c54DyTjIznRNxRjJjFog4w", "user_name": "Dawn Y.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been going to Rockreation intermittently for years. . .so sad that it's taken me this long to write a review. You would never imagine that there is a climbing gym in this neighborhood. It's nice that they are right here in WLA. The location is convenient for westsiders, I work in the area.  They have gone through some major renovations over the past couple years, which includes a new higher and bigger boulder, new bathrooms and added an amazing workout area on the second floor. A definite plus to the gym. Their staff is always so friendly and warm. I enjoy the community feel. The climbing routes are always fun and challenging, I never get bored. I'd highly recommend it and can't wait for my kids to start climbing!", "date": "3/20/2017"}, {"review_id": "4Z9InkSwhmS37wSFdETuxg", "user_id": "iT6nne2ottyBgoNaPPf7OA", "user_name": "Mary K.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "We did a birthday party for a 9 year old at Rockreation yesterday. The staff was friendly, helpful, patient and fun. We had a big room for presents, pizza and cake, and the kids were really excited to get back on the wall after their break - even though the party was over!  There are lots of different levels so if you are a serious climber you can have fun, and same for novices trying to get over their fear of heights. It's a great place to hang out, and we're looking forward to going back just for us to climb.", "date": "11/4/2017"}, {"review_id": "VNW4SKABUoXz5b2oleAzXA", "user_id": "hvPGLDc07oyaBXXJIdSAPg", "user_name": "Brandye B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I booked a corporate event at RockReation and had a great experience from start to finish! Our instructors were friendly, knowledgeable, and very encouraging. The session started off with some group team building activities which got us working together and using our collective skills to solve problems and figure out challenges. After that, we broke off into teams and began climbing. It was a great day and wonderful way to develop our communication and teamwork skills. Major kudos to our instructors Brynne and Jason who were AMAZING!!!! Special thanks to Lee for being so flexible with the last minute booking!!! :)", "date": "2/2/2017"}, {"review_id": "2hTjd9FFFCfPsyXiEQlEIA", "user_id": "224i5x9KJkzwBkbUGXtk-w", "user_name": "Jane L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 22, "funny": 2, "cool": 0, "text": "Majority of staff is very friendly. Kids friendly. Lots of enthusiastic rock climbers. A bit cramped for the space, esp during the weekend. The only issue / one-off scenario I had was with one of the employees who was administering a beginner class. They focused and emphasized safety training, which was great. But because I was still getting used to the ropes (as I was just a beginner), I ended up with pinched cut from the ropes/buckle. The first thing that happened was the instructor got annoyed at me for getting injured and then proceeded to gather everyone in the class to point and tell them: \"Class! See this is what happens when you don't follow instructions!\" It really turned me off and I was pretty annoyed bc I was already injured (not like I purposely tried to injure myself - I tried to follow instructions as best as possible). Not saying they didn't emphasize safety training, just the instructor's attitude. They didn't have a safety kit either, just bandaids. I might give it another go but there are different rock climbing facilities in LA that i'd rather check out before coming back here again.", "date": "6/25/2015"}, {"review_id": "g6lAzSdAiDdwIL3-vrT_iw", "user_id": "j7oJdAeamyzokZqw1uqMyg", "user_name": "Tisa G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 2, "text": "The perfect place to start your fitness routine that will keep you coming back! Whether you are new to the area or have lived in LA your whole life, you are pretty much guaranteed to build a community of motivated individuals to spend your time with, either through the amazing staff or the multitude of athletes that roam this gym. Rockreation is not only a climbing gym, but offers meditation, yoga, martial arts, dance, raw body movement, and personal training classes. And after your done with all of that, inquire about a massage, because they offer those too!! Your one stop fitness destination and the best place to meet people that love the active and outdoor life as much as you do!!", "date": "1/13/2017"}, {"review_id": "plunzLcMy0lI_dYwucoqcw", "user_id": "nc3yQ757sEpM5glnq0bwwQ", "user_name": "Eliezer Y.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 1, "funny": 2, "cool": 1, "text": "1st thing i want to say is that this rating could much easily get better, and I will edit my review if they ever fix their big issues.I've been to numerous rock climbing gyms. and this is my third membership. I am a member here solely due to the fact that they meet the basics for a rock climbing gym. they have bouldering and some sort of ballet.1st big issue they're size... much  much smaller than most the gyms within 30 miles  of the area. To their defense, santa monica is very expensive and they do a lot with the room they have but none the less it's small and very expensive.2nd issue their buddy system. Every other gym i've been to lets you bring one buddy per month for free with a membership. this place lets you bring one person for free, but it must be their first time. From a business standpoint, I don't understand this, most people do not join a gym after there first time. it usually takes a few times so why not let them bring the same friend two months in a row. Thats how i decided to sign up and I've had two friends get memberships at another gym i went to after bringing them a few times.3rd HUGE issue is the belay system. Both the gyms i've been to only had auto belay and I've never used a buddy belay system. So coming here they make you past a test and give you a prep piece of paper that looks like its from the 90s. They would not even let me use my phone to watch a youtube video on how to do it \"for insurance issues.\" But they did suggest i purchase a $45 class that would show me how to tie a rope and how to brake a buddy. $45 after i just signed up for a membership for something that was learned off of youtube in less than 8 min.Basically if you're equally as far from this place as the other gyms, go to the other ones, much better quality gyms and cheaper. If you're like me and this is the closest BASIC gym, it will do but that's about it..", "date": "9/17/2015"}, {"review_id": "QxR0Hy-Ob_zg8Gc4FyBWoQ", "user_id": "jARzrEYhF5JarYyY4yhCtg", "user_name": "Alvin S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 3, "funny": 0, "cool": 1, "text": "As a preface, this review is only applicable to the bouldering section. I did not utilize the toproping/leading section of the gym. Also, I've been a member of a couple of different gyms (all while in Northern CA) and wanted to give this gym a try to see if I could make it my home gym as it's on the way between my work and apartment.Unfortunately, despite the amazing location, I don't see myself coming to this gym on a regular basis. Parking is actually not as bad as some folks make it sound, I was able to find parking within a block of the place and, since I was coming in to work out, walking a block was not an issue. The front desk staff was extremely welcoming and friendly during my experience and they did a great job showing off the gym. The bathroom/locker rooms are all new and spotless.The bouldering area is tiny. It wasn't over populated the day that I went but I can see how it could get cramped easily. The routes aren't that great either. Actually, that's the main reason why I'm giving this place such a low rating. Not to say I'm that great of a climber but I do have experience climbing both indoor and outdoor and I found these routes really confusing and disconnected. Part of it is the fact that they'll have same colored routes intersecting or adjacent and the other part is that the routes themselves have no continuity. Also, a good section of the wall was just unlabeled. Not the biggest issue for me but I noticed it steered a good majority of the crowd to one section, making it even more crowded. Overall, great location, chill staff, decent space for a smaller gym but really underwhelming and disappointing in terms of routes. Sad to say, although this place would have been the most convenient for me in terms of driving, I don't see myself coming back here.", "date": "7/8/2015"}, {"review_id": "HS0J7QtvNBd9MlzRloiwDg", "user_id": "IVpjRyVTveGEw8uKLNzK5g", "user_name": "Faith T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I was something like a first-timer since it has been years since I rock climbed/bouldered (and only once), but I received so much assistance and support that I was scaling the walls in no time. The lovely and amazing staff member Brynne showed me the ropes (no pun intended) offering great instruction full of warmth and encouragement. I had a blast; it was the rigorous fun I needed. I will be back!", "date": "2/15/2017"}, {"review_id": "SkBpyEBWDcFB4ti9SzE5FQ", "user_id": "oBytC6p9DlqVVGh2pHqnHQ", "user_name": "Correy O.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 3, "cool": 1, "text": "My husband and I tried Rockreation from a groupon that we received. It was really fun to learn the ropes / climb techniques with my spouse. It was actually like a lesson on communication and trust! :)My husband wasn't a huge fan since the walls are only so high and he is already 6'6\" himself, but I had a great time. I think we may try to climb in nature where he has more room to keep climbing. Awesome staff. Beautiful women's bathroom. Slightly stinky atmosphere - but it's a gym right?!", "date": "7/31/2015"}, {"review_id": "wKaEMu4Ytcc0ppQ3wLo_Xw", "user_id": "vll2e2IE7rphZhJhG-_Gtg", "user_name": "marissa p.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is great! I was a bit intimidated to start climbing again after a 10 year break so I decided to take some private lessons as a refresher course with my boyfriend. Our instructor, Steve, was amazing! He was enthusiastic, encouraging, knowledgeable and flexible with our moods and schedule. We couldn't have had a better re-introduction to climbing. Steve tailored classes to our skill level and preferences and checked in with us multiple times a week. He was really engaged in our progress and it helped keep us focused. We have gone back on our own and have found the rest of the staff and instructors to be helpful and accommodating as well. Seems like there's a lot of regulars but don't be nervous to try it out if your new. If you have no idea what you are doing or want to tighten up your workout routine take a lesson with Steve.", "date": "7/21/2016"}, {"review_id": "KlbkMdj2PvJFJJqL8Hv3qw", "user_id": "6J08rEMSrgsFfiyb3BWWkg", "user_name": "Ailyne V.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 6, "funny": 5, "cool": 5, "text": "I used to come here religiously a few years ago. Although not a fan of the distinct foot funk, I loved it here! I'm serious, if you're easily put off by strong odors, don't come here, it reeks of feet, sweaty feet. Anyway, I love Rockreation, especially the boulder area. In my opinion they set some of the best routes. I've been to a few climbing gyms across the U.S. and this gym by far has routes that are pretty outstanding, not to mention challenging and for the most part rated correctly. On occasion, there were a couple routes that made me sit back and scratch my head in puzzlement but eventually if there was a will there was a way. My god, countless hours staring at the different colored routes - hating and loving them at the same time. I used to break a sweat on the pink routes but after putting in time over the course of many months I made it all the way to greens and blues!The top ropes here are decent too, but I recall liking the top ropes at Boulderdash in Thousand Oaks slightly better. Anyway, I took the Fight Gravity series and the instructors are great! They even have kid classes for the little ones.They also have a small area for weights and cardio. Last I was here they also offered up yoga classes a couple times during the week.The crowd here comprises of both newbies and regular climbers. Everyone is friendly and willing to give you a tip if you look like you need it. These folks will spot you and even cheer you on especially if you're trying to do a climb and look like you're almost at the top but your darn Elvis leg is shaking a million miles a second and your forearms are about to burst! You definitely feel the camaraderie here - it really is something to step back to admire and appreciate.Anyway, I made a lot of friends at this gym - some of which I still keep in touch with. It's a great place to go and challenge yourself, blow off some steam, make a new friend, and oh yeah, get in shape. I hope to be a regular again.", "date": "1/15/2013"}, {"review_id": "cDbr4CeX_klZoXKO11QEJw", "user_id": "XIQHOiJmeeHixhy66EqBrQ", "user_name": "Nika D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 4, "funny": 2, "cool": 2, "text": "Honestly, this place was really disappointing if you don't know what your getting yourself into. We initially came in and were greeted very warmly. For three people it came to almost 80 dollars including everything (harness, chalk, shoes) but they didn't tell us that we would need to take paid classes and pass a profiency class to do 95% of the bouldering, now thats some bullshit and I go bouldering all the time in OC and have never had to deal with this. Anyways, Christina helped accomodate us and she was very nice about everything. I really was thankful that she was there.", "date": "4/9/2016"}, {"review_id": "O_d3QIzHKmzjeSKMzUuwSg", "user_id": "LJrrg1_Qym2QaZWNveANyA", "user_name": "jenna C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "Just finished a week of the Reach summer camp. We've been going the past 3 years, and my kid would not let us go this summer without signing up! I admittedly did try to not sign up this year, to save a little $$$ ... but of course, he remembered, and he reminded me. He loves this camp. That makes me happy. 5 stars.", "date": "7/29/2016"}, {"review_id": "qsn2vjUc0IloZobCGcs6kA", "user_id": "WN4qSRyb9Y-KuQ5jldOXuA", "user_name": "Ricky H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I've been climbing here for almost a year and I love it. The gym isn't the largest, but the density of technical routes is impressive. The ratings are a little tougher here too. If I can do a certain level climb at Rockreation then I know I can easily do that same level anywhere else.", "date": "5/27/2016"}, {"review_id": "GTFpHrmMorADMweaSmz5TA", "user_id": "Au6aPL14n9p7Hx1C6PyFmw", "user_name": "Lucas D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Let me start this off by saying that I am a fairly new climber. From the second I walked in the staff were extremely friendly and helpful. They showed me the ropes (literally) right off the bat. If you're a new climber looking to get into the sport, this place is for you. I can't explain enough how warm and friendly the staff are, they were so happy to answer all of my stupid questions and making sure I was always safe and still having a good time. I had so much fun that I can't see myself going to another gym. What a cool place!", "date": "5/1/2016"}, {"review_id": "L66q12PQwTWBrDp5TpM9Dw", "user_id": "rWAN3ZWXVs3lKk6phBYCjg", "user_name": "Karen P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and I got a groupon for the Fight Gravity 1 class which comes with a week long membership. Drew and Dan taught the class and they were very friendly and helpful. After the class, you have to come back to take a test before you can climb and belay on your own. We're looking forward to going back this next week.Looking at the rates, I'm not sure if we would sign up for membership, but maybe we will reevaluate after the week!", "date": "9/20/2015"}, {"review_id": "5xo5IWk7PF_3HO9RdO6UVQ", "user_id": "m6I0PDywph5xICK7GdtK5A", "user_name": "Ian B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 6, "funny": 0, "cool": 4, "text": "Note: This review is for customer service only, not the climbing setup or gym.I bought a month long membership for $100, and after climbing decided it wasn't for me. I was expecting to pay the day rate + rentals. Nope, they refunded my $100 and didn't have me pay a dime. Wasn't expecting that. Very thoughtful and appreciated.", "date": "7/8/2014"}, {"review_id": "_XeDT61DI9mm9FJSedgVRw", "user_id": "tobS-dDyu27wrcCiJHoPew", "user_name": "Anthony M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "My girlfriend and I just took the Fight Gravity 1 class purchased on groupon. Great experience! Customer service was great! The instructors were very knowledgeable and made the class entertaining. I can't speak so much as far as other detailed things that a climber with years of experience would critique. Coming from a complete rock climbing newbie I highly recommend this place to anyone interested.", "date": "12/3/2014"}, {"review_id": "51WyICUVEukGOuQ9dCZL6A", "user_id": "lNxRaIO2wNqMkCcQ8hhtyQ", "user_name": "Kathleen W.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 5, "funny": 0, "cool": 1, "text": "Maybe I'm just bitter because I couldn't send more than 50% of my climbs at Rockreation, but I certainly wasn't out to write a bad review from a climbing gym.As the only climbing gym in West LA (for now), I had to check it out.  Pros:- Cool staff.  Their payment system was glitching up and they were fine letting us through to pay later- Auto belays - yay!-  Short walls...for lead climbing.  If you're beginning lead climbing and afraid of the drop, I guess this would be the perfect gym for you?Cons:- At 10,000 sq ft of climbing, this gym is on the smaller side.- The top rope/lead walls are SHORT - no endurance climbs in here.- Whoever set the routes for bouldering problems, has an odd technique.  The start holds were literally a foot off the ground...I can do climbs with a sitting start, but this did not make sense.  Ain't nobody got time for that.- Unmarked routes.  On the bouldering wall, there were tons of routes that either discontinued halfway or were all-together unmarked.  Free form climbing, anyone? - The Sawtelle area is not the best for parking availability.After about 1.5 hrs of climbing, my friend and I left bored and frustrated at our lack of progress.  Suffice to say, I'll be waiting on the next new gym to pop up in West LA when I visit.", "date": "8/4/2014"}, {"review_id": "3o_fmRgNhm067yPw43Zo0w", "user_id": "rgBWoOBGLYYoh0_oqqZjHA", "user_name": "Brian K.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 3, "funny": 1, "cool": 1, "text": "Rockcreation is not a good climbing gym. Been climbing on and off for the past 4 years and been to many different gyms.There were no more than 15-20 top-rope routes. Few of them were graded in the 5.8, 5.9 range. Just lower 5.5 - 5.7 then jumps up to 5.10a and on.There were way more lead routes, but when I went there was literally no one doing lead climbs. The lead and top-rope climbs were separated. Why not mix them in, so the crowded top-rope routes are spaced out along with the empty lead routes?Also, the different climbs aren't marked with tape, but have holds that are supposed to be the same color. Ends up being very confusing.I'd recommend Stronghold or one of the Touchstone gyms (LA Boulder, I think).", "date": "10/1/2014"}, {"review_id": "cvydWUzGRIuLeoCm2vROzg", "user_id": "PU2sJGUSJzMUFiZrmV519Q", "user_name": "Army C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 7, "funny": 2, "cool": 0, "text": "Rockreation is where my boyfriend taught me how to climb, so I obviously feel sentimental about it.... which is why I am giving it three stars. I've only been climbing for about 6 months and try to go at least twice a week, so my review is given through the eyes of a newbie trying to transform into a legit climber.Few quick notes: 1. I know my review below may sound critical, but I think due to the fact that climbing CAN be a very dangerous activity, it's ESPECIALLY pertinent to be proactive about everyone's safety.2. Climbers I've met here are some of the most supportive and friendly people I've met. It will probably be really easy for a newbie to come in and make friends/climbing partners.3. Staff members are generally friendly - ask them questions if you aren't sure about something.4. All the roped routes seem very bouldery... but that's probably to make up for the short wall. Other gyms with tall walls I've been to have settings that are mellow until you get to the 4th/5th clip (safe to fall at that point).5. Dirty carpet and feet smell? That seems unavoidable at any climbing gym. I just try to wipe my feet before leaving and have a separate pair of flip flops for my gym days. #1 annoying + dangerous thing about this gym:- Rockreation has kids' classes couple days out of the week... which coincide with the time when people are getting out of work and start coming into the gym (hectic!). As a fee paying customer, I don't like how climbers have to wait around for the kids' warm-ups and give up the main space so they can conduct their class. I don't remember agreeing to this inconvenience when I signed up. It's a SMALL space to begin with, and it's really awful because a lot of the kids don't know how to behave in a climbing gym. - I've had TOO MANY instances where kids (early teens - are they still kids?) bumped into me while I was belaying or they would trip over my rope. I even actually had a kid throw a shoe and hit me while I was belaying my partner as he was climbing the arch. What makes me angry is that some of the staff seem so lackadaisical about this type of unruliness. UNACCEPTABLE. I understand that they are kids, but they are under the gym's supervision... SO SUPERVISE THEM! Just a quick note to parents who bring in their young children into the gym: PLEASE DON'T LET THEM RUN AROUND WHILE YOU ARE CLIMBING. It is DANGEROUS. Supervised or not, they shouldn't be roaming around the gym where they can be a danger to climbers. I've actually seen a toddler in a diaper roam around willy nilly as the parents were climbing... and the kid ran into the belayer's arms...  O_O ... and the staff didn't say anything to them. GENERAL/UNIVERSAL note for everyone (important points + etiquette I've learned/observed): - DON'T step on someone else's rope. Especially when it's being used!- DON'T traverse or climb underneath a climber (for rope/boulder/auto belay!)- DON'T traverse too high (I actually recently saw a guy who fell off from almost at the top of the wall and smacked his head and got carried out by EMT). Even if you are a great climber, you never know if you'll slip off. Be considerate of the people you may hit if you fall. - DON'T wear your harness in the bouldering area. Do you really want to take the chance of falling weirdly on your harness/gear/carabiner?- LISTEN UP for people announcing \"LOWERING\" - you may have a climber being lowered over your head. Actually, don't stand around at points where climbers are going to be lowered, period. Always be aware of your surroundings!! - DON'T give a ton of unnecessary slack during lead climbing even if you're belaying a human monkey. I'm no expert, but if someone falls on their 2nd or 3rd clip and there's a ton of slack out.... you get my point (hopefully).", "date": "10/16/2015"}, {"review_id": "-5IN0onL7p21Hg-tLxgRxg", "user_id": "pZh1obL9FVg6jjlNX6G5lw", "user_name": "John V.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 5, "funny": 0, "cool": 0, "text": "Over the past 8 years I've been a member of 3 different climbing gyms. Rockreation is the closest option (in regards to proximity) for me now.I have a flexible work schedule so I try to climb during the day - whenever I go at night it tends to be very crowded.I don't have any major gripes with Rockreation. Most of the staff are friendly. They recently redesigned the bouldering area and it's an improvement over the old setup.I really wish that they'd come up with a better guest pass system. I'd love to bring my girlfriend/visiting friends in to climb with me on occasion, but the current setup makes that pretty difficult. An expanded weight area would be nice too.", "date": "4/18/2014"}, {"review_id": "KiqG9wgtITuOtEroA4JfLQ", "user_id": "Gdzqo32xFRrHF2-27FW7vg", "user_name": "Jeraldin R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have to give this place a four star just because it was my first ever experience with bouldering indoors.  If it wasn't my first experience, I would given this place a three just because there's not much space to boulder.My friends and I went on a Friday night and supposedly it's considered a slower night than usual.  With that being said, the amount of people on a Friday was a lot in my eyes.  Everyone basically had to share the wall and wait for their turn.The staff were cool and trustworthy as well.  They were also helpful and knowledgable.", "date": "3/24/2013"}, {"review_id": "VlQxv4Eqge1eYDNwaH-F0w", "user_id": "S_MYFfvGM9HpCp04AWs86Q", "user_name": "Linna L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 4, "funny": 1, "cool": 2, "text": "This place rocks!! (pun intended)Staff: Everyone is pretty friendly and willing to help . . . even when I had to go back and forth for a new pair of climbing shoes twice because they were either too tight or too loose. They even were really patient with me during my belaying test - I had some performance anxiety and my figure-8 knots stopped looking like 8s for some reason.Facility: Pretty awesome. There are so many walls for you to climb on and they're all nicely labeled with the level of difficulty. As a novice, I climbed a 5.1 with little difficulty. They even have walls for bouldering - it's harder than it looks because of the steepness of the incline, but you can get some pretty awesome photos of you on rocks! See photo taken here as an example. I make it look easy, but I let go immediately after this photo was snapped.Parking: One thing that made me frustrated about coming here was the parking situation. There's a lot outside of the facility, but most of the spots are \"reserved\" for the other tenants in the building, but I was unsure whether these reserved spots were still supposed to be reserved even after normal business hours. So, after deciding that I did not want to risk getting towed, I had to park on the street and climb the high wall and shrubs that separated the street from the parking lot.All in all, I loved my experience here. As a novice who's pretty scared of heights, the thrill of climbing up high and coming down is so much fun. Though you can get tired pretty quickly. I can't wait to come back.Tip: If you plan to climb for an hour and this is your first time here, you should allocate about an extra 30 minutes to the time you spend here because of the belaying test. Depending on whether you want to refresh your skills before or how busy the staff is, this process could eat up a lot of your climbing time.", "date": "3/18/2012"}, {"review_id": "RQckyYhRCref5q4Me7FWwg", "user_id": "-r0NZan_59y3BQ-u3mX_GQ", "user_name": "rogerio r.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Very nice place, some times is little crowded, but not to bad, staff are great and helpful, the new bouldering area looks great!!The routes are well planned and you can identify the color in the holds, they wash the holds time to time :)", "date": "2/23/2015"}, {"review_id": "PX_WELOp7osPbPuNLS-phw", "user_id": "VQq3tsEjiYvvbn1YJwyoaw", "user_name": "Los Angelin O.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 5, "funny": 3, "cool": 0, "text": "Gross smell when you walk in, but that's probably normal for a climbing gym. Sloppy tapes indicating routes. Don't walk barefoot in the boy's locker room. Come to think of it, don't walk barefoot anywhere in this gym. There's a new climbing gym opening in West LA soon. It's time for Rockreation to either start shaping up or start tearing down. Listen to the customers--cheesy costume-themed nights won't cut it anymore. Tip: Give a free guest pass per month to every member to use whenever they want; limiting the guest nights to one random Friday here and there won't bring you any new members. Groupon can only keep you alive for so long. Update January 2014: I had you at 3 stars until this new set in the cave. By far, the worst set in my many years at the gym. Almost every route requires an awkward drive-by move; no skills necessary, just strength. Not very well thought out, and just sloppy and lazy altogether. Get it together people.", "date": "1/8/2014"}, {"review_id": "5jaHrOb6GgDh46JK3qGJlg", "user_id": "NCkw3WFfCRBz06oZ_5_lpA", "user_name": "Chris J.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Started coming to Rockreation as a complete climbing novice about six months ago. Signed up for the Fight Gravity series to learn the basics and have been hooked ever since. Great facility, VERY helpful and friendly staff ready to answer my beginner's questions, and a fun place to climb!", "date": "6/3/2017"}, {"review_id": "7AQZLI5vRqVmlReHs0LUHg", "user_id": "Z_9jGnC_ULCTPvgAR36TVg", "user_name": "Snook C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "I love this gym and i want to encourage people with bad experiences to give this place another shot. I think that the community here is really awesome. Everyone is very friendly and I can initiate conversation with most people. I spent 99% of my time in the tope roping area and this is definitely a top rope oriented gym as their bouldering area is pretty small. But if you want to boulder, there are other gyms that have more spaces for that. Not that their bouldering area isn't good, it's just a smaller section of the entire gym. I took 3 classes here. As a beginner, I feel that the classes were really necessary and I didn't mind cashing out for a few great lessons. The instructors regularly wander around the gym and you can catch them at any time to ask questions. I don't understand the complaints about odors. It's a gym...and seriously, it doesn't even smell. I feel like my college gym smelt worse. The staff here is super friendly. I don't think that people should expect the staff to try to be everyone's best friends. They do their jobs. When I ask them questions, they respond nicely. I forgot my shoes once and they didn't charge me for their rental. This demonstrates that some of the staff like to go above and beyond. I generally feel very welcoming here. The routes are well set. Of course, i'm new to this sport so what do i know but they are generally consistent. I don't feel that vary very much. 10a's all feel the same. There will occasionally be some really awkward and difficult 5.8/5.9 but i feel like i just need to work on my skills more and it's not the route's fault. People in the gym help rate the routes so they are pretty standard. However, if i do have one criticism, it would be that routes name/rating fall off all the time and staff aren't always replacing them. But really, it's not a big deal.", "date": "2/5/2014"}, {"review_id": "3l6P-ra3ZTKSxEL9cKkk1g", "user_id": "3HZKZ5EEkkPmc7baT6zcbw", "user_name": "Sal D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 7, "funny": 7, "cool": 9, "text": "This is the only wall climbing place I have ever been too and I love it. Have been here twice, Rockreation has a member bring guest free night and I have had a great time and an amazing workout each time. I have done bouldering and harness climbing but where its at is traversing, I don't like heights. To top it off they have a small work out area with free weights and machines. Love that the floor is so bouncy and padded, it really helps with there whole fear factor of climbing. To top it off this place has some great views, who would have known female climbers have such great asses and for the ladies there are a lot of guys in great shape too, if you're into that. Will definitely be back, thinking of getting a membership, I hear its $60 a month. I don't own climbing shoes, but luckily you can rent them here for $4.", "date": "9/17/2011"}, {"review_id": "m9Hsp0nu4AsoRO16W9YDjg", "user_id": "JUsgPMN5QRTqFCfG-oeVYg", "user_name": "Frank S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "My kids discovered rock climbing here, and soon moved from casually interested to enthusiastic members of the Rock Warriors climbing team.  The gym has a wonderfully laid back clubhouse vibe, and even on crowded weekends with kids birthday parties, there are always plenty of great bouldering routes free to work on.  The recently remodeled changing rooms and exercise areas are top notch.", "date": "2/13/2016"}, {"review_id": "RAmJ0bTZ1HORuXNLS8KUrQ", "user_id": "MemRJ7L9jS3BOngZnWeYlQ", "user_name": "Sarah R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 4, "funny": 1, "cool": 0, "text": "Review for the bouldering area. Crowded with a crew of boulderers who don't pause in their relentless assault of the wall. Hard to sneak in. Taping jobs are confusing, some nearly impossible to decipher if you haven't already fully mapped it in your mind. A dizzying array of colors. And only 4 crash pads for the entire are. Seems extremely sparse and the locals seem to ignore them anyway. And as a comment on the safety here, an ambulance was carting someone away when I arrived - no one seemed to take much notice and the staff member at the front desk wasn't sure how the accident occurred. Really reassuring.", "date": "12/15/2013"}, {"review_id": "tb76ZUFbVgbK1I_BfrnQSg", "user_id": "yOTpoabJWyYCJMwV_vCTCQ", "user_name": "Hannah R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I had a great experience when I signed up for a group introduction belaying class through groupon. A girl friend and I had discussed going rock climbing together many times, and were anxious to make it a new hobby. I bought us groupons for her birthday, we arrived together and I had an excellent time belaying with the group.My friend, however, claimed to have foot cramps from the shoes and was unable to do any of the exercises... idk..I came two more times to fulfill my groupon deal, each time experiencing a very friendly staff and regulars to the gym who offered to partner with me (since my friend decided to never show up again). Everyone seemed to care for my enjoyment at the gym, and I still would love to make rock climbing a regular hobby. There were young girls (10 years or younger) enthusiastically belaying solo (attached to the tethered harness) who were encouraging me to stop being such a wuss and allow myself to free-fall from the harness! They demonstrated for me how easy and safe it was.. I was still a bit of a scaredy-cat.Prices are comparable to other rock climbing gyms. Equipment all seemed to be in great working order. I went before the renovation of the bouldering area, but it was usually pretty crowded in that section. I found plenty of parking in the private lot (a few spaces for Rockcreation) or street parking (metered). The gym closes fairly early, its an ideal hobby for those who don't work normal 9-5 jobs, as you'll get the most free access without it being too crowded.", "date": "7/29/2014"}, {"review_id": "yW0I85lgwLKVrns3CQ5UqQ", "user_id": "IEsjXABiNZdACd8kvwwD6A", "user_name": "Stephanie L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We had my son's 10th birthday party here and it was fantastic!  Von and team were great at keeping everything running smoothly.  All of the kids loved it and gained a lot of confidence as they learned the ropes (pub intended.)  There is a party room where we served snacks and dessert and the guys even helped us clean up!  Highly recommend.", "date": "1/3/2017"}, {"review_id": "Hvm-ipdmwOhMe3PFiKiccg", "user_id": "3tpzXGDjQkot1i2NwQvz-g", "user_name": "Philip B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym for inexperienced to advanced. They even offer fitness and yoga classes. And have weights and fitness machines upstairs.", "date": "4/27/2016"}, {"review_id": "-jHI4eJN55Js53bcghL_pQ", "user_id": "lIf68Cx42WvAjt_k4PNs8w", "user_name": "Steve M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 2, "funny": 3, "cool": 1, "text": "The luster of this gym has really worn off. Especially with competitive gyms now encroaching on their turf, you'd think they would step up their game. The only thing they have going for them is location; it's ideal. But other then that, they have a pretty crappy staff. Inconsistency with changing their holds on the walls (especially the bouldering area). Children running freely into the bouldering area which could end up being a lawsuit should someone fall on them. Terribly kept washrooms. Oh, and shut the damn Skrillex off. Listening to robot sex SUCKS.", "date": "12/13/2013"}, {"review_id": "kcz1aULlfllI85LwjtiSSw", "user_id": "Mwv_H1J3Lv2gGeKvaFMHfA", "user_name": "Jay A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing here since Dec 2014 and I truly feel at home here. The staff here are great(shout out to Jeremy and Tracy)! The FG series nails everything you need to know to get on that rock and hopefully beyond. The gym is a bit smaller than other gyms I've been to, but Rockreation works very well with what they have:). I can't count out the efforts they are making with what limited space they have such as updating their fitness center and building more top rope walls! Their climbing routes are very interesting and challenging. When stuck with a route the staff is awesome with feedback and advice. Rockreation also offer fitness classes almost everyday of the week. I still have yet to attend one of those. But I can't wait to try them out. If you're curious or want something new you should definitely try this gym. I would love it if they opened 6am everyday because it gets crazy during the evening hours. I also hope that they get more fitness classes and start doing outdoor climbing events.", "date": "3/8/2015"}, {"review_id": "C65eFsfhkhJUBR2jUfLpFw", "user_id": "2PYQtFl_4G5cVf83xFqezw", "user_name": "Shawn S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I had my 10 year old daughter's birthday celebration here. The waiver process was easy. They were ready for us when we arrived with a clean party room and 2 instructors. We got Lee and Alec (I suspect more than a few little girls are in love). These guys could not have been nicer or more patient with 10 squeely little girls. They laid down the rules, taught a few skills and managed the party's fun and safety throughout. At $25 a head and an extra $5 for goodie bags, I felt like I got a bargain. Collin is the guy that sets up events. He was clear, professional and efficient. I knew what I was getting when I walked in - no buried fees, no upselling.", "date": "4/1/2014"}, {"review_id": "a5G1N0av6jlN-QB-qsToKQ", "user_id": "nrSvy25HqxYHZ5fLNX5WNQ", "user_name": "Tom P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I have climbed at several gyms in several states, but only the dudes at Rockreation are so interactive with us while we climb! They're a great group of people who have helped me get better at climbing and been a blast to hang out with! I'm still pretty new to climbing but they've helped me excel quickly. The climbs rotate at a good pace to get the best out of the path. Definitely going to keep coming back!", "date": "12/14/2016"}, {"review_id": "eJ7-iChDk0SeKA9_2vg81Q", "user_id": "o9Uh5XWfuwy5mbJcjyB9NQ", "user_name": "B F.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 2, "funny": 1, "cool": 1, "text": "Rockreation is the only place to climb indoors on the west side of LA.  Because it's a monopoly, it suffers from the classic symptoms of a monopoly, i.e., it is undermaintained because they don't need to worry about members going elsewhere.  I only climb here because it's the only game in town, but I plan to cancel my membership when the Cliffs of Id opens in Fall 2015 (touchstoneclimbing.com/c…).I will summarize the faults with Rockreation as follows:1) The gym is outright ratty.  Poor ventilation, smelly, dirty.   I am making this comment even after the recent remodeling of the bathroom.  Not sure why they have carpeting, it's disgusting.2) Routesetters lack creativity, especially in the bouldering area.  Too many similarly styled routes - generally very crimpy and straight up.  Seldom do you find routes that are balancey, require stemming/open palm, sloper-y.  I think part of the problem is that the actual wall sucks -- doesn't really give the routesetters a lot of flexibility.  I don't like the surface of the bouldering wall but that's personal preference.  As others have stated, I find many of the routes illogically architected.  3) Route refresh rate in the gym very slow.  Often takes months to reset routes.4) Parking is terrible.5) Weight equipment is awful too - does anyone really expect to get a good work out in?   The stationary bikes are out of the 1980s.6) How can you have a rock climbing gym without a campusboard??!", "date": "8/27/2015"}, {"review_id": "FV1ccq5_0aCLM5uoU8j5PQ", "user_id": "wC7bh1Tg5I1-SuxXvrKrmg", "user_name": "Caitlin C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I just took the fight gravity 1 series with Tracey and Christina and it was so amazing. I am addicted and will be coming back. If you want to get over a fear of heights you should try this. It's exhilarating and freeing. I feel so alive. Extremely friendly staff and a community feeling of members.", "date": "9/8/2015"}, {"review_id": "u32VzjQJK2e4OqerwvvrOA", "user_id": "GsjBqGD78XT-QEDEudK1eA", "user_name": "Kevin S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 4, "funny": 3, "cool": 3, "text": "I have been climbing here for about 3 months now. I go pretty regularly (3-4x a week). And I recently graduated to climbing outdoors! real rock! Whoo!My story from rockclimbing rookie to the (somewhat) initiated intermediate climber is a great testament to the great people at Rockreation.Fight Gravity Series (1-3) classesI started out with FG1, using a Groupon. I learned how to belay, the basics of climbing and got a week of unlimited climbing. From there I opted to enroll in FG2 and 3, which gives a total of 1 month unlimited climbing, and also gives more advanced instruction and technique classes. The instructors are great. They're passionate and personable too. They teach the fundamentals, giving you a good foundation to build your climbing career. Remember to climb with your skeleton! You'll learn it ;)If you're just starting out, I highly recommend the FG series. Not only will it get you hooked, it will also accelerate your learning curve. Literally by the end of FG3 (after 2weeks climbing), I sent my first V2 bouldering problem (sent, meaning I finished it), which is not too shabby I think. The climbersThe best thing about rock climbing is that most climbers are really friendly and social. People are especially communal in the bouldering area. Friends and strangers alike love to work on problems together.In fact, a friend I made while bouldering recently took me on my first trip outdoors to climb at Echo Cliffs. It was an absolutely transcendant experience and was totally made possible by the cool people at Rockreation!The facilitiesThe gym is on the small side. Walls aren't too tall. And routes can sometimes feel limited. I boulder mostly. The problems in the boulder area are adequate. Fellow climbers have told me the bouldering problems, when compared to other gyms, tend to be reachy or strengthy. Routes get reset more regularly than other gyms I've been to which is nice. Keeps me challenged. But I climb 3-4x a week so I could see some hardcore gymgoers getting \"bored.\" but at that point you should be getting outside anyway! Some have complained about the gym smelling bad, but to this I say, get your butt outside and climb in the fresh air!", "date": "6/21/2011"}, {"review_id": "EsgtcB8eMXfgPDy7-0QRRQ", "user_id": "VygNOzcF04qTvvfgM_7Ylw", "user_name": "Chi L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 12, "funny": 0, "cool": 0, "text": "While the staff is nice, this place is a terrible place for bouldering.  This is obviously an older gym, with short, dated walls.  However, they could go a long way in up keeping what they do have.  I climb at Touchstone, Planite granite gyms in the Bay Area and this gym can do a much better job. The walls are filthy with black tape residue, and layers of old tape everywhere.  Tape is simply put on top of old tape.  The walls and holds are disgustingly greasy.  There were a handful of newer holds, but it was limited.  There were little foot holds everywhere....why?  And they use a color system, that you have to check the wall for the rating - kinda lame.Also, setters seem just plain lazy.  About 1/2 of the boulder problems don't have a top out end.  I guess the regulars are used to this as climbers look for the end, don't see one, then top out at any place.  Touchstone is building a gym downtown.  I can't wait for all these climbers to experience a good clean gym.  Rockcreation won't be able to compete unless they clean this place up.", "date": "4/9/2013"}, {"review_id": "NlgofCI5lhmVUBcBhaLJHQ", "user_id": "pLuJGC1CN0W_yfrNvckDfg", "user_name": "Raymond P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Sucks they're currently renovating a good portion of the gym which includes the bouldering area.  Future patrons: don't make the mistake of accidentally coming in during a kid's party--I arrived with my brother-in-law last Sunday afternoon to find the place a complete zoo.  Completely wasted workout day with obnoxious brats all over the place. On a more positive note: they have real good routes, an awesome arch for lead climbing, a great weight station that even has fixtures to work on your grip and finger strength, as well as a stair climber machine to help work out them legs.Parking can be tough, so come during the evening on a random weekday.", "date": "3/4/2014"}, {"review_id": "unhbHuKa52LHTrVMZ6UMlg", "user_id": "UE66GxGVc0xjmT6Uprr_fw", "user_name": "Stephanie C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "This gym is really nice, and it's only about 10 minutes drive from where I live, but it is so EXPENSIVE! Also if you want to belay anyone or try top roping, you would have to take their lesson, which is $45. It's probably worth it because the lesson is very extensive and it gives you a good grasp of climbing in general, and it's 2 hours long for pretty small sized groups so you deifnitely get individual attention.  You also get a week of free climbing afterwards.  HOWEVER, at Hangar 18, you learn how to belay with a GriGri for free, and their membership is only $28 if you are a student. I would say that rockreation is great for top roping as they have a lot more routes than Hangar 18.  However, their bouldering is pretty limited to a small section, and their membership is $45 a month (or maybe even more?), and I dont think there are student discounts. Top roping is definitely a lot more fun than bouldering (personally), but top rope belaying is a bit more difficult than using a GriGri, which you need to learn before you can do anything at rockcreation. They even test you before they let you start climbing.  So at least you know you're in safe hands if you do top rope?Anyway, this is probably the only climbing gym close enough for me to go to on a regular basis, and despite the cost it is a lot of fun and can be really addicting. there are probably better and bigger gyms around, but none are within driving distance. and i have close to no upper body strength so i've definitely developed more forearm muscles than i had a month ago... don't know how handy that will ever come in life... the staff is friendly and rock climbers in general are great people to be around. so give it a try! Also they had a groupon deal a while ago!", "date": "9/6/2013"}, {"review_id": "uQpvnskchN0ex_3KsmNm6A", "user_id": "4RxMvwDyosTYQhmgRITlFQ", "user_name": "D K.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 2, "funny": 1, "cool": 2, "text": "The daughter enjoyed the party overall, what I don't understand is why all the parents that come to pick up their kids a few minutes before the party ended were obliged by Von the party coordinator to sign some sort of spectator release form. These parents are just going in for a few seconds...why bother them again with yet another form??? What sort of terrible danger are they in while they watch their kids on their last climb?Also, considering the price, it would be truly nice if the staff would help you a bit with the setup, even a symbolic gesture would do.", "date": "6/21/2015"}, {"review_id": "q3EggR9KZqI2iOrD-bsQAQ", "user_id": "c6aYHrJni6mpv1koWF2YwQ", "user_name": "Nate B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 7, "funny": 1, "cool": 0, "text": "* PERM LOST CUSTOMER & NEGATIVE WORD OF MOUTHClimbed for years... assh-le wanted money for a 5 second question - apparently other climbing yelpers have had the same experience.I've zero patience for douches.Luckily, there are many other rock gyms with better yelp/customer ratings.TIP:  $45 + 2 Hours to show you what other gyms do for FREE in 10-15 minutes", "date": "3/10/2013"}, {"review_id": "ttDT1Ps7FFUtjrVz8G6Blw", "user_id": "Qh8FLpLqMcv6TuNFPO_Mbg", "user_name": "Jon V.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "This is a super late review, but hey- better late than never. I used a online deal and took a belay rock climbing course. It was a two hour course that was exciting to my amazement. I remember showing up and being greeted by some rude obnoxious guy. I didn't give it to much thought and didn't let it bother me. It was the first time I was doing something like this so I went with it. The place had a great crowd of different ages. It turns out, only me and another girl showed up for the class. WHICH WAS AWESOME, because we practically had a private session. The two hours turned into three and a half hours of being taught and learning. It was great. I remember the instructor was an awesome guy who took his time to teach us and stayed beyond \"class time.\" I haven't gone back since, because I don't have mates up to join. But it was okay overall.", "date": "8/30/2013"}, {"review_id": "VLYwd29eFPQ34s6MWseRFQ", "user_id": "oinIrzljytrWH-DUWnipNw", "user_name": "Veronica B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 44, "funny": 5, "cool": 2, "text": "I hate writing bad reviews. When possible, I prefer to contact managers directly about poor service. However, when I asked for contact information of a manager, I was given a scrap piece of paper with a phone number on it (no name, no e-mail), and I looked it up... he gave me the gym's number. So, Yelp review it is.First, let me preface by saying that I have been climbing for over ten years. I have done bouldering, top rope climbing, and lead climbing at gyms in San Diego (Solid Rock and Vertical Hold!). I had a monthly membership at Solid Rock in San Marcos. I then moved to Orange, tried an indoor gym, found it too difficult to climb due to financial restrictions, and so I put a hold on climbing for a few years. Now that I have moved up to LA, I was so excited to see that there was a gym near me. I hoped that I could get back into the swing of things. So, I checked out Rockreation's website. First, $26 for a day pass/gear is pretty darn expensive. I also checked out their yearly rates (since I was thinking about another membership) and found out it would be $699 for an annual membership. Wow! Still really expensive! But, this gym was the closest, so I went for it.First, we walk in and find an employee checking people in. He seems friendly, and I let him know that we are new to the gym but not to climbing. He pulls out an ATC belay device and asks if I'm familiar. I say that I've used it before, but would like a refresher. The mood changes. He pulls out a long checklist of things that he tells us we will be \"tested on\" to see if we can top rope climb. If we do not pass, we can only boulder... and they won't teach us or review anything with us before the test. The test includes figure eight knots, \"belay on,\" and other basics. I let him know that I have used figure eight knots in the past, but that my last gym used grigri clips, so I would love if we could get a refresher.Well, that changes things. I am allowed to take the test, but my two friends will not be able to because they have never used figure eight knots (but have belayed and climbed extensively). He also will not show us what to do unless it takes less than \"two minutes\" because they're busy and short-staffed. Um, what? I have never, ever been at a gym where I was refused a belay lesson. Gyms are all about safety, but they also want people to be able to climb and pay them money! One of my friends was also pitched a belay class that cost $99 (includes month's membership and gear). I'm sorry... a belay class that costs $99 dollars? For six hours of training? Yes, it includes a month's membership. But what if I only need six minutes of quick refresher training, not SIX HOURS? And if you don't take this $99 class, you can't top rope climb. This is a blatant rip-off and poor gym service.By the way, by comparison, the local gym in SD cost $9 for a belay training. But whatever, okay, I figured I would try and practice for their test, take it, and get to climbing. I went over and practiced my knots, and asked some patrons to show me and make sure I was right. I did remember correctly, so I thought I was good to go. The only thing I didn't remember how to use was the ATC, and I figured they could at least show me that.So, my friend and I went back to the desk to begin our test. The original staff member was very busy texting on his phone (really busy, right?), so a second staff member said he would help. I explained that I had several years of climbing experience, but was a bit rusty, and so I would appreciate it if he could explain the ATC. He looked suspicious that I had ever climbed before, and he showed it to us very quickly, without explanation, as if he was giving us a cheat. I then showed him I could tie a figure eight knot as a climber, and my friend asked again if he could explain the ATC (because he had never used it). He did in about five seconds, and my friend put on the ATC correctly. The staff member then began to ask us in a patronizing tone if we could examine each other for safety issues. I pointed one out, growing frustrated--if there are any, just show us and move along!He then started to quiz me about harnesses (including kinds I was not wearing), and I decided I did not want to spend a night being patronized instead of climbing. I gave up and asked for a refund. Basically, I fail to understand how they did not have time for a five minute belay lesson, but did have time for a 10-15 minute test where the potential clients are made to feel like fools. I wanted this to be my regular place. I wanted to give them more than a $1,000/year in membership fees. But, I have never been made to feel less welcome or as incompetent as I was made to feel here. Add that to the numerous unsupervised and often dangerous climbing errors I saw around the room, and you have the many reasons why this is the worst gym I have ever been to. I guess my search continues for a new indoor rock climbing gym.", "date": "10/23/2012"}, {"review_id": "pxzFZS9r_D__MD51xu5RBA", "user_id": "LgOyR1NVG6b7MYaE6DFj_A", "user_name": "Megan H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I organized a team-building session for my company at Rockreation and it was excellent.  Linda was extremely helpful and had everything ready for us.  The team that facilitated our session was patient and helpful and made it really fun.  I highly recommend this for a fun and physical team building exercise.", "date": "7/7/2016"}, {"review_id": "NkohFRg1QdiBfxjABWK9Gw", "user_id": "J42g9ZquohAAjrGIe8l0yQ", "user_name": "Mia A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really fun and great place! The staff is very cool and down-to-earth! Please take the level 1 class before u start ANYTHING!!!The boulder is INTENSE! They also have yoga. Very cool place that allows for the ultimate body strentgthening work-out.On Belay!", "date": "8/25/2014"}, {"review_id": "_E9GV54y9NWWrU_0kW-xIw", "user_id": "b9Azt2DNyTP9QJZdRFs8jw", "user_name": "Douglas O.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 2, "funny": 1, "cool": 0, "text": "#Yelp #Yelp365 19 - Feet anyone? Yes, that is the overwhelming smell of this place. Our work took us here for a team building event. The staff was very friendly and we did several competitions across many different walls. They were all knew how to keep safety in mind while making the event enjoyable. Encouraging us to give a little bit more. Feet, yes, it stunk like sweaty feet on the mat and the gym equipment where people were working out, all barefoot.... a bit disgusting.", "date": "4/24/2011"}, {"review_id": "DaoL_mjgw4Ea5TaYIzeQyg", "user_id": "8L2pSfae8BIg5FhQHQxHDg", "user_name": "Margaret D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I love this gym! But you do need to be a friendly beginner or a regular climber at this spot. I've heard complaints from people who were to shy to ask for help so they had a bad time. Rockreation is more expensive than Hangar 18 but the lighting is better, the floors are softer, and the building is warmer.Families vs Single AdultsKids at Rockreation are not allowed in the bouldering area! Rockreation has great classes for kids with great teachers but they can only be on the ropes. I didn't understand why until I tried Hangar 18 in LB and spent most my time avoiding kids in the bouldering area. I'd be on a route and a kid would jump on the wall right next to me or UNDER ME. They don't understand routes so they were in the way a lot. But at Rockreation that's not a problem.Btw I've gotten a couple dates and numbers at Rockreation. It's a great place to meet cute people and make friends.Tip:Sign up for Rockreation's 3 Fighting Gravity classes for 99 bucks and you'll get a month a month's membership free and free equipment rentals. If you go climbing 3 times you've saved money and it's a great way to meet the staff and other climbers.", "date": "2/11/2013"}, {"review_id": "UtvLLetpCFHrqCuWzl5NIA", "user_id": "aU0tnhS4Yxy2L6J-UbL6rw", "user_name": "Minja M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 3, "funny": 4, "cool": 0, "text": "FIRST, the place smells...no, reeks!...like feet.  Sure, once you are there for a little while, your brain overrides your nose and you don't really smell it anymore.  But man oh man, it sure is stanky.SECOND, the customers (climbers) are all really nice and offer tips when they see you having issues.  Don't be a overly proud douche...take the tips and learn something.  Take a moment to watch some of these amazingly fit, good looking folks and absorb the skills.  If you have a question, just ask someone and you'll be surprised how helpful everyone can be.THIRD, the teachers have been very nice.  Taking the Flight Gravity class series is highly recommended as it will teach you things you will want to know asap rather than finally figuring it out after two or three months.FOURTH, the front desk people will ignore you if they are helping someone already.  Be patient and they will help you as soon as they completely finish with the person in front of you.  Then, they'll ignore the next person in line until they are done helping you.  It sucks when you are being ignored, but it's awesome when they help you until you are completely satisfied.FIFTH, this is a kid friendly gym.  If you don't like children then you'll have to go during school hours or avoid this place altogether.  Lots of hip dads bring their fearless tots here to climb and boulder.SIXTH, if you become a member, you get privileges at the other Rockreation Gyms.SEVENTH, climbing can be addictive and expensive.  It's like crack, except you remember what you did the night before. :)", "date": "10/15/2012"}, {"review_id": "Mc6WSbsFXxGtx_G1SRGyjg", "user_id": "8koKm5ZI2jlq4xueUOYAxw", "user_name": "Kalika S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 4, "funny": 3, "cool": 1, "text": "I walked in and they had Gungnam Style playing throughout the gym....Awesome :)  First time climbing today with a friend, we were welcomed by the desk staff that informed us that we could do what was called bouldering, which is climbing without ropes.  You mean I can't get up on the big walls?  We decided to check it out anyway, and after being helped with our shoes were given a quick tour of the gym and how everything was set up.  Everybody in the bouldering area was so nice and helped a couple of newbies out with climbing technique.  But what we didn't expect there to be so many good looking people there.  Like really.  You didn't see any of the gross creepos at regular gyms who seem to look a little to long and sweat a little too much.  On our way out we saw a yoga class going on that was apparently free to do which seems like a great deal but we were too tired.  Climbing is hard!!!  We'll definitely be back to take the class, I WANT TO GO ON THE BIG WALL!  If you hate working out and want an alternative to going to the gym, check this place out but try to get in a class first.", "date": "9/11/2012"}, {"review_id": "PSHuToWXbuiIZ3M9wUSw6w", "user_id": "DavUsq_COljMPIGnPXRYrg", "user_name": "Krista P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "When I first stepped foot into Rockreation it felt like home.  A warm fuzzy feeling like...I belong.  I was a beginner about 2 years ago and they made me feel like one of them.  It's a great group of people bursting with enthusiasm and willingness to help, assisting whenever I had a question or concern.   I currently have  a month membership after taking almost a year off. I found there have been a few changes, but good! They added automatic belays so if you don't have a climbing buddy, and don't want to Boulder, you can still Top Rope :)  I \"highly\" recommend this great climbing gym. They even have yoga on certain days!", "date": "11/9/2013"}, {"review_id": "DuMM0xDsJtA_shEbCNCI_w", "user_id": "q1D8PDH9SDZrrTCWECkA3g", "user_name": "Lindsey K.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "The skin on my hands is so sensitive...and my arms feel like jello....Earlier today, I had my first belaying lesson at Rockcreation. I got a deal via Groupon for $35 that got me a belaying lesson (2 hours) and 2 wks of unlimited climbing. You must reserve your spot for the belaying class, which I believe happens on Saturdays (noon-2pm) and Tuesday nights from (7-9pm.) I was in a class with a group of about 10 other people. Some of us were beginners and some of us had climbing experience before. You DO NOT need any experience of climbing whatsoever to take this class. Our instructors were Dennis and Jeremy. I've read some bad reviews of the staff/instructors, but my experience was pleasant. Both the front desk and our instructors were super helpful and friendly. In the belaying class, you learn everything from putting on your harness correctly, learning how to tie a perfect \"8\" knot, to being a responsible belayer. From there, you and your partner switch off climbing and practice communicating the climbing lingo, such as \"On belay/Belay on,\" \"Climbing/Climb on,\" \"Tension/Tension on, and \"Lowering/Lower on.\" This portion of the class takes a little over an hour.The remaining time, Jeremy took us over to the bouldering section of the room. This area is basically a free climb where you climb without any support, but there are crash pads you can use. He tells you the benefits of climbing this area (great body workout/more technique minded/group activity) and demonstrates how to climb the wall...which he does so freaking effortlessly. (I tried attempting this bouldering area with my toosh on the floor, which is how you're supposed to start, and I couldn't get myself up from the floor. Me = weakling.) This area was definitely more crowded than the regular rock walls, but I liked the idea of free climbing and something more challenging. There are sections to the bouldering wall that are easier than others. All in all, I was very pleased with my purchase and hope to come back soon. Toward the end of class, Jeremy went over the other classes we can sign up for and to come back quick to take the belaying test. (I guess every climber needs to pass this test?) Side notes:-The parking lot is limited for Rockreation members. However, there's PLENTY of street parking.-With the belaying class, shoes were provided.-One thing I wish the instructors would have gone over is the whole \"chalk\" thing. I assumed chalk helps with a climber's grip, but we were never told anything about it. Plus, I don't think they even have a \"chalk station\" for climbers. I saw most people bring their own bags of chalk.-The place doesn't smell all that bad, really. Some people have said it smells like a gym, but I only smelled it when we were sitting down. Wasn't sure if that smell was from the floor or my shoes...-They have a mini gym area you're free to use.", "date": "2/26/2011"}, {"review_id": "7opO65b7o5XkePd1L3vbVQ", "user_id": "AuwZrJRppYB4X4vMbUnwPQ", "user_name": "Brent P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've had nothing but good experiences at Rockreation.  The people who work there are very nice and knowledgeable.  I took an intro to rock climbing class there recently and learned a lot about belaying and safety.  The gym is under construction currently but I'm very excited to see it when it's finished.", "date": "8/19/2015"}, {"review_id": "qlBpOV-BzC9uD2DO3aEfmg", "user_id": "6YFQPimhc_rGQLvP3zOftw", "user_name": "Mabel C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Staff is friendly. Not the best rock climbing gym I've been to, a bit smaller. Needs ventilation or fans.", "date": "8/14/2015"}, {"review_id": "ijJ0QDnoibO7Wi9CulyGTQ", "user_id": "e965YVXvIEOMe2hV_nVssw", "user_name": "Annie N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Today was my first time at this gym and I had a fantastic time. Everyone was very nice and helpful. The employees all seemed to love their jobs and this make the experience for the patron very positive. Jeremy was my instructor and he was first rate. I would definately recommend Rockreation to others.", "date": "2/23/2013"}, {"review_id": "uMrpWR2fSkiu22TKR5xF7g", "user_id": "O2ij7rZPIWSkvsSXcRoQcA", "user_name": "Nousche M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 15, "funny": 13, "cool": 16, "text": "If this place wasn't far I would be hanging out here like all the time.OMG, what an awesome alternative method of a work out. I came here with my brother in law, since he wasn't smart enough to remember figure 8 tying we ended up doing just bouldering.This is obviously for people with good fitness and strong hands. And no I am not bragging about me being strong or fit (although I am), that's besides the point. You work all your body muscles to try to get as much higher as you can in the lower rocks. You definitely will need some chalk. You will feel the burn in your arms and your legs. But it's sooo good that you won't want to stop.You can practice well within 2 hours to get the trick of rock climbing. My next visit will be with the ropes and with someone who knows how to tie figure 8, just to complete my climbing experience :DThe staff is pretty friendly and helpful. You can always reserve a class to learn the basics of rock climbing. They have the shoe, chalk, rope rentals at front desk.Parking is great, either on the streets or in their lot.Have fun while rockreating.", "date": "2/28/2012"}, {"review_id": "XiwZieu_8-Zn0X2XVQQEwg", "user_id": "5LETXJylAtjbox_r1s8g8A", "user_name": "Derek R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "These guys ROCK! They showed me the ROPES, and I had a great time HANGING OUT. Seriously, though, best gym in town. Colin and Von are my favorite staffers!", "date": "10/24/2013"}, {"review_id": "SykFfceoXq_xSmUhyVjg3A", "user_id": "N1aRdDiHu_krLw6q9bMthA", "user_name": "Blake Z.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Coming from an avid rockreation-goer. This place would have 4 stars BUT, unfortunately they do not swap out their top-rope routes often enough. They finally switched some out this week but it must have been at least 6 months since the last time. And for a small rock gym, that just ain't cool. Other than that, love the laid back vibe and micro community of the place.", "date": "8/19/2015"}, {"review_id": "CRment9nQyxNysr3GN9w4Q", "user_id": "18LFQk6zThWMwYNDyP5bEA", "user_name": "Natasha C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm new to climbing and I felt totally welcomed and safe here. The staff is very friendly with lots of their own climbing experience. I bouldered for a while before taking a belay class. The boulders were challenging (especially because my upper arm strength is pitiful) but they had enough easy routes laid for me to get comfortable. The class itself was terrific. After two hours I learned how to tie myself in ropes, check my gear and my partner's and somehow defeat gravity! Really great, can't wait to come back. They also play excellent music.", "date": "8/14/2015"}, {"review_id": "f_M2Vz2nn5AmQRUVQasa6w", "user_id": "oSN3M4_WKdlTsnpgqPDiBg", "user_name": "Steph H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 3, "funny": 2, "cool": 3, "text": "Rockreation, even though you kicked my ass I'm still a fan. Met up with some avid climber friends who let this n00b hang (haha) out with them. For $24 (and a bunch of waiver-signing) I was outfitted with a harness and rental shoes and ready to climb! We started out with the easy stuff but as soon as I hit some 5.7-rated climbs things got considerably more challenging. That's the great thing about this place; there seems to be a climb for people of all abilities (there was even a kids' group in progress). When you're taking a breather you can check out all the really good climbers and get inspired. Climbers seem to be a very mellow, supportive breed, which is great. I spent a fun and exhausting 3.5 hours here, and looking forward to my next visit. And yeah, there is a bit of a funky odor in here, but it wasn't too bad.", "date": "1/12/2012"}, {"review_id": "YlXsIQ-qMmdN3jq8DS-aGg", "user_id": "F4G5mRY7peA3blbGWQkkuQ", "user_name": "Sean M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 5, "cool": 1, "text": "But sarge are we really going to crawl under barbed wire and climb ropes in combat.Dont question me son. This kind of training will save your life one day. Who knows where you'll be? Iraq. Somalia. Wall Street. Life isnt all soft cushioning and choices of easy or hard routes. What do you think it'll be like? Rockreation? Do you think there be friendly staff there when your boots hit the ground? Do you think there'll be classes for all levels when you arrive? Do you think there'll be a handy little fitness area so you can workout? Hell no! You'll be dodging bullets and praying for your momma. Now go get yourself a hot shower and get ready for your bed time story. On the double!!", "date": "1/9/2012"}, {"review_id": "vbzcQP0W0lQmsTR5c6-x_Q", "user_id": "Xtlfe74Uw0Q9iVDc0IMEWA", "user_name": "Tim C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went here for one of their beginner's classes and had a great time.  The instructors were very knowledgable and were really helpful (I had never been to a place like this before and had no idea what I was doing). It was really fun and I can't wait to go back!", "date": "4/21/2016"}, {"review_id": "Cdd_VbTkv4aEwfUKK2-SeQ", "user_id": "I26PLVBABlTcUJ8pq08p_g", "user_name": "Kevin P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "Glad they are here but the space is way too small - especially for Bouldering.  Way too crowded and then you have to put up with the \"professional climbers\" who think they own the place leaving everyone else waiting.I went twice - never again.", "date": "8/21/2014"}, {"review_id": "6fZnxiDYi1-nxMPtxjTWJg", "user_id": "nt1ILBATxQpSfdZ0EqHOmw", "user_name": "Jonathan G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 8, "funny": 2, "cool": 0, "text": "I was disappointed in this spot.  Having only taken an intro rock climbing class at another gym several years ago, I decided to take the FG1 (Fight Gravity 1) beginner class for $45.  It's a 2-hour session that focuses on tying yourself into the harness and on belaying, with a little bit of climbing.  You also get a one-week pass to use the facilities.  There were two teachers in a class of 8 people.  One of the teachers was very good: clear, patient, and funny.  But the other teacher did not belong in a beginner class--or maybe any class.  I heard him repeatedly say to (almost yell at) one student that her belaying was off.  He kept on saying something along the lines of: \"You just did this.  What happened?  Now you keep on messing up.\"  Keep in mind that the student had only learned belaying about 10 minutes before the teacher made this comment.  Another student had trouble tying a knot and when that student asked the instructor for help, the instructor replied, \"I've showed you how to do this a couple of times.  Now you need to figure it out yourself.\"   In short, this teacher in a beginner class was impatient to the point of rude. Hopefully that one instructor is not representative of Rockreation, but my first impression of Rockreation didn't encourage me to return.", "date": "8/21/2011"}, {"review_id": "gEvHCK6Son43u3kiNE6aeQ", "user_id": "F-cQX2rDEPiwzcDEJVxw1Q", "user_name": "Brian B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "i was a member here for 2 years when i lived in santa monica and didn't have a car. on the plus side: you can climb here, and climbing is super-fun.on the minus side: the walls are really small.  the routes tend to be set less well than other gyms I've visited. several members of the staff have been unpleasant to my friends and I (others are great and super nice). the gym is often very crowded.good if you're in the area, not worth making a big drive to this gym.", "date": "8/15/2014"}, {"review_id": "ZL8MFSJUe8ftnmhnlEel_g", "user_id": "hoPA4iBItEUMWUH7bIqrmA", "user_name": "Keisha A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 18, "funny": 21, "cool": 16, "text": "Hooray for indoor rockclimbing!  This was my first time rockclimbing and it was a fun experience.The facility was as warm as other reviewers mentioned, if I were a few decades older I'd be concerned that the change was finally a'comin', but a Gatorade from the vending machine cooled me down.  The majority of the facility is lined with huge rock walls, color coded with various suggested paths.  They switch up the routes from time-to-time to prevent regulars from getting bored.  If you're a newbie like me, you primarily focus on getting up the wall and not making the stupid mistake of looking down once you get to the top.  If you look down from the top, you'll probably scare the crap out of yourself and wonder, \"Why the eff am I doing this?!\"  A one-day pass is a great deal at $17, plus another $7 if you need to rent equipment (including a supercool harness that cannot possibly be  comfortable for men and might serve as a fabulous chastity belt).  The annual passes seem quite steep at upwards of $700, but what do I know?  They also offer classes (group and private) for those looking to get started rockclimbing.  This is a great workout!  My chest and back are more sore than they were when I tried force my boobs to grow in 5th grade (\"I must increase my bust!\").  People of all ages can get in on the rock fun as I saw little kids scaling the walls.  I was not about to be shown up by a 6- year old, so they provided fantastic motivation to get over myself and climb that rock.  There's also a bouldering cave with cushioned landing mats so you can practice traversing or play competitive climbing games with people far more experienced than you who scale walls like crack monkeys and smile like they've lived their lives amongst simians.  There were two members on staff at the front desk, one of whom was friendly, the other who seemed to have a permanent scowl on her face and I wouldn't be surprised if she *is* the Angry Little Asian Girl from the comic.  She knew her stuff though.Overall, it was a great experience and I look forward to going back.", "date": "5/3/2009"}, {"review_id": "1yPHViTdnMKsFgotHXtpcA", "user_id": "dKjaShY1xBzf6VEszco8tg", "user_name": "Sam I Am M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "What can I say about Rockreation...Staff- For the most part the staff are unfriendly.  They have a tendency to make you feel bad when you ask them for assistance.  As in, 'one of your holds just spun on me and it launched me off the wall, or the vending machine ate my cash\" which is met with indolent or irritable responses.  Finally, they make you feel like they are doing you a favor if they help you.Workout Equipment- Disgusting.  This is the first climbing gym that I joined that doesn't clean their equipment.  There is nothing to wipe it down after you use it.  Basically, every time you touch any of it, you are touching the sweat of every other person who used it in the past.  Since the staff (from appearance) do nothing all day, besides answering phones, or hanging out, this should be an easy fix.Taping- Taping, and now the new color coding system is completely confusing in the bouldering area.Routes- Very inconsistent in the grading.  Some of the V2s were actually harder than the V4s.  Also, they use the same type of holds in a lot of the bouldering problems.  Climbing a route that is all side pulls is annoying.Cleanliness-   I've had to throw 2 pairs of shoes away in last 7 months of climbing here due to fungus from the gym.  Side note, I have been climbing for 16 years and this has never happened before.  The men's bathroom is a whole new level of heinous.    The smell is beyond horrible and it is consistently dirty.  I also hear that women's bathroom is just as bad.Music- This might be my personal preference, but no human gets pumped up to climb with Fleetwood Mac playing.  They have 2 stations that they switch between.  Both of which are terrible. Age Limit- There is no age limit posted in the bouldering area.  When there is a kids party, which is Rockreation's bread and butter, children constantly end up in that area which is dangerous for them and the climbers.Buddy Passes- This is the first gym I have been a part of that doesn't do this.  From a pure business standpoint, why would you not want to up your membership base?Overall, this is the worst climbing gym I have ever belonged to.   It has actually made me start disliking climbing in general, which is something that I loved my whole life thus far.  Fortunately for them, as of now, they are the only game in town, so there is no urgency to fix anything.", "date": "3/21/2014"}, {"review_id": "7t60v7s8J8WWoJGjpDiYWA", "user_id": "e6JwKlb034zrychwH8bpeA", "user_name": "Kevin D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for a team party, and was impressed with how convenient the location was, how friendly the staff was, and how much space there was to climb. Not only were there walls to climb, but there was workout equipment too. I climbed and did pullups. Great place. Would definitely return and recommend it.", "date": "12/7/2014"}, {"review_id": "spmcgsGh34t9KQmA9aGQTA", "user_id": "d8HyVA1YhnfAI7AqK-71JA", "user_name": "Kate K.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I signed up for the Fight Gravity series of 3 classes and took them over 3 weeks (includes month membership and rental equipment)... and I have loved every visit so far! Jason and Steve were my instructors and they are both amazing. All the staff have been super friendly and helpful, and everyone there is really fun! So glad I found it, I'll be joining when my free month runs out, and signing up for more classes.", "date": "8/29/2014"}, {"review_id": "wEHVuhb9T0Um_fYSOTfEXw", "user_id": "OYsBSDUi2WpPD1gKEOL-gw", "user_name": "E A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "As an anniversary gift my boyfriend and I had our first indoor Rock Climbing lesson with Brian, we were in a small group, each taking turns to climb. Brian was great he was patient, friendly and warm. he didn't make me feel like he was watching the clock but like he truly enjoyed seeing us newbie's get excited. He would also guide you to try harder paths when he felt you were ready. I loved my experience so much I went back the next day to climb with Brian. There was a small error with my second day of climbing, the lady who swore up and down that she would put me in to climb again dropped the ball so the staff couldn't find me scheduled. I did appreciate the staff working together to fix the error so I could climb.", "date": "9/3/2014"}, {"review_id": "q9xh0vv41VvB7Jrz3fJzWw", "user_id": "2AkkjZ-NM6LfelvpEQ1D5Q", "user_name": "Alice P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "The staff was friendly but I had trouble figuring the place out, a little frustrating and I ended up getting bored. I tried to stay only long enough to feel like I got my monies worth.", "date": "1/24/2015"}, {"review_id": "Rm4AEilB1uU1AmzrglZwgw", "user_id": "qIECCqeEZQXre0mYvZU_pA", "user_name": "Lee D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 8, "funny": 7, "cool": 8, "text": "It's like picking at a scab, you know you shouldn't but you can't help yourself. I did it, I looked down when everyone said not to and surprisingly I didn't soil myself.  What a rush.  I could feel my heart sinking to my feet.  It's like when you're on a roller coaster that's slowly creeping towards the top of the drop and the next thing you know, all the blood rushes to your face and you feel like you're going to need to be resuscitated when it stops. I am by no means an extreme sports enthusiast, but I love trying new things. Rock climbing indoors?  Yes! Rock climbing in the Swiss Alps with a rope and mountain goat?  I'll pass.Needless to say, I only stuck to the easy walls.Not to bad if you're looking for something new to try.  I suggest coming with a friend that knows what they're doing so that they can get you all hooked up and be your anchor. Best part, getting to the top! and letting yourself drop!Scary at first, but fun once you get past the initial heart attack. The prices are listed on the site, newbies will run approx. $25.That's all day in and out entrance and gear.", "date": "5/15/2009"}, {"review_id": "uJ83ZH9O_Ytin45MHsqtFA", "user_id": "h66p3_jkuBUbTUrCTbLh2A", "user_name": "David D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I took a group of students there last week from my church. The staff was really friendly and the instructors were great.Highly recommend.", "date": "5/28/2014"}, {"review_id": "baBV1zPr_TUI7aURociotw", "user_id": "Pe4zrsIFbsp11IRuDHHzJg", "user_name": "Alex G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 9, "funny": 1, "cool": 0, "text": "I climb 3 - 4 days a week for the last 5 years. I have been to gyms all over the US, AU and the EU, and this is the worst gym I have been to. I go to this gym sometimes because it convenient. Not because it's good.This gym needs a major overhaul. They need to take better care of the equipment and facility and put some money into fixing it up.  Take some pride in this place. Set better routes. THIS GYM COULD BE SOOO MUCH BETTER.The Pros -They have cardio and work out eq and weights -They set new routes often-The Color code system for rating for bouldering is nice -Sport climbing roof is fun and sometimes well set (about 1/3 of them are good)Cons -This gym is very dirty -Walls are messy with old tape and tape residue still stuck to them (makes routes had to find and fallow  -Routes not maintained hard to fallow, hard to tell where routs begin and end  -Holds are greasy, old and beat up -Routes not well set (seems like setters don't care)- Routes are cluttered together. -Rating system totally out of wack (V5 that is really V2 and 5.8 that are 10B)- Cardio, workout eq and weights old and beat up. Also dirty -Top rope routes are really poorly set, not well maintained at all and with old holds (prob the worst part of the gym). -Overcrowded (feels unsafe with people not paying attention and walking under me while I'm bouldering -Music sucks", "date": "5/30/2013"}, {"review_id": "yGueyFR0Xr1M6G0drNk0YA", "user_id": "Px_aOjsH3ocELCqLdY9Ijw", "user_name": "Kealie G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 4, "funny": 0, "cool": 0, "text": "I may be spoiled by some other, and much larger climbing gyms, but this one didn't quite cut it for me. The staff are really nice, but I'm just not a big fan of the routes. Most of them required quite a bit of upper body strength and not a lot of technique. Perhaps I wasn't doing them correct. I'm not expert and only climb 5.10b, but I had problems with their style of routes. They also use colored rocks instead of just tape and it makes it hard to discern what is on. They have a decent bit of wall space but a large chunk of it is dedicated to lead only with no top ropes and I hardly see anyone use them. They could put ropes on a couple of the lead walls, but they don't. Not sure why, maybe an insurance reason or something. Their best attribute is their bouldering routes. Pretty decent beginning routes and they get hard pretty quick for good climbers. It was a decent place to climb for a summer, but I would get sad if it was the only gym around.", "date": "8/13/2011"}, {"review_id": "35l1kh9QAfCrmJ0FVyAi8g", "user_id": "EvYvNH1pZmsGkfSG5-G_Tg", "user_name": "Byron A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "I've been to Rockreation 3 times and I've gotta say that it's pretty awesome. I was pretty impressed the first time I went with how many people there were especially since it was on a Friday night. The 3 times I've been there you start recognizing people and scoping out the regulars. This is a great place to take your first steps at any sort of climbing. Lots of fun and way safer than going outdoors somewhere like Stoney Point.", "date": "9/20/2011"}, {"review_id": "HTr6cBxJYwKiTRVcz4jHSg", "user_id": "Z5_KJ2U86Xe1YyckqhgOdg", "user_name": "Emilio M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Came here to celebrate a kids birthday party. Even though the facility was bit crowded, it still managed to pull off a fun and safe event for 10 eight year olds. Staff was very patient and were capable of explaining the rules and safety tips as well. Sure Id come back and give it a go again.", "date": "2/21/2012"}, {"review_id": "L4NVK8L3wTO1I8Va1cFkmA", "user_id": "PTnFflE5f19ih5D6Ukxhaw", "user_name": "Samantha S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Wow the classes are awesome and the staff is super cool! I'm in mega like! :D", "date": "8/16/2014"}, {"review_id": "1Vylh77VQUkoIlGwfekbkA", "user_id": "6rNzkNYzwVlhw5UdQVk_Ow", "user_name": "Margie O.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 8, "funny": 5, "cool": 1, "text": "I have to begin by saying I didn't climb here. I had every intention of doing so and got suited up and headed in to arrive as it opened on a Saturday. I had been warned that it \"smelled like a gym\". I was okay with a gym smelling like a gym, but there was no way to prepare me for this. The scent was so strong that the moment I walked in, I began dry-heaving. I had to explain to my husband that I couldn't stay and I ran out. I continued to convulse all the way to the car. This place is disgusting and for what it charges, I am shocked that they don't spend some money on odor maintenance. I wouldn't go here if I could stand a smell so bad, bc I think its a slap in the face to allow this when they charge as much as they do.", "date": "3/10/2013"}, {"review_id": "2xG8GKm_ZkZMEVSS5kfr_g", "user_id": "08adX_VUy3C4jb5WqzrkGg", "user_name": "Christian R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Well I walked in wanting to get some info and the guy at the front desk was soo uninviting and looked bored. You would think because he seemed bored that he would of wanted to show my friend and i around the facility. We just filled out a liability form and the guy at the front was pretty much like your on your own.  After we wandered around we came back to the front desk and asked a couple question, but it seemed like the guy just wanted us to leave. We asked a couple questions and it seemed as if the guy expected us to know the answers. Anyhow the place seems cool, but I hope they are aware of the lack of customer service thats at the front desk. I highly recommend you get someone who is friendly and actually intrigues someone into coming back.", "date": "9/19/2013"}, {"review_id": "kPBNAQ_WHCqCh7eElgXlKA", "user_id": "m35yX3Swga3-KbvM81U82g", "user_name": "Jessica B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The only rock gym I've ever been to so take this review with that in mind.Routes are good with frequent changes, decent size bouldering area and lots of lead climbing (maybe too much). They offer yoga and often have a lot of kids parties which take up space and routes. Also, it smells a lot lilke feet in there.... but after a few minutes you become used to it. Staff are friendly enough but don't seem super stoked to be there. I'll continue to patron but would be open to trying another gym if there were one closer to me.", "date": "5/24/2012"}, {"review_id": "AMsALOROgZkZUC_PQMSukg", "user_id": "PEwM4-M_vZ5872US8Ytbcg", "user_name": "Matt A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 7, "funny": 1, "cool": 0, "text": "They do things different from any other rock gym and expect you know their system without wanting to show you. There business model is not condusive to first timers. They deny it, but they are probably at capacity most of the time and don't need new business. Fortunately a new gym will open in March downtown - hopefully not the same owners.", "date": "1/26/2013"}, {"review_id": "wfajxlq9HSKu7RE1qo8aUw", "user_id": "F7vgCzNV-cSGvTn4szQDuQ", "user_name": "Sam Y.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Rock climbing is my new thing. Love it. I would say I am an advanced novice. Meaning if you never rock climbed before, I would look really good. To someone who climbs well, I look mediocre. This is the only one remotely close to me, the only one in LA actually so you don't have much to compare it to. Its a blend of physical and mental. So if it's the only one around, by default it should be 5 stars? Well the rock climbing itself is like a 5 star activity. It's 4 though just because a lot of other rock walls are 15 bucks a day, this one is 17. But it's LA. I can see that. But they charge you 3 bucks for chalk for nonmembers when you can buy a brick of chalk for a dollar. So it makes climbing all the time rough. And it's too far to get a membership. I live in Hollywood and this is next to Santa Monica. Its a blend of physical and mental. Prepare to create a smarter mind and body.", "date": "10/11/2011"}, {"review_id": "hA-Lz8gqIl7O2aQ_uw_NuQ", "user_id": "khQp98yFFOvRrwaepPW8pA", "user_name": "Zoe O.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love this climbing gym! The staff is so friendly - Erin, David, Colin, Von, Eric, and the climbing instructors are great and incredibly helpful (Tracy and Jeremy). They even have a great yoga class Wednesday night with Jason. Whether you are a beginning or expert everyone is very welcoming and happy to help.", "date": "12/6/2013"}, {"review_id": "NTwf6k1WEUcm3uyIncQQ2Q", "user_id": "exWfJBRKvl5dyBpDnRC6FA", "user_name": "Christina L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I purchased the Flight Gravity series (FG 1, 2 & 3) back in 2006 but never returned for FG3. After coming across a Groupon, My friends & I started the FG series during the fall of 2010. FG1 covers the basics--safety, how to tie ropes, & how to belay. Make sure you pass your belay check before FG2, where you begin to learn the name of each of the rocks (ex. slopers, crimps, pockets) & you start to learn technique. Make sure you do a good deal of climbing before FG3. The gyms are empty on Mondays & Fridays since most of the gym patrons climb outdoors. On Wednesdays, the gym offers from yoga. Once a month, there is a Free Guest Night, where members can bring their friends. Most Saturdays you will likely encounter children's birthday parties. Despite the limited parking spaces available in the plaza, I've never had a difficult time finding a spot on La Grange. Once you enter, you will find the top-rope area and the gym area (which is limited with elliptical & biking machines as well as weights) to your left. Once you continue, you will see an area for experienced climbers followed by the ever-popular bouldering area (they change the routes regularly), equipped with plenty of mats. Once you pass the restrooms, you will reach the back of the gym, which houses the traverse walls.Despite finding slightly more competitive rates at the Southbay's Hangar 18, my friends & I signed up for membership at Rockreation because we prefer the gym and all it has to offers.", "date": "3/26/2011"}, {"review_id": "GVxmM9kz1By7z_qOg21n2A", "user_id": "sugA1tq1RD1hflVQZvesIg", "user_name": "Enrique G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Rockreation is one of the most excellent facilities for rock climbing. Especially for a rookie climber like myself. When I first signed up for the beginner class on belay, I thought to myself, \"how hard can it be, its no different than climbing a tree as a kid.\" Little did I know the walls at this place are enormous. They have rock climbing walls all over the place; side ways, low, on the ceiling. Yeah it was a bit intimidating watching some of these advance climbers dangle from the ceiling like in the movie \"Cliff Hanger.\"The deals here are decent including the rentals. One of the hardest parts of the class had to be learning all the terminology. Seriously when you are holding your entire body by your finger tips there is no way in the world you remember the phrases.But what most I got out of the class was strategy part, as physical as it appears, you also use your brain to plan out the climb. I can see why everyone here is fit, after the first class you feel the burn all over. Great class, cool peeps and fantastic facility. Also made some new friends here which turned out to be as adventurous as I like to be someday. When I grow up I hope to be like the big kids dangling from the ceiling.", "date": "1/15/2012"}, {"review_id": "agzLslRqJeEv5_TIi6Jn7g", "user_id": "qk85kXbav3FYFz6_Nf6HpA", "user_name": "Brian J.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "so thankful this place exists, its my little sanctuary. just dont expect everyone to be your friend, there are  some untamed egos . as a general rule of thumb, the harder they climb, the nicer they aint    ;)    but it's easy to find your own little corner to have a good time.", "date": "10/25/2015"}, {"review_id": "_uQKGV43ppZvlS8rO1V2yw", "user_id": "rtJvtO-TqmighZ_uDez17A", "user_name": "Mario C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I really liked this place. It wasn't too crowded and the people are friendly. Definitely coming back", "date": "10/27/2013"}, {"review_id": "N9vgLdT4Pgo0PDA8c0cnGA", "user_id": "GujGeNalHiM8VyWhAXqsPQ", "user_name": "Briii T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Had an OK time when I came.  I was a noob and was really excited to learn to rockclimb.  I had a friend who already knew how to belay so we didn't really need the class.  Paid $24 for a day pass that included shoes and the harness. When I was signing up, the guy at the front desk was a huge douche.  I wish I got his name because he was on a gigantic ego boost when I told him this was my first time.  He was very belittling and made me feel kind of uncomfortable.  He needs to take a class in Customer Service 101.  Won't be back because of him.  Thanks dude. The place was bigger than I expected it to be.  My friends and I had a good time bouldering. The regulars there were pretty easy going.  Have to park on the streets because the parking lot is private.Don't worry, there was a lot of street parking. I'll try the Costa Mesa one next time.", "date": "4/2/2011"}, {"review_id": "630FF1JFHEO63hwdJtwPjA", "user_id": "bFAgd4pK8pFsnOiABoVb8g", "user_name": "Sean F.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Hah! Coming from someone who didnt know a thing about rock climbing, I had a lot of fun here bouldering. Was my first time, rented some gear and had at it. They also have classes for belaying in case you want to experience more in depth climbing. I don't like really high heights so I stuck with bouldering, but that alone is really fun, i'll be coming back.", "date": "8/29/2011"}, {"review_id": "MAxQRVJGxq_xspeSD0PEFQ", "user_id": "g2kIR4c_QE1q6htYVMxdfQ", "user_name": "Travis B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "An Amazing girl brought me to this place! Pricey, but take a class and get free visits. Far better than going to a traditional gym if you just want to stay in shape. The people here are really great.Also you have to love a gym in LA that plays great music.", "date": "12/27/2011"}, {"review_id": "T7S9UgGU2OhbZOZoq854pg", "user_id": "47d25fl0YAu7H7dlqyIi8g", "user_name": "N P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My 5 year old daughter has been begging to try rock climbing after seeing her uncle do it up in San Francisco.  I called the gym and they set us up with a two hour private with Cameron.  Cameron met us at the front desk and immediately engaged my daughter.  We put on our rental shoes and harnesses and went climbing.  I was not really expecting to be an active participant but Cameron nudged me along.   Not sure who had the better time, me or my daughter!!!We learned so much in two hours about routes, traversing, how best to utilize muscle groups and the technical jargon.  We will certainly come back although I could barely cook dinner that night, I was so sore!!! Thank you!", "date": "2/26/2012"}, {"review_id": "UKVfPCWHJA9due5fChavIg", "user_id": "GiPvassloy1k7MWW7T3wGQ", "user_name": "Evan G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "A week in LA was made that much better thanks to Rockreation.  Unlike my local climbing gym, they actually open early (Tues, Thurs, and Sat), and I loved getting some bouldering in before the work day (or before kicking off the weekend!)Staff I encountered was great, really helpful in helping you get the lay of the land, and those I saw giving instruction knew their stuff.  And the guy who was setting routes in the bouldering area knew his sh*t.I can only really speak to the bouldering area, which offered PLENTY of challenging routes, even for experienced folks, and I love the \"one-armed hallway\" behind the bouldering area, which I'm sure is amazing for technique building.  (I was too chicken to try it out.)The $17 day pass felt a little steep, but it was worth every single penny.  The lead climbing routes are a little bit short (this place is in a small office park, so the real estate is a bit limiting.  Oh, by the way, they have regular gym equipment, too, so you can work on muscle groups or do cardio to warm up/warm down/target/whatevs.And only park in the Rockreation spaces in the lot.  Otherwise, the parking gods will not smile upon thee.", "date": "3/28/2011"}, {"review_id": "q8nfad2devA4Kd7S1VELiA", "user_id": "BMEmpeosi4LfwRlAMgtjbg", "user_name": "Stephanie S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 15, "funny": 2, "cool": 2, "text": "I have to agree with James P. here. Service is weak. Really weak. They make you feel like a total interloper. Like going rock climbing is not esoteric enough that you already feel awkward when you don't know what you are doing. They won't let you use grigri belay devices (not even your own) which is quite unusual I'm told from a friend who used to compete. They're also pretty pricey ($24 for a day pass versus $16 at Hangar 18). There's zero parking (by zero I mean two spots) because the gym is in the middle of an office plaza. Overall, not the place to go.", "date": "3/13/2010"}, {"review_id": "KEILZbFrAAHuYrO4b9vJsg", "user_id": "F0ZYoC3hm3XspMEb0NeiUA", "user_name": "Erin T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I started climbing at Rockreation about 5 months ago with a class I got through a deal on Zozi.  The first class (fighting gravity 1) was pretty basic, just belay skills and simple climbing.  I enjoyed it enough though that I was easily talked into buying the FG2 and 3 classes as well (at a discounted rate).  The classes were great and taught a lot of technique, focusing mostly on traversing and bouldering.  Once I completed the classes, I was hooked and have been there at least one a week since.  The other climbers in the bouldering area area super friendly and always willing to help you figure out a tough route.  The staff are friendly and helpful as well.  My only complaint is that it is pretty expensive.  $17 for a day pass and at least $60 a month for membership.  I always have a hard time justifying the expense, but I keep coming back because I love climbing so much.  Hopefully I will get to climbing outdoors one of these days.", "date": "7/3/2011"}, {"review_id": "TWfz16VM1d3RknNGkNL4ow", "user_id": "NcdvdM5d-Xejg8U40CZAMw", "user_name": "Gracey L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Irks me when people can have such strong opinions on a place based on HALF of a real visit. Your 20 second experience with a grumpy employee [who has to deal with you whiners every day] doesn't break this gym.PARKING: Limited reserved spots in the lot, like 6 or 8. But PLENTY of free residential spots all over. So quit QQing.STAFF: Almost all of them are pleasant, helpful, funny, and REAL climbers.REGULARS: I heart, because while climbing [bouldering] can be a real independent sport, it's awesome sharing with fellow enthusiasts [beginner or otherwise] who are willing to yell out encouragement, offer pointers, ask questions, be your friend for the day.ROUTES: Up just long enough for me to take a stab at most of the ones I want to try whilst not get incredibly bored. They'll even let you set if you've got something good in mind. Only real complaint is that sometimes [most... of the time! hehe] the ratings aren't super consistent, but that's fine.AROMA: Yes it smells. Yes it's a gym. Get over it.", "date": "12/31/2010"}, {"review_id": "xcWOc6dv9Xu3hcuDqPYXbQ", "user_id": "7wtCo5tMXk6nw5Glopb-Sg", "user_name": "mike C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The smell of feet greeting you at the door can be intoxicating but once you get used to it , it and awesome spot.investment in an air filtration system and a heater could make the place a little better.", "date": "12/10/2013"}, {"review_id": "oEEBrk4sf_uECYX_OQoSKQ", "user_id": "svTjpZOojJSZjlSkfSPeIA", "user_name": "T ?.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 1, "funny": 0, "cool": 3, "text": "Staff are friendly, but their bouldering and lead climbing sections are small.  It's definitely a place for top-rope climbers and newbies.", "date": "10/29/2014"}, {"review_id": "pmJI9InmUCdAZOq6v7ETWw", "user_id": "bVJXdVoo3l12lr4mPKxvIA", "user_name": "Min C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm compelled to write this mostly because of how great the staff is. They are friendly, accommodating, and make sure that everyone is safe and having a good time.  I've taken a couple of classes there and the instructors are skilled, knowledgable and look after everyone's needs.  My only gripe is that some of the routes are a bit non-sensical in how they're arranged and graded. But there are plenty to choose from. The renovations that are under way are going to make the place even better. The new bathrooms have lockers and are really nice.", "date": "6/7/2015"}, {"review_id": "mcII09BaHedHlaQB0BlAxQ", "user_id": "Pnr6ELDk15yZPqouTWg1eA", "user_name": "dave b.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Decent gym. Nice selection of boulder problems and auto belay is nice if climbing solo. Weight area is a bit haphazard, but looks like they're doing renovations. Only complaint is most handholds are pretty grimy. I'm used to climbing at a gym where they clean them everyone once in a while. Some were so chalky and shoe marked it was hard to tell what color they are.", "date": "6/27/2015"}, {"review_id": "MhtvI5ynZlIwUq_QdXyWmw", "user_id": "4RKq0POQ5jpToRkiiUvJLg", "user_name": "Sherry T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "Rockreation is a great workout for your core and leg muscles. I took the intro class for rock climbing & boulder climbing last night, and it was very fun and insightful. Our two instructors, Tery and Jeremy were awesome. Will definately come back for the 2nd class, which is apprerantly more based on technique and strength training. They even have yoga classes on wednesday nights! Yaayyy for fun work-outs!", "date": "10/6/2010"}, {"review_id": "D6UzmYD8IX_fsxnG1IoZng", "user_id": "HTyFnJNn_bWlzDlWdk3Gig", "user_name": "Jason P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is great, the climbing routes are challenging, and I always enjoy my time here. It can get fairly crowded, however, and it would be awesome if they had a wall/ceiling that opened up to let some fresh air in. Regardless, this place has become rather addicting!", "date": "5/16/2013"}, {"review_id": "bdcIx3PJOl84N9wAR3kOTQ", "user_id": "0FwLLkgyaM4SPm5aeUXweQ", "user_name": "Jonathan M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 7, "funny": 5, "cool": 1, "text": "It would be fair to say that rock climbing is one of the best total body workouts you can get. I'm usually extremely tired after 30 minutes of climbing (I'm fairly active/in-shape, but have horrible climbing technique). This place has plenty of space for the novice or the avid climber. Unfortunately, it definitely smells like stinky socks. But that's hard to fix because the foam flooring and bolted rocks are all subject to the intense odors of the climbers, hands and bodies glistening with sweat as they attempt to make it to the next rock (sounds sexy? cuz it is).I've been to rockreation many times as a recreational climber, and as part of a corporate outing. I'd say the day pass is pretty pricey for a one time thing ($22 a day including shoe rental). Spend most of the time bouldering (climbing without a belay). Many of the people that go here are very nice and social, willing to help out others that don't have the proper technique to get to the top. But there are also some climbing snobs, that like to show off how good they are at climbing, or attempt to show off to the hot girl that is waiting to go next. That's fine and all, but the grunting noises can be ... weird.As a corporate event, this is a great place to take the company for team building exercises. They really have some great games that challenge the team both mentally and physically. AND it doesn't smell as bad when there aren't another 80 people in the gym with you.Staff is always very friendly, but the rental shoes are not.", "date": "11/19/2009"}, {"review_id": "X9Ku43F5UEGcAsH6aDHk4Q", "user_id": "q6nmI5W4rSgO3OT1pAXlLA", "user_name": "Chris R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 5, "funny": 2, "cool": 0, "text": "This is the only rock climbing gym in the westside, and they sure know it.  While they've fixed the frayed top ropes and loose bolts in the walls, it still has a lot of improvement to go.  Some of my complaints, in no particular order:-About a third of the staff are rude and condescending; I've been to several gyms, having regularly rock climbed for about the last 7 years, and this place has some of the worst attitude I've experienced.  We were literally yelled at by one staff member, Steve, during the belay test he administered.  While most aren't as bad, the vibes tend to be pretty unwelcoming much of the time.-Do you like kids running underneath you unsupervised while you climb?  No?  Don't worry, the staff don't especially care.  Safety here tends to be kind of a joke, and they do little to enforce it. -How about hearing the piercing shrills of one staff member attempting to harness a circle of unruly kids? Not particularly fun/relaxing/enjoyable to climb next to.-The men's bathroom smells pretty awful, and is in pretty sorry shape.-For some reason the A/C is rarely used during hot summer days.  Another guy who used to climb here would drive from Glendale; he stopped showing up, but I happened to run into him at another gym where he now climbs, where he explained why: after driving so long to get here, and once again stepping into the place at 80dF, along with all the above problems, he finally snapped, turning around right then and quitting.-The yoga class is a joke, and there's not actually room to have the class.-Prepare to get shit for bringing in people on their guest day.  I've never gotten static before for bringing a friend in at 530pm, because apparently 6pm is when guest day starts.  In contrast, the majority of other gyms will give you a pass to use whichever day you like.Bottom line, if you live in the westside, and prioritize convenience and distance in gyms, then this is the spot. Otherwise, there is plenty better out there.", "date": "1/3/2014"}, {"review_id": "ueFPT2FaeMT025HP8eIUFQ", "user_id": "6n5KGsZXXBpqiAy7cCcqGw", "user_name": "Wei-Li S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Being the only climbing gym in WLA, it's very pricey.  The routes are fine and they are changed on a somewhat regular basis (about once per month, sometimes longer). There is a good variety of routes (bouldering, top rope, and lead) with a wide range of ratings to keep everyone happy.  It's usually packed on weeknights and that can get really annoying.  Try to go during the day (mid-morning or mid-afternoon) if you can when it's much quieter.", "date": "1/21/2013"}, {"review_id": "cpkZhNrtIJVK82ePWQvPdw", "user_id": "fEoBk3QxwDp38drtjndYhA", "user_name": "marlon e.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 5, "funny": 4, "cool": 7, "text": "As I walked it I smell socks, stinky socks. I think this place needs better ventilation. And when it comes to the walls since i'm not the expert to this matter some are freaking hard! Since this time i'm not using any harness and we're just bouldering all over the place.  I must say from the sport that I do which is paddling where we use more core muscles than arms, where i learned not to grip too hard and where I don't use too much forearm, wall climbing is a bit of a challenge for me... actually its HARD especially doing boulders. I did the one with the harness before its a piece of cake but this one is harder and you can be creative. Actually i like it i'm planning to buy my own gear now and get a membership from another gym cause this one is so far from my house! Will i be back? Maybe maybe not... who knows...", "date": "9/18/2009"}, {"review_id": "GuvZWIbYV5oZkPL7wSPshA", "user_id": "-4viTt9UC44lWCFJwleMNQ", "user_name": "Ben J.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 6, "funny": 7, "cool": 7, "text": "Ever seen popeye?michaelspornanimation.co…Yep that's me, that's what I look like after an hour bouldering.  My arms get swollen from tension, my veins come out, my legs look ripped, and my abs are a wall of stone.  Rockreation kicks my butt every time I go, if my body could take the abuse of going every day I would.  If you're looking for a new activity that will get you lean, toned, and build muscle nothing can beat climbing!", "date": "8/5/2009"}, {"review_id": "_tRFySb5fC9sk3NkT8EMbg", "user_id": "IdRUjneeLykImpB2-u4zHg", "user_name": "Aaron S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I wanted to be sure to mention how great our instructors were. Dave and Mark were both very attentive, informative, and obviously passionate about climbing. I would recommend their instruction to anyone who was interested in starting climbing.The gym is great for us because we work evenings and have free reign of the gym during the daytime. The kids' classes are well-publicized, so you can avoid them if you want. Pricing is what keeps me from giving the 5th star. You're definitely paying for the privilege of having a rock gym so close, because it falls short of competing gyms on every aspect of pricing: start up fees, higher monthly, rental fees, etc.I've definitely enjoyed my month of climbing at Rockcreation, and the only reason I'm hesitating to enroll as a member is price.", "date": "8/2/2010"}, {"review_id": "ayS-HGU3zCjXiYIHDfLR-g", "user_id": "8Op1W1dkokWoqaHynq2Ipw", "user_name": "Meredith W.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went here on a Sunday evening as part of a team-building/development exercise and we had a blast.  The belayers were fantastic and talked us through different routes as many of us had never climbed before. There is definitely something for everyone here.  We felt totally safe and had an amazing two hours.  Thank you Rockreation!!!", "date": "3/30/2015"}, {"review_id": "xb25Ya-pS3QnLrHXwZ6nwg", "user_id": "uVZTAn0NfW1T7JTZm5h9kA", "user_name": "elizabeth c.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 12, "funny": 6, "cool": 5, "text": "I must say, I've gotten spoiled by Pipeworks up in Sacramento.  I came to RR and was expecting a lot more than what I got, especially considering the much, much higher admission fees.I wanted to keep up my climbing skills while I was down here (I'm usually only down on the weekends because of work) so I decided to pop by for a quick session with a friend.First, it's hard to drop by Rockreation if you don't know how to climb.  They'll make you sign up for a class. When they belay test you, they make you tie in and go up the wall, telling you to fall at some point.  You better trust your belayer knows what he or she is doing, baby, cause otherwise, you've just signed your life away and all the attendant will do is point at you while you lie all broken on their spring floor and laugh.I'm a small person.  My friend, L, is by no means a big person, but he's probably twice as big as me.  The top ropes are not on a pulley system, so they require a lot more muscle to belay.  Poor L got the scare of his life when he was testing and fell, cause I went flying up off my feet, into the air, and smashed into the wall, where I braced myself with my feet to catch him.  The effin attendant just said, \"I knew that would happen,\" and went laughing off to perpetrate mayhem elseware.So now we're in and we can climb.  I understand that space is more expensive in LA, but its hard to have to pay way, way more than what I pay in Sac to climb at a gym that I feel is less impressive.  The routes are much shorter, perhaps only 25 feet, compared to the 40 I'm used too.  The bouldering area was smaller as well.I didn't realize how nice it was for Pipeworks to carefully delineate all the routes for us climbers with different colored masking tape.  Rockreation has their routes marked at the bottom with a card saying the color of the hold.  However, a lot of the holds are covered in chalk, so you spend a lot of time going, \"Do you think thats my hold?  I can't tell if its black or blue or just grayish.\"Since there are so few indoor climbing options in LA, this place will do in a pinch, but all you climbers out there, come visit me in Sac during the week, and we'll get some true Spidey action going!******************Once again, I apologize to L for making his life flash before his eyes.", "date": "8/15/2007"}, {"review_id": "X6y7Qx3JqP4a55chYZuhBQ", "user_id": "aZtX3NethA-CovPXH0tKyA", "user_name": "Jenny B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 9, "funny": 5, "cool": 4, "text": "I can't compare any facility with this yet, as this was my first time rockclimbing and yay, I did it!!! All this time I thought I could lift my butt up higher than 3 feet, I was wrong!!!I was tardy, came 15minutes later than the scheduled time, but there wasn't much crowd yet, 2 staff in the front welcoming me. 1 was a friendly guy and the other one never smiled and started asking questions right away, \" are you here with a group? what are you guys?\". I'm like pointing out to Matt who's talking and helping someone who's about to start climbing and said, \"yes, with them, we're yelpers.\" Wow, even after that answer, she was smirking, maybe that day wasn't her glorious day to show any smile, pshhh! Anyway, the admission is $17 for the whole day, which means, you can get lunch and come back for that same amount if you have so much strength in your body and $7 for the equipment, shoes and straps. Parking is not hard during weekend, but I could imagine weekdays. I'm glad the floor was those soft mat, which is a little bouncy so if you fell from like 8 feet, which I did, didn't hurt you at all. They also provided a slightly thicker mattress pad, but it's a little small, so everywhere you want to try new wall, you have to keep dragging it to the spot you're trying it on. This facility structure doesn't look like a rockclimbing place from the outside, cause it's joined together with like a business park complex, so it's more of those creative design space area and it's quite well hidden, unless you know the area, I don't think newcomers would notice there's rockclimbing facility inside an office building, ya know what I mean?!All in all, I'm glad I did this cause now I know I actually could do rockclimbing! For me, there's plenty of rooms to try new things, but never come later than like 12.30ish, cause by 2 when we left the place, it was much crowdier than we came.", "date": "5/6/2009"}, {"review_id": "lQzQuO5HqTmhpV90MIbdkw", "user_id": "PuRGm01YPZXn-NIa2nxqkA", "user_name": "Michael S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 8, "funny": 1, "cool": 5, "text": "I've been a fair number of gyms around the country, and this one falls right in the middle of the pack, which unfortunately is doing pretty good for SoCal.  I really wish this was the gym close to me, rather than the Arc in Arcadia.  Rather than a long blah review, here are the listsPros:- They have an ok amount of roped climbing and the routes are decent, though not super interesting- The walls are faux-rock and offer a good bit of friction for when you don't have a foothold.- Decent amount of bouldering space with plenty of past vertical areas and tons of marked problems- Relatively new regular exercise equipment and a fair selection of weights.- Staff was friendly and laid-back- Lots of lead-able climbsCONS:- Walls are short, though they are the exact same height as the gym I climbed at for years in NC- I've seen bigger gyms- EXPENSIVE - seriously $17 a peep, gimme a break- Parking blows, only a few private lot spaces, and then streetAll this said, I haven't been climbing enough recently and, on  a weekend where I don't got outside, I'd happily drive here rather than go to the bore-fest that is the ARC.", "date": "8/21/2007"}, {"review_id": "A8WrwyGq7oLHLocMp0ypVw", "user_id": "_Ps-chEmA737nwIM6_va7Q", "user_name": "arianne b.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I love this indoor wall climbing gym. The staff are friendly and the instructors were great. You will learn essential skills how to handle the rope (belay) and of course how to climb a wall. This gym definitely will help you prefer for the outdoor one.On the downside, this gym can be so crowded that you would have to wait on your turn and parking is another issue.", "date": "10/20/2010"}, {"review_id": "v_9UGWcn7lA0sKNQ8ymIPw", "user_id": "ceYHPujxIH31VHF35QP72g", "user_name": "Vitaliy M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The route quality is outstanding -- and it's all thanks to the current crew of setters ran by Erin (HME).  Steve (SG) is the stand-up guy who opens the gym early in the morning on Tuesdays and Thursdays.  If you come here often you'll meet motivated and fun people that all share the same passion for climbing!", "date": "2/11/2013"}, {"review_id": "OtpXBLGip2V7FdsogVIxhw", "user_id": "-24Lje2-UIpDhjUEqvkx9A", "user_name": "Debbie C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 6, "funny": 4, "cool": 4, "text": "The facility is pretty average here.  The top rope and sport climbing areas are fairly well maintained, but the bouldering routes are difficult to figure out.  It can be quite messy, but I was able to get the jest of it after figuring it out with some other people.  As for the atmosphere, the employees there are quite rigid so don't expect that laid back climbing attitude here when you enter the door.  I also experienced some pretentiousness from the climbers there and that is definitely not something I want to deal with when I have just given $17 for a day pass and just want to have a good time climbing.  Overall, an average climbing gym experience.  I would never get a membership here.  However, I did have a great time with my fellow yelpers :)", "date": "5/7/2009"}, {"review_id": "oS7KApXNP9KzBsVRG63Psw", "user_id": "KhZfPzoHOtvZSfwDL4gqLQ", "user_name": "Kevin C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The ropes course was informational and helpful in terms of getting acquainted with indoor rock climbing.The actual gym itself was small and limited in terms of climbing space.  I had an extra day to use the gym through a yelp deal but never went back.Recommend the place to learn and become acquainted with indoor rock climbing but wouldn't use it as a regular gym due to limited space.", "date": "9/11/2012"}, {"review_id": "q9i8MytdQ4Ar_1PAX42DKw", "user_id": "NTeKlnpTYG1A4ozjc8vOjQ", "user_name": "Christine L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took the beginner course and had a wonderful time. So much fun. I highly recommend Rockreation.", "date": "8/13/2012"}, {"review_id": "sPNPi8fInPGtniCPMXMblQ", "user_id": "Cth2m0XJ2wdPQwU__eF6GQ", "user_name": "Roel C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 3, "funny": 5, "cool": 4, "text": "There's nothing like channeling your inner Neanderthal by getting absolutely shit-faced on Courvoisier and Pepsi on a Friday night, forcing you to sleep in your car in a desolate parking lot in Venice Beach, and then waking up Saturday morning, drunk, un-showered, and hungover to go rock climbing at Rockreation.This, my friends, is what I experienced this past weekend (among other things) because a friend has decided to voluntarily lock himself up in jail, er, marriage prompting a much-needed bachelor party.Lessons Learned:1. Courvoisier is a helluva drink.2. Venice Beach is a helluva city.3. Do not rock climb hungover, unshowered, and well, just plain hungover.Because when you're up 40 feet in the air with a just a piece of rope wrapped around you and you're relying on a friend down below, who also happens to be hungover, to hold onto that piece of rope, you'll be immediately praying to Jesu Cristo for some of that hyphy juice, er, red wine or whatever them Catholicos drink in a crisis.Thankfully, the folks at Rockreation realized how hungover everyone was and made sure we listened intently and learned the proper ways of rock climbing, with clear instructions and of course the signing of a waiver just in case you...uh...die.In the end, I actually enjoyed this Neanderthal act of being one with nature, albeit it's not really a rock and we were actually indoors. But I felt like I was with my ancestors. So I topped the rock climbing experience off by peeing on trees to mark my territory and clubbing a girl over the head and making her my wife.", "date": "7/23/2007"}, {"review_id": "nugXfBjSMbPRWukksDNYIg", "user_id": "OSjNr-G5tQreCUm3Ydjwag", "user_name": "Shelley H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 3, "funny": 2, "cool": 4, "text": "This is the only climbing gym I've been to so I don't have much to compare it to, but Rockreation is a great no frills gym that serves its purpose. Once you get past the whiff of feet that kicks you in the face as walk in, you see slightly worn away plastic rock scattered with colorful crimpers and slopers.  There are top rope routes, lead climbing routes with an arch and a bouldering area with an overhang.  All an indoor climber could want when stuck inside on a week day.  There are also a few stationary bikes, a weight machine, a pull up area, etc. All the basics to get a climber in shape for the real rock. The gym gets pretty crowded week nights so you gotta be quick when you want to try your turn but climbers are respectful of the \"one try, then step off\" rule so there's no problem getting time on the rock.  If not a regular already, most everyone becomes a familiar face after a few weeks so it's easy to make friends or find a new climbing partner.  There are some really exceptional climbers there and some just starting out but altogether everyone is really nice and always willing to lend a helping hand or a word of advice...which can be good or bad depending on how you look at it. If you've never climbed a day in your life, but are a little bit curious- take the Fight Gravity 1 class for 2 hours to try out your rock climbing aptitude.  All the equipment you need is provided so all you bring is your desire to begin a new adventure and your muscles.  If you get that climbing itch like so many have, take the whole series of Fight Gravity for $99 which includes unlimited access to the gym for 30 days.  Not a bad deal.", "date": "11/2/2006"}, {"review_id": "osdukaCPe9K3EZrN75SLwg", "user_id": "RjfNwq0LDp-DiOQ2VX1-nQ", "user_name": "Whitney F.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 3, "funny": 2, "cool": 1, "text": "So this was an average climbing gym in my opinion. The walls tend to be pretty crowded and it's not the biggest gym ever, which seems like sort of a rip off since it's 17$ for the day, which is expensive when you only have the arm strength to climb for two hours. Now i'm slightly biased because i'm used to the gyms in SF and Oakland, which are HUGE!!! and well, cheaper. But the price was worth it for some good times with other yelpers.The staff tends to be pretty chill if you know what you're doing. If you're new, they tend to attach to you like a barnacle. Oh well. Good times, but i'm not gettin a membership, these pockets don't go that deep!", "date": "5/4/2009"}, {"review_id": "PNWUpW8TUG3a6JDsa3yVxA", "user_id": "wWJdRai4cdAXS-K62Yl_lg", "user_name": "Amy H.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 3, "funny": 1, "cool": 2, "text": "If you live in Los Angeles and want to learn to climb or keep up your climbing skills during the rainy season, this is the place for you.  It's not the greatest gym ever, but it's got everything you need and it's in a central location.  And there aren't any other indoor gyms closeby.\r Pros:\r - There are plenty of toprope and lead routes, and they update them often.  They also have a pretty big bouldering area that sometimes seems more popular than the rest of the gym.  They offer a variety of classes (but you have to call ahead to sign up).\r - There's a good mix of people there - lots of super-ripped abs, plenty of beginners, always a couple scary-good kids, and sometimes a few famous people.\r Cons:\r - The walls just aren't that tall, so you can't really work on endurance.  My solution was to climb two routes in a row, and end the day with laps.\r - They're not very friendly.  I went there every Tuesday for two years, and each time, the guy behind the counter (often the same guy) would ask me whether I'd been there before.  That got old after about a year.\r - The gym-gym facilities are pretty limited.  I would have totally joined Rockreation if I could have done my regular gym workouts there too.  But there's pretty much just one bike, a bench, and some free weights.\r Either way, climbing is an awesome activity that challenges your mind and your body.  Rockreation's a good place to learn and practice - I highly recommend trying it out.", "date": "5/25/2006"}, {"review_id": "jxTmdNQw-CChqD7qRjjk5A", "user_id": "pBtO8XjsijX9ipPO6VRtTg", "user_name": "Susan C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "I hate to say this, but I've graduated out of Beach City Rocks in Hawthorne.Rockreation is a more impressive climbing gym but can get pretty crowded during week nights. Climbing fees are higher at $18/day. There's a hefty initiation fee for monthly / annual memberships.If you can get past the high cost, this gym's pretty cool. People working are helpful and knowledgeable. There are a lot of regular climbers at this gym...and a lot of group parties of guest climbers (can get annoyingly crowded).", "date": "7/4/2007"}, {"review_id": "WzAh0yxVrZ9Kc8piWo96Qw", "user_id": "juup9B15bvPNR7lOHryMAQ", "user_name": "Jen S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best indoor rock climbing gym in the area, brand new bouldering wall and the people there are really chill and friendly. Definitely a good atmosphere and sweet place for those late night climbing sessions", "date": "9/27/2014"}, {"review_id": "yLGJe2k8hXAMSoiUT2QykQ", "user_id": "I9nz8t9uzQ_O6-mzEmQutg", "user_name": "Tami R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "Love this place, its my new gym.Everyone is so nice and chill. Loads of cool people who are there to literally catch you when you fall, and cheer you alogn the way.Note: its on La Grange in the business buildign that doesn't look like a rock gym, but once you come insdie you're blown away at the cool bridge, rock walls, and boulders they've got for you to climb.", "date": "4/10/2007"}, {"review_id": "1Ws-SMH6GPCBswzjIXx5DQ", "user_id": "9p0NaPGgBGtNu-sKmaEpkg", "user_name": "Rebecca D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "As a new climber, I took the series of two hour classes Rockreation offers (Fight Gravity 1-3), which also comes with a month of free membership and gear rental. I could not have had a better experience! The first class was the largest with about 9 people but we got plenty of instruction and individual attention, and the next two classes were just myself and two other people plus the instructor (Jason and then Steve! The instructors were really nice, knowledgeable, patient, and always ended class with, \"I'm here all the time! Feel free to stop me anytime to ask questions or if you need help!\" and they really meant it. It does get busy in the evenings, but my schedule lets me come during the day or early morning so it's not bother to me. I'm no pro, but the routes seem great to me, some I can concur and others I need to work at, as it should be. They also change them three days a week, so lots of new ones to work at. Over all I would HIGHLY recommend Rockreation. And no, it doesn't smell like feet. It's a gym, it doesn't smell likes roses but its not bad or bothersome.", "date": "8/29/2014"}, {"review_id": "N-zNCEigl2bfD2Sj0NMRIw", "user_id": "lupK6fEilbMRFlAEF7R9LQ", "user_name": "Eli S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 4, "funny": 2, "cool": 5, "text": "I can't comment much on this place, because I know practically nothing about climbing. But what I got here was some friendly advice from fellow climbers (including a 12 year old who was on the team at the club). I hadn't climbed since I was in high school. Even then, it wasn't in a place with color coded hand holds and crevices. I don't know terminology, and who knows if I ever did, but this would be the type of place to learn it. And, since there are very few, I may be back here in the near future. I really enjoyed the workout it gives for the whole body. Though my fingers were easily torn by the pressure of my weight on them. I needed tape and should have thought ahead about that. I will definitely come more prepared in the future and may definitely take some of their class series. Enjoy if you go. Rates vary for time and classes and whether you get chalk, but it's all available on their site. Check out the monthly plans and it seems like buying yourself some climbing shoes is a good idea if you want to do this regularly. They also offer yoga classes etc. It's really an interesting niche.", "date": "1/3/2013"}, {"review_id": "hLortl99_uKbo9DQaurRoQ", "user_id": "KxVf5jFIA_1Yk0nnLMq6mA", "user_name": "Lily A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Thanks to another yelper who pointed this out to me, the chart that shows what color course is what level is above the men's bathroom. Wow I wonder why no one pointed that out when I'm struggling on course that's WAY beyond my level!", "date": "3/2/2012"}, {"review_id": "uRFxLay66SSYByVKa4bayQ", "user_id": "YpcIXzIeFULd75DdTrdIQw", "user_name": "Robert R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Love the dedication of this staff at this atypical gym.  It's good fun for beginners and great when it rains or when the experienced climber lacks the time to drive out to Stoney Point or Idylllwild.", "date": "9/14/2011"}, {"review_id": "IAw1Of7Ilcbe6ZnxjWMHwg", "user_id": "L4rQOq0OyKlA7lRJ0TTO-Q", "user_name": "Michelle R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome staff very helpful!! However when I called all I was told is that I needed to pass a belay test, what's a belay? I wasnt told I needed to take a belay class. But that was small compared to the fun and workout I had! I'm looking forward to taking the class and coming back for more rock climbing!", "date": "9/4/2011"}, {"review_id": "S_4t1HyeI4LMVdLEPb2WCQ", "user_id": "DWZuxdAD1K1RtLlWCuTDsQ", "user_name": "John D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Great little gym/gem in Santa Monica area.This is a great little climbing gym.  It's not the cheapest place to spend an evening.  They have all the stuff you'd need to climb as a beginner or if you forget some gear at home.  It can get a bit crowded sometimes after work.  Make sure you bring some water to drink.  They offer classes here too so that you can learn properly.Don't half step.  Give yourself at least 3 hours here, since time will fly quite quickly.", "date": "7/11/2008"}, {"review_id": "5TPDvPFzOp0A7llNJhp4dA", "user_id": "VVTPgpbbeZ0bsKGpEej_LA", "user_name": "Josh G.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great place for rock climbing in the city and getting in a good workout after work. When i am able to complete a new level of difficulty the sense of accomplishment is amazing. I love this exercise, it is both mentally and physically challenging.", "date": "12/24/2011"}, {"review_id": "BTYSCzGlsgQ7CIN0z1k-vg", "user_id": "BsO5wbGRqoY-WZi8vzNv2Q", "user_name": "Liza S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Once you get over the expected gym smell, this place is great. I'm still trying to figure out the night that's the least busiest.  I'll post back if I ever determine which night it is. On second thought, I might keep that info to myself ;)The staff and the members are all friendly, although, a male friend once told me that the \"members\" are friendly because most are men and I'm female. Who knows!  I love the sense of community here. Everyone tries to help everyone be a better climber or solve a problem.  If you've been wanting to try out climbing it's also a great place to take a class and try it out.  Again, the staff are friendly and knowledgeable.", "date": "11/1/2008"}, {"review_id": "bM-vks_c0Lo_lzkmrCEH9Q", "user_id": "DK3RBYh3oqe6W2yPEnt0ow", "user_name": "Ryan S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "This was the first place we went and researched before ultimately going elsewhere. The location itself is great and is very large. However, the reason we give it 2 stars is because for first time climbers, they try very hard to squeeze as much money out of your as possible. They charged $40 for the lesson alone including the all day pass which we didn't get the price of. Although Climbx was a lot further from Los Angeles, it was only $18 and gave us a lesson. We didn't appreciate them trying to take advantage of us and charging us for things they don't need to. Now that we got the lessons elsewhere, we might go back and review it again.", "date": "2/19/2012"}, {"review_id": "e0JEMKIfSWIHPBm_B0SA7w", "user_id": "ew7wlt_riozq9Pw2hMk4zQ", "user_name": "Johanan L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "It's been years since I've gone rock climbing.  Come to think of it, the last time I may have went was in the 90s, but I might be wrong.This place is great.  Located close to the 405 and the 10 right in the middle of West LA, it's a great workout after spending the day eating too much at all the great restaurants in the area.  There's always a wall available to climb at, just make sure all your friends pass the belaying test! LOL!  They also have a workout section, boulders and places where you can hone your skills by traversing the wall.  The padding was exceptional especially when I missed this one handle resulting in me dropping a couple of feet. haha.  BYOC BTW! (Bring your own chalk, by the way).", "date": "2/3/2008"}, {"review_id": "uu2mBBnjoJYk7VW6B_-Eng", "user_id": "PpeNp4MvA5--t5scqviEsw", "user_name": "Brec S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "So this is only the 4th rock gym I have been to, although I am no beginner to climbing. I have climbed in numerous states for about 18 years so I am familiar with what  a rock climber needs in a gym to stay sharp.  And for that basic reason, Rockreation gets 3 stars right out of the chute.  It has all of the basics: overhang routes, boldering caves, chin up bars, cardio bikes, VERY CLEAN locker room, etc.  It's also has a great arch system for lead climbs which almost pushed me to give it a 4th star.However, I did have some serious issues that disallowed the last two stars.  First and foremost is the price. WAY TOO MUCH. I understand tennant rates, etc., but it is still hard to justify. Even if you get a monthly membership, it is still WAY more than a traditional gym in which you are offered a much wider range of activities. Second, the routes are just not marked that well. A lot of routes are tagged at the bottom, but are then crossed out and it is like finding Waldo with the holds.  These two issues, along with the obvious height shortcomings make for a somewhat disappointing experience. I like the staff, and there is a good selection of lead routes...and like I said, I almost pushed the 4th star here. But in the end, Rockreation gets a solid 3 stars.", "date": "5/21/2008"}, {"review_id": "gJ6k-YwJCP_BXKhZWUWI1w", "user_id": "OxC1AXAntyfrRARPxQQWcw", "user_name": "Maggie A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I had a ton of fun here bouldering with my boyfriend! He's great... I'm not so great (and a newbie).... but either way, Rockcreation doesn't intimidate - rather it makes you feel like you're just at a regular gym and everyone's doing their own thing. I was afraid to go in at first, and realized quickly that it's a safe, fun, encouraging environment with a good group of people. Drop-in's can be expensive. But try it first, if you like it, memberships aren't that expensive and if you go a lot, it makes it worth it. Definitely a unique alternative to a regular old crappy gym.", "date": "11/14/2011"}, {"review_id": "UYQPlp3tTJNXZJE4kBfelQ", "user_id": "8QUKueUDq6y0dlxQYNWGJg", "user_name": "Debra Z.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 2, "funny": 0, "cool": 2, "text": "I've been a member of Rockreation for a few years now & I can not say enough nice things about their staff. So friendly! They are kind, supportive, patient & knowledgeable. Hands on & encouraging, I absolutely love these guys. I have never had a bad experience with any of them. They are also very good about constantly changing & updating their routes, so you don't get tired of climbing the same things, not to mention attentive when it comes to fixing a 'spinner' as soon as you point it out to them. Safety always comes first here, which I greatly appreciate. The gym is also home to a very friendly & supportive community, which is part of what makes it so great. The only thing keeping me from giving them a full 5 stars is the ladies locker room. It's not hideous, but could use a little work. I don't expect them to supply towels or anything, but once when I showered there after a good climb, um, some little critters crawled out of the drain to join me. They weren't exactly my ideal shower companions so I naturally reacted with the very stereotypical female shriek & jump on the nearest object off the ground technique. Not my proudest moment but what can I say, roaches creep me out man. Sorry. I will note that as soon as I notified the staff, they were on it. But I have been hesitant to shower there ever since, which does make getting a good climb in before work a little difficult, especially since they don't open until noon on Monday, Wednesday & Friday. That said, I still love this gym & their staff & will continue to be a member for as long as I'm climbing! :)", "date": "12/6/2012"}, {"review_id": "S1_FYr0qiK3v_9ROHibcWQ", "user_id": "xI2rZKFAENVV-2FzF39bjg", "user_name": "Julie M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter, aged 7, just attended a week of Reach Camp. She had a wonderful time! The staff was super awesome and sweet, the kids loved them. I liked that the staff seemed to have as great a time as the kids. : )The kids are never bored...there is so much to do. I was worried that my daughter was attending without having a friend there that she knew. However, she wasn't bothered by it at all, since she was having a great time. When it was time to pick her up, she never wanted to leave.  Booking the week over the phone was a bit difficult. Don't let it discourage you. I think I called about 3 times, and was put on hold for a long time each time. But when I finally talked to someone, they were really kind and helpful. I think they were busy tending to their climbers.", "date": "8/15/2011"}, {"review_id": "dTPYWCnAywFl39bVXaAlRg", "user_id": "kkTSGJP_8Iq9kkm-kmsKVw", "user_name": "Nancy Y.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "I've been to a few climbing gyms, and this is by far my favorite. Actually, I take that back, the Rockreations in Costa Mesa is a bit better..but I like I also like it here. Yes it's a bit musty in here, but in my opinion, I think Rockreations is better maintained than Beach City Rocks in Hawthorne. I don't boulder, but I rock-climb with a belayer. I feel that the levels marked at this gym is more accurate because the difficulties reflect the numbers. Also, the classes taught here are very helpful for beginners learning to climb. If you are in L.A, I would recommend Rockreations as the perfect place to start before you venture out to other gyms.", "date": "1/15/2009"}, {"review_id": "GYgdsAQE6CkdV3RlEiVIWw", "user_id": "h25vnXfrFPckqCGqFLe3oQ", "user_name": "Quan D.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Of the climbing gyms I've been to, this one is a bit on the smaller side. The height of the climbs is not really all that impressive, but the bouldering area and the traversing areas were better than most other gyms that I've seen.The ropes are a bit on the old and seem to be losing some of their elasticity, and the top rope is only once over instead of the twice over I've typically seen elsewhere; so anchoring in is recommended.My first visit was on a Saturday afternoon and it was not terribly crowded (it was a bit overcast that day as well). Prices are pretty fair. I'd go here again for the convenience of its location in West LA.", "date": "6/24/2009"}, {"review_id": "ttwuAx2zzXGgiyjUZeyWgA", "user_id": "JOr0dVjhNINbpiks6YZE_A", "user_name": "Richard J.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "If you're stuck in a gym rut, hiking rut, or a whatever rut, and want a different type of workout you should check out Rockreation. Im no rock climber but I thought that this was a pretty cool climbing gym. If they had a bigger weight room I would be tempted to get a membership. Overall rock climbing is really a unique type of workout. You use so many muscles that you typically never use at the gym. The nice thing is that you dont need a membership to come, they have some open climbs with groups and there are some other classes available. I think that classes start at about $15 (including gear rental) which is pretty reasonable.Again, I am no climber, but I think that the only thing that could be better is if there was about one more story to climb. Other than that there looked to be some pretty challenging climbing paths that you can take.", "date": "6/15/2009"}, {"review_id": "Iz3cX-9CEl8Pa6nsOXCjBg", "user_id": "H0FUdfLSDGg3AgMxsbYXnQ", "user_name": "P C.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "If you want to climb here and you're a newbie, sign up for their Fight Gravity 1 class with friends, which is a 2 hr class on belaying, and includes a 1 week pass.That's plenty of time to hone your belaying skills, bouldering moves, and to determine whether or not climbing's for you. You'll end up with calloused hands and a stronger upper body, along with new climbing buddies, since you usually see the same guys. They're all extremely friendly and helpful.", "date": "7/18/2008"}, {"review_id": "8rsd5qqd_KF11JypPbgMEw", "user_id": "7oQeR5ttXM3jhwmo802WpQ", "user_name": "J B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "By far the worst gym I've ever been to..If you are a regular climber you will be really frustrated with this place. I've been climbing all over the world, inside and out, and never been to a gym as bad as this. Where do I begin...?I don't think the people behind the counter are actually climbers. Couple of them are overweight and out of shape, while the others know very little if anything about climbing and gear. (probably a big reason behind the problems here.) Their costs are outrageous, and their benefits are small. Here is a quick rundown:-$100 \"startup\" fee to begin a monthly membership-If you stop your membership at any time you need to pay the $100 again to restart (so you can't make this a \"winter only\" climbing spot..)-NOTE: You could take 2 months off, but you still have to pay a \"maintenance fee\" just to keep your account active.. -If you want to buy just a 1 month pass it's $100 (for ONE month)-They do NOT offer \"punch cards\" or other passes-They do NOT offer lead ropes for you to climb on, you have to bring your own (OMG!)-They do NOT offer guest passes (there is one specific day a month when you can bring a guest, and it usually falls on an odd day for climbing, like a Friday..)-I've been there 3 times in 3 years and they have lost my records every time, so I've had to re-take my belay test each time I've been there.-List goes on. You name it, it probably costs $100I highly suggest going down the 405 to Hangar 18 in Hawthorne where it's $99 for THREE MONTHS. You can also try \"The Arc\" in Arcadia which is $190 for SIX MONTHS (and they offer punch cards.) Both places have a staff which is active in climbing and are far better than the staff at Rockreation. Both places offer lead ropes for use, and both places offer cheap (i.e. usually free) belay lessons, etc.If you are serious about climbing you probably aren't rich, so I'd recommend you save your money and go somewhere else... If you want to burn money and teach people behind the counter about climbing, then Rockreation is your place.", "date": "2/7/2013"}, {"review_id": "DlSXZg4nghp130Qh1LKpyw", "user_id": "fQE0ru9r8aT-t6AidQ48uw", "user_name": "Dat N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "They have an extreme waiver form that you must sign. In part you must agree to the following: \"I HEREBY RELIEVE ROCKREATION FROM ANY DUTY TO PROTECT ME FROM HARM, and agree that even if Rockreation chooses to implement safety procedures such actions shall not alter the fact that Rockreation has no duty toprotect me.\" Wow. So, they give you a wall and straps and say Go for it! And if they help you with the straps and it is negligently strapped by them, it is not negligence because you are on your own and you should have know how to strap yourself properly. How would this business survive if this were their motto: \"YOUR SAFETY is not our concern, it is YOURS.\"? The truth is that in a court of law a patron could and should sue them if they were negligent regardless of this waiver. The waiver is to deter those who do not know their rights. This waiver should just say that this sport involves reasonable risks that increase with your level of inexperience and non-fitness and carelessness.", "date": "6/29/2012"}, {"review_id": "yqOTLxURLi49OQKQKT_UHg", "user_id": "Qvo6dV1ROR8MswaMfVLq-g", "user_name": "Perry K.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "It's good for what it is!  Since there are no other climbing gyms in the area, I can't complain too much.  The walls aren't as high as the other gyms I've climbed at and there's a really small workout section.", "date": "2/2/2008"}, {"review_id": "xfkjNdV34oJPRT0HaSIayg", "user_id": "G8T_Vq0MSjlmPJdY9DS3-g", "user_name": "Angela F.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I learned how to climb here and have been a member for the past 2 years..so am a little biased...while the facilities are not totally impressive (the air circulation is not the greatest, and there isn't enough work out equipment), the bouldering area is solid, the routes are challenging, and most of all the community is friendly and helpful for folks of all levelsIf you are interested in learning, I recommend doing the 3 class package (comes with a free month of rentals/ admission - around $90). If you're more advanced, I recommend going during the morning on Tues/ Thurs (open at 6am) - there is a small group of regulars that go and it is not crowded whatsoever.", "date": "3/14/2009"}, {"review_id": "hpD8orP8TxWjif5d2Cw3Tw", "user_id": "SoQ06F6bJD4s45thZuzmMA", "user_name": "Karine A.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "While the facilities themselves are quite functional, rockreation is smelly, rude and generally unpleasant.  I would rather make the 35 minute drive down to Hangar 18 in Manhattan beach, than the 5-10 minute commute to rockreation.  The staff is condescending and does not seem to care at all.  Not to mention this attitude seems contagious.  The atmosphere there is one I would recommend to someone I don't like.  To top it off they are pricey too.", "date": "8/25/2010"}, {"review_id": "J6tt6T3iUQgPvFzM19Vxtg", "user_id": "dvP5u9D1B2ac5LXqK3vgEA", "user_name": "Matt M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I climbed here when I first moved to LA and had a year membership for a while there - but haven't been back since.  I've climbed in gyms in NC, AR, MA (3 different ones), and UT - Rockreation was easily my least favorite of them.  The gym is expensive; a number of reviewers have said that so I'm not going to belabor the point.  And some of the staff are a bit on the evil side.  I used to warn students (I've taught a few hundred people how to climb) not to be intimidated by them as they got tested on their belay skills.  If they can intimidate someone who can belay in their sleep, they can make a beginner wet themselves.  I did take a good lead climbing class with them, and i wish I could remember that staff member's name so i could compliment them now as I've lead (and taught lead climbing) for years now and never been involved in an accident.  Janet, Tavis, and Phil (if any of them still work there) are all chill people - so if you get them to help you out, congrats.  One of my bigger complaints (possibly rectified by now) concerns their ropes...  The top ropes were of pretty poor quality - stiff and not very easy to use.  And I hated the fact that you had to use their ropes to lead with.  I have no idea how many falls have been taken on them and trusting them seems foolish.  There are no staff counting how many falls are taken I bet you that they aren't retired as often as they should be.  My favorite gym (Rockhaus in Logan, Utah) required you to have, use, and maintain your own rope after you passed their lead test.  Their reasoning is probably the same as Rockreations - liability.  At any rate, now that I've moved to Culver City I may have to see what gyms are nearby.  Rockreation is right up the street, but the quality of service isn't worth the price...", "date": "8/12/2011"}, {"review_id": "0S0La_OYFhra5lrPoF3FXA", "user_id": "En5be-y6Pk0RnMBwlHlrLQ", "user_name": "Drew R.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is really great.Considering the small amount of indoor climbing there is, this place really gets the job done.  TONS of really good bouldering, and top roping.The prices can be a little steep, but that sort of comes with the sport.  Staff is friendly, laid back, and knowledgable.If you don't know anything, lots of people there are willing to help you learn, but don't try to fudge your way thru like you know what you're doing.  Everyone in that gym can smell BS from a mile away.Good music, good people, and good times!  Where do i get the annual membership?", "date": "8/8/2009"}, {"review_id": "CFyLHPzeoJzXcbmP3B7BfA", "user_id": "UB79qeoVJ-3zHhRhvPFCPQ", "user_name": "Emily T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "This gym is not worth the money.  It's way overpriced, there is limited parking, and worst of all the staff is rude.  Also, the routes are poorly set.", "date": "1/31/2010"}, {"review_id": "H5so7YS6fGjJwqEfQ0OZYQ", "user_id": "-46YrKu6PceCUcHcnN02KQ", "user_name": "Mark W.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I went to rockreation for the first time with a friend a few days ago.  I got there early, and was unimpressed at first.  The bouldering is not great and it was way too crowded.  When my friend showed up, however, we had a great time traversing and TRing.  Cons: Bouldering not great.  Not a great place to go solo.Pros: Fun cracks to practice on, Decent top ropes, pumpy traverses and a really good sport/lead area.Bottom Line: Go with a friend and you'll have a good time.", "date": "3/3/2011"}, {"review_id": "1-dCdJFQR3yNttwtN447Eg", "user_id": "3N810U4M4yAyZj3fx9s79w", "user_name": "Fred L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I think I would give this a 3.5 if I could, but as it is, it leans a little closer to 4.This is a fairly decent gym, and probably the best (only) one you'll find within a reasonable distance from the West LA area. Some of the staff seem to be a little despondent sometimes, but who can blame them? Standing behind a counter for hours on end and telling people to not be stupid and endanger their own lives can get pretty tiring I imagine. Otherwise, I've always found the staff to be cheery and helpful. Compared to most gyms I've been to, this place is pretty expensive. 17 for a day pass, not including gear rentals. ouch. Other notes: the boulder problems are rotated fairly regularly so you shouldn't ever get too bored of the place; lead/TR walls are a little short which is a bummer. All in all, there are some fine climbs in here, although I think there's a slight tendency for the problems to be sandbagged.", "date": "10/27/2008"}, {"review_id": "dH-fC6ZSkY1Ztdy6gKWBmA", "user_id": "1_KSumh5IQn_XdWQB8ARAQ", "user_name": "tiffanie l.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. The people are friendly and the routes change every month. Parking isn't as bad as it seems, as there is a ton of street parking.", "date": "1/25/2011"}, {"review_id": "lgQAG9DPIg8nm2_Hi_MbUA", "user_id": "iIKfBXbqLpQiJhLVFusQ3g", "user_name": "Victor W.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "Wow! This place is awesome, I brought my wife here really as kind of a goof, because we're always saying we need to get out of the house and do something. Well this is totally something. Holy s&%#, what an experience!  All the instructors are experienced climbers and know every aspect of climbing and how to let you do it confidently and safely. Big emphasis on safety, because if you don't pay attention ... well, lets just say that was part of the thrill.  Fortunately I didn't have any problems with the staffs attentiveness at the front desk, and the forms are very detailed as far as releasing Rockreation from liability, but they have to, people will sue a place for anything. If you go skydiving it's even worse, they just about say we can murder you and there's nothing you can do about it, so this wasn't bad at all. It's all just CYA.  Anyway, lots of fun, I got a great Groupon deal, $19 each, which included a one week membership. Check it out if you're looking for something cool and different. This would be a great first date thing to do!  Just don't scream like a girl when you get to the top.", "date": "2/24/2012"}, {"review_id": "j45xRMl18fazt_T9htU6nA", "user_id": "z33x0fHD8gutPy5Gv6Hwpw", "user_name": "Angela O.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 5, "funny": 2, "cool": 4, "text": "I don't like Rockreation's routes as well as Beach City Rocks': there aren't  enough chances to learn to lead, and they don't have those cool auto-belay devices that allow one to climb alone. Rockreation's color-coded route-indicating holds are quite novel, but they're arbitrary too. Routes are run-out and hard to follow. It must be a drag to work here and to have to change the routes all the time; tape is less permanent, of course, but easier to manipulate. As is, might I add, the gym's rating system. I can tell that several people determined, without collaboration, what's a 5.6 or a 5.8. However, the employees' attitudes at Rockreation are far and away superior to those at Beach City Rocks. I particularly liked the (gorgeous, sweet, shaved-headed) man who tested my abilities as a climber, in order that I might belay 500 fellow Yelpers :). Kidding, kidding.  Also if you like to boulder (I don't), this is your gym.I'll likely be back, primarily due to its cheaper gym membership options and its proximity to UCLA.", "date": "5/2/2009"}, {"review_id": "-5ffqfImjf66VQH7bztNJA", "user_id": "wWRoZ9uG_IHLKFKLch26jw", "user_name": "Karin M.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "at last a west side gym with no attitude. fun vibe. attentive staff. kids love it. I'm going back", "date": "2/7/2015"}, {"review_id": "2YxI8CigpUWUcgPjflOHSQ", "user_id": "ZiwTj9U_n-e0AbwL16LHeg", "user_name": "Sue Z.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 3, "funny": 2, "cool": 3, "text": "i've had this itch recently. i've been climbing on my couch a little too much. jumping up stairs, climbing over fences. so i decided it was time to go to rockreation. i've only climbed a manmade wall ONCE, and it was on a cruise. go figure. and the next day, i was unable to open the top of a water bottle. yep. a water bottle, my fellow yelpers. you work out muscles you literally never knew you had. i'm slightly banged up right now. few scrapes on hands, bruises on knees, but overall A-OK. : ) except for the fact that my fingertips are PETRIFIED. piano practice was quite painful today post climbing. you get 22 dollars. (17 for full day pass, other 5 for borrowing shoes). there are cubby holes, but i suggest you keep valuables close to you, since there's always a chance some a hole feels an itch to grab something other then a rock wall. the person in front was very helpful. and i even got a couple of tips from an expert climber there! when you walk in, go left, all the way to the end, and you'll see some simple walls you can traverse and train on! there are heavy mats you can put under yourself in case you take a spill, and yes, you WILL take a spill. everything is color coded, go for the pink tapes, cuz those are the easiest. i went with Ben G. which means he put me to shame with this monkey-climbing ways. it's ok. i set mini goals for myself, and i did it towards the end, while simultaneously popping out SOMETHING in my left shoulder. gah. reading through past reviews, i did notice some snarky, holier then thou rock climbers there. but fuck them, i'm not there to impress them. i stuck by the kick ass nice climbers. : ) this is a super super fun way to stay in shape, AND hanging out with buddies. try to go for at least 3-4 hours. take mini breaks in between, and you're golden. see you all at the top!", "date": "6/10/2009"}, {"review_id": "8Y6i0TUx-FI9PymYgYPIHw", "user_id": "QXeuuT6gTStx7JxXMcNBbQ", "user_name": "Sophia L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 2, "funny": 6, "cool": 4, "text": "Welcome to the cult of rock climbers. As a member of this cult you will join a new community of friends from all walk of life. Soon after learning the basic techniques, you will make this place your second home. You'll hang out at the gym after hours, socializing, climbing, and planning weekend outdoor climbing trips. Your wardrobe's \"climbing gear\" section will grow exponentially until soon you will dress like a mountaineer always. Your hands will always be dry from the chalk and your nails will barely survive past your fingertips. You'll start to see the climbing trails in your sleep, and you'll spend precious work time daydreaming about the next weekend trip or about the challenging technique of a puzzling climb. Soon, your sense of humor will incorporate dorky climbing metaphors and double entendres. You'll start camping in random places and random people's backyards, and you're gonna want all your friends and family and coworkers and neighbors to become rock climbers just like you!Whoa, I'm just here to climb the walls. [2 hours later]Um excuse me, where do I sign up? I'm hooked. :)", "date": "11/10/2007"}, {"review_id": "vPkEgiF0lYAK56MSP2ybYQ", "user_id": "RkgWZR0IJZHI5I7g01nSfA", "user_name": "Emily S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "A little difficult to find!!!  It's tucked into an office center with a lack of signage.  Parking looks dubious but you can actually park in any of their assigned spots.  I think this place is more geared towards top rope and lead climbing, but the bouldering wasn't bad.  I do prefer Hangar 18 for bouldering but this place had a lot more space.  Very cool staff.", "date": "12/31/2009"}, {"review_id": "Y0J1pnv0iNwdaSj6lxPTHA", "user_id": "_tdQ19jYyqeKKbwzcvsb2w", "user_name": "Danielle S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took the first of fight gravity classes yesterday and was impressed. The instructors were thorough and gave clear instructions. Most notable was our instructor Jeremy who spoke with passion and gave sincere advice. What really made him stand out was after the class was over he continued to answer questions and give sound advice. I highly recommend spending the money on the class.", "date": "8/15/2012"}, {"review_id": "Vvl4W7Rt-6xjd1yp5dOatw", "user_id": "yWoDC8QzMiG5X1-t4z2sYQ", "user_name": "J.H N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "4 stars for facility pricing and instructors2 stars for the front desk guy who wouldn't get off the phone for a sec to explain anything to me about the form he was making me sign to enter even tho I was not climbing... Apparently I need to give my blood type, my first born and every piece of info needed to steal my identity just to watch my niece and friends climb for her 11 th bday.  coming from a customer service background, that really bothered me.  otherwise, I loved everything about this place. This is a big climbing facility with friendly knowledgeble staff.  $25 for two hours.", "date": "2/16/2012"}, {"review_id": "TUcuFWrRvgpxNVMTu0aZ-Q", "user_id": "3V_PnPYtmu-mLTE0n0Bv4A", "user_name": "Helen P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "Good climbing gym, has all your standard stuff. Some workout equipment, a decent-size locker room/bathrooms, everything is clean and adequately maintained. The cost is rather high, $17 for just a day pass, and the membership costs only supports hard-core climbers.", "date": "11/15/2008"}, {"review_id": "5C-JehVZ7g7rHMaaddTqzQ", "user_id": "zUGNL2kbzomjtB9YMzpY6g", "user_name": "Len S.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "The photos were sort of misleading. The gym's highest routes are barely 2 floorrs. I didn't bother with the top rope and stuck to bouldering. The routes were impossible to follow, the ratings were tacked to a cork board in the form of a piece of cardboard with the different colored tapes and their relative ratings. I saw a number of people trying to figure out where the bouldering routes went or to which route a given peg belonged. The walls look like they were slapped together in someone's garage and the holds haven't been cleaned, oh ever. This place reminds me of a tiny version of Mission Cliffs in SF.", "date": "1/15/2009"}, {"review_id": "9fK0c7cV04HqjDc5Hrci3w", "user_id": "8dvlwmR7FIyzKGieRZrXOg", "user_name": "E. T.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "You're only a few feet away from the ground, clutching a rock with your fingers and you look down and fear/panic take a hold of you. Rock climbing is for those who thrive on adrenaline, and want to get in fantastic shape. Granted, I've only gone rock climbing a few times, but I liked this place. I came in, thinking I had no fear of heights, but rock climbing is scary if you let your mind create worst case scenarios. Even so, I found someone who was very encouraging to help with belaying and learning how to climb. The staff  explained some safety tips which helps with the fear. I like belaying because of the psychological feeling of safety. Bring your own shoes and chalk, if possible. You could always try one some shoes at REI to find your fit and then buy that type online to save money. As far as everyone talking about how horrible the staff is and how expensive it is, I say 1) if you're going rock climbing, expect to spend money, 2) the staff was nice. They also have a mini gym, and weights, and a shower and shoe rentals.", "date": "12/18/2010"}, {"review_id": "b8M0OHtcm31-PN2i1b0pSQ", "user_id": "UvutFovo4fgr7wdx22rp_w", "user_name": "M. P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "This is not a great place to go to have fun climbing with an easy-going crowd.  If you just want to have fun without a whole lot of competitive/cultish B.S., go to Beach City Rocks.This place is loaded with newly on-the-wagon AA types trying to manage their addictions by going to the gym.  No fun. No thanks.  The preening is ridiculous too.I am still trying to figure out how, exactly, that's supposed to be a good place for kids.  Birthday parties? Not so much...You will note all of the other reviews are from very enthusiastic climbers.  If those other reviews sound more like you and you like working out in B.O.-ville , then it is probably a good gym.", "date": "1/2/2009"}, {"review_id": "DnIQgEVGZZH9w6j5Vn5e5Q", "user_id": "G0ufhKtGkK9wvgY0Smj9sQ", "user_name": "Jennifer L.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I signed up for the yearly membership and paid in full up front.  I didn't use the gym for 5 months due to family problems.  They are only willing to extend it for 2 months after paying $20 fee.   Please DO NOT PREPAY nor sign up for the yearly membership.  It's cheaper to pay as you go.  Also, if you are taking lessons, you don't have to pay to get in.", "date": "8/19/2011"}, {"review_id": "cAN99cZORGdl_j3alUhTRQ", "user_id": "dV4QVGzX3MzzK57hJGuBNg", "user_name": "LA Explorer N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Rockreation for about two weeks with a groupon deal and was pretty impressed.  I went through the belay class which was a really helpful brush-up course even though I'd done rock climbing before.  All the staff were really nice and helpful.  I liked that they have so many different walls and courses available so you never have to wait to climb and can always find a challenging enough course that is available.  The parking lot was usually full but street parking is totally doable and available in the immediate vicinity so it wasn't an issue for me.  The only thing that kind of sucks is that they don't have the self-propelling device on their walls like some other places do.  As a result, you basically always need to go with a partner unless you want to only climb the bouldering wall or if don't mind trying to make new friends on a whim.", "date": "3/22/2011"}, {"review_id": "ZeHMqwpfJpQLXiP7WQ_luw", "user_id": "BFMZGVqCjMYhQ-Zb6lngqw", "user_name": "Elliot B.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "The actual climbing and gym portion of this facility is quite nice, but due to their management I can't help but only give them one star.  What good is a decent facility if you can't trust the management to treat their customers right.  I quit this gym officially and formally about 2 years ago and since then have had nothing but hassle because they will keep your billing information on file and then continuously \"accidently\" charge you for a yearly membership out of the blue.  The steps to get in contact with their billing department to have these charges removed are ridiculous.  You have to email a certain person who takes weeks to get back to you and even then I had to repeatedly call them to remind them that they hadn't reversed the charges.  Almost 2 months and a dozen phone calls later they finally reversed the charges.  This happened not once, but TWICE in the past 2 years that I haven't been a member.  Their excuse is always the same, that they have it on file that I officially was no longer a member, but they switched their systems over to another program and it automatically charged my account because they keep the billing information on file.  This is no way to run a business.  Not to mention I've never gotten good customer service there.  The facilities are fine, but the management just makes this place a big NO.", "date": "3/13/2012"}, {"review_id": "cePW5cmI5S8U0nLeTDygdg", "user_id": "-uJWKmKcDbmYDxOT36RRgQ", "user_name": "Jaimie N.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just started climbing a few months ago and I love this gym!  The people that work there are AMAZING & have always been super helpful.  The routes have a variety of interesting challenges and new ones are always being added.", "date": "4/7/2011"}, {"review_id": "0BJBwwgpOYwsYv5-KONN5w", "user_id": "EV7Zj6Jyf2tcuFB2Fv1shg", "user_name": "James P.", "business_id": "Ky4_MzwoLcVhBpuWcJsPwA", "stars": 2, "useful": 4, "funny": 4, "cool": 4, "text": "First of all I want to thank Matthew K. for putting together the UYE at Rockcreation the other day.  It was very cool to meet some fellow Yelper/Climbers and those aspiring as well.  Rockcreation was the first indoor gym that I checked out about ten years ago.  I had been climbing outside for a couple of years, so I found the novelty of pulling on plastic rather intriguing.  Every time I have gone to this place over the years, I have always gotten the same vibe from the staff and clientele.  You tend to get a lot of attitude from the newly arrived Westsiders who are aspiring to be an actor/model/pornstar/waiter.  I actually lived in West LA for two years only a couple of blocks away from Rockcreation and I could not force myself to join because I could not stand the attitude and unfriendly vibe of everyone there.  So how is the place now?  I was waiting to get a day pass at the front desk and the staff member had answered the phone and was very condescending with the person who wanted to do a group event.  I am still amazed in a down economy how people can get away with such crappy customer service.  The routes also were pretty sad and not very inspired.  There were only two routes on toprope that were over 11a and they were pretty featherbagged.  The lead cave seemed pretty cool and the bouldering alright, but overly packed and badly labeled.  Not worth the time unless you really have no other option, have plenty of money to spend on a substandard wall, and you have to get that plastic fix or you will go into withdrawal.", "date": "5/12/2009"}]