[{"review_id": "-t13xAqozv_nEx7Q4pUViA", "user_id": "WTCX7YFP0psWop7y5peg2w", "user_name": "William C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Spent 10 minutes my first time here before I dropped off a wall and broke my ankle. Staff was super awesome and quick to respond. Even got a call from the manager the day after to check and see how I was doing! 10/10 can't wait to come back when I'm all healed up. More relevant: this place is huge and they've got routes of all types. Stop on by and have a good time!", "date": "5/17/2019"}, {"review_id": "A_3AG2sgyChtJBYUpMRrhw", "user_id": "wFHLcF8Xei4GoWOHxOgiMg", "user_name": "Mike S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "After seeing Free Solo, my son couldn't help but want to try climbing. We found Pipeworks and went in to check the place out. It's nothing short of amazing and while we're certainly not experienced climbers, I can't imagine another facility really doing a better job in terms of the bouldering and belay climbing variety and options here. We signed up for a recurring monthly membership but later learned there was a monthly option, which probably would have been the better move for us given the fickle nature of ten year olds. After a few tries, we realized this wasn't the right time for us and when we inquired about cancelling, Jason, the guy who also signed us up, couldn't have been more nice about even making that a great experience for us. The customer service approach they have is second to none and as soon as we're ready to get back out there and give it another try, I wouldn't even consider other options. Pipeworks is the best and couldn't be more welcoming to beginners like us or experienced climbers like we saw all throughout the gym.", "date": "4/17/2019"}, {"review_id": "ZfUM3_y4HTeoyHLJPYqXhA", "user_id": "JKjt8-0w6jZJrL3onHf0aQ", "user_name": "Sunny P.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Whoa! This place is huge! Usually places are focused on belay climbing and have a small section for bouldering, but this place has a huge section dedicated to bouldering! I usually climb in the Bay Area. The problems here are a bit on the challenging side, but have a good variation to it compared to other places I've been too. Its an awesome place for both beginners and pros climbers alike. They also have a variety of walls. Your typical vertical wall, overhang and I believe its called slab (where the wall is angled at less than 90 degrees). There walls are also fairly taller than other places i've been too which makes it for more of an exciting climb. My review is mainly on the bouldering side of the gym and trust me, You won't be disappointed! One thing is that their location is a bit sketchy around the area, but have a gated parking area that's kept open. It's been fine the past couple of times I've been there, but just a heads up.", "date": "1/19/2019"}, {"review_id": "wbJ3s9m0DBTkEW0VhwmFsw", "user_id": "QPFYr4q90IH4HMoE1XIYMA", "user_name": "Ana F.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "So. Much. Fun.  A friend and I tried bouldering a few days ago (still mildly sore). I hadn't been to this gym in probably about 15 years (probably why I'm still sore).  Quick check in.  Friendly staff.  Dogs everywhere. Very friendly and cool members. What's not to like?  Some might say the price tag?  It was $20 to climb + $4 for rental equipment.  So for two of us it was $48 and we were spent before an hour was up HOWEVER had we stayed longer it would have been a better value, of course.  Not to mention it's a day pass so you can drop into the classes they offer as well!  A section of the course was being worked on and wasn't available while we were there, that was a bummer but there was still plenty to climb on.  It wouldn't hurt for you to give them a buzz to find out if any construction is going on if you are planning to drop in.I'd been jonesin' to try bouldering for quite some time now and I'm so glad I did!  Next up: Some conditioning, to make my next trip worthwhile.  Wish I lived closer!  I would most definitely join the club is if did.", "date": "1/5/2019"}, {"review_id": "7K71jUCZ978WZtTugpp_cg", "user_id": "XZ6he_X4-Tq4NW4QsdAg-g", "user_name": "Adam S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Probably one of the worst climbing gyms that I've been to. The staff was very cold, the facilities were run down, and they actual bouldering runs were all in need of a solid cleaning and re-work. My time here was very short lived. If you want to focus on cross fit and other activities; go here. However if you're going mainly for bouldering; explore the other options in the area. I won't be back.", "date": "5/20/2019"}, {"review_id": "CinB4MOpynDJuHREz8iTKQ", "user_id": "bkYltVAsrfYb5AP4aEHh5A", "user_name": "F H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We had a lot of fun today at Sacramento Pipeworks. The staff were really friendly and it wasn't overly crowded. It is really cold inside but once you start climbing its just about perfect. Aside from the rock climbing they also have an area for cardio machines, free weights for lifting, yoga and warm up mats and a crossfit section. The price is ok for a one-day pass at $25 but it does add up if you're attending with your family or a large group. Suggest renting the rock climbing shoes.", "date": "12/23/2018"}, {"review_id": "EvYOSL8g3MJFZAEkwwrUag", "user_id": "JTCtZoj8AjijcQptWAFxwQ", "user_name": "Saran W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Pipeworks is my home gym and I recommend it to everyone!  It's about time I finally write a review.  My first visit here was a couple years ago with my cousin, who is has a Touchstone membership.  One of the many perks of a membership here is that you can bring one guest per month any day for free and a guest on the fourth Friday of each month.  That's two guest passes a month!  After a few visits, I decided to get a membership too, and have since loved utilizing all of the perks (see their website for more membership details).Most of my visits here are spent in the bouldering section - lots of space to climb with varying difficulty levels throughout.  Despite the fact that I still consider myself a beginner, climbers of all experience can feel welcome here.  Those who are newer can easily get tips and advice from others and the more advanced climbers are always finding new routes and sharing techniques with one another.  On more crowded days/times, people are always mindful of sharing the walls.The staff here are really cheery and welcoming.  They're always greeting people with smiles and waves, which is greatly appreciated.  They do a great job of maintaining the facility and providing a positive experience.And while the exterior of the building may not look like anything special, the interior is HUGE and offers space for all kinds of activities, from climbing to cardio and weights, to yoga and CrossFit and more.  Plus, all of the facilities are kept really clean, which is a definite plus anywhere you go, but especially in a gym where people are sweaty and working out.All in all, Pipeworks is a super well-rounded place for a workout, and an even better place if you're looking for a community of kind and fitness-oriented people.  Definitely check for some of the events that Pipeworks hosts, such as gear exchanges and competitions.  And when you're taking a break from whatever workout you're doing, there are plenty of good doggos and puppers around (because they allow dogs!) for you to pet and adore.  What more could you ask for.", "date": "5/9/2018"}, {"review_id": "q1J3uWeuHR-LJIy4XAa9LA", "user_id": "gdgfqmMc3nnpNvB_pMLUFg", "user_name": "Apollo K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If not the Boulder Field, then absolutely Pipeworks. The space is huge with a large dedicated bouldering area and unlike TBF, a dedicated belay area. Thicc padding for safety, plenty of room to climb and walk around, never felt crowded, routes are well kept and maintained. The space has a dedicated free weight/open floor for those wanting to mess around on bars, stretch, flips, whatever. If you want to have other options than just bouldering then Pipeworks is the place to go. Regardless, bouldering here is excellent-never belayed here or BJJ to say otherwise. Can't remember how much I paid but somewhere between 15-25 probably, less without rentals I think This place is a no brainer.", "date": "12/16/2018"}, {"review_id": "51SqLocS9g5p0WT_e0vr8Q", "user_id": "QrFb9ny3eJw1s2Np-ckayg", "user_name": "Alex D.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 2, "useful": 1, "funny": 0, "cool": 1, "text": "I had never been rock-climbing before, so I was excited to give this place a chance. It was $30 for the day (which is already pricey). To my surprise, that fee does not include basic customer service. I asked an employee to show me how to use the equipment correctly. He said that he was not allowed to help me, but if I wanted to purchase a class, I could pay to learn the very basics of using a harness and rope. Then, he said, there were not any classes that day, so I would have to come back another day if I wanted to receive help from their staff. Since I was already there, I didn't want to drive home and come back another day. Plus, I had already paid! So he told me I was welcome to use Google and YouTube as resources..... (bish plz) To my luck, a couple of friendly members were able to help me figure out how to properly use my harness. After an hour, my feet were hurting so badly from the shoes I rented, that I couldn't continue climbing.", "date": "4/8/2019"}, {"review_id": "-G53kqHHP2MnE18_TzAYQQ", "user_id": "BvPWDtYLj2WI6b1ti5QnUg", "user_name": "Summers S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "Due climbing injuries I mostly used Pipeworks for weight training.  Weight training is a very poor cousin to climbing at this gym.  The general neglect of the weight training area along with the lack of sufficient squat racks to avoiding long waits caused me to downgrade this gym.  The recent purchase of a very little used $4000 leg training machine made me understand that the staff are neither a weightlifters nor have any interest in the needs of members primarily using the gym.As most of the other comments state, this is a great climbing gym with a great ambience.  I would have to rate that part 5 stars.", "date": "12/10/2018"}, {"review_id": "Tge4aZN7Ta9OpTz2hLyiDA", "user_id": "BinNY56Al_0U9cqCrNbyAQ", "user_name": "Francesca H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "The greatest climbing gym I have been to in California! The holds are nicely textured, and fresh. Dogs are allowed, which is  a first I've seen at climbing gyms. There's tons of room whether you want to top rope or boulder. Even if you want to lift weights, this place has everything, from a speedboat for boxing to a squat rack. This is what every climbing gym should aspire to be.", "date": "11/30/2018"}, {"review_id": "qbliROrA01tbTm-lLcFzmA", "user_id": "hFwQvDMixkC4CaYMgxNwCg", "user_name": "Thimoty I.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my daughter and her friends for her bday party and they loved it, customer service good, clean place, thank you to employee Ira she recommended this place.", "date": "1/14/2019"}, {"review_id": "0O-bq77gudEKQrxEy5b6hA", "user_id": "AdnL1ZEYB3S2a8iWzQJSyA", "user_name": "Anisa A.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "A FIVE STAR gym. This place is HUGE. You could practically live here.The bouldering area alone is incredible.The bathrooms are clean and have plenty of showers. Perfect place for a workout before headed out to work/life.", "date": "10/22/2017"}, {"review_id": "Jkr8eAH0ZABV3Xr19e4Dsg", "user_id": "srrhssAADQGch6mbVIa9Ig", "user_name": "Bonnie N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "At first glance driving by, I thought it looked pretty sketchy - it was a fenced off huge grounds with a bunch of warehouses and a large parking area, and some sections of the fence had barbed wire. But looks can be deceiving because this place has it all inside. It is more than a rock climbing area - it has a cardio area, weights, yoga, martial arts, body weight training, and even an area to workout with tires! This facility is huge and they're in the process of building a brewery in one of their warehouses, so that'll be cool to check out once it's done. All the rock climbing walls have rocks labeled by difficulty if you want to try and complete a certain color, or you can \"rainbow\" as rock climbers call it. For example, all the pinks on a certain area of the wall could be V0 (easiest) and V1 is the next hardest, which could be black or something. One of the staff members said they switch the climbing routes frequently so that the walls are never the same. That's pretty cool!It's also cool that you can bring your dogs here. There are areas dispersed around the gym where you can tie your dog's leash. There are also cubbies to place your belongings, as well as a locker room with showers. The women's locker room even has a vanity area. A staff member said that Sacramento Pipeworks is Alex Honnold's home gym. Ooo celebrity sighting chance! (He's the first ever person to climb El Capitan with no harness). So maybe one day we can run into him! hahaThe staff is friendly, there are so many things to do here. It is a little pricey for a membership - $100 initiation fee and $78/month for adults. But you pay for what you get. I forgot the price of a day pass (around $25 I think), but I'll definitely come back for more climbing.", "date": "7/28/2017"}, {"review_id": "dfpu42DtPPlM0CeHN62j2w", "user_id": "kThLpx6BrSRA1qbncNn06A", "user_name": "Savannah A.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! I wish I lived closer so I could get a membership. It's huge! And the staff is awesome!", "date": "5/19/2018"}, {"review_id": "tgkcObeRTQz6C8_ExetkbA", "user_id": "wHiFUSCEs1dkoygmttxHlw", "user_name": "Lindsay J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "So happy I found this gym! I have spent many years trying to find a good gym and I finally feel like I'm starting to find my \"home\". In the past, I've gone to gyms that are full of roided out dudes and I always felt out of place. Aside from the awesome climbing areas, there is a great weight/cardio selection as well as classes.", "date": "3/9/2016"}, {"review_id": "fH5aWIQ1nV-4u-1UB_lD7A", "user_id": "ErDTj7CV7mGhf0qcW5zbtA", "user_name": "Rick M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a good time here with a friend who had showed me the ropes being my first to ever rock climb. Took the belay test and pass on my first try thanks to my experience buddy. It really did a number on me, the next day I was sore all over. I like it and have been rock climbing sense.", "date": "7/4/2018"}, {"review_id": "ZsM_s13fSKO3i7_DkrL7KQ", "user_id": "YcOyOhpM3Qih6z1Hu0KeWw", "user_name": "Jessica T.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 4, "funny": 3, "cool": 5, "text": "I have had nothing but wonderful and memorable experiences at Pipeworks!The location is located off the street with a private parking lot for convenience. It is located in a sort-of \"sketchy\" ares with a lot of homeless nearby. I recommend bringing in any valuables and storing it in the convenient lockers provided by the gym. As a new climber, I was amazed with how large the place was upon first entering. The first thing you see when entering are top-rope routes directly in front, cardio and workout machines behind that, a HUGE bouldering section to the left, and a functional training area with a slack line nearby. The ceilings are high for increased ventilation and the gym is equipped with multiple large fans for the warmer weathered days. I do not have a membership YET but I definitely plan on getting one within the near future. While the membership and daily passes may be on the expensive side, it is definitely worth the investment. Daily passes are about $20 with shoe (~$4) and harness rentals available for an extra cost. But with frequently updated routes, access to other gym equipment and exercises classes, and a crossfit membership add-on available, you will never be bored. The staff and other climbers are some of the friendliest and more supportive people you will meet. Everyone is always so positive and are always happy to lend a helping hand when others are climbing. Most of the climbers here have great climbing manners (patient and respectful) and do not sit or climb underneath you during a climb. I have only bouldered at this location, but the routes are changed frequently which is nice and there is a large variety of different routes accommodating beginning to very advanced level climbers. The place can get chilly in the winter and warm in the summer so dress appropriately depending on when you decide to visit.  I love Pipeworks and will be back frequently!", "date": "11/26/2016"}, {"review_id": "g9_RqruXGHj7rml42vCMFw", "user_id": "kUQiuYCAtpzIT6a4L8cGUA", "user_name": "Dilraj S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Really great place if you are down to try outdoors and hiking and rock climbing slack lining. Sucks that the tutorial takes long for first timers but they are pretty cool and try to be quick and to the point. A bit pricey ...so if you're are going make sure to spend at least 3-4 hours to make it worth the money. Would be down to go again", "date": "5/29/2018"}, {"review_id": "NtosCf12Chnkk1qo1PBi6Q", "user_id": "i-6URmPdeJ9ZBoP3WqIRZQ", "user_name": "George K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "the first time I went I felt insecure because so many people were more fit than I was but in the long run, nobody cares. Everyone is there to improve their climbing ability or to get a great workout in.When you're renting equipment, there's a good chance you don't need the harness (it's $2), just rent the shoes ($4). For first timers, the shoes be uncomfortable but you get used it.I got 4 blisters my first time but that's expected. I recommend using chalk to grip the wall better.I'm definitely coming back here about twice a month since I live an hour away.", "date": "10/15/2017"}, {"review_id": "5SAaXtT2xxI1dSki6A60RA", "user_id": "tzfUumGV5GkVTm_e2OiUbg", "user_name": "Jennifer G.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pipeworks is awesome! My fiancé and I joined about 2 months ago. We love it there. Everyone is super friendly and welcoming. There is no \"bro\" vibe here at all. The classes they offer are great... cycling, yoga, crossfit, Pilates... We even just went to an Acro yoga class! Add that to top rope walls, bouldering, and full gym equipment and it's seriously everything you could hope for.Plus, they allow dogs. So it doesn't get any better!", "date": "10/18/2017"}, {"review_id": "Ezr5zeS27NAOb6fHE4qjlQ", "user_id": "xTyNw0IvQbIbZMWufm0aRQ", "user_name": "Crystal J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Came in about a week ago for a party and was surprised to see rock climbing since it's called pipework lol.We had never been but it was a cool site to see and the kids had a blast. They got to climb different walls with different levels of difficulty.The building also had a gymn on the other side of the building and it was large inside.The party helpers seemed super excited and happy to work with the kids", "date": "11/25/2016"}, {"review_id": "HmyVawCviRHM5fytEZ_XFg", "user_id": "ZIqedypXkcheImJ28pUSGw", "user_name": "Stephanie F.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I came here for a one night event and I had a splendid time!!AMBIENCEThe surrounding areas around Pipeworks is somewhat off of midtown where a good number of homeless people may be roaming so be aware of the surroundings/your belongings in your car. Aside from that, there is super ease of parking, and a nearby building where a brewery will be established in the next year. EXPERIENCEThe staff was super duper awesome and accommodating there. Pipeworks is more than just a gym, but rather a kind of community. It doesn't give the same \"meat head\" feel that normal gyms sometimes have, but rather that people are there for real fitness, not just aesthetics. We were shown around by Preston who was super energetic and gave us a tour of the gym. He also explained how Pipeworks is not only a climbing/bouldering gym, but also offers yoga, Pilates, martial arts, and cross-fit (for an additional $20ish dollars) classes. They also have a separate area for normal weights as well if that's what you chose to work out!  I went bouldering and my oh my, if I didn't already have a gym membership, I would have totally signed up that day! :[... There are different levels of difficulty for climbs, and also many different techniques to approach climbing, which is what's so great about the sport!I worked up a good sweat and am sure gonna be a bit sore but that's what a work out is for, right? Can't wait until I come again :) It's a great place for a date, and also as a home gym! I may switch over to this gym once my current membership is up!", "date": "7/28/2017"}, {"review_id": "kkmur6Fs9y37YVwS7aWFfA", "user_id": "MZWFVCQH49jICqlBqXeQug", "user_name": "Christina K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great place! Gym is available and yoga even! Just wish they would charge by the hour instead of $26 for a day pass ... A little too pricey. I could only stay for an hour and if I would've went by myself I wouldn't have known what to do. It was a fun experience and a little scary. Definitely a good workout!", "date": "9/26/2015"}, {"review_id": "WUs78NMd3lhXzZVdqdSyzQ", "user_id": "zazhhZCdT4hG8OwRAPWiug", "user_name": "Ori N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Great place for climbing- definitely enjoy the amount of space and difference in levels. Cubby space everywhere so you can store your stuff. There is also gym equipment (although I've only climbed) that looks very new. They also allow dogs!!", "date": "10/22/2016"}, {"review_id": "JkP5q895H6aG6AoOFVJybA", "user_id": "jNY255rUMhcY0s4n2VaUgA", "user_name": "George D.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is massive! Out of all the touchstone gyms I've been to this is my favorite. The bouldering area is sick.My palms are getting sweaty just thinking of it, where's my chalk?!", "date": "8/20/2017"}, {"review_id": "SEN2m4uP3GRHscwI7uOm-A", "user_id": "adKonsQWY64vJYglPotH5Q", "user_name": "Stefanie C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 3, "funny": 0, "cool": 2, "text": "This place is huge! My home climbing gyms are Mission Cliffs and Dogpatch Boulders. I've always wanted to visit Pipeworks because I'm from Sacramento, and I will definitely be going back more often. The staff members and facilities are nice. I think it was a special week when I went because most of the routes were faded (seemingly have not been changed in forever) and the staff was putting up new routes for a competition so half the bouldering area was unavailable. There are so many different components to Pipeworks, though. In addition to the vast and spacious top roping and bouldering areas, there are tons of open workout areas, with and without gym equipment. Another cool gym in the Touchstone family!", "date": "12/15/2015"}, {"review_id": "2o8bPwQFkBnkj2c84EyJFg", "user_id": "YXnA3Ux4T3ZEmQWk9mwBUg", "user_name": "Adam K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "The quick:  We have been climbing here for a week (after looking into it while we were there to let a kid climb for an hour), and we love it.  It's a great place, in addition to climbing they have tons of class activities, cross fit, workout area with cardio, free weights, machines.  Tons of rock climbing space, and tons of bouldering area.  It is a great way and a great place to work out, you can also drop in and get a day pass.The rest of the story:  The staff is amazing.  We took the intro to climbing course to get started, and it was super informative, and a lot of fun.  All the staff we have dealt with have been helpful, friendly, and full of knowledge to share.  We have started looking at getting our own gear so we don't have to rent every time, and after doing a ton of looking and research, I have found their prices are spot on.  They have a nice little pro shop with a good selection of harnesses, shoes, chalk bags, belay devices, anchors, books, clothes, etc....  I've found that there aren't a ton of places to buy climbing gear in Sac, so this pro shop is a great resource for both new climbers, and experienced climbers, and everyone in between.  They have some great resources available as well.  Info boards, clinics, a board where you can post to find climbing partners/friends, etc....  It's a great place to start climbing, or a great place to work on your skills and keep in shape for outdoor climbs.  The atmosphere is great, everybody is friendly, the place is dog friendly, as long as your dog is chill in an environment like that they are welcome, always several dogs hanging out.  Oh yeah, and a large indoor bike parking area.Looking forward to continuing climbing here several days a week and working up to outdoor climbing.  It really is a great way to get in shape, recreational, doesn't feel like you are working out at all.  You feel the burn, but it's so much fun it doesn't feel like work.  I really really love this place!!!Update:  We bought some climbing gear tonight so we don't have to keeping renting, and it was a great experience. Juan was extremely helpful, no pressure, lots of info, no trying to up-sell to something beyond what you need.  A really great experience just like everything else with Pipeworks.", "date": "3/13/2017"}, {"review_id": "ljasmddAF1oPsC0QRvqZmg", "user_id": "us1QZNEl5a96iFeNRC6BXA", "user_name": "Addison M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 4, "funny": 2, "cool": 3, "text": "Great rock climbing gym in the downtown Sacramento area. I come down here where I am in downtown other than that I don't really make special trips to pipeworks. The staff is very nice and helpful Jason has been there a while and has always helped me when I come down there and he even has some of his artwork displayed around the gym. Don't forget to pass your belay test. Climb on", "date": "10/23/2015"}, {"review_id": "HRCnY8feOLhD2fPhQakHug", "user_id": "er0HYy6mDWrtpIrM72kG_A", "user_name": "Drew G.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "THEY HAVE TAKEN ADVICE AND UPDATED THEIR BELAY METHOD! :)  Go to this gym, try climbing! Remember to look up what time their belay classes run because they don't do them all day.", "date": "12/29/2017"}, {"review_id": "8GYYcFKTfG5t2o1DlH7AdA", "user_id": "_2CNWXnIFKZ1QkCUhvwqqg", "user_name": "Melissa K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My son loves this place. He had so much fun he didn't want to leave. They have great beginner walls that are easy for kids to climb. The staff here is really friendly and helpful. I don't know much about rock climbing but everyone there was knowledgeable and answered all my questions.", "date": "9/19/2017"}, {"review_id": "HLBWIdlDITf7TqBjQMqXKg", "user_id": "9U88tstEtNxoM7Qs8rFAaQ", "user_name": "Chad Y.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Totally enjoy this place! I love the employees they are very customer service oriented and have noticed that they all like to say hi and bye.The gym is filled with rock climbing routes (both bouldering and top roping). In addition to climbing they have a nice gym and tons of cardio equipment. Pipeworks also provides yoga, cross fit, and a few other activities to keep the extreme active life changing. They also provide classes on how to climb and improve your current climbing skills which can come in handy later on.Aside from this they also have a nice small sauna and contain showers which look pretty clean and decent. Lockers are also available to store your valuables while you trek a few hours at this gym.The only drawback is that there are sooooo many homeless people in that neighborhood.  It's like a scene out of the walking dead on the side street. There is however an entrance at 16th which is nice to have. You can bypass all of the homeless this way. It is a little above downtown sac which is also convenient!", "date": "1/16/2016"}, {"review_id": "5ajzVyiNQxYU_vnVpZuQvQ", "user_id": "jrALVwTNvVvGeK02ibGiRg", "user_name": "Mollie H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 6, "funny": 2, "cool": 0, "text": "Pipeworks, how much do I love thee? Let me count the ways. Actually, that would take too long, so I'll just keep it brief...maybe.I joined in the summer of 2015 because they were running a special, and I was feeling adventurous. I'd never climbed a day in my life, and could stand to lose a couple of pounds (or like...30), so I figured, hey. Time to get in shape enough to climb! So I started going to the spin classes every day and trying out the other equipment--pretty much using everything except the climbing walls, because those were intimidating and terrifying to someone like me, who thought of fitness and \"working out\" as walking a few blocks in midtown to get to my favorite coffee shops. And I've never related to the people whom I refer to as \"the sad muscleheads\" who always look like they want to cry as they curl those weights in front of the mirror, then take swigs of those Mystery Neon Drinks for sustenance. I get it (sort of), but I was definitely looking for a more \"casual\" gym atmosphere where no one would judge my bright neon size L workout pants and discount Nike's.And \"casual\" is a perfect word to describe Pipeworks. First of all, everyone here is friendly. In over a year, I haven't seen much (if any) turnover in staff. To me, this means the people actually give a darn about their jobs and each other. They don't sales pitch you. They always say hello when you check in, and tell you to have a good day when you leave. Plus, sometimes they bring their dogs to work. Oh yeah. A huge perk of being a Pipeworks member: it's dog friendly! The fact that I get to pet dogs after a workout is a huge bonus to me. The only downside of this gym (and actually, most of the other Touchstone gyms I've visited) is that it's located in the crappy side of downtown. Be cautious driving/biking around it, and don't leave any valuables visible in your car. As long as you use common sense, you should be fine. I always think of driving to Pipeworks as like getting to an island. Once you're on the island, you're pretty good to go. Lock up your boat. Er, car. Now, the climbing. It took me 6 months of \"getting in shape enough to climb\" (see also: 6 months of being a scaredy cat) to actually try out climbing. I took the intro to climbing class where they taught me the basics, and I haven't looked back since. The top rope area is like a playground, and the bouldering area is huge (and for me, still challenging!). There's also a lead climbing area, but I have yet to muster up the courage to try that out. It's very easy to lose hours just trying out different routes--and they do a great job resetting them often to shake things up. The classes: they offer spin, yoga, and a few other classes. They also do a lot of climbing series events and instructional workshops. I wish they would add more spin (4 days a week isn't enough!), but they also offer cross fit if that's your thing. Maybe one day I'll brave that side of the wall...but until then, I have my top rope and spin classes. The instructors are all top-notch and super helpful. You won't find this kind of atmosphere anywhere else. Plus...I mean...dogs.", "date": "7/21/2016"}, {"review_id": "P1Umm4b3AshHX6b8jN5j1w", "user_id": "soaUQlE5c8UWwCIn7d0ilw", "user_name": "Brian K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Have I not written a review for Pipeworks?  That doesn't seem likely...  I've been going for about two years.In those two years, I've been fortunate enough to get to know the staff.  They are a great group of people and seem to enjoy working there.  They're never rude or in a bad mood.  The head guy's cool dude.  He gave me free beer and food.  I got a little carried away there.  Anyway...Pipeworks has a wide variety of classes and equipment.  It has classes in yoga, spinning, climbing, and cross-fit.  Their equipment includes bikes, weights, stair climbers, slack lines...  Most of all, the place has TONS of climbing walls.  If that's your sport, this is your gym!  You can even bring your dog!  Nobody will make a fuss.  It's a laid back, dog-loving, no worries kind of crowd here.  Man this gym is cool!", "date": "10/30/2015"}, {"review_id": "2lFXkprSTnEYDRw822DKYQ", "user_id": "B_Via1bKGdvbxcOfd988EQ", "user_name": "Mymy N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 7, "funny": 1, "cool": 3, "text": "Pipeworks is such a cool gym! In my quest to add variety to my workouts, I tried bouldering for the first time here. My friend Randall T. is a member and is allowed to bring one free guest per month and another free guest on the last Friday of the month. Cool perk for members and much appreciated for free guests like myself! My sister came through and paid $15 to be able to use the gym for the day. Pretty affordable drop-in rate. I also appreciated that the staff were chill and didn't push gym memberships on us. To climb, I had to fill out an electronic waiver on an iPad at the front desk and then get the special climbing shoes. I would say go up a half size to a full size if necessary because those shoes seemed to run small. My toes were crossed all crazy inside before I went up a half size! Then we headed to the back area where the bouldering section was. There are large cushioned mats on the floor so you can safely jump/fall down. The goal is to stay on the same color boulders as you climb up the wall to touch the last one of that color group at the top. The start and end are labeled by tape in coordinating colors.  The colors labeled V0 are the easiest and progress up to V10 I believe. They also seem to get respectively harder as the walls began to curve. I absolutely loved my experience, ripped callouses and all! Climbing was both mentally and physically challenging and a great work out. I'm addicted and can't wait to come back!", "date": "6/29/2016"}, {"review_id": "hBLiAUknjIoBwIu3pcXMrA", "user_id": "Hi0T4tXQWU48EweYwbpWcg", "user_name": "Anjelica C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I've been to 3 of the Touchstone gyms, and this one is my favorite.  First off, its giant which means everything has more space (and smells less like feet).  The routes are also longer which makes it more challenging and a better workout.  The boulder area is AMAZING. They also have a little workout area for the slack line, rings, and other random stuff.  They have a rope strung up if you feel so inclined to relive high school.  Wish I lived in this area so this could be my homebase gym.  Staff is always super friendly.  I took my 3 year old niece here to climb and the person working that day was extremely helpful.", "date": "1/19/2017"}, {"review_id": "JJ0vcieKfr1vvEy60hgZ0w", "user_id": "UNW31RDdBcN2M-mUpNvfeA", "user_name": "Eric S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Pipeworks has now become the standard in my mind against which all other gyms are judged (which can be dangerous).  I didn't realize how much I loved it until I moved away!It's HUGE, the routes are reset fairly often which keeps things interesting, the staff are awesome (and on their game making sure everyone stays safe), and every route or problem I've tried has been a fun challenge.  It's expensive, but worth every penny!", "date": "1/22/2017"}, {"review_id": "kdL_Vvfo7cIwEZXDqyX46A", "user_id": "6mgYTBGN1Ig2thDBCjmLwQ", "user_name": "Michael C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I'm biased, I'm a Touchstone member and junkie. Whenever I go to a city that has a Touchstone gym, I maximize my membership and make it a point to go to that gym. Look, all of the Touchstone climbing gyms are great. Pipeworks is definitely a bit greater in that it has lots of ropes AND lots of bouldering. You Sacramento folks have it good! If I lived in Sacramento, Pipeworks would definitely consume a good part of my free time.", "date": "11/22/2015"}, {"review_id": "UzEhQ-NyhFEviFBXpt0RYw", "user_id": "9cVyYciCoHXhncOT2psQmg", "user_name": "Tara A.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I went at night on a weekday and it was pretty busy! Everything went great and the place is awesome! I'm debating signing up for their gym but I their prices per month is fairly high, especially if I would only be going there to rock climb.", "date": "11/23/2016"}, {"review_id": "_-_PK43HwNyA69vJE5GLGQ", "user_id": "I1WqOqbLPoJ_Kw-Pp8AtEQ", "user_name": "Andrew N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "YAAAAAS!! Absolutely amazing! The coolest gym I've ever been to. It's extremely social; not many people wear headphones. Bouldering area has got to be the best in the Sacramento area and definitely better than Granite Arch. Membership is a tad pricey, but I doubt you'll find a more dynamic gym that provides the numerous work out options as this one does. Pipeworks = Awesome AF", "date": "7/12/2017"}, {"review_id": "2gjJO5H6nHu1b7UBKQgKxw", "user_id": "_kENUv9ZoaomCD3nWkIUDg", "user_name": "Sonja P.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place has changed a lot.  Before there was a small bouldering area, and now is half the size of Dogpatch.  It also includes a huge crossfit area next to the bouldering.  The climbing hasn't changed but seems high enough.  The bathrooms are clean.  I really enjoy this place.  It is also a nice place to just put your feet and take a nap on the couches; or study on the large tables.  It is a nice place to get away from the city.The cardio and weight rooms are sufficient.  There is even a large space to do gymnastics or yoga.", "date": "7/19/2016"}, {"review_id": "ZocQ8H135T2Y-by--Fd_WA", "user_id": "da-K_FIV2EprRG8-_Ajfiw", "user_name": "Linda V.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Despite what you may think you know about gyms and fitness centers, this place is pretty cool. The only bad part about Pipeworks is the location. If you were to imagine the worst spot in downtown Sacramento to put a gym, it would be where Pipeworks is currently at. I don't care too much about the gym being in a bad location, but I do wish it was in somewhat of a nicer place. Everything you can imagine fitness wise could be done at Pipeworks. Not everyone is so used to having so many options to choose from, but Pipeworks allows many different routes to take for your fitness goals. The facility has everything from cross fit, rock climbing, cardio, weights, and martial arts training. Every time I go this gym I have so many different options to choose from. For this reason alone, I believe it beats every other gym in the downtown Sacramento area. If you live in mid-town, east Sacramento, or even Natomas it is a great idea to check out this place. With so many different workouts to complete, you will never run out of fun activities to do. The gym has a lot of great members as well. There's been a lot of people that have stayed loyal to the gym for years. It doesn't surprise me at all though. Regardless of what your past experiences have been like at other gyms, this place is above everyone else. The only thing I wish they had was a swimming pool. Swimming is the best full body exercise anyone could do. It isn't the current management or staff's fault that there is no pool, but it would be a nice amenity to take advantage of. Check this place out if you want to get fit downtown, and have a blast.", "date": "11/30/2016"}, {"review_id": "20APfsCdzDfD-MouPNLL7A", "user_id": "YXuNCJFTfmq_rWJUM_ur_g", "user_name": "Samantha C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I took my 8 year old son to the kids belay class today. He previously only has had experience with climbing a few of those little towers at fairs. Preston was AWESOME helping the kids climb. He totally enjoyed what he was doing and was super positive and encouraging the kids. My son was SO STOKED and he said he wants to make sure Preston is there when he comes back...which he now wants to do every single weekend. He says he can't wait until he is an adult so he can go climb at Pipeworks every day. We are considering having his birthday party there now. The other kids in the class were having tons of fun too and all smiles. I thought $25 was kinda pricey for a one hour climb, but overall we had a great experience and it was totally worth it! Preston keep doing what you're doing!", "date": "3/12/2017"}, {"review_id": "tUqMwFkR6-og51CVtcXEFg", "user_id": "czITO24_p0Q6vbLIPfGtiA", "user_name": "T D.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I try to climb at Pipeworks a couple times a month to work on my climbing stamina and have been climbing here on and off for three years.What I like about Pipeworks: the wall height is great for sport climbing and working on your stamina.  The routes are changed routinely, the holds are color coded for easy route finding, and the worn holds are frequently replaced.What I dont like: The staff is extremely pretentious and wont pay attention to a customer if they are busily engaged in a non-work conversation with a friend and openly talks poorly about members and other climbing gyms in the area (very unprofessional).  The routes are very predictable and can get boring (holds screwed to plywood can only be so exciting).  Friends and I refer to Pipeworks as the plywood ladder gym.  I am always able to climb a full grade higher here than at another Sacramento climbing gym.Despite the dislikes, I still have fun climbing here, which is the point of coming but I could not find myself making this my primary gym or springing for the membership.  **If I was into bouldering, I may have a different impression of the climbing aspect of the gym.  Unfortunately, back issues prevent me from using the bouldering room.", "date": "4/20/2016"}, {"review_id": "n-YdCnMqX0Hd2wYMKacPhQ", "user_id": "UwRHhT1iP94QioH5TwFGvg", "user_name": "Emily T.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 6, "funny": 0, "cool": 6, "text": "Pipeworks is pretty awesome. The first time I came here, I stayed only in the top roping section. The second time I came here, I was amazed at how much bouldering they have to offer. I think this gym shines with their extensive bouldering, cushiony padding, and opportunities to top out on most routes. I've been here three times now. From what I can tell, the routes change pretty frequently. I would say that compared to other rock climbing gyms, they rate their top roping routes much more generously. It's kind of a good thing for beginners, because they can build up confidence right from the start!My only qualm about Pipeworks was some weird vibes I got from one of the workers. I've been climbing for 8 months now (at other gyms). On my third trip here, my friend told me that we could get a belay card so that we won't have to belay test every time we visit. This particular worker who tested me wouldn't give me a card despite my smooth and correct belaying and climbing setups because I didn't verbalize certain safety checks like \"double-backing\" my buckle on my harness, when my harness has the automatic mechanism. I know it's probably part of their policy, but I was really really peeved by this!Also strange is that they don't test people on using the proper terminology for climbing. I train my friends who come here to use the phrases \"on belay,\" \"climbing,\" and \"take.\" Safe climbing is all about communication. If the person on the ground doesn't know what take means, then the climber is surely in danger! Ah!I'm sure I will come back, but I will just hope for a different belay tester next time!", "date": "9/19/2015"}, {"review_id": "nl6QzWgN2XMCxqI_Ffn5Fg", "user_id": "3qmc6RH-qJfAVTYxe3kX8w", "user_name": "Steffi F.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "A group of 5 came for my friends birthday and we had a wonderful time! I decided not to climb and was allowed in to take photos and observe. My 4 friends paid for climbing-$18 each including harnesses and shoes. We arrived too late for a belay class but one in our group had past experience and was allowed to instruct us with a follow up test from a member of staff. Took a few minutes and they were off climbing.The building is a wonderful old warehouse with a huge open area in the middle for climbing. There is also a free climb area, a free weight section, weight machine section, cardio section and many workout classes. The locker rooms were clean with showers and a sauna. I was tempted to buy a membership right then and there! Great work parties, family events, or personal fitness!", "date": "4/22/2014"}, {"review_id": "o2_FuV6ZgDOZ4eHSxoLCBg", "user_id": "u0oq_togA9he6iBfhj5CPQ", "user_name": "Kelly B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Friendly and helpful staff, laid-back environment, and you can bring your dog! I signed up during a month when they waived their membership initiation fee - saving $100 gave me the motivation to try it out and I'm glad I did! They offer a state-employee discount too, which is really nice. It's a huge space, with tons of parking, clean facilities, and they provide towels at the front desk and mats for the pilates/yoga classes. They also have a free intro to climbing class for members. I've tried out their pilates and spin classes, and I wish they offered them more often! Neither are offered in the morning, and pilates is only twice a week. Spin especially was an amazing workout.  I did notice some of the bikes are old and have issues, so when people dropped in late a few of them had to hop around and find bikes that worked for them. The focus is really climbing here, but because there are spin classes offered, it would be awesome if the bikes were in good shape. But all in all it's a great gym and an amazing value for how much they offer! Check it out!", "date": "2/9/2016"}, {"review_id": "cs26-gnny-RZ11qImkOgBQ", "user_id": "ye6UcTnHi5conr-C25-RYQ", "user_name": "Kyle M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Everything you want in a gym. Friendly staff, always new climbing problems, great route setters, classes, people without dumb egos, cardio + weights, tons of training areas, and crossfit. Great place to meet and train with really cool Dow to earth people.", "date": "12/11/2016"}, {"review_id": "BFapewSwEHr6LQD2oVUwnw", "user_id": "5mG2ENw2PylIWElqHSMGqg", "user_name": "John H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 9, "funny": 7, "cool": 6, "text": "You have a century-old, brick warehouse with broken windows and 40 foot ceilings. What to do with it.Option A: tear it down and re-sell the used brick for someone's back patio. Build a drab, faceless office building.Option B: Put in a totally cool gym and first-rate climbing center with some of the tallest walls on the west coast.Glad they went with B. It's really a fun place to spend an afternoon and you'll challenge yourself in a completely different way. My daughter used to climb here and several of her teammates placed in the nationals. The gym has good equipment and the climbing instructors are really knowledgeable.If you've never had your kid's birthday party here, it will be a hit.On the downside, some guys like to walk around barefoot all the time. They lost a star for that one.", "date": "1/2/2013"}, {"review_id": "pDlRW8gR60XANSHC7GcxbQ", "user_id": "ozVQi33ddvRrvCo_aDa5nA", "user_name": "Maksim G.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 1, "cool": 2, "text": "Our family has been coming to PipeWorks since 01/17. We initially got passes because two of the kids that we adopted had add/ptsd, and with the guidance of their therapist we decided that bouldering/climbing would train their sensibilities to focus and remain calm in challenging situations. Needless to say we have been completely taken back by the progress of our kids, as well as how kid-friendly this gym is. Vaugh Medford and his staff, along with the members of the gym have been nice, warm, patient, and kind to us and our kiddos. We can't say enough nice things about this place.", "date": "6/12/2017"}, {"review_id": "czFklE3HqCnlSezEB4l7rQ", "user_id": "7RcRYbyK5Tgh7MmAGh1KLA", "user_name": "David L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "I came for the rock climbing and stayed for the jiu-jitsu.  Because like Bruce Lee famously once said: rock walls don't hit back.  Wait... or was that boards?  Anyway, this is a great place to learn the highly effective and extremely devastating south American martial art of Brazilian Jiu-jitsu.  After just 3 weeks of training here I had to register my hands as concealed weapons or else every time I stuck my hands in my pockets I was breaking the law.  Yeah, it's that serious...  But seriously, it's a great place to learn how to grapple.  Very family friendly and welcoming atmosphere.  Stepping on to the mats for the first time can be kind of intimidating, but everyone who trains here is super friendly and approachable.  And the type of people who train here runs the gamut from teenaged kids to local rock climbers to state workers just looking to get in better shape.  So if you have ever even entertained the thought of training jiu-jitsu, I can 100% recommend this place as a solid and fun place to learn.", "date": "5/18/2015"}, {"review_id": "WWwiL1wFTTe4J757TbDFOA", "user_id": "9Hl064L7vRqwtxOenbO43w", "user_name": "Brandon M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I went to the new bouldering area and it was fantastic. It had been a few years since I climbed last but when I did I climbed 5 days a week.This time I was able to attack every V0 and some V1s and even attempted a V2. Getting back on the wall was wonderful and I can't wait to go back. I have even been tempted to get a monthly pass because the downside is it's pretty expensive to go on a regular basis.A day pass without equipment is $20 and I don't know what shoes and a harness cost. Though $20 is a good chunk of change it's really worth it if you stay a while. That is what I love about rock climbing is you can feel comfortable climbing a few routes then taking a break to socialize. So I could see myself and my wife hanging out for a few hours IF we could find a friend to hang out with our son for a while.That is probably my dilemma, paying for two people to climb and then finding a baby sitter. Now it turns into a $60 to $80 day.Regardless of my situation this place is on point.", "date": "3/18/2015"}, {"review_id": "GKZ5-c6WFq-sc9HZJv_auQ", "user_id": "Wm41x0Rw17Bu71cf7EmuOA", "user_name": "S B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to take the grandson! The place is clean, the staff friendly, and the patrons helpful as this was our first time visiting Pipeworks. Now the whole family is planning to enjoy the walls and gym.", "date": "8/17/2017"}, {"review_id": "EVICHjN4g_SMugoa-udr1A", "user_id": "qEe-Flug7iwvu6Twe2HbTA", "user_name": "Rachel L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pipeworks is bigger than I thought, it has nice climbing walls. The lady at the front table is very nice to me. We rent equipments there. It has various wall and is label with difficulty levels. So I had a great experience there.", "date": "11/29/2015"}, {"review_id": "HCuqoKTyr5fP4Umk9ZlLWg", "user_id": "LgNeDwMRM3cXA7Rw4QpNmA", "user_name": "Brittany W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 5, "funny": 3, "cool": 4, "text": "I guess it's time for me to review Pipeworks, considering I've been here enough. I'm not overly athletic but my partner is. I preface that because I recognize its daunting getting into something like climbing. Im fortunate enough to have my partner to show me the ropes, but if you aren't in a similar situation don't fret :) Pipeworks has all the resources that you'll need. I've not been to many climbing facilities but I hear a lot of commentary of it via my partner, who used to work at one in another state, and has frequented many all over the country. He speaks highly of Pipeworks and I (who has been in climbing gyms in 3 states now) have to concur that this place is pretty great. They offer route and bouldering, which is cool. In addition to that they offer many classes (such as jujitsu, yoga, and more) as well as regular ole gym equipment and crossfit resources. *I would like to take this as an opportunity to inform you that there's no heater or AC should the conditions benefit from it. They do have what I presume to be swamp coolers. So heed my word, conditions might be COLD or HOT-weather dependent*  They have many helpful staff members as well as offering courses that will help get you up to speed if you don't have someone to show you the ropes. Don't be shy. This place has it going on!!", "date": "1/24/2016"}, {"review_id": "6NZr8x7tvbD6z7blLNcJ-g", "user_id": "iEEQI9A15N-_pYfz8Vwmvg", "user_name": "Allie D.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 5, "funny": 4, "cool": 5, "text": "Has it been a year and a half already? After being a member at this gym for that long and now experiencing it as a climber I stand by my five star rating because this place is AMAZING.When I first became a member, I joined for the fitness area, yoga and pilates. And all of that continues to be awesome. A year or so ago I started climbing with some friendly people I had met at the gym and now I have a hobby that I absolutely love. A talented team sets challenging new routes often enough to keep you from getting bored of climbing the same stuff and to keep you on your toes. There's something for everyone - a slab wall with balance and technique focused routes (my favorite), a crack, overhanging routes and lots of square footage for lead climbers. The people here are awesome. It's a welcoming community of folks who are passionate about the sport, and everyone was so helpful when I was just learning the ropes (ha. ha.). The climbers here challenge and support each other, while making sure everyone is safe.I'm not a fan of bouldering, but I can say the same about the bouldering area. And great news for those of you who do love it: Pipeworks is remodeling the recently vacated (and huge) building on their lot to be a massive separate bouldering gym with top out routes and everything!I can't say enough good things about this place. Pipeworks has become my home away from home and I'm happy to be here!", "date": "8/27/2014"}, {"review_id": "izolV5co7i1F55KNHOYsyQ", "user_id": "zapst-jTigHxOMv05tD3ZQ", "user_name": "Mary S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I think this is a pretty good gym if you're a climber. I've been a member here for about a year but I'm mostly into weightlifting and I feel increasingly disappointed. The weight area is a little less bro-y than some other gyms, but the non-climbing spaces in the gym feel increasingly crowded and less usable. There are often young children running around unsupervised, kicking balls and climbing on stuff (not the stuff they are supposed to be climbing on lol). I think what really did me in is that they now have acro-yoga on the main stretching/free weight mats at the time that most people are going to the gym after work. The acro-yoga people try to do cartwheels and headstands and fall over so you have to give them a wide berth if you don't want to get whacked. The trouble is, on the other side of the mats are the slack liners who are also falling off the slack line and you have to give them a wide berth if you don't want to get whacked.  But there's literally just not enough space. So if you want to go to the gym after work and stretch or do free weights you just have to constantly worry about people falling on you. I think pipeworks is the right gym if you're a hipster climber whose only non-climbing activities are acro yoga and slack lining. But I need to find another gym!", "date": "2/28/2018"}, {"review_id": "8wW_vesDx6_6UzTULzVHNQ", "user_id": "vMHl1VH7wkADkx2VCOloBw", "user_name": "Brett B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Training Brazilian Jiu Jitsu with Brad Sandoval has been a great addition to my fitness regimen.  Brad is a very technical black belt and puts on very informative and fun classes.  Also, being a member of Pipeworks gives you access to a ton of other fitness  outlets like rock climbing, yoga, weight training and cross fit.", "date": "5/10/2015"}, {"review_id": "ntNHn_9sHNQIASvFwC0ECg", "user_id": "2kFPOYA20PEoO-DQN4_GVQ", "user_name": "Jason B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 2, "cool": 3, "text": "There was a place that made me find salvation here in Sacramento...a place called home on the West Coast for me. \"You want to go...where everybody knows your name, and they're always glad you came. You wanna be where you can see, our troubles are all the same. You wanna be where everybody knows your name.\"You just need to come and find out why all of your friends are here, and you are not...YET. The best gym in Sacramento, hands down.", "date": "8/2/2014"}, {"review_id": "yNxjqQHNaHTWBl0XhycJrg", "user_id": "1nN4RNJrMSbQJHeyPUvAbQ", "user_name": "Lily L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "If I thought Stone Garden was scary, this place made me squeal with both excitement and anxiety. A group of friends and I went and were astounded by the massive 40 foot rock walls. Pipeworks has 11,000 square feet of climbing terrain, 2,000 square feet of bouldering, and over 70 top rope and lead climbs. Did I mention there was a full-fledge gym with classes in the back and a lounge area? Honestly, this sounds like the best after school or post work location to be. If I lived in Sacramento, I would request to live near Pipeworks. In a city as flat and wide as Sacramento, they can afford to have this much space for climbing lovers. Each wall has about one or two beginner-amateur routes and then the rest go straight for the gold. The walls do not look real, but they're structured in ways that real rocks are formed, lined with edges and jutting rocks to climb around. Owned by Touchstone Climbing Incorporated, this gym has a route setting team who rotate and ensure there are new routes every 2-12 weeks. If you love climbing and endeavoring to more challenges, Pipeworks creates that for it's climbers. Most of the staff have been climbing for over 8 years and are very knowledgeable and passionate about climbing. If you haven't climbed and you either live in or are traveling to Sacramento, I highly recommend Pipeworks.  Price for renting gear and climbing for a day is really affordable and you can always take your time if you're new. So far my one of my favorite places in Sacramento and surely a place I would revisit.", "date": "7/9/2014"}, {"review_id": "Q-lP6vQ6M_ysRbxlWmfM6g", "user_id": "uwdOxzIvhpWJV7SzMyVO1A", "user_name": "Paul C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 6, "funny": 1, "cool": 5, "text": "Love this place.  The rock walls are amazing - it's like Yosemite Valley in there. The free-climb area is spacious and challenging too.  You can work on inverted holds six feet off the pads. Great workout area, never crowded.  Love their yoga studio in the loft.  Instructors are great.  Staff is always friendly.  The merch area is well stocked.  Nice waiting area.  Good locker rooms.   Pipeworks is located in an old converted factory, a very cool spot.  One of the best gyms in town.", "date": "4/2/2012"}, {"review_id": "YYjd4ai6S8wJoOmCV74Iag", "user_id": "qLMT6tS074Opsaz4qkbjVg", "user_name": "Vince L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Not that I've been in a lot of rock gyms, but this place is really cool. very tall climbs, up to 45'. The place is relatively cool and the price seems reasonable. Will definitely come back. My 11y.o. daughter climbed to the top and had a blast.They also have a workout gym equipment, slacker line and boulder area. and yoga too I think. There's also a lounging area for taking a break or non-climbers. Staff was also very nice.", "date": "5/11/2013"}, {"review_id": "F5DSM6jNktUQPgjQcmyDvA", "user_id": "0wiTI9Qz7vrGn759eT1ahQ", "user_name": "B B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The new Boulder area is HERE!!!!! We just climbed it tonight! It's SO FUN! Pipeworks is now the largest climbing gym in California! The walls are higher and incredible for smearing. The holds are fantastic.  The routes are a BLAST! My son and I just spent three hours there tonight! I love the new top out wall where you climb to the top and walk down the back side. There routes are placed for all levels in mind. The new floors are Über thick and springy. So cool! Can't wait to for the last part of it to be completed: a huge crack wall to be done by the end of this week. :-) Can't wait to go back tomorrow morning!", "date": "1/27/2015"}, {"review_id": "XGNec7Zpm36IXxpzD0h0Lg", "user_id": "sUI1P5UBLtf9Ioxf234lTw", "user_name": "Mike W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best Touchstone gym (or indoor climbing gym, rather) I've been to. This place is huge! I love Mission Cliffs, but Pipeworks is basically MC's bigger, cooler brother. There's a lot of top roping, bouldering, and then - as an added bonus - there's a massive room in the back for cross fit-y things. If you're a climber in the Sacramento area, you should definitely stop by.", "date": "5/23/2016"}, {"review_id": "x5yLB98Vdl69SdovfGbhtg", "user_id": "idSLEy-1dNlMthmbiMaMJQ", "user_name": "Ashleen C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "I am so glad I decided to join this gym. I was looking for something more than yoga but a place that has a feel of community like my studio did and I found it here. The staff are so warm and loving and always has a smile on their face. I had some questions about their equipment and a staff member gave me 30+ minutes of their time to go over some things with me. Now if I were at 24 or some other big franchise I'd probably have to pay a trainer who would insist on going over them with me and oh yes I'd have to pay them but not at Pipe works. They also offer many classes and instructors are helpful too; cycling, yoga, Pilates are some of the many classes offered daily. And they have cross fit which i'm excited about. If you want to join a gym that offers great classes and more importantly is more personal then join PipeWorks.", "date": "4/21/2014"}, {"review_id": "UZwZ9ROIVyeAHleJrqLs9A", "user_id": "Zqb5oDkebCBbGj5Jil0H5Q", "user_name": "Reanne T.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "This place is awesome! I can't say enough good things about this gym. Everyone is super friendly and routes/problems are frequently changed. I love that in one location I can boulder, top rope, take a yoga or jiu jitsu class, and do cardio. The facility is dog-friendly and super clean. There are routes and problems for all skill levels. And if you need a belay partner, just ask the front desk and they'll find you one. I've taken the no-gi BJJ class with Brad. It's catered to beginners but provides a great workout and teaches the fundamentals of BJJ.  Love this place!", "date": "3/20/2012"}, {"review_id": "f3mnRkwY8ixxt-aNC_dBVw", "user_id": "jEVqZq_r0zd9GNrxbliGag", "user_name": "Adonis V.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 4, "funny": 6, "cool": 4, "text": "This is my third review so take it with a grain of salt...No, take it like gospel :)  Pipeworks is akin to a rare breed of wife you're married to, she'll get old and rusty (as evidenced by the growing number of transients in the area) but just like a great vintage of wine...she'll just get better with age.  I'm married to Pipeworks nigh a decade now and not a day goes by that she still doesn't surprise me and keep me on my toes.  All of a sudden she shed out of her cocoon and blossomed into a beautiful butterfly (as evidenced by the brand new paved parking lot when it used to be just mud and dirt).She's even transformed herself into a new hard bodied vixen (as evidenced by the the new building dedicated to CrossFit).  I mean, I can splurge for a $150 burger (average CrossFit membership) every now and then but, seriously, why do that when I can stay home and have prime steak?  (CrosFit is included in standard membership fees around $80 or less for civil servants).She's given me everything I need and simply gives more as the time rolls on.  I see this marriage going stronger and stronger as this match is ordained by the heavens.  Pipeworks, I'm happy to grow old with you for as long as I can...", "date": "12/2/2013"}, {"review_id": "X_JgEMG_hsNXdewS3DoCTw", "user_id": "7i1iH-l6S2IWW8lZU8Novw", "user_name": "Michael T.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you want to stay in shape without \"working out\" you need to do something that is fun. This is exactly that! Rock climbing, slackline, bjj, yoga, belly dance they have it all XD.  If you're into the more traditional gym equipment, spin classes, and crossfit classes they have that too.  The vibe here is friendly and inviting everyone is super nice, because that's juat how the outdoor community/climbing community is they like to look out for each other.  Best all around gym in Sacramento! Love it! And this is only my second time here!", "date": "4/5/2016"}, {"review_id": "Rve4UXnM4bbB6V0ajxb6mQ", "user_id": "Y6xqsh46ix4bc0FWdkfQSQ", "user_name": "Eric K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Awesome gym that has it all!The rock wall is very impressive with routes refreshed every month. There is a section for slab climbing and two walls connected by an amazing overhang that can be done if you are a lead climber. The bouldering section is a little small but it is decent enough to give you a variety. I would say most of the routes are creatively designed and fun!There are more options at this gym than you could imagine! These are the classes that are offered daily!1. Cycling2. Yoga3. Ju jitsu4. CrossFitThe one reason I chose to come to this gym is for the people. I recommend that if you just moved in the area and want to meet people while working out, check out Pipeworks!The membership is pricey at $70/ month but it is well justified for all of the amenities offered and an awesome community!", "date": "3/23/2014"}, {"review_id": "Ix1Y1B66tOD9jhnIVarIqA", "user_id": "1h3ojqjHLEIJm9HJKqX5fQ", "user_name": "Jason W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "You like to work out? Great. You like to climb stuff but scared of the pain in case you fall? Great. This place answers both of those issues with the rock climbing and weight section. Pretty good mix of walls to climb here and my only knock against the joint is that I don't think it has air conditioning, or it's never on when I'm here at least.", "date": "6/7/2014"}, {"review_id": "QDWCkIvQwTrBpZy3paKe4Q", "user_id": "ufRaUF4lOQlCz5FpD841MA", "user_name": "Vanessa J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place and was able to check it off my bucket-list. I suggest the class if you have never been the instructors are very helpful and you also get a pass to get in free 30 days after so you can come back and enjoy climbing.", "date": "9/10/2014"}, {"review_id": "c0uRgGw_Ugh7l1dOtlDvvw", "user_id": "RwRR4S6Q_FFW9bdnfUbYNQ", "user_name": "Edin L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place so much. The boulder room is fantastic- spacious, creative routes, and beautifully laid out. I spend hours in that room. The top rope and lead walls are also super fun and beautifully done. So many routes!! Did I mention I love this place??", "date": "1/30/2016"}, {"review_id": "h75VxVWnVvxmDImGxt0m2w", "user_id": "ebgL4kFL_Ayi6Mw52EE4NQ", "user_name": "Sarah W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 6, "funny": 1, "cool": 2, "text": "Joining Pipeworks is the best decision I've made all year. First of all, climbing is super fun. It's rough at first and it took me a couple of weeks to develop callouses on my fingers, but you improve very quickly. It's a great total body workout and it's addicting.Also, I LOVE their yoga classes. Each teacher has their own style and they switch up their classes all the time. Sometimes classes are calm and easy with an emphasis on balance or stretching. Sometimes they have hardcore power vinyassa classes that leave you drenched in sweat. I've had an off and on relationship with hot yoga for a couple years, but going to yoga classes here have really made me realize how much I love yoga. I've been going to the classes about 3x a week and my balance and flexibility have never been better. I honestly get excited for yoga class and get bummed when something comes up and I can't go.They also have regular gym stuff like treadmills, stationary bikes, ellipticals, free weights, a punching bag, weight machines, etc. They also have Cross Fit classes in its own little warehouse, if you're into that sort of thing. I'm still mustering up the courage to go check it out. There's also belly dancing, pilates, and jiu jitsu classes. It's a little bit more expensive than a regular gym membership at $68/mo, but for all the things you get it's a great deal.", "date": "7/5/2013"}, {"review_id": "xKwvwLBdcdYAWVJ3DF8xiQ", "user_id": "lAUuFp_TCtuQXOY_KIh_Gw", "user_name": "Jeff B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Rock climbing is a blast the Jiu jitsu class is a blast the instructor is very patient and knowledgable and the people that train are super friendly and helpful as well. I highly recommend this gym it's the best deal on Sacramento.", "date": "5/2/2016"}, {"review_id": "pQs2XAEnopnj3it94TpqTg", "user_id": "HDoMnqWbdZjHPrG9g7SmVg", "user_name": "Elizabeth N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I came here with a couple friends for the first time and I have to say, I was pretty intimidated by the height of the walls. I'm used to the Rocknasium out in Davis, which has shorter walls. It's a little pricey, but I guess you get what you pay for. I was surprised by how strict they were about the whole belay testing thing. You have to test several times before you can get a \"permanent\" card. Even over at Planet Granite in the bay they aren't that strict and over at Rocknasium, they don't make you test at all LOL. Overall though I had fun and I can't wait to come back.", "date": "10/23/2013"}, {"review_id": "guD0s3pZ7_62Od4QSvGI1Q", "user_id": "uQy_X2jXa3Dk53rhvdGTTw", "user_name": "Kevin S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Great climbing, great classes, great price but most of all, great people. This gym offers yoga, palates, jiujitsu, Crossfit, spinning, and climbing. The locker rooms are clean and the staff is amazing. Vaughn (the GM) truly takes into consideration the opinions of his members.", "date": "10/21/2013"}, {"review_id": "rzxKA6e3i5-4uLWrVqYzMQ", "user_id": "xF37DhTGYFb9V-3DbdO4CA", "user_name": "Chloe A.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very cheerful and jolly atmosphere in the gym. My kids appreciated climbing the wall and had a radiant time at Sacramento Pipeworks. I would recommend other people to come to this place and get there kids entertained and try out the rock climbing wall. After my kids tried out the rock climbing wall and played in the gym they got tired and slept very strong. Finally, come, stop by something new and challenge yourself to something current.", "date": "4/6/2016"}, {"review_id": "wGbq_bLrfFUtvbN_AnUqwA", "user_id": "EjOdjwWQ2dFUBVSc6dYB2w", "user_name": "Colin R.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vaughn, the manager, is one of the nicest guys out there.  It's obvious how much he cares about providing the best service.  Just taking to him can make my day.", "date": "2/13/2017"}, {"review_id": "05dlCeWuqQtbkNpHQnrYXA", "user_id": "1-NgfS2PBWLgGpbdhnRZMw", "user_name": "Kenneth C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great rock climbing gym. I just started taking their cross training class Tuesday and Thursday mornings and I love the teacher and the classI took the belly dancing class and it was fun but I wish they had a more active dance class like zumba.The yoga classes aren't very hard and done in a kind of chilly room, I wish that they could heat up the room so u get a real sweat on. The yoga teachers are wonderful and very helpful in helping u open up and get the form down correctly.I love that you can bring your dog to the gym. It has pretty much everything that u need in a gym.", "date": "9/16/2014"}, {"review_id": "dZUagwTv3JyZgoJeXV4wBw", "user_id": "ep8NBpLx5cfwy2CaE7cG4A", "user_name": "Helen H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I wanted to try something new, something active. That's when I came across Pipeworks on yelp. I never really thought about rock climbing before. I'm a tad bit scared of heights and have weak upper body strength. Luckily, my friend was interested in joining me. We decided to take the intro to climbing class ($29). The instructor taught us the basics of knot tying, belaying, and climbing. On my first climb, when the instructor told me to lean back in order to get down, I told her I didn't think I can do that. I was scared of falling. It's a matter of trust though, and if you knot correctly, then you'll be fine. After our knowledge was tested, we were free to make use of the climbing walls on our own. There are two reasons why I knocked off a star. The first being that it was hot inside; the fans didn't help much. The second reason is because the instructor was a bit rude when we checked in at the front desk. She seemed annoyed that she had to teach the class to my friend and I. During the class, she was helpful and knowledgeable but the initial impression was not favorable.Overall, I had a lot of fun, more fun than I thought I would've! It made me nervous when the holds were tiny and I may not always have made it to the top, but it was still a great experience. I'll try to climb higher next time.... maybe. (As part of the class, we were also given a free day pass for us to come back.) I walked away with a few bruises on my legs, and sore arms (the next day) but also a sense of pride and accomplishment. :)", "date": "8/29/2013"}, {"review_id": "vO2DTau7qNjAAyzudOQCXQ", "user_id": "po4CU_f9nrpNeQm5p0MCPw", "user_name": "Matthew M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Pipeworks is hands down the best gym I have ever been a member of.  I was a member last year when I lived in Sacramento.  Unfortunately in 2013 I moved to the LA area for work but I make a point of visiting Pipeworks every time I am in Sacramento.  The members of this gym are amazing and extremely nice.  The same is true of the staff who are not only extremely helpful but genuinely friendly, especially Tahnee, Kristen, and Natalie.  It is very obvious that they are climbing enthusiast who love where they work and enjoy being part of the Sacramento climbing scene.  I love how Pipeworks has a fully stocked weight lifting gym with quality equipment along with boxing heavy bags and great cardio equipment.  And it goes without saying that the climbing walls along with the bouldering area is top class.  Just an absolutely amazing gym!", "date": "12/24/2013"}, {"review_id": "nLsFJtFJNYwUZTtyT3N5SA", "user_id": "FM4zVQe5B9WMZM_JjDyvSA", "user_name": "Tiffany L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best touchstone climbing gym I've been to so far. Mats are so clean and the routes are great. Bathrooms are nice and the showers include nice amenities for the women. Employees are so sweet especially Ryan! The bouldering section is the best. Also love the dogs I see there!", "date": "1/15/2016"}, {"review_id": "W776g9cwYzSCb1qO6ty7UQ", "user_id": "aLhK880cHWLBZRmc5Ze3ag", "user_name": "Gardner H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "This gym is great.  They are known for their rock climbing, and it does not disappoint.  I've been a member since january, and they are constantly changing their routes. The staff is great.  They all take climbing very seriously but are down to earth and very approachable. Pipeworks is also attractive for someone looking for a more general gym as well.  They have a great free weight section, they offer a number of classes from yoga, to spin and BJJ.  They even have a separate building dedicated to CrossFit.  All in all, it's a great gym for the price. If i had to find one criticism, it's that parking can be hard sometimes.  But really it's not a criticism, its a symptom of a gym that is doing a lot of things right. Check it out. You wont be disappointed.", "date": "3/6/2013"}, {"review_id": "TcGiNHI8N5dDUDrx4s7d9A", "user_id": "LlDXqIOu_eEVU6sEOoss8g", "user_name": "Lisa L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym! Never thought I would ever have joined and learned to climb. This gym is amazing...it's so much fun!  The staff are nice, bouldering section is big, so much climbing to choose from, bathrooms are clean...you can even bring you dog! I have so much fun here!", "date": "12/8/2016"}, {"review_id": "sXu4WNWCh2fYw7YvTVol2w", "user_id": "9xx3xh1-Fd9inVPNgYbbQQ", "user_name": "Luci N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "Great place for rock climbing! This gym gets my vote for one of the coolest if not THE coolest gyms in Sacramento. I came here to try rock climbing for the first time.  First of all, I like that they are in an old warehouse - great that they made use of this empty space or it would be another abandoned warehouse. For your climbing needs- there are several walls and difficulty levels to try out plus boulder climbing area. I was impressed that they care enough to test you before you get started and they make sure you know what you're doing and you're not putting yourself in danger or your partner's when they're climbing. I had to know the 'points of safety' and how to belay. I didn't get it right the first time but they were patient and came back to check me again. Our guy was really helpful and explained the belaying techniques to me. Finally I passed and was ready, with shaky legs to do my first climb. It was a great experience and can't wait to try again.  BTW- you can check out an ipad from them I guess to use while you're on one of the cardio machines. There offer several classes- Yoga, Jiu Jitsu and more. The drop in rate is $12 and you can rent climbing gear too.", "date": "1/3/2013"}, {"review_id": "YIspnYGQwtAfVxdKauo1vg", "user_id": "toLm7SzE6qpJcXVed7na_w", "user_name": "Katy C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "What can I say that hasn't already been said? This place is rad. With the new addition of crossfit classes their membership is a total steal. My only complaints are that I wish they opened at 5am and were open later on sundays.update: I would just like to add that their yoga classes are GREAT. They offer three different styles (Hatha, Sivananda, & Vinyasa) and a meditation class so there is something for everyone. As I mentioned before, I just wish that they offered classes in the early morning so I could hit it up before work.", "date": "2/28/2013"}, {"review_id": "NS0dHMtGPuquGjbFExRwvA", "user_id": "S72WLoB1SUdLm0SBmp2law", "user_name": "Jenny W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "SO MUCH FUN! I've never been rock climbing before, so I was really excited to come here with my friend who has a membership. He's allowed to bring one guest each Friday and two guest every last Friday of the month, so I would only have to pay $5 for the shoe and harness (belay device is included). You have to test to be a climber and belayer, so you just learn to tie the knots and what to check for and show one of the employees when you are ready. I could only do two climbs before my forearms gave up on me, but it was really fun and challenging. The members/visitors are all friendly, and there are a ton of people bouldering or on the gym equipment or taking classes in the private rooms. People of all ages, pretty good distribution of guys/girls. Give this place a try, you won't regret it!", "date": "9/10/2012"}, {"review_id": "1oue3siXPvbWBAcEr60TXg", "user_id": "VPLYS4JZb6ekcVfQMQrl4w", "user_name": "Naomi J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "This place has a great vibe. Not full of the usual gym rat douche bags. Friendly folks, and a great atmosphere. I feel comfortable doing my thing in the gym, but the neighborhood is super sketchy. I wouldn't bike here alone at night. Other than that, I love it! Where else can you zone out doing an hour of cardio as you watch people climbing, practicing their right rope walking, and acrobatic skills as they balance on each other's heads?!", "date": "10/10/2014"}, {"review_id": "1TA-cuyvUUQHHrHoJTXGWg", "user_id": "1VFIZy-bxQfDsxKNsBiiQg", "user_name": "Daniel M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This place is nice inside but there is just to much going on. I feel it's not about the climbing but money and how big the place can be. The price is very expensive compared to other climbing locations . This is my person opinion but for people like me who likes a smaller more personal style businesses this is not for you..", "date": "7/1/2015"}, {"review_id": "E_DYQysOZ-MH96sDywjuQQ", "user_id": "-RsxLDYda6PJHVaoQlmcEw", "user_name": "D L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 8, "funny": 7, "cool": 4, "text": "This is one of the best indoor rock climbing facilities in Sactown. It also doubles as a gym.I often come in here to get my spider man turrets under control. They have a huge 40 foot high lead wall which is more than enough to get your north face fix. Plus some smaller walls to practice free climbing.In addition sometimes they'll put out a slack line for you dare devil junkies just don't get your \"special powers caught in the rope\" if you don't know what a slack line is here is a video link youtube.com/watch?v=eXiy…The staff is professional and knowledgeable and for new comers you can take a course for like 30 bucks then climb all you want. A must try if you're feeling commando.", "date": "3/21/2010"}, {"review_id": "Pc15yqG9UXk0_R727GfgnQ", "user_id": "gABWuEBJHqnbQPARfWK8-g", "user_name": "Logan J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 7, "funny": 7, "cool": 2, "text": "Funny, I'm at Pipeworks 4 days a week and it only just occurred to me to review it. Great people, best climbing terrain of any local gym, good snack options. Frequent route-changes. Fun events. Plenty of classes. Friendly, helpful employees, plenty of eye candy if you're into that. The temperature in there fluctuates a lot, due to the old, uninsulated building, so dress for the weather. Also plan on seeing lots of bare, male chests. Climber dudes like taking their shirts off. Doesn't matter how cold it might be. People wearing long pants, beanies and no shirt is a common sight. Good stuff. Room for improvement? Maybe free coffee. Shirts VS skins coed climbing comps. BYOB days. Live music. Free massages. I hope you're writing this down Pipeworks...", "date": "3/8/2012"}, {"review_id": "fUXcCdwd9KEhh54jMqpiUA", "user_id": "lqEr7O7RlOTOBaCDtPh4bw", "user_name": "Sam C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "What amazing facilities!! Great route setting too!! Only complaint would be one of the ladies who works the desk. Elena was very...umm... Best, nicest way to put it.... Curt and came across as condescending and rude. Not just once but during both our visits this was the case. Would still come back to this gem of a gym however because the facilities are so amazing. Maybe just get Elena some customer service 101 classes in the meantime?!? :)", "date": "6/23/2016"}, {"review_id": "b3iUhaeCQOy9MS4j--bX8g", "user_id": "m5nb4WNYldQpWd3ZEr05BQ", "user_name": "Drew T.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Totally my kind of gym. Plenty of variety and typical gym equipment, but the people here are so down to earth, unpretentious, and not fake barbies. Pretty good deal on Groupon didn't hurt either.", "date": "5/23/2012"}, {"review_id": "eNm87GQS8GyuZwsTooIHiw", "user_id": "0mP76PwDxamNMpO1qnHuhg", "user_name": "David P.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "This is the best place for rock climbing and/or bouldering in Sacramento. They have 3 caves for the bouldering with plenty of climbs for all skill levels. They don't rent out chalk bags but you can buy a block for a dollar. This place can get very crowded during peak times so try come during the odd hours to avoid waiting and congested caves. It is a bit expensive but definitely a lot of fun!", "date": "12/8/2013"}, {"review_id": "rWBDUg_AB1P4BCaIQCkOkw", "user_id": "svQV1AYggUDutCfN1RbBoQ", "user_name": "Brandon M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Checked out Pipeworks today with a couple friends that are members to see if I'd be interested in switching from 24 Hour Downtown. It's a huge space, great for climbers, ok weights/machines and cardio area. I give it 3 stars due to the pretty poor attitude the girl at the check-in counter had. She definitely did not make me feel welcome, nor did she take any time whatsoever to explain the features of the gym or being a member. I might check out the space again in the future, but for now I'll stick to the super friendly dudes and the awesome equipment at 24 Hour.", "date": "3/26/2015"}, {"review_id": "4QT_OJjoRNIFba3Fpwwtsw", "user_id": "Nxc82hWzuJVrdwzx93kQow", "user_name": "Brad L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is great.  For the price you get a membership to a full gym and rock climbing.  They have a decent selection of classes and all of the equipment you need.  It is also nice to go to a place where you do not have the body builder types grunting and dropping weights.  The people at Pipeworks are focused on the rock climbing walls.The walls are great.  They change the routes often and have enough that even when it is crowded you will not have to wait that long.  The staff is very friendly and laid back.  You can bring your dog and many people do.  The other climbers are very friendly once they realize you are not just there on a day pass.  It would be nice if it was open later on the weekends,  Also, the building gets hot in the summer and cold in the winter.", "date": "6/3/2012"}, {"review_id": "tVygjIcUBVqqcDkLmF9mCA", "user_id": "DeDWKTxJpBh3BzL2njeviw", "user_name": "Chris B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My home away from home. I really can't get enough of this place and in two years I have yet to have a bad experience here.I have been a member here for quite some time and as much as the experience has had a profound effect on my fitness, the camaraderie expressed by regular gym members creates a unique atmosphere at Pipeworks. Vaughn, Jason, and Natalie are all great members of the staff and are always helpful with my frequent inquiries. I can't say much that hasn't already been said but whether you like standard weight/cardio equipment, bouldering, top roping, lead climbing, yoga, spin, or even the occasional martial arts class; you'll love it here.", "date": "1/8/2012"}, {"review_id": "6bsizuzKryWGMCYiM0CQmw", "user_id": "J7fmfD8q5v64eAmHE4dI6w", "user_name": "Angie C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I have been a member of pipeworks since the day I moved to sacramento.  I have also tried the other two local gyms (Granite Arch and Rocknasium) and I can say without a doubt, it's the best climbing gym around.  Tall climbing walls, variety of routes, and great bouldering area.  Wide open spaces too.  The added benefit of this gym is that they offer a decent selection of cardio equipment, weights, yoga, etc.  Also free towel service, sauna, and locker rooms with showers.  The spinning classes leave a lot to be desired.  I have attended a couple different instructors and have been very disappointed with those classes.  But overall, it doesn't affect my opinion that PW is the best around.I have to admit, PW would be a 5-star gym if they added some real crack climbing to the gym.  To get my crack fix, I have to go to Granite Arch climbing gym or outside.", "date": "4/25/2012"}, {"review_id": "5UbuhimIvjxcl7DxxCpaRw", "user_id": "jh3T49O77o_qqQn7ixSZBQ", "user_name": "Carrie B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Pipeworks is absolutely amazing.Great staff with amazing knowledge about climbing, very welcoming, and ready to help you learn.  I was intimidated at first, with everyone watching and it being such an intense activity, but I realize that that was just silly.  The environment is very open, with many climbers very fun, talkative.  It has a great sense of community.They change the routes often, and have a pretty good sense of rating them.  They've changed the walls twice since I've been going and I've only been climbing about 3 months now.I thought the Yoga classes would be semi generic since its mainly a climbing gym with the other activities somewhat on the side, but the yoga was really amazing.  I'm a member of 24 hour, and I thought the yoga was MUCH better here.  Much more relaxing, with a more knowledgable instructor.  They also have martial arts classes, pilates, and a gym with most of the basics.", "date": "5/10/2012"}, {"review_id": "GsGxh7PAGrj4BjXBJDU0Vg", "user_id": "bNrX9563lEilgEjkTahk6Q", "user_name": "Arda S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great facility! The gym was very opened and offered many different types of routes. It is much larger than my usual indoor climbing gym which was nice. The staff was very friendly and very helpful. The only problem I had was the mat around the bouldering wall needed updating...didn't like it that when i jumped down, i got a foot stuck right into the mat. Overall great facility!", "date": "9/7/2014"}, {"review_id": "qMpeZrXyF4Bjp2_hPUv7jw", "user_id": "YFDQNnPD5_oPF5JVIf8U2A", "user_name": "Jen O.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 1, "useful": 10, "funny": 3, "cool": 2, "text": "I'm a member of the touchstone gyms down in the Bay Area and wanted to check out the gym in Sacramento for a change of scenery and was BLOWN AWAY by how rude the staff was. I will NEVER come back to this gym.I love Berkeley Ironworks!! I love San Francisco Mission Cliffs!!! I love Concord Diablo Rock!! And I love Oakland Great Western Power Company....BUT Sacramento Pipeworks??? YOU SUCK.I have never, ever had a bad experience with any of the other gyms. I go climbing about 4 days a week after work, and its the part of my day that I look forward to. I got to the gym at about 10:30 and left at about 11:00. The employees were so rude I can't even believe it. I still think back to it and it amazes me. They were hassling me about my membership card, they hassled me over my belay card. Okay, I'm done with my rant.", "date": "3/13/2011"}, {"review_id": "3Nd4GTXQzCzUhaIL_2Q-vQ", "user_id": "ojz_Kpx-41nMKw0hwCBtZQ", "user_name": "Michelle L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 19, "funny": 5, "cool": 2, "text": "First off, I love Pipeworks. They have a great gym and climbing facility.  They would easily earn 4 or 5 stars on any of my previous visits but my most recent experience left a sour taste in my mouth.I brought in a friend who is new to climbing. I enrolled us in an introductory class to learn the basics.  When I checked in, I was taken aback by the rudeness of the employees at the front desk. We arrived at 7:28, just before the time our class was scheduled to start.  I apologized for cutting it close to which they (Jason and Diane) rolled their eyes.  The staff continued to mention our lateness  multiple times and that we had inconvenienced the rest of the class by arriving late (\"They have been waiting for a hour half for you\", \"Let's go get the guys that you made wait\").  We filled out the paperwork and signed the releases and arrived to class at 7:32 (2 minutes late).The class went well and Jason, who was also our instructor, helped my friend learn the basics and get comfortable.  During our class, I apologized to our classmates for our tardiness and they were surprised.  They told us that they had arrived only a couple of minutes before us.I find it troubling that the staff felt the need to belabor the fact that we were late after multiple apologies to both them and our classmates.  Considering that our classmates acknowledged that they did not wait at all for us makes their behavior even more rude.While I really enjoy the facilities, the condescending behavior of the staff put a damper on the evening and unfortunately overshadowed what could have easily been a positive experience.", "date": "2/23/2011"}, {"review_id": "Miew3cDFBv7ybfDTttLPFw", "user_id": "8rCzL_xMQ3Fn0sPVX7VixQ", "user_name": "Vicky P.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best gym ever.  Not only you get the climbing experience but they also offer classes such as yoga, crossfit, cycling, and even belly dancing! It is great for kids and animals as well!", "date": "7/17/2014"}, {"review_id": "9mRiIwsWqjRlBtJwEnh5rg", "user_id": "a9rhAZ5ceOCBG9wmf-iT7A", "user_name": "Cat F.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My boyfriend and I came here today for the first time and we absolutely loved it. Neither of us is very experienced with climbing, so we took the belay class and rented equipment and a day pass, all for $29 each. The instructor, Solomon, was very clear, nice, and helpful and we felt comfortable and ready to climb like pros right away. The place spacious and everyone is very friendly. The rock climbing walls are great, and the gym with all the exercise equipment looked fantastic, though we didn't use it today. This was a fun place to hang out all day; we hung out on the couches for a while, ate our sandwiches, played with some of the dogs that people brought in, and of course, climbed and had so much fun. I highly recommend this and I would love to become a member!", "date": "2/11/2012"}, {"review_id": "cUIrRy-B2kDROv-vW6pu_w", "user_id": "Zkh0t5NmHslE51AzZhnu4A", "user_name": "Chris A.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "Amazing gym. Not a globo gym!  $65/ month gets you everything: endless top rope climbing, bouldering, tons of cardio equipment (including the lesser seen rowing machines and step mill), punching bags, gymnastic rings, kettlebells, free weights, weight machines, yoga, pilates, ju jitzu.Great staff, hours of operation are more than adequate, climbing routes are changed at a perfect rate, fun and friendly clientele. I can't say enough. I love it.", "date": "2/14/2012"}, {"review_id": "Rpqm-l1PndDprejoZWuc1A", "user_id": "shVyD312LNnLUvQEPdzo7g", "user_name": "Alison W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "When my friend suggested rock climbing, I was in. I'd done it recreationally a few times before in my life. Little did I know how methodical and complicated it was. Oh and also my friend actually meant bouldering. I'd never done bouldering but fine, I'll try it. First off, this place is located in north downtown-ish with a big parking lot. And apparently they have a mini gym and classes (youga, crossfit, etc) you can also take. We signed a waiver and just ended up getting a day pass and shoe rentals. For regular rockclimbing, you can also rent a harness. It was all less than $20 (before 3pm, think it's a little more after). There's a locker/ bathroom to use but also just shelves and cubbies along the floor to stash your stuff. Anyways being a first timer, I didn't know there were levels and actual \"routes\" you take to climb your way to the top. This makes it an actual challenge, I suppose. But man, what a hard workout - you're your arms and legs. I have like no upper body strength so now, a few days later, I'm still sore and hurting. The worse was the day after though. I guess if you come here regularly, that's not an issue. I was able to complete one route fully without cheating so I was happy, being my first time. Oh and don't forget to bring your own chalk to protect your hands. If I go back, I hope to accomplish more and maybe try straightforward rock climbing. That may require a class to get the belaying part down though.", "date": "11/19/2013"}, {"review_id": "GR75DOXrM4i7eka56FSq1w", "user_id": "lOSYSSDFctTXOvPRtQ1MRg", "user_name": "Scott B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I can't think of anything bad about Pipeworks.  World-class climbing gym, free yoga, full cardio gym with treadmills, ellipticals, spin classes, etc, amazing staff... and pardon my french, but this place has the least \"douchy\" members of any gym I've experrienced.  I initially thought that the climber-type members here would be a very jocky d-baggy group, but I was very very wrong.  Climbers, at least at this gym, are the friendliest, most accepting group of athletes there is.  And I'm proud to now count myself as one of them", "date": "5/9/2012"}, {"review_id": "ifpGRbInc_ZBMaavpktNxA", "user_id": "ZjknSPgDNQGawU8CcgR4pQ", "user_name": "Kahikina R.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "Coolest gym ever. I just started coming here but I love that they add new routes on their walls to keep us challenged. The staff is always friendly and ready to help.  The atmosphere is really laid back.  People are here to actually workout, not walk around and flex or show off, imagine that!", "date": "6/13/2013"}, {"review_id": "KziX6GVOjX2OHE4a17qNYA", "user_id": "9IFTHSUykOACAQ-Q_KzwHw", "user_name": "Elaine F.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "This place is awesome.  I really appreciate being able to climb, boulder, cycle, yoga, and do whatever in a space that's really open and welcoming.  Unlike other fitness gyms, it's a very relaxed environment.   I just got in on the zero initiation fees (going on for a few more days) so it's been a great deal so far!  Been coming a few times a week for the last couple weeks.  The staff is always super friendly, whether I'm there at 6:30 AM or PM.  Since it's part of the Touchstone Climbing group, we get to climb with friends at Mission Cliffs when we're in the city too!  Looking forward to updates on some of their classes, workshops, and other happenings.", "date": "1/29/2013"}, {"review_id": "GyzIVDS84LtboQoUW43lkA", "user_id": "Uh5O-ilK0yT7zUMMg3YT6Q", "user_name": "Nicolas L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome climbing Gym.  Spacious and with a lot of variety.", "date": "12/17/2015"}, {"review_id": "aRyRJ7neT9BieaanLzjKFA", "user_id": "rg70NRZVHtY4LQpVKR3x8A", "user_name": "Bill C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I've been a member of a number of gyms before and as odd as it sounds, I joined Pipeworks to work out, not to climb.What I liked about it was the laid back atmosphere- it wasn't some uptight fitness club, and it didn't seem like they were trying to sell me a lifetime membership with high pressure tactics. The fitness equipment was clean (other than the bit of climbing chalk) and well maintained. They had all the equipment and free weights that I like to use, as well as climber specific gear.The gym is a haven for the kids. My kids liked to climb and their running around and being loud didn't bother anybody. It also kept them active either climbing the bouldering walls or the roped courses. It's also not uncommon to see people bring in their (friendly) dogs.The climbing/bouldering courses are changed frequently and go from very simple to sadistically impossible.They also sell a fairly decent amount of food/drink, have internet access, and cable TV. Their pro shop has some great stuff and the prices are comparable to REI.I really love Pipeworks. I recently had to leave the gym due to a move to another town, but I still drive by Pipeworks occasionally and wish I could rejoin.I did check out a competitor of theirs- Granite Arches and was not impressed. It was dark and dirty and their actual workout equipment was garbage. Too bad really, because I could really use another Pipeworks experience closer to my home.Check it out for free, there is lots of fun and fitness to be had at Pipeworks.", "date": "6/4/2011"}, {"review_id": "bseBuDY-A8mA3UJ1xf5-ZQ", "user_id": "3cJsY18AzCmb-JzEF1Kizw", "user_name": "Merisa M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This place was huge! I wasn't expecting the rock climbing walls to go up so high.I've been rock climbing to other places before, but this one is definitely the best.  They have an area for bouldering and an area for beginners.  I liked how the different \"courses\" were mapped out and their group lessons were very clear.I'd definitely go back again!", "date": "5/9/2011"}, {"review_id": "tfonfqAL9mM2ykr0TR5NKQ", "user_id": "VshCwd6NJy-JSGU1nneNtQ", "user_name": "Shelly S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My kids came here for a birthday party and they had such a great time.  The staff here is incredible.  They showed genuine interest and patience in helping the kids, many of whom have never rock climbed before. At the start of the party, the kids were shown all the basics and instructions on safety, proper grip and how to maneuver through the different rocks to go higher.  The instructors also encouraged them and guided them on which rocks to go to next and that made the kids felt more confident that they could do it.After starting with the beginning wall, the kids were then brought into the main rock climbing area where they were allowed to go much higher and experience varying levels of difficulties. You could tell that all the kids enjoyed rock climbing so much because they barely wanted to stop rock climbing to eat pizza and birthday cake!  I would highly recommend this place for anyone with kids looking for a fun place to host a birthday party.  The only downside of this place is that it is a little difficult to find, and we ended up going through this one area of town that had a fairly large amount of homeless people milling about.", "date": "6/18/2014"}, {"review_id": "uZKxU6O7eO5vIdoDHC7Nlw", "user_id": "EqQepaEf86zU-BhGlIVxkw", "user_name": "Rachel E.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the most beautiful gym I have ever climbed. It's definitely a unique structure. I did have a difficult time locating it and the area has a lot of homeless folk. The building itself is has a bit of a factory/warehouse feel to it. I walked in and filled out a waiver. While I was waiting, I noticed the staff that was occupied were being very thorough about safety and belaying. The facility was awesome. They had a lot of sport climbing, and a good sized bouldering section. The back has all the exercise equipment and is a great option as a member to workout on an off day. They had towels at the front desk. The bathrooms had a roomy locker area, showers, and I think a sauna as well. The sport routes were tall. I didn't have a belay partner, but those routes were awesomely long. The bouldering had a flexible floor with crash pads spread throughout. I enjoyed the routes in the bouldering area and I was able to try out the starts to a lot of sport routes. They was a variety of setting styles. The routes felt a bit soft for the ratings. Also, it was a bit on the warmer side in the gym. There are a ton of fans throughout but I felt like the holds were getting greased up/slippery.", "date": "5/25/2014"}, {"review_id": "sSY7KscYl4jv1tAbovgvEQ", "user_id": "zoOACYF-JDF9YV5vkAkcxQ", "user_name": "Norma Denisse S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love the atmosphere! A great place for a date or catch up with friends. My boyfriend and I had actually found a great offer for introductory lessons on climbing. Let me just say it was addicting. I mean they really drill you on the rules and that is awesome. I want to be safe and knowledgeable while up in the air.  My boyfriend loved this place too, I found out I was best at belaying. A joint-replacement in my arm keeps me from pushing myself to the limit but it didn't stop me from trying. They also have  a gym which is cool too bad we didnt come prepared.*Dog friendly, I saw some well behaved dogs.", "date": "11/5/2011"}, {"review_id": "5rqP2dpbrVM-4z2yXftcww", "user_id": "P6uXPlerJDzgSuQ52m4RMg", "user_name": "Janet L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love the atmosphere, the people, the climbs.I JUST started climbing so I was a little intimidated going in, but I could not have felt more welcome. Even though I was with my friend who has climbed for years, there were complete strangers who were encouraging me.I think I\"ll be coming here on a regular basis from now on.", "date": "12/12/2011"}, {"review_id": "0sEhp0qWAwjzZmD9E5gXTw", "user_id": "LU2NT3qFrG1p_4uEU0YOTA", "user_name": "Erica N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "This place is wonderful, as are the instructors and the people that attend the gym. I took my boyfriend here as an anniversary present on a Sunday, and it was a great gift to both of us. We took the introduction to climbing pass which cost both of us together $58. With that class we had are equipment, an hour of instruction and the chance to use the walls for the rest of the day. They also threw in a free day pass for the next time we want to go! The staff was incredibly helpful and the gym has such a great atmosphere. I can't wait to visit again.", "date": "12/16/2012"}, {"review_id": "r5n3Rog0fwe2Yw0MlngYzQ", "user_id": "2gGMOAMnY5C0Z6q4i-_qGg", "user_name": "Betty H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love climbing here!   The staff is incredibly friendly, which makes this place feel more welcoming than most other gyms.  I feel completely at ease here, with great people to climb next to and their lovable pets too.  The facility is huge and spacious, and have a variety of walls to climb.  They are constantly updating the routes, so you always have something new to try every month.  Most importantly, the routes are doable and challenging at the same time; the really do label the level of difficulty appropriately and have so many to choose from.  Come try the place out!  Also, try joining their facebook group!  They send updates on special deals, classes, and trips that their staff and members go on.", "date": "1/1/2012"}, {"review_id": "m9AqrvMLMQqozEaZTh5JMg", "user_id": "BVnf5WZh01WaAw8F3CL_hA", "user_name": "Jennifer H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I had wanted to do this as a date night for a while and lucky for me my bf basically goes along with all of my ideas.  We decided to go with another couple and based on the easiest place for us to all meet up Pipeworks was the choice.I must admit that while I was excited to learn/relearn how to rock climb I was nervous about this because they are affiliated with Mission Cliffs in San Francisco and I had the worst experience ever when I tried to go to that gym.  But that is a story for a completely different review.We arrived on a Thursday night just in time for the 7:30 intro to rock climbing class.  We were able to quickly fill out our paper work and get our climbing gear.  We then waited for the class to begin.  We learned all of the basics and all of us liked that our instructor made sure we really knew what we were doing before she let us climb on our own.  We stayed until closing and all of us had a great time and enjoyed ourselves.  All of us left feeling very confident about our new found knowledge.  We felt the staff was friendly, helpful and aware of what was happening and the safety of the climbers in the gym.  I will definitely be returning, probably this week.", "date": "4/19/2011"}, {"review_id": "mAo8DrfEetam2IPG44r6vA", "user_id": "5F4PYbImBn3rv0WHewjiyw", "user_name": "Annie L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 3, "funny": 2, "cool": 0, "text": "I've never done rock climbing before until two months ago.  A lot of my friends told me that I should come here to try out rock climbing.  Since I am into trying out new things, I decided to go with a few coworkers.  I had a great time and have already went back a second time with some friends.  It is a lot of fun once you get into it.  If you like to have some fun and do something challenge, rock climbing is definitely one fun activity to do.", "date": "7/10/2012"}, {"review_id": "cXpLh0u9azQnqzGLznJDMA", "user_id": "15MkGQvNUbNS-CuatSiMOQ", "user_name": "Ronald L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Wife and I tried the indoor rock climbing. The staff was excellent and very detailed in training you to belay. After about an hour, we were ready to go. we climbed for a few hours before stopping out of exhaustion. We have now found a new hobby to do together. We'll take friends the next time and the kids after that.", "date": "4/21/2013"}, {"review_id": "r4ooq6Zu2iMMPNlcxxxGvw", "user_id": "HZUCD031f6h1IBBwFm79cw", "user_name": "Kim H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "I am reviewing this as a first timer who has never rock climbed at a place like this before. The staff was friendly enough but not too inviting. I went with 3 other people none of which have been there before and we told them it was our first time and all they did was take our money and get us shoes. They explained nothing. We did the bouldering because we didn't want to spend the extra money to take an hour class to learn how to do the ropes. When we first get in we were looking around (what I would normally do being somewhere for the first time) Towards the back there is a workout space and we go in to look at it because it looked pretty cool and right away we get a stern talking to. He didn't yell but was pretty rude, I guess they have classes in there and you're not supposed to go in there. We did not know that and we were not being loud or disruptive there was no reason for him to be so rude about it. Right away me and another one from our group gets turned off from the place. We had no instruction and within 5 minutes we get in trouble so for the rest of our time there I couldn't really enjoy myself because I thought I was going to do something wrong and get \"talked to again\" As for the climbing it took us a minute to figure out all the colors and numbers. It would have been a lot easier if someone would have explained us the rules and which walls to climb. This place is pretty pricey, we paid $15 to climb and $4 for shoes and that was discounted, I definitely expected a better experience. We ended up having a good time because a friend of ours met us there and was able to explain everything to us. Without him coming this probably would have been rated a one. An introduction to the place when we paid could have made it a great experience, but that is not the way it went. This might be a great place for people who climb all the time, but it did not feel welcoming to new comers.", "date": "1/30/2016"}, {"review_id": "EJIDkda5zUKmq4X--Cve1w", "user_id": "J33IMVtyAGXhb92JWZC9RA", "user_name": "Amanda S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 4, "funny": 2, "cool": 3, "text": "Yoga here with Robert is life-altering. The desk staff is awesome. Great bouldering area and the top rope runs change often enough so that you don't get bored. Great place to meet people, IMO. Did someone really complain about the men with shirts off here? Just kidding, Jade. But really, I don't mind this. At all.", "date": "4/4/2010"}, {"review_id": "ZW18tp0EN6cdm64DqZhVHg", "user_id": "cYQLmb9SrOErs0yeCDQ6eA", "user_name": "Justin A.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I feel so fortunate that I found this facility. I moved from the Bay Area and really missed climbing once a month. this facility is so clean and reasonably priced I signed up for membership! you should too...", "date": "10/3/2013"}, {"review_id": "rJD5r795a9bBcC6rQtq5PQ", "user_id": "5wf-b9hqWbWWPMg_FU50QA", "user_name": "Darina H.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Do you want to get a good work out with friends? Come to Pipeworks for some indoor rock climbing. If you go on the last Friday of each month and you know someone who is a member, they can possibly get you in for free. I was reading the details about the membership plan and boy is it costly. I think in the future when I have a little more spending money, I'll invest in this place. They also have yoga, gym service and belly dancing classes for members! Cool!The indoor rock climbing is pretty fun. Once you test out of the belaying process and you're trained in how to climb safely, you'll be on your way to great fun. My friends and I went last week and it was  a blast. I tried the easier courses first before going onto the more challenging courses. Bring chalk or use chalk because you'll need it. My arms are still feeling it! I love coming here! Staff are pretty friendly as well. It really does make me feel like I live in an enriching community when I come here. Everyone is super nice and I feel like hugging someone whenever I'm here.", "date": "2/1/2011"}, {"review_id": "xbnTGRKMjRFknP9veaZhHQ", "user_id": "EkyM6r2HvQcShwIh7WhjwA", "user_name": "Rachel D.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The customer service is extremely helpful. Jonathon went above and beyond to help my entire family learn about all the safety procedures, as well as helpful tips for an awesome experience. I highly recommend Pipeworks as a place to have a fun family day. There are an array of climbs for all skill levels, and all the walls are labeled with ratings for difficulty so you know what you are getting yourself into ahead of time. Just a fun place to be and you get a great work out!", "date": "7/13/2013"}, {"review_id": "tDAIb45o7f8L9J7J0lS2Hw", "user_id": "WjNFKmwi24QGAIaaWnd7Bw", "user_name": "isaias J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We hit Sacramento Pipeworks on the way to Reno. Wish we could make it up there more often. Huge bouldering area. And great top roping, plus we basically had the gym to ourselves since we showed up right at 9am ;-)", "date": "1/29/2013"}, {"review_id": "sYtp9OxxdYhGJ7HQDoFBLA", "user_id": "BX2WFPgY34eqTiq6bgCiUg", "user_name": "Mario S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Awesome place! only received 4 stars out of 5 due to the hour drive to get there which i suppose isn't there fault. Looks to have a decent gym as well.If you can find someone to teach you the Knots and how to belay someone you can save money from taking the class. You just need to prove that you are knowledgeable in the equipment.", "date": "11/17/2010"}, {"review_id": "sByuPHSZsf2c4tbyQR5A2Q", "user_id": "_SVfoi3YUFNHswsfZUO9mg", "user_name": "Mikey U.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 7, "funny": 4, "cool": 5, "text": "A fun Touchstone climbing gym with a nice decor and ambiance!The medium sized layout (11k square feet) and midrange height (40ft tall lead walls) gives this facility a personable and cozy feel that isn't as readily felt at similar facilities in busier metropolitans (the similar-sized Mission Cliffs in SF seems a little crowded by comparison).We (4) arrived shortly before 5pm on a Thursday to find the gym nearly empty.  By 6pm, it had picked up somewhat, but no shortage of routes/ropes to ascend. By 8pm, attendance seemed to have peaked and still any route we sought was ready and available... AWESOME; no pressure to rush a climb, no intimidation of crowds or peering eyes, no din of noise... quite peaceful for regular climbers and a welcoming environment to new/beginning climbers.The bouldering area is comprised of three alcoves, much of which offering naturals, features, and overhangs, making even the V0/1/2s more demanding than I've encountered at other facilities.For the lead/rope walls, it appears that the routes are evenly distributed between lead and top-rope (where as other gyms have top-ropes on most routes with lead clips as an option on about half).  Featuring (at least two prominent) arches, lengthy negatives, varying steeps, and jutting overhangs, the climbing here is fun and engaging. (Although, some of the more interesting 5.9s, 10a's, and 10b's I wanted to climb were lead-only, and none of us are lead-cert'd!)  40ft tall walls are a good range, but something about climbing above and beyond the rafters and crossbeams of the re-purposed industrial warehouse make the climbs seem higher... FUN!Altogether a nice gym! Definitely will hit it up again next time I'm in Sactown!___________________________I played hookie from work.  Went to Esco's.  Drove up to Sac. Picked up RB and 'Becca. Climbed for five hours! AWE.SOME.DAY!", "date": "8/22/2009"}, {"review_id": "9ZEq5O8fkMx_97Ht5U5s4w", "user_id": "Zmkp4QnC-bF9z17bCshBOA", "user_name": "Sean S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 1, "useful": 4, "funny": 1, "cool": 0, "text": "... $18- to climb for an hour or two is absolutely absurd... Especially in today's economy... and especially if one is only Bouldering...  Can u say GREED?No Thanks.", "date": "10/1/2011"}, {"review_id": "PzatxYKz1TvHA3MhbOTdxQ", "user_id": "Ayxa14skw7ogJy6Vv8ecjA", "user_name": "Jade B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Rad everything, one small complaint: men should HAVE to wear shirts at all times. Yay otherwise, the bouldering area is huge and the top roping is abundant. You can always find something to do - even when it is busy.", "date": "4/1/2010"}, {"review_id": "yq6bkxzI5-OYUKU5jwQ2AA", "user_id": "YxAKByP-we-ku57XWjjnwQ", "user_name": "Kimberly E.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "I agree with Jen O.... the staff was sooooooooo RUDE!!! the lady at the front was so cold and the least friendly person i have ever met. she couldnt even say hi. it seemed like me being there was an annoyance to her. Im sorry, but dont you want my business? I will never go back.", "date": "2/18/2012"}, {"review_id": "NZNPQCnXsNP8st6Qrff-6w", "user_id": "C3aWYjdI3xZIaFOuswnu6A", "user_name": "Janet T.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Enjoyed the climbs. The staff seemed a bit impatient every time I came for an intro class though.", "date": "5/16/2012"}, {"review_id": "HWBdwWRkQvM7iND9LFx6iA", "user_id": "hhSSbB8Ci798DM7xlDYGdQ", "user_name": "Monu K.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is great.  I am very new to climbing and coming here was a lot of fun.  This gym really has a lot to offer in regards to what you can do there.  The instructor that taught the how-to class about climbing was extremely patient and helpful too.  Really made feel at ease regarding a relatively scary experience... climbing for the first time.  I really have no complaints about this place.  I will go again!", "date": "2/25/2010"}, {"review_id": "Khdo6mmPrd35q328b2OheA", "user_id": "uVZTAn0NfW1T7JTZm5h9kA", "user_name": "elizabeth c.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 5, "funny": 11, "cool": 5, "text": "Is your inner you a monkey?  Maybe your inner you is really Spiderman?  Here's where you would go to find out. When I started living in Sacramento part-time, I decided I wanted to join a gym that wasn't one of the big chains.  I found Pipeworks.  This is a great climbing gym, with a lot of different levels of difficulty.  The people are all nice and there is some serious eye-canding, with bulging backs and nice pecs everywhere you look.  There is also the occasional \"Holy Shit!  I can't believe that person is hanging upside down with his legs over his head and he's only using 1 finger and a toe!\" moments.  Unlike a lot of other climbing gyms, this one also has a decent set of weights and a bunch of cardio equipment.  They just added some new ellipticals so there's almost always one open.  They also have yoga, belly dancing and spinning.  Curious George, you ain't going to have anything on me!", "date": "4/23/2007"}, {"review_id": "ywTrJGf0yIKp8HYil9HHwg", "user_id": "eCcjxh8zjAqn-kZVWZ_HJQ", "user_name": "Katie S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 6, "funny": 3, "cool": 3, "text": "EDIT 2/07: Since my original review I've joined Pipeworks.  I love it.  I go everyday and I can always find open cardio equipment.  If I actually climbed (which I intend to start doing) I could do that too.  And not to be shallow or anything, but y'all climbers are hot.  I can't argue with having a room full of eye candy to oogle while I'm doing my thing on the elliptical.----I've only climbed at Pipeworks once, but I'm impressed.  I wasn't expecting it to be nearly as large or fancy as it was.  Not only do they have a ton of wall space, including a large bouldering area, but their cardio/weight section was spacious and had really nice, new looking equipment.  I really wish they hadn't done away with their student discount or I might have signed up for a membership.  At the normal rates I just can't justify it, but I'll definitely be back with friends (members get to bring a guest once a month) or with a day pass (around $10/day + extra for gear).", "date": "1/4/2007"}, {"review_id": "etvcwRGzgBEA8NmqtMliWg", "user_id": "oiWSzUcjqdgvY1UCE3JDQQ", "user_name": "Mark F.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "What can I say that 80 other people haven't yet? The bottom line is that this is the best rock climbing gym in Sacramento. The routes are changed often and have many options for all levels of ability. Along with climbing they have classes, a great weight room, cardio equipment, slackline...so many options to choose from. Look out if you like to climb after work, weekdays between 5:30 and 8pm are ridiculously busy. Get in line for your favorite route.", "date": "1/12/2013"}, {"review_id": "rxnC1l1lTkmc-28aaNb5fA", "user_id": "67pgwraYqJ9s9JHtuQjHUg", "user_name": "Joey O.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Fun, but can get expensive.  I'd say its worth going to once just to learn the basics then for not much more than another trip you can just buy your own gear and climb outdoors.  I have 2 kids, they loved it. But like I said for not much more than 1 day for the 3 of us, we bought gear, ropes, etc and we can go climb anywhere now. Super tall trees are our favorites.", "date": "10/13/2012"}, {"review_id": "Ua5Jfyz1_wWGaxDRKFyQNg", "user_id": "LndyAdazbeLCpUbirbJuPw", "user_name": "Scott B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 5, "funny": 2, "cool": 2, "text": "Disclaimer: I've only climbed indoors at Granite Arch and Pipeworks in Sacramento, but I definately prefer Pipeworks.\r The bouldering wall is large and can be challenging (if you can find room to climb). For those of you that are new to climbing this is a good place to start. It'll help you learn technique (like keeping your arms straight) without getting too tired too fast. Also, with bouldering as long as you don't get too high you can climb alone. Also, the routes are sometimes misleading. If a route is labeled as a V0+ that means they aren't really inbetween a 0 and a 1 but instead have at least one really tough part that might be rated much higher.\r One drawback of climbing here is that during the weekdays, this place gets really busy starting around 5:30. If you climb a lot you'll notice that they don't change the routes often enough.\r They have small discounts for fulltime students only (must show proof of enrollment). On Friday evenings they have Friday Frenzies (Ooo, they're getting crazy! Slashing prices. Everything must go... wait a min that's Cal Worthington's)\r Friday Night Frenzy\r$7 to get in\r$6 for gear\r$5 safety class\rStarts at 4:00\rJust remember: 7-6-5 @ 4\r If you are considering joining the gym get a ten-pass (10 visits for $120) first because the initiation fee is $125 and with the ten-pass that fee is waived.\r Sooooo, go climb, but beware of flash pump!\r Oh ya, they also have a small traditional gym section, daily yoga, and free wireless too.", "date": "4/27/2006"}, {"review_id": "CjXK1AwZ8YajjwR4jScwyg", "user_id": "2hmpz5fgO4bmz3KDGaMbOw", "user_name": "Holly S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "I love this place.  I'm one of the old-timers...joined shortly after they opened.  Did some climbing at first, and yoga, but now mainly just use the fitness equipment. Pipeworks has a comfortable, laid-back vibe that is very welcome at the end of a stressful day, and the staff is always friendly and helpful (even when they're trying to herd everyone out by the 10 pm closing time on a Friday night). They just got new ellipticals (Precor), but I still use the old ones. There are lots of fans scattered about, thank god, because it can get a little hot during the summer. My friends love the spin classes. Robert was my favorite yoga instructor...I quit going, but he's still teaching. It can get a little crowded after work, so I go later and usually have no problem.", "date": "7/10/2007"}, {"review_id": "qLdOsj44FDIVUs-DE6FcHg", "user_id": "KaF57_Gqz9cbHHtSzB0CzQ", "user_name": "Amy Q.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 2, "cool": 1, "text": "I love touchstone pipeworks and always bringing new friends to this place. I believe the structure inside is the best in Sacramento and the prices are just right. I even scored a free pair of shoes once from the table they were giving away. I could spend hours in this gym! And I love that its dog-friendly as long as it has manners and potty-trained. I leave this gym with hands filled with blisters and calluses but well worth it! Such a great workout facility with the best staff on hand. The friendliest and knowledgeable staff on site. By the way theres $1 chalk if you ever end up needing it for sweaty hands. Wear athletic gear your first time cause you'll be needing something to schwick the sweat away.", "date": "9/20/2011"}, {"review_id": "jqJTBUv9m7vLISl20ylUoA", "user_id": "nTSuDeinJq76_hg5FOVQOQ", "user_name": "S Y.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I climbed at PWs in the early days and now bring my kids to climb.  This place rocks. :o)", "date": "10/3/2012"}, {"review_id": "uq_FCA4o1xRiy4E1ZSZMjw", "user_id": "uQkVfY_2uInzVEumk-Ot8w", "user_name": "michael s.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 2, "funny": 4, "cool": 1, "text": "I must say the best climber in Pipeworks is the membership fee! What's up? It used to be a 5.10a now it's practically lead climbing a 5.11. Yuck.Okay, so Pipeworks paved their parking lot! Right on! This should have happened years ago. This gym is always brutally hot in the summer, and freezing in the winter. Poor insulation comes with the territory with being in an old warehouse...  How hipster is that? The Climbing is great the ropes are usually in pretty good shape and the route are well designed for all skill levels,", "date": "4/22/2009"}, {"review_id": "WmxNsuohLXxvLX3sIAGBfg", "user_id": "5nDEG7vLBf16QKscBgViEA", "user_name": "Sabrina R.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Love the atmosphere of this gym, very welcoming and chill. Basically you can sit a chat with anyone, ask for help/beta, and even if you're bouldering alone I've had the experience where a random person will just come up and spot me.Being new to Sacramento, this has been a great way to connect and make friends in a new city. I've met more people here in the one month I've been climbing, versus the six months of just hanging around different locales in Sac (don't worry Old Soul I still love you!).The one aspect that keeps this from being a full 5-star rating is the monthly membership cost. $64 is just plain pricey in this economy. I know, I know! You get more than just climbing at Pipeworks, you get a gym and free classes, but if it were $45-50 it would be more manageable. I also think more people would be likely to join. I realize that could make it more crowded, but a lot of climbers like to get outdoors too, so it could balance out.In all: solid gym, great work out, awesome people, and a regal atmosphere!", "date": "10/17/2011"}, {"review_id": "ZGD62KmsGjSfeyzIQYwMgQ", "user_id": "4aX0zFTPUZcSLCxPWegiJw", "user_name": "Jessica M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 3, "cool": 2, "text": "I have been a member of Pipeworks for just over a year. I seriously love this place. It has never been easier to get myself to the gym than it has been since I've started here. If I'm not at home or work there's a good chance I am here. I regularly use their cardio equipment in addition to \"hanging\" around in the bouldering caves. They also have a bunch of yoga classes and a few other classes as well as a good selection of weight lifting equipment. Pipeworks is such a low key gym - everybody (staff and members) is very friendly. If you are new to town I recommend going to Pipeworks because it's a great place to meet new people.", "date": "2/25/2009"}, {"review_id": "J2FnUloqlShum0cj68RpRg", "user_id": "fVnVJM-5rM5XINf8WIVoYA", "user_name": "Evelyn A.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Trying to get back into indoor rock climbing!!! My family and I have been coming here for years! The rock climbing is so much fun and a great way to workout!!", "date": "2/23/2011"}, {"review_id": "9KhFPhb9Xe4_XNq1bOoGPA", "user_id": "wrwl2_NNR9E2sUky5Sa2VQ", "user_name": "Becca P.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 2, "funny": 2, "cool": 1, "text": "I have climbed here a few times.  Climbing is such a great workout!  I've taken a few dates here, because I think you can tell alot about a guy on how he climbs.  I wish the building was taller - the walls are good, I just want them to be higher.Friendly staff.", "date": "10/26/2008"}, {"review_id": "KKmOeyfBEGI8v5Xa_kH8Qg", "user_id": "UhQKoYiRTT3643q3DSu0Ag", "user_name": "Gerald M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I took my son to a birthday party at Pipeworks.  The building is spacious, and well-laid out.  The staff was extermely helpful, professional, and patient with all of the 20-some 8 year olds running around.  Climbing is a great activity to tire the young ones out...If you are looking for a different kind of place to hold a birthday party, I tould recommend looking into Pipeworks.", "date": "10/22/2007"}, {"review_id": "W-eZ6dEnkVkccmS7ZaV1zw", "user_id": "L3ilyT4_HZUqdkHrZfkIIg", "user_name": "Sylvester N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Pipeworks is a pretty solid climbing gym. From what I remember the bouldering problems are pretty decent, but nothing too out of the ordinary compared to other gyms I've been to. Had a good time.", "date": "3/8/2011"}, {"review_id": "hcahDACpijjI3XnOOyixBA", "user_id": "Fy2xzObPmfq_vl6omABFZQ", "user_name": "Booth N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love the open design and many amenities. Decent bouldering section, and lots of toproping.", "date": "3/25/2012"}, {"review_id": "LBZx6tnntlpLliPIQAQFIQ", "user_id": "a1p_8rxba8CxKAV-IKNGbQ", "user_name": "Jennifer S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Well, I've been a member for about a month and have been very impressed so far. I've had memberships at other clubs and been very turned off by the singles bar meat market atmosphere. There's none of that here--just a nice friendly, laid back place where people actually come to work out, not hook up. Super nice staff, no pushy sales people hawking deceptive contracts, very clean facilities, even the dogs are friendly!", "date": "2/1/2009"}, {"review_id": "iR-HbBhtunuPARO1TOLqMg", "user_id": "LOMO-n6J7i3ysVIgbvjw1w", "user_name": "Ben R.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 2, "funny": 1, "cool": 0, "text": "Although this is a climbing gym, I come here mainly for the workout equipment. Usually have no problem getting onto a cardio machine and the weight area is usually uncrowded.If you come here to climb after work in the evenings, it can be quite crowded. Weekend mornings are the best for rookies.Would be nice if they had a \"fitness area only\" membership for those of us that don't make much use of the climbing wall.", "date": "1/20/2011"}, {"review_id": "P7W5PjE00YgAllFBktn_jw", "user_id": "uZLxphTb4LrMOiy43rAT8g", "user_name": "K V.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love, love, love Sacramento Pipeworks! Why, you ask??1) The staff. Awesome people, funny as hell (they look like they enjoy their jobs!), super knowledgeable, concerned about S-A-F-E-T-Y ... yours, mine, ours. And they're consistent in their efforts, too ... just try getting past the front desk without swiping in!  2) The classes. My impression is that Pipeworks is a climbing gym first and foremost so I like that they offer a variety of classes (yoga, spin, Pilates, cross training, kickboxing, even belly dancing!), taught by amazing instructors, for us non-climbers. And if (when?) I want to learn to climb, there are flyers all around the gym with info about private climbing instructors who teach all levels. 3)  The community. Climbers in general, and Pipeworks members in particular, are really cool people. The energy in Pipeworks is unique, and very different from any other gym in the area (I've been to many so I can say that with confidence!) It's like summer camp for adults. 4) The extras. Like the bike club. You can find the email list at the front desk. Sign up and every week you get an announcement telling you about their upcoming ride on Saturday morning. They're definitely a social club, everyone's really friendly, and they offer rides that appeal to all levels.  Finally, I just have to add that my membership fee was actually reduced earlier this year. Who does that in this economy? Thanks, Sacramento Pipeworks!", "date": "7/9/2009"}, {"review_id": "sWjj4kff0VuTMnTk5Q-tPA", "user_id": "QkPXTkLZ2Ok9TOuYMJJ6-Q", "user_name": "Tim G.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to a number of gyms now and this one is definitely at the top.  This place is kept thoroughly clean and the routes are updated quite frequently (at least the bouldering part).  I love how there is a full weight/cardio gym in addition to the climbing, so you can get a full work out here.  This is the first thing I've ever had a membership to because I can't get enough of it.", "date": "10/2/2011"}, {"review_id": "JJ_o_ipHPWnQxN9j8uEn_A", "user_id": "wMikg9N5OEjrUrCm4aJEww", "user_name": "T C.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This weekend marks the fifth time our scout troop have spent a night at Pipeworks.  The boys love having full run of the facility from 10:00p to 6:00a.  The staff is always friendly and attentive.  Natalie and Tahwnee were wonderful, not to take anything from the guys who have staffed this night for the past four years.Will we do this again?  Without a doubt, yes!Thanks again ladies from all the guys in Troop 37 from Redding, CA", "date": "12/11/2011"}, {"review_id": "G61Ahn3GYQFC2JWFH425gw", "user_id": "R-mY9ygLQ_BeZrnPfXQDjQ", "user_name": "lauren e.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 2, "cool": 0, "text": "Okay I renewed my membership because they paved the parking lot and put some lamps in.  Im still scared as a mofo to walk out there at night, but good thing I do a lot of cardio because I just run like hell.But seriously, its a really great gym and everyone that works there is pretty nice.  i like it because it really offers an alternative gym space to those who don't really dig the meat market 24 hour crowd and you really do feel comfortable here.  Also the machines are really nice, everyone is really considerate and its really clean.  Also, the locker room is super nice and its fun to watch all the people rock climb.  I love pipeworks!", "date": "3/3/2009"}, {"review_id": "6BSipt2rA4wAYgg2mI3euQ", "user_id": "ml0uNjln-zQVb11NmkYAdA", "user_name": "Jen N.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Do you want to sweat and be changed? Come here?  Do you want to pretend you are working out and spray perfume all over yourself in hopes of a lover? Go elsewhere, but definitely not here.  Luckily, I am all about the work out and this is my playground, well not on some days, but the next day I am happy I pushed myself so hard.", "date": "10/16/2013"}, {"review_id": "XF0HQY5du1WTNjnCmclCmQ", "user_id": "8rk-e18TfXrBO1Ft50hIrw", "user_name": "Linsey S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'll stick with my original rating. The staff here is really laid back and friendly and the facilities are cool. But I did recently cancel my membership because of the hours. 10pm is too early for a gym to close with my schedule. If I worked a regular 9-5 I'm sure it would be great. I didn't end up using the classes or climbing, so the cost wasn't justified for me.", "date": "3/30/2011"}, {"review_id": "3tf-quxL1bAJy6elPQi3-w", "user_id": "O8_3MhR7YpRcOOVhiYU-7Q", "user_name": "Ryan B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 3, "useful": 2, "funny": 0, "cool": 1, "text": "Nice alternative to 24 or family style exercise.  Membership is overly pricey but down to Earth friendly members make the expense bearable.Be warned no AC in 115* Sacramento summers!Overall better alternative for the person looking for lifestyle enrichment not rock solid abs, biceps, or glutes.Cheers!", "date": "3/7/2010"}, {"review_id": "fgRXsSPm25ewrZoLnRRzhA", "user_id": "uZxz5yvxW2BQD-Opmvj12Q", "user_name": "Cat B.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awsome! My husband and I recently began climbing and the staff there are helpful and welcoming. I emailed them with a question and received a response in a few hours. It's a great place to climb and work out. You can even bring in your (well behaved) dog! The staff are always friendly and personable, it really sets a special vibe there :)", "date": "3/24/2011"}, {"review_id": "Db8IAgJfesqC0U6GQnC53A", "user_id": "SFsDcgNsObvYQQx00pNxlA", "user_name": "Andrew I.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "expensive. worth it just for the free classes, let alone the rock climbing and empty free weights.", "date": "12/6/2012"}, {"review_id": "Zr8xIxnKEtc5wAJaVjJLxw", "user_id": "q45Egtdto91vaE0pOiqY9w", "user_name": "christina c.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I have been a member of PW for years now.  The classes are great, the people rock and the routes change at least twice a month.  Vaughn, the manager, is a great guy and keep an eye out for Nicole who works the counters in the morning.  The cardio section just got new elliptical machines...yeah!  The only downside is parking can be tight.  PW tore up the parking lot years ago and have yet to relay he asphalt.....so sometimes you need to do a little off roading to get a parking spot.", "date": "5/28/2007"}, {"review_id": "WJLtlRFLQj-7_3LRtgMIYQ", "user_id": "op8JZLRgzFDwnjbbO0FC3w", "user_name": "gaius g.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great gym.   Great atmosphere, nice people - both members and staff.  Rock climbing is a great sport and this is one of the better climbing gyms in the country (Touchstone gyms all are very nice).   This one is not very crowded and has a nice weight-lifting and cardio area.   The only thing I would change is the weekend hours.   Closes too early.  Other than that, it is really a great place to workout.", "date": "1/31/2010"}, {"review_id": "qFUAnSjJmZ32durcasYxnA", "user_id": "CRjU1H1pp2si4Qzta4AlTQ", "user_name": "Kristie S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This place is awesome!  I don't climb, but my two teenage daughters do, and this place is a climber's heaven.  First of all, it's HUGE.  Way bigger than any place they'd been before.  Second, the staff was super nice.  Third, the place was super clean (I sound like a mom now, don't I?)--there were a couple staff members walking around with cleaning supplies and wiping things down the whole time we were there.  For those parents like me that don't climb, there is a \"living room\" area with couches and a TV, plus a computer with internet access.  How cool is that?!  If we lived in the area I'd be very tempted to get a membership.  It's not just a climbing gym either--there are treadmills, ellipticals (sp?), weights, spinning classes,  lots of yoga/pilates classes.  Very cool.  Decent locker rooms too: sauna, showers, lockers.", "date": "4/13/2008"}, {"review_id": "jpvDc40aOgjvCKd7W7OaSQ", "user_id": "xKGggpogDVs8V4V890P3gQ", "user_name": "abbey e.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 2, "funny": 1, "cool": 0, "text": "For my first time I decided that this place was a perfect experience.  We took a class which took about 30 minutes.  It cost about $25 for the class and you can rock climb until they close. Our instructor was this young guy who was very entertaining and knowledgable.  He was also very helpful and nice. I recommend you get some gloves because after a while your hands will start to hurt from the constant friction.  Also wear some tight clothing (no jean shorts) that won't wrinkle or bunch up in the wrong places :)  I really enjoyed my first time experience and hope to do it again sometime soon.", "date": "6/24/2008"}, {"review_id": "8hzcDyQ3eW1jQWigueujhA", "user_id": "fndYlWBXCGu1vL5y8-kr4Q", "user_name": "Tabatha Y.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Wow, what an awesome gym!  This is a rock climbing gym but they also have regular weight and cardio machines.  I also saw some people coming out of a room with yoga mats.  This place is so great and a great place to try out rock climbing for the first time.  Equipment rental costs $6 (including shoes) and a day pass is around $20.  There's a shorter wall for those of us that are a little afraid of heights and for those of you who are like little monkeys, there are nice tall walls for you too.  There's also a boulder wall thing, which I couldn't really figure out and hurt my hands on.  Also a great place to have a little kid's birthday party!", "date": "2/20/2006"}, {"review_id": "NGIob4Io_RufWRs2Fns7-w", "user_id": "e7RkJGYr5Yg0iZoGdUhyMQ", "user_name": "Ian M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the better gyms I've been to.  I'm no expert climber, but I've been to a fair number of gyms.  Both as a climbing gym and a normal gym, this place is heads above the competition.  The climbing seems great to me as a relative novice and it is never that packed.  I live in SF and Mission Cliffs (another Touchstone gym) is always packed and is about half the size of Pipeworks.  The area for weights is a pretty good size and contains all of the equipment that about 99% of people could require.  I haven't been to their classes, but they seem to have a decent selection.  The facilities are nothing super fancy, but are very clean and nice.  Finally, the staff are super friendly and push Pipeworks into my rarely granted 5 star range.", "date": "12/4/2011"}, {"review_id": "qLS1vaZOiOVyUMXINVNsJg", "user_id": "XqfShJIA_cRp49Q4rQ-M6Q", "user_name": "Lisa S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Ugg. Horribly condescending and rude employees makes paying through the nose to climb here even more intolerable. Suggest friendlier options- UC Davis ARC or rocknasium- go somewhere that is respectful and fun instead!", "date": "11/29/2011"}, {"review_id": "aAO9-S4AJBQsw3ULbLtbpw", "user_id": "Jp2uK8JCAlocK0SUg_-NwA", "user_name": "Kaycie Y.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is pretty cool. I hosted a family gathering here. It's a great place for adults and kids. It's something different to do with the family. My little nieces and nephews loved it. =)", "date": "12/6/2008"}, {"review_id": "43nnkX0hBtT8StJqFi5g_w", "user_id": "PPDkDJAC_2FyWdHaewGywA", "user_name": "Jjx J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "hands down one of the best gym in Sacramento you can rock climb and also lift weights", "date": "7/21/2011"}, {"review_id": "4lUCPqlszh-U2-be4THx-w", "user_id": "fRNkjTL-OuhXNqGhuGXtKA", "user_name": "Neland M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Of all the rock gyms I've been to, this place has to be my favorite. For starters, the location and atmosphere makes it feel like a real gym. It's located downtown in an urban warehouse that gives off an industrial setting. The gym is pretty spacious with a separate bouldering area and numerous routes. The hieght of the walls is what impresses me and is definately perfect for those looking to work on their endurance. There's a secluded section towards the front which is perfect for those learning to climb or simply just to warm up. The dedicated bouldering space is not as extensive and can probably expand on beginning levels. Most of the routes I saw were V4 or higher. The locker rooms are comparable to the size of a regular gym (such as 24 hr fitness). The staff is pretty friendly and approachable as well. There is plenty of parking outside just in front of the main door. Even if you're not from the area and just looking for a place to climb at, I would recommend hitting this place up.", "date": "3/17/2011"}, {"review_id": "GTAD6btpfScwPC5wI8QSqw", "user_id": "AIgP-otoUmjfJyp6wLyWVQ", "user_name": "Max W.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty solid climbing gym. Good bouldering section, nice open floor plan and weight area but why do 40% of the guys there roll with their shirts off? It's not blazing in there, nobody's taking photos, and it's certainly not a meat market. What's up with lounging on the crash pads while people are trying to climb? Despite that, the climbing's great and the vibe is mellow.", "date": "8/9/2009"}, {"review_id": "jxbhKUK065f6F3hUshDGwA", "user_id": "aL9eMEJ015QJOqrIInVuig", "user_name": "Mario S.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome will return. Only reason it did not get 5 stars is because it takes me a little more than an hour to get here. Which i guess is my fault.", "date": "11/17/2010"}, {"review_id": "IQRnHReEyIbYeXR_oWpinA", "user_id": "FtrDpX6LmWflGsAr1P_GTg", "user_name": "Samantha J.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Love this gym...HATE THE HOURS, COME ON GUYS  9AM-6PM on SAT and SUNDAY!!!! If you work on the weekends like I do (8-5) its not gonna work!!!!", "date": "1/30/2010"}, {"review_id": "gHK_qaLPsoJPGAqDRNrVVA", "user_id": "oGH3lIoBzpV76TRoxPRAoA", "user_name": "Marie M.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love this gym! There are tons of different areas to climb for different experience levels. They can provide you all the equipment for a small fee. They often play good music which is awesome compared to any other gym I've ever belonged to. They have a good amount of workout equipment if you don't feel like climbing or if you want to work out other muscles. They have several free classes throughout the day, though I wish they would schedule a Pilates class for later in the evening. They even allow well behaved dogs! The staff is usually very friendly but I have encountered a few, rare exceptions with some of the female staff.", "date": "2/11/2008"}, {"review_id": "IMAT5OKPbmQlCSZucn5ohA", "user_id": "qhnEZwy2M8CD9P-QwlWd0A", "user_name": "Linda V.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "definitely give it a try and it's worth joining just for the yoga classes.", "date": "9/18/2009"}, {"review_id": "lxWO9vVtP275J8f6TNMLdg", "user_id": "sN1lNwR5J_P0k83f-5IOsg", "user_name": "H. L.", "business_id": "4dniG36pDnqpPXfQGQDhZg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "i'm a member of touchstone, but since i live in the bay, i usually go to Berkeley Ironworks or San Francisco's Mission Cliffs.  this gym seemed like it was larger in space than those, but offered about the same amount of climbs.  i did like sacramento pipeworks because it was empty.  haha.  no need to wait for anyone to do your climb.  the climbs themselves were okay.  if i had to rate the climbs, i would say berkeley has the easiest, then sacramento, and then san francisco having the hardest.", "date": "9/20/2008"}]