[{"review_id": "ARZbTmmx3ThaDZdTNhEkHQ", "user_id": "u7h2h_WQX-g6JFZz5czl9Q", "user_name": "Lale S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great place for a local hang out and a good workout. For the size, the gym has a very good amount and very diverse routes. It gets crowded in the 5-7pm, if you want to make friends. The staff are always very friendly and there is an awesome crew around at all times. Excellent bouldering spot, it will train your grip without a doubt.", "date": "4/4/2019"}, {"review_id": "lp1UvPDVbd1dCZjrX_e1gw", "user_id": "50TVRkf98gYI_KPQ1QgboQ", "user_name": "Kevin K.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "If you love this rock gym- you eitherA) are a long-time climber who knows the people who work thereB) never been to another rock gym and like it because it is a rock gym not because it is SB rock gym.For one overpriced- charging for shoes and to climb for the day is robbery- especially for beginners who most likely can only climb for an hour before there tendons get tired. Secondly the staff is extremely unhelpful to outsiders and new climbers they focus on their friends who climb there which is a bit annoying because you could pay for the new iPhone payments with how much you spend on a membership here.Thirdly they put up way too many routes with not enough lighting and honestly its just too much. They also don't keep the holds clean enough to keep them distinguishable.All in all- I have no axe to grind- just wish this place had some competition with reasonable prices and better customer service.", "date": "2/27/2019"}, {"review_id": "-fZd7k6vb1awFXAc7GnOQQ", "user_id": "SondCj9sYzvJ2Zo-Jmi9EQ", "user_name": "Michael E.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Great experience for a family outing.Though I would have liked a simple return phone call as it took a while to get a hold of someone and left several voice mails.", "date": "5/16/2019"}, {"review_id": "1XGsrE1IU5VXd_lIEe9HYg", "user_id": "W_vJHOMWcbbvNZn8jeC3Ug", "user_name": "Cameron E.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It has a wide range of routes and lots for new folks and kids too. Only downside is it can get crazy busy so know that going in. A few auto-belays are available too.", "date": "9/22/2018"}, {"review_id": "9Chh-iTukc0kf5hALMpoSw", "user_id": "y6Vnof-r_3jBxeoDWcPZ_Q", "user_name": "Joey S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So when my nephew was crying about hating baseball practice, I told my sister to check out some other hobbies and let him explore his true interests. She started looking for other hobbies for him. That's when we decided to see if he liked the rock gym! This places is very family oriented, safe, and has a good crowd that comes around. I met the manager Wyatt who's an awesome dude I was very impressed with his knowledge of everything rock climbing and my nephew loves this place! Thanks Wyatt for giving him a safe environment to be himself.", "date": "5/10/2018"}, {"review_id": "MTPoJrIp14M2Gr5fcCSWjQ", "user_id": "X-rdf2BAcnhbfz8U0bRAWQ", "user_name": "Jess H.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Not a regular climber but I really enjoyed my time here. On Tuesdays they have a couples discount (doesn't have to be a SO, could be a friend or family) where they give you half off of their original price. If you don't have shoes or a harness you will also have to pay for those additionally. The service is very friendly, laid back, and knowledgeable. Other experienced climbers are also friendly and are not intimidating despite their amazing skills! For beginners they have auto belays that you can hook onto and will catch you on the way down. They have easy routes (even though they were still challenging to me) and they have very difficult routes. They also have bouldering and as long as you are respectful and safe, you can try to easy routes!Would definitely recommend this to anyone wanting to try rock climbing as this is a good environment to do so!- J", "date": "9/1/2016"}, {"review_id": "JhhDaZbkiS0Wq9rx8FDdsw", "user_id": "c2QDMrUK9B9-vLRqeJ3Eww", "user_name": "Helen D.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 3, "useful": 9, "funny": 5, "cool": 10, "text": "Went to try this place out on half off Tuesday. Normally, it's $15 but on Tuesdays, you pay $7.50. An additional $5 for shoes rental. I didn't get the harness because it was my first time and I was going to be climbing the shorter walls with pads beneath. If you go alone and want to climb the tall walls, their employees will spot you (belaying). For the short walls, be sure to move the pads to wherever you are climbing, but of course mind the other climbers.One of the guys gave me a quick orientation and they seemed real cool with answering questions and such. It wasn't so crowded when I arrived at 6pm but it quickly filled up and the whole place started to stink like feet... no doubt from the rental shoes everyone was wearing. I climbed three walls successfully and decided to get outta there. I found it quite easy, it's a lot of relying on your fingers strength with pinching rocks and shifting your body weight from side to side as you climb. Don't take my word for it, watch a YouTube tutorial, if you're a beginner like me. They color mark your climb so it's more challenging if you keep to one color rocks all the way up... I think people look down on you if you use any color to get to the top. lolI would've had more fun if there wasn't so many people sitting around watching the climbers. Made me very subconscious swinging my ass around up there. I know it ain't like that but who the hell knows for sure.Also, I noticed that some of these guys like to study the markings a little too long before they climb. I guess one can argue that rock climbing is an intelligent sport?Anyway, they've bathrooms n water fountains n resting spots outside.", "date": "4/23/2016"}, {"review_id": "XmLK91q2SOiZZQ4qn5aywA", "user_id": "nabJKapjKahYfTtnBDG6JQ", "user_name": "Kinga H.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 4, "funny": 4, "cool": 3, "text": "Recently checked this indoor rock climbing gym out and fell in love. Bouldering? Plenty of options. Lead wall climbs? More limited but still some fun options. Both changed regularly to keep things interesting.The staff is very friendly. The environment appears to be social between staff and patrons, making for a more fun experience. Did the \"on the rocks\" special which includes 4 lead wall climbs with an instructor and then free use of the gym. For future use, unless you take the Introduction Class, you cannot use the lead walls without a staff member, a safety issue I assume although the gym only has auto-belay.Offer memberships, day passes, session punch cards, and also it is  1/2 off on Tuesday nights! Don't let the lack of height initially turn you off, give it a try and love it too! Perfect for birthday parties, adding to your fitness routine, or just trying out every so often.", "date": "12/1/2014"}, {"review_id": "co2aWkzNPVPUPc0jW4FOXQ", "user_id": "rI_a7eZ75D-SfJ6QlktgiQ", "user_name": "Rachael T.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Got to meet Will, the owner of the place. Super cool, knowledgable, friendly, and honest guy. This place has a very friendly, supportive, and cozy ambiance. Come out for a climb, bring a friend or two, or meet new ones here!", "date": "12/16/2016"}, {"review_id": "_5Y-1AWL7ccYCN4LmzUFXg", "user_id": "kRtMtb7cq3Zahl0MEfLvsw", "user_name": "Ruthie H.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Love the lead routes! The setters are great, I constantly have a project because they reset every week!", "date": "6/25/2017"}, {"review_id": "sfsJTaog4-jjxS5AlONoHg", "user_id": "7qk3EpqIVjLsJvaFvT82ng", "user_name": "Peter N.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 1, "useful": 10, "funny": 5, "cool": 3, "text": "One of the Climbing staff was incredibly rude, unprofessional, and condescending.   Being a non climber in that environment he let me know right off the bat how he felt with, \"oh don't look so glum\"'. Glum?  Do I know you?  I'm here to climb with friends.  Please leave me alone.After a dozen vfun routes he decides to leave the front desk to join in with our group of three.  After approaching me then asks, \"has anyone shown you how to climb the v1 route you are attempting?\" I replied by saying yes both my friends did already.  Then he proceeds to scale it on his own.  And after finishing says \"sometimes beginners are better off watching rather than climbing.  By the way did you see that campus finish I did?\"I felt completely inspired by him at this point.  Even tried to stroke his ego just so he'd leave and go back to work, but it wasn't enough.  He decides to start rattling off his athletic accomplishments like he is reading his fucking curriculum vitae, \" I cycle up Gibraltar road, i love to push it up the climbs, I run, I'm fit, I'm fabulous blah blah blah\".To the management, please take a look at your staff members and ask yourself whether they are there to serve themselves or to help serve your company and promote climbing.  Exhibitionism is inherent in climbing, but starting pissing contests with beginners, making inappropriate comments, and being a chauvinist only disservices your sport.  If this is an example of how the SB climbing community is as a whole, it's pretty glum.", "date": "12/21/2015"}, {"review_id": "Mj4e7dvo-9dUaTx7w6KMmQ", "user_id": "bi3Law5lxusiC9eBRfjMNA", "user_name": "Marie L.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 2, "useful": 4, "funny": 2, "cool": 0, "text": "This gym is fine for bouldering but their policy for belaying is inexplicably restrictive. I have climbed frequently at about 4 other climbing gyms in major cities (including San Francisco and Philadelphia) and everywhere I've ever been, a climbing gym will allow paying guests to become trained in belaying, pass a test to prove they can operate the equipment safely, and become certified to belay their friends. At SB Rock Gym, they refused to allow my guests to become trained in belaying. I still don't understand why. Their staff members insisted that there is no place in the country that will allow you to become certified in belaying and immediately climb thereafter, but that statement is belied by my own experience at Mission Cliffs (SF), Planet Granite (SF) and Go Vertical (Philly) and a few other places. They also inexplicably refused to allow me to bring in my own Vibram 5-finger shoes (which I have used for climbing for the last 5 years at least, without any problem), and made me rent their shoes for $6. It was a real pain and they gave no good reason why I couldn't climb in my own shoes that I prefer for climbing. Their bouldering wall is fine but if you're looking to come here with friends to climb and belay, and you're not already certified here, then I don't recommend this place.", "date": "11/27/2016"}, {"review_id": "b-01eMPS9PXSV8y7GXBe_Q", "user_id": "Fvx9WcAfRCMAB1TsQZYBTg", "user_name": "Irina P.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome rock gym with a good selection of challenging problems. I've seen bigger gyms, but there's a lot of quality in SBRG's limited floor space. The staff is friendly and the culture at the gym is laid back and encouraging. They offer a discounted student membership which I'd recommend.", "date": "1/6/2016"}, {"review_id": "9u48-bNusM_G6OjkFnaYCQ", "user_id": "pFPNj3QidhWUEc-awdnBtg", "user_name": "Krista E.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Perfect location in the heart of downtown, right in front of REI...So many fun climbs and it changes every week. My kids love it here. Great for all ages. I love the set up with the lounge area, comfy sofas and large table to relax at for moms like me who don't climb. The staff is so friendly, Will the owner and all of them really, are very, very helpful. Memberships are reasonable, but so is trying it out on $5 Fridays until you figure out that  this is a fun sport or workout for you.  Mountain Sports I think offers discounts for members too if you want to get climbing gear like harnesses, shoes, chalk, etc. REI is also right behind the store and great if you're a member there. You can rent equipment at SB Rock Gym too. Harnesses are $5, shoes $2.They offer discounts for youth memberships so for us it was well worth becoming members and going  whenever they want. And if your whole family are climbers they have a great membership for you too.", "date": "4/6/2013"}, {"review_id": "hR3scnFcHW3ydNngVM9RuA", "user_id": "GpuH4_61Nv3k0Zn8dSM5DA", "user_name": "Honey G.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 3, "useful": 2, "funny": 3, "cool": 1, "text": "Maybe I was just tired the day I came in... maybe.I was in town for my cousin's wedding. Before going home up North I had my husband take me here to check this place out. Upon arrival I was shocked at how SMALL and short this place was. I can literally just boulder every wall here... literally. There taller walls were as tall as the bouldering walls I've bouldered on at other gyms, and high balls outdoors. I sport climb as well and I was shocked to see that this place does indeed have a lead wall... which is surprising considering that this place is pretty short. I'd be scared as heck to test for lead, let alone take a fall. What is my belayer supposed to do?! Keep tension on the entire time, as if I'm going to get pulled off the wall?! NO WAY!The general price to climb is $15. I decided to pay the $15 because I wanted to pull on plastic that bad. Their rating system is odd, however, I do kind of see their theory behind it: They rate their problems by color and not the usual Vscale because they want to encourage everyone to get on everything and not be fixated on the ratings. TOTALLY UNDERSTAND, but what about those who are new to climbing? They won't understand the Vscale. What about those who want to see how much progress they're making? They can't just be like \"Hey I'm a YELLOW COLORED CLIMBER\" or \"Hey I just crushed that GREEN!\".  What does that even mean? Also, the routes are rated accordingly, but what about the subdivisions within that specific rating? Like I said, totally understand, but let's be real... c'mon.At the end of the day, I ended up only staying for 45 min. and felt like I wasted my money. I forgot to mention, there was uncovered cake left out on the desk. I was thinking it was free game for the members and guests to take? Well whatever the case, it's kind of gross dude. There's chalk flying everywhere. You can't let cake sit out like that!3 stars though. Customer service was nice.", "date": "10/3/2014"}, {"review_id": "qU-NRl567GmY-TbPeSrfEQ", "user_id": "xlBvNvpz8njNFFNOU9lveg", "user_name": "Jessica B.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 2, "funny": 2, "cool": 3, "text": "This place is very accommodating for beginners! Unlike in my hometown where the cost of a few quick lessons costed $80, for just $30 here we were able to do 4 fun and helpful climbs with an instructor and felt like regular 'ole pros by the end of it. It is a smaller facility but you will regardless get your climbing fix! Additionally...the playlist was bumpin' that day.", "date": "1/2/2016"}, {"review_id": "7On12dALWSQFPbqjyrY_xQ", "user_id": "ny9k8PitJmq9pdUfEh3bSQ", "user_name": "Wiktoria S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm a beginner climber and this was my first time at this rock gym (I'm a UCSB student so I climb at our recreation center wall). Anyways, it was my first time here and I thoroughly enjoyed it! There is a wide variety of routes with different difficulties. Most are for experienced climbers who can climb those V4s and above, but I found plenty of workout room for my own range of difficulty (Vfun-V2). A lot of their walls are on an upward slant which increases the difficulty of the climb but brings awesome reward upon completion. Will definitely go visit them again as the day use pass is fair priced (they even offer a student discount and more discounts on Tuesdays and Fridays). Parking is easy to find with plenty of 75min free parking all around the area and a full parking lot right outside of REI (that's right, that parking lot is also for the SB Rock Gym!!). The staff is friendly and sets you up really quickly with an orientation and then you are ready to go! The place holds a great community of people and is super family friendly. Make sure you go check it out, you will not regret it.", "date": "3/26/2017"}, {"review_id": "ULvb6gNotMef-bSgrl0XrA", "user_id": "bB598d5bCax_cgz5VdCjjQ", "user_name": "Bob M.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 2, "text": "Friendly and helpful staff. Not much of a pro-shop. If you want selection in gear go someplace else. Plenty of walls to choose from. Good times.", "date": "2/7/2016"}, {"review_id": "9DsSVTrKVOW5f1RAfXLB6w", "user_id": "i3tYR78tEIcAzeynP7Bu0A", "user_name": "Perry K.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Our family loves Santa Barbara Rock Gym!  We have a 10 and 12 year old and this place is fun for all ages.  Whether you're a beginner or expert there is a great experience for all levels. The management and staff are friendly and experienced too.", "date": "2/10/2016"}, {"review_id": "MJr4BO0ujETvyvFUzfZ5Uw", "user_id": "tsT-OHX8MyvTbmgAoxIffg", "user_name": "Cassandra A.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My 15 year old son and I were in SB for the day and needed something that we could enjoy together. I found this place through Yelp and used one of their 2 for 1 coupons. Their employees and instructors were all very helpful and answered all our questions and made sure we were safe. I wish there were more easier climbs for the novice, but all in all it was a great bonding experience for the two of us and we will definitely visit again.", "date": "5/3/2015"}, {"review_id": "vm4nFz7JvW_N2UcY9k_yeQ", "user_id": "RFBKNLT1tmFJMDAv6C5Q1g", "user_name": "Branden L.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! Setting is both challenging and creative. Fun staff and a great place for kids. I first learned how to climb here and have developed many friendships and connections through climbing here. I would recommend this place to anyone who is looking to start climbing or even if you have been climbing for years. This place has something for everyone.", "date": "6/13/2015"}, {"review_id": "3P-uQD5EkDjkF0StjfxA6g", "user_id": "rIBhR8_VYtzhc_7efBZ2jQ", "user_name": "Marc G.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome facility, great kids and team programs, knowledgeable and professional staff.", "date": "2/10/2016"}, {"review_id": "mWpdmbdtDUn6eRnq96xopA", "user_id": "6k126Tla-FTCXzfq690Bkg", "user_name": "Susan M.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "The staff and patrons are so welcoming and inclusive! We love bringing the kids here and will buy a year membership next year for sure!", "date": "9/18/2016"}, {"review_id": "Kia1Pn_onF9EDTdp43zBNw", "user_id": "1k4b0EzU_F4L6dLT6IWN5g", "user_name": "Jenny C.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "This gym was nice, though somewhat smaller than other ones I've been to.  I found the ratings to be really hard - I normally can climb all 5.9's and some 5.10's, and here I struggled with 5.9's.  The staff were really nice and helpful and the atmosphere was relaxed and fun.  There was a good variety of climbs, and climbing there was overall a really nice experience.", "date": "3/8/2015"}, {"review_id": "CZpkfrKLmTwS_rmjmpv8EQ", "user_id": "0jcZZ11v9ZynVQbk6TBZqw", "user_name": "S. C.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Love this gym! Sure it's small but if you're a member you get in @ 10 am before all the noobs and tourists. I often have the gym to myself because of this. Staff is friendly and helpful. The only downside is the summer kids camp during the morning hours... Not a fan of kids climbing around and being loud.", "date": "6/24/2015"}, {"review_id": "gjN1PMPgzVIHBfEhMDs80Q", "user_id": "lWfnUt5U2Mlz6K_sl1QGXQ", "user_name": "Kevin Y.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "I've been climbing for over 5 years now and have been to various gyms in Northern California, SoCal, and New York, so I'd like to think I have a decent sense of how gyms are normally set up. SB Rock Gym is technically located on State Street, and is a bit hard to find even with the assistance of navigation. it's tucked in a corner near the walkway for the tunnel, and is impossible to see from the road. The best way to get there is to park in REI's parking lot, and walk down the street and turn left onto State until you see it. The gym is priced fairly, and the half off Fridays make it a really good deal. Even on fridays, its never too crowded, and you can always get your workout in. The gym utilizes it's limited space well, and the bouldering rooms are one of the best I've ever seen. The bouldering walls have unique terrain and route setters make great unique routes that work with it really well. And its updated pretty often! The top rope on the other hand... The top rope is pretty much glorified bouldering with a rope. The entire corner closest to the window is just a mess, with incredibly short routes. The parallel walls in that corner are too close to each other, making it a tight space for belayers. Routes are not updated frequently, which is especially important in a smaller gym like this. Don't get me wrong, the top rope is great for parties and kids who wont mind the shorter height, but for more experienced climbers it really doesn't cut it. Overall, an amazing gym for bouldering, but the top rope isn't up to par. Also, pictures are incredibly misleading for getting a feel for the size of the gym.", "date": "11/8/2014"}, {"review_id": "FsNrCevbdWG3F9dyJhTBMg", "user_id": "iOJrkvSC78mVfNyHb6j3QA", "user_name": "Cody M.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym and great staff. There's plenty of bouldering available but a bit limited on the lead and top rope climbs and the ceilings aren't very high. All together a solid gym and I will revisit when I'm in Santa Barbara.", "date": "8/23/2015"}, {"review_id": "7ALzFCb39tNFuX1-J3aL6g", "user_id": "SnJtBXH7AQr81-vB5lfn9A", "user_name": "Nick S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Shout out to Chris for showing my wife and I the ropes. Awesome instructor! Facility was amazing, staff was friendly. Highly recommended!", "date": "11/16/2014"}, {"review_id": "s8e98wp1Z4BcipbipDVDpQ", "user_id": "BBQT4vT6z7sQdWoLyNnaEg", "user_name": "Jarrett G.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is just a great place.  The staff are knowledgable and friendly, and the other members also all seem to have good attitudes.  Everyone who works there....and goes there...loves rock climbing and that makes this place a really fun environment in which to learn.I started to visit SBRG shortly after it opened last year.  My 9 year old son began climbing there and I would just go down to watch him climb.  Eventually, I decided to try it and now I'm hooked.  I literally had ZERO experience with rock climbing when I started....I mean I never even watched it on television before...or read about it.  But after a very short time, I was able to start climbing and take a few classes and seriously increase my skills.  Its a very social place and it was easy to find several climbing partners close to my skill level who I now climb with almost every week.SBRG has a wide variety of routes to climb, and these range from \"Fun\" to seriously advanced.  They also set up new routes frequently, so you don't get bored climbing the same things over and over again.  They offer classes as well, and these are intensive small-group sessions (around 6 students max) where the instructor can really engage every student individually.There are a couple of nights a week when it can get pretty crowded, but as I mentioned above, everyone who goes there seems to be for lack of a better description....COOL....and will share routes with you etc.If you are an experiecned climber, or someone who wants to try it for the first time, you will enjoy the SBRG.", "date": "2/21/2013"}, {"review_id": "cPcWSNkKyElLbRjYmiDIpQ", "user_id": "anQ9iCLeyd-4Yj0noH53kw", "user_name": "Kirsten S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kids, along with their cousin, did a camp here for a week. This was their second time doing camp at the gym; however, it was their first time doing the outdoor rock climbing. It was fabulous! Cassie and Ian led the trips and made every day wonderful. My kids aren't usually fans of camps and yet they looked forward to each day.  Cassie and Ian not only kept them safe, they made the days fun and they were tolerant and patient and kind. We just wish we had more time in the summer for another session! While the camp might seem expensive at first, they are truly engaged and using their body, learning new skills, and building confidence. It was what every kid hopes for at camp, lots of laughs and memories.", "date": "8/5/2016"}, {"review_id": "BETBJ9SY771tJw7IFK_jcQ", "user_id": "DVd3D2BR5gjQwCv28P0tBw", "user_name": "Laura N.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Let me start off by saying this:  There's something special about Santa Barbara Rock Gym.I've climbed at several different climbing gyms around the country, all of which were taller and larger than SBRG.  What SBRG lacks in height and size, however, they more than make up for in fantastic, flowing top rope and lead routes, challenging bouldering problems -- all of which that are updated frequently -- and a truly awesome staff.  I'm not sure what it is about most rock climbing gyms, where the staff tends to be dry, listless, and totally unenthusiastic.  I mean -- REALLY?  You work at a rock climbing gym... how could you not be pumped?? Not to mention you're surrounded by some of the most chill people in the population... Regardless, SBRG has completely circumvented this issue and is run by a talented, warm, solid group of passionate climbers.  As I mentioned, the routes are awesome - there's nothing worse than climbing in a gym, and finding that the routes are clunky and lack any flow.  There's a good balance between easier routes and problems and more difficult projects. (And for any lead climbers out there, they've got a great arch that's always got at least a few challenging routes on it).If you live in the Santa Barbara area or are just passing through, I  definitely recommend you check out SBRG and get your climb on.", "date": "2/9/2013"}, {"review_id": "FC3CNAz68G2Kz0eZa4dSuw", "user_id": "OnyPESeFF8P449v3cpcw3g", "user_name": "Ben M.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I started at Santa Barbara Rock gym about two months ago and I am officially hooked. I love to exercise, love working out, and climbing is exercise in a way that I've never experienced before. It's like putting a puzzle together in my mind, then attempting to do it with my body. Watching the more experienced climbers is awesome, and one thing that struck me was how social the environment is and how kind everyone is in the gym. The staff are exceptionally friendly and helpful, which goes a long way, they are great people.", "date": "6/3/2014"}, {"review_id": "vrLnwtwnRLV2WdcTzeVfFw", "user_id": "8HWcV9BptD_Ix6MyIFBrwA", "user_name": "Lyle K.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took an intro class to learn the basics and the do's and dont's of bouldering. Everyone was very friendly, there was a kids birthday party while I was there but barely noticed the kids. Great spot.", "date": "6/25/2016"}, {"review_id": "_UM-JW4n68bk3skEsDQ2TQ", "user_id": "VTRqNF5cDRLnlppkeyCnTw", "user_name": "Riry P.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "I've taken my kiddo here a few times, he loves that he can free climb or use the auto belays - he always has a blast so it was a no brainer for us to come again. We had a groupon for a lesson and we were taking the kids while the grouponee had their lesson. However I ended up joining the lesson. I was not properly dressed to be a participant but it worked out. Ryan was super patient and made sure that we were safe. Falling 20 ft to my death would be utterly traumatic to my little guy. (This is obviously dramatized and exaggerated as there are a zillion backups in case one thing failed). He taught us to make sure the harness was on right, that the ropes were tied securely and kept reassuring me that I was safe. I'm petrified of heights. Insanely petrified. I hit a mental wall midway through the 2nd climb up and Ryan talked me out of my almost cardiac arrest. He coached me through and wouldn't let me give up. Trust me, I was mid meltdown and ready to call it quits. He was super calm and professional, gave some tips, and I hit the top!!! Then I was stoked to be down on the ground and I made out with the floor until it was borderline humiliating and tragic. Thanks Ryan for making sure I finished so I looked super badass for my kiddo!I can't even climb a 6 ft ladder without having a panic attack! I'm stoked to have done this - been wanting to forever - grateful to have crossed this off my todo list with my pride and ego intact.My kiddo loves coming here. You'd think that for amateurs a place like this would be intimidating but it's actually really rad. Everyone is super nice and encouraging and he always has a good time (he's 5) and scaled up 2/3 way on his own with a belay today, a personal best (usually he'll free climb up about 5 ft and jump down). This is a great place to get kids interested in sports and at their own pace. And it's super safe for them to do. The staff is always helpful to answer questions. It's nice that decent climbing shoes aren't exp and well worth the investment instead of renting them. Will 1 lesson make me comfortable to do it solo - no. But it's encouraged me that I can do almost anything if I put my mind to it and have my peanut gallery to egg me on.", "date": "3/16/2014"}, {"review_id": "kXk2jqYv1Qmywu4uSSnDAA", "user_id": "cpvbPF29E8dW42_xHahRmQ", "user_name": "Zach D.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I think lots of the reviews are inflated since there aren't really great options for indoor climbing in the area.  UCSB has a climbing wall, but it's not that big (it's taller than SBRG, but less routes in total) - but is a decent option if you also want a membership to a gym as well.  There used to a be gym in Ventura (vertical heaven) that featured both top rope and bouldering, but they've since moved to a new location and only offer bouldering now.  My major qualms...I mostly TR, so I'll stick to that for my critique.  The walls aren't very tall.  Granted they seemed to do the best they could with the space they have, but the TR routes basically amount to bouldering + maybe 10 feet.  Also, I've seen much more creative route setting elsewhere.  There are a couple interesting routes that make you think, work the problem out, and use some different moves, but the vast majority are straight up, use some flagging and maybe a layback here and there.  The positives though - decent pricing (especially if catch a membership deal or go on evenings when they're running specials), good place to get into climbing (learning the basics), it's a new facility so while it smells (hey, it's a rock climbing gym), the holds, walls, ropes, autobelays are all in great shape, and because they are growing they are starting to add more benefits to members (yoga classes).", "date": "1/8/2014"}, {"review_id": "uvgMkTARmQ590WbOPcO8jQ", "user_id": "74PfFiYrf5yjrWc6vkdmOA", "user_name": "Eugene K.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the jewels of Santa Barbara, we just called to come for a class and were greeted by Will,the owner who was just a pleasure to work with - this is one of the highlight about Santa Barbara", "date": "7/3/2014"}, {"review_id": "6bqty4v-mRWADFwhIuwxKg", "user_id": "DDGcYEO1Pf4ruUUHWHutrg", "user_name": "Stewart R.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very friendly, courteous staff. I paid for two 11 year old girls to spend time \"on the rocks\" with Max and he was excellent with them. Encouraging and offering great tips to become more proficient climbers. A great workout when the weather outside is less than ideal.", "date": "3/7/2016"}, {"review_id": "T5q0ZIjwIAPSLq6yyXutpQ", "user_id": "O0wYcmTsf-RvVwqrc_HTMg", "user_name": "Sasha A.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a wonderful way to spend some time, or have a party.  They have accommodation for kids - parents must be present.  And a great deal on Friday nights!", "date": "3/11/2014"}, {"review_id": "Qls2_3lySb5eB7Cb14As-g", "user_id": "Fe1IihkrWP9uUA2CIt0mVg", "user_name": "Nacho L.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kid just had her 6th bday party here, and her and her friends had a blast! Kids ranged from 3-8 and the staff there are amazing. It was really reasonably priced for what is put in to making sure the kids are having fun and being safe. Highly recommended for having a awesome bday party and watching the instructors/staff helping the kids overcoming their fears of heights.", "date": "8/3/2014"}, {"review_id": "9xYtFNnI0_8bdmBrYad9jg", "user_id": "gJHWp-YeyLjX7gZ2obdXpg", "user_name": "Linh T.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Very nice and clean gym right behind REI. This gym has Auto Belayer so you don't need a partner for top rope. My husband and I were in town for our vacation and decided to check it out for a quick hour of climbing. I love all the climbs. We usually climb 5.10s-11s and found all the 5.9-5.10 climbs here to be quite challenging and requires more core. Each climb has its own name. Very creative. The staff is friendly and attentive. Definitely come back here next time we're in Santa Barbara.", "date": "7/8/2013"}, {"review_id": "5yUx9pmhezcqot4pm76BXg", "user_id": "-IbvvYKwa5fvl67RXimaBg", "user_name": "Melissa A.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I love this place! Has a lot more to climb than your average gym and I always meet the coolest people here. Five dollar Fridays!", "date": "6/11/2013"}, {"review_id": "VEtzRkRiLBTEB3t9PYdx9g", "user_id": "a145JM6WTebVX0ByrZVuPQ", "user_name": "Marc A.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Took my girlfriend to SB Rock Gym last night as part of her birthday celebrations. As climbing novices, we were apprehensive since we didn't know what to expect. We called the day of one of their 2 hour \"Intro to Climbing\" classes and they signed us up even though we were technically putting them over class capacity. We discovered a fun and friendly staff. The class taught us all the basics that we would need to come back and climb on our own (after we take a safety test) - knots, harnesses, belaying, lingo, etc. Our instructor, bearded Chris, was friendly, funny, knowledgeable, encouraging and all around super enjoyable. He deserves a ton of credit for making our first visit awesome. SB Rock Gym is a good time - don't let inexperience stop you from checking it out!", "date": "2/22/2013"}, {"review_id": "sEetNrfGXfhq7tzyFB4Z5w", "user_id": "vtKR9CYNpODrzx-GQ1owFw", "user_name": "Maliny S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I was very excited to find out that there was a new Rock Gym in Santa Barbara. I was extremely impressed with the friendly staff, pricing, and climbing options. It was a large group of us girls including 2 leaders and 8 High Schoolers. It's so nice to have a fun place in town to take kids to. The girls had a blast and enjoyed the freedom to climb with the option of auto belays. There is inexpensive parking across the street and the place is open late. The girls are excited to come back again. I definitely recommend this place!", "date": "11/9/2012"}, {"review_id": "jz6cQjre8qrzwsRs9QijrA", "user_id": "K5sTKytnUvYO-zzVaPwnVA", "user_name": "Tom B.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Five stars! For being such a small facility, they really do ok for themselves. Great belaying, awesome bouldering! Always lots of fun problems for climbers of all levels. Routes are reset often enough that even the most avid full time members can't get bored. And the staff... It seems to be a thing that the staff at climbing gyms are a little stuck up and typically quite rude about it. But not so here. The staff are awesome, very friendly and professional. They're always willing to give you tips when you ask and all seem to love their jobs. Climb on!", "date": "8/22/2013"}, {"review_id": "ZBBEFarQ4aKjhs62wiU6Qg", "user_id": "KeiIWUWLeiD9U6_-sVWywQ", "user_name": "Dr. Steve P.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place ROCKS! I have been brand new to the world of rock climbing. The staff at SBRG is great. Chris the Program Director has a great teaching style, and is super-helpful for newbies. He is a passionate instructor that is great with kids. He makes things simple, safe, and fun. Mike, and Dean are also top notch rock climbing instructors that really take an interest in the people they are working with. I have learned a lot, had a lot of fun, and would highly recommend this gym to anyone, of any age looking for a safe, fun place to get exercise. It is perfect for families to do something together. Will has put together a great team for his gym.", "date": "6/3/2014"}, {"review_id": "jDouv_GCrvYtEXpKfKzUbA", "user_id": "VczANg4regO1n3y213zNNA", "user_name": "Julie S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My company went for a team building / celebration event. Our instructor Chris was absolutely on point. He was encouraging for us beginners, genuinely friendly, and kept us all engaged and laughing the entire evening. We all had a wonderful time - I highly recommend.Thanks Chris & SB Rock Gym!", "date": "4/16/2014"}, {"review_id": "r_DwxhXiZNMHCUPuC9vELg", "user_id": "CVLRUh_z_KvQNViIIARcuw", "user_name": "Andreas S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Decent size gym with lots of interesting boulder problems and some fun sport routes as well. They change the problems often so there is always something new to play with. Prices are reasonable and the staff is friendly with a good focus on safety and comfort. The wall is not as high as you would want for decent length routes, and it tends to get very busy on discounted days.", "date": "9/28/2013"}, {"review_id": "8eL1dY5PeddjyHODzQLwxA", "user_id": "3kkBxu9aVAcLEdjHK4onpw", "user_name": "Josh C.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If anyone's interesting in starting to climb, this is the place. My daughter came in as a beginner and now climbs better than I do! It's always a great time at the gym, and the instruction couldn't be better.", "date": "8/10/2015"}, {"review_id": "dm-n5qyLkkiYS1hk7HiZlQ", "user_id": "dS-HiFY-bdtz56ZxPWXavQ", "user_name": "Megan R.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Santa Barbara Rock Gym is such a great place to get excercise and have fun! Not only is it a wonderful family environment, but the staff members are so kind and friendly. Chris and Will were so generous and eager to donate to our organization.Kids Helping Kids would like to thank Santa Barbara Rock Gym for their generous contribution. All proceed assist in making a positive difference in the lives of youth both locally and globally. It is thanks to companies like Santa Barbara Rock Gym that allow us to make the world a better place.", "date": "11/21/2013"}, {"review_id": "iWz5sCW2WxeLMutb9Sepng", "user_id": "cPQOKQjpEED3sQfuvIpumQ", "user_name": "Lauren C.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very fun climbing gym! You can find lots of really interesting boulder problems on vertical wall sections, a cave area and other slightly overhung parts. The building is a kind of short so top roping is shorter than at your average gym. The rating system can sometimes be a little all over the place, but overall really fun! fivedollafivedollafivedollaFRIDAY!!!", "date": "5/4/2013"}, {"review_id": "JfTuMiudrwAvmBgaz6CjOQ", "user_id": "kdc0PuO0VnzmWffA_xfGFQ", "user_name": "Ms S.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Nice gym with great staff. My husband and young son recently visited as beginners just looking for an afternoon of fun and something new. The staff was very accomodating and made it a fun experience for everyone. Felt very safe and professional. They made new customers for sure; my son can't wait to go back!!", "date": "10/20/2013"}, {"review_id": "FTCU5mozOTZIor8uIv1EJg", "user_id": "Ua_WUsGOMy9EV8YzPippQg", "user_name": "Annikka L.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I got a groupon for this place because I was going to be in town for a day and wanted to do something fun. It was very easy to use and the staff was very friendly. My boyfriend and I really liked the free climb area. We stayed for hours, basically till our hands were raw. Loved this place, and would most certainly go back!", "date": "4/26/2015"}, {"review_id": "FgIKiUYpc4HmQ8BGlLbkKw", "user_id": "Hje78VZzvG2txbVB1fFU2Q", "user_name": "Rich A.", "business_id": "i_VY8EEOxZlNnXrESAhmig", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The Rock Gym is the greatest place in town! Whether you are 5 years old or 75, crushing 5.12s or struggling up 5-funs, you will love this place. Total positive energy, great staff, the Rock Gym rocks!", "date": "12/28/2014"}]