[{"review_id": "eEcTUmV7XjEH9inub-UCVw", "user_id": "LYRHcK61DFsvWAUGylVZXA", "user_name": "Teresita R.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went climbing here with my bf, and it was surprisingly huge! The staff was really helpful and nice and we had so much fun. We were both super sore afterwards and we had so much fun!", "date": "2/2/2019"}, {"review_id": "SxSsLUp3XM4PlO7I9tQRrA", "user_id": "EXx8nzBWMtdW6EvLWYwm6g", "user_name": "K D.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "SUPER SUPER small. 45min wait to climb. 1 bouldering wall and the floor is rubber pieces, not made for dropping.", "date": "3/3/2019"}, {"review_id": "XiytCDDho4KbRZL7Js3mCQ", "user_id": "BROs5a4ZW2MQ_C8Z-hsLXw", "user_name": "Mike G.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Ok so this place is 23 plus years old never knew Modesto had a place like this. You can rock climb 40 ft walls all levels of experience could do the different walls. They opened up early so we could have a party which was very nice of them. It's not some big chain and all perfect inside but it's safe great prices and the staff was friendly and helpful. I would give 5 stars but the bathroom situation was a little weird (it's outside but in the building) but not a big deal. I was happy and would return here in the future.", "date": "3/1/2018"}, {"review_id": "emXxyGkZhzz3Edwtki_JaQ", "user_id": "DUWvR-Vn6QP4ybCeZP-bRw", "user_name": "Tasha H.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter and I have not climbed together in 18 years. We happened upon this gem recently and have LOVED IT! The staff is very helpful and is all about safety. The routes are a good mix if difficulty. My only complaint would be that some of the ropes seem pretty old and as such do not have the give that you would expect when hanging. They do have all kinds of gear you can buy onsite including harnesses and shoes. They have a family membership that is very reasonably priced. If you love to climb and need a place to train then I would highly recommend this location.", "date": "11/5/2018"}, {"review_id": "M2kCdGHQkASqQyMw2ahjMA", "user_id": "HAiklCP-PLzvI15DUXm1gw", "user_name": "Natalie W.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Old school gym.  The floor is made of small rubber bits for cushion instead of the typical crash pad floor.They have the best cracks I've seen any in new gym.  Great for practicing before you head to Yosemite.  This place is small and is in a seedy part of Modesto, but it is tried and true!", "date": "3/20/2018"}, {"review_id": "5k4hNnE_Zv30c2Id2We9QA", "user_id": "vBXu_8xOFJXKoG7eYKQs5Q", "user_name": "Brandie M.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had my son's 10th birthday party here and it was so fun. All the kids (and adults) had a great time. Forrest is an excellent instructor with a lot of patience. I highly recommend renting out the gym for your next event", "date": "9/10/2018"}, {"review_id": "fz5-mwQxWzi1AcpOhacI0w", "user_id": "cutqXniqnsN0-VaXG-T6jg", "user_name": "Jennifer R.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Very cool experience!  I took in my 13 year old son and his friend for my sons birthday. The facility is really neat and the staff is friendly and helpful. The building allows for very high climbing and a lot of variety. Even though the two 13 year old boys worked alone together, with supervision, after the climbing lesson I felt that they were completely safe. My son wants to go back again for sure and I want to go back so my husband and I can learn next. Also the price is a steal for the experience", "date": "11/11/2017"}, {"review_id": "Xu3pCP6mTJB1bSZpisL3OA", "user_id": "9e3miBbH-pk_rrRKo0Dhsg", "user_name": "Ron S.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Had a lot of fun. Seems pretty big inside the staff is very helpful. Little bit of advice watch a YouTube video on how to tie a rock climbing rope before going you need to know this before they allow you to do it yourself", "date": "11/19/2017"}, {"review_id": "nWr79tvsAGqa0vgVRbhXAw", "user_id": "nmoJYyh3KlplBdw7SPCK5g", "user_name": "Takara S.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We loved our first climb at Stonehenge. It took about twenty minutes for our instructor to finish the class he was teaching so he could teach us, but once we got started we had a blast. Our instructor (Luke) was friendly and knowledgable. Climbing was good scary and we definitely felt safe with the equipment they had. The other climbers were very friendly and welcoming even though we were clear newbies. We climbed more than we thought we would be able to! Plan to come back again soon.", "date": "2/20/2016"}, {"review_id": "hHLvHkLwDkxbBdskr_muFA", "user_id": "TWE8L3bIOGuKbc1yKFemyQ", "user_name": "Tasha S.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We went for a scout outing so it was closed to the public. Jason, the instructor was very clear with instructions and all kids and adults had a great time.The facilities were great, it had everything that was needed for beginners and advanced climbers. We can't wait to go back.", "date": "1/10/2015"}, {"review_id": "ZQLh2U8xjCetHqh-kJzDjw", "user_id": "U7ScXnw9KpNg0ioDu_5PzQ", "user_name": "Michael G.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My first time ever climbing today and I couldn't have asked for a better experience! The staff was very helpful when teaching me the ropes in a quick manner and very friendly. They provide everything you need if you don't have your own equipment but I left with some of my own I purchased! Thanks for the awesome experience and the newly found hobby! Definitely gonna be a regular here", "date": "10/22/2016"}, {"review_id": "jb1354zdKaWMQ0ate-TQ8Q", "user_id": "5jhsnrzHHlU-tOg5d2YouA", "user_name": "Michelle C.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "A solid rock climbing gym. They helped set me and my son up, and showed us the ropes. A good, friendly crowd. I wish they'd have classes, especially for newbies and kids, and I wish the gym were bigger. But overall pretty good and I'm glad Modesto has a rock climbing gym!", "date": "7/2/2016"}, {"review_id": "46VUqz3gApZ9h664VDjKBg", "user_id": "JdGi3w8085FpP2cgX53PtQ", "user_name": "Mike R.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Met these guys at a grad night and it was awesome! Really cool idea for a grad night when the traditional DJ and other activities get boring for the grads. I really liked the customer service of the owner and his staff. Highly recommend!", "date": "6/13/2016"}, {"review_id": "mqiF0rUV4wR5bnkkOFg6Cg", "user_id": "RFsXoetidq3GwVCcC-aAtQ", "user_name": "Kathleen C.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Stonehenge has such a friendly shop and atmosphere! The people who climb there make it incredibly fun for me, especially since I just began climbing a little under a year ago. They help me with the routes when I get stuck and are extremely encouraging. The owners and staff are extremely friendly and helpful. They teach you the basics of climbing really well and are willing to answer any climbing questions you have.  I look forward to climbing here at every chance I can!New Climbers, GO! Try it out! I've brought many of my friends from school here and they love it! It's a kid-friendly sport too!", "date": "4/4/2013"}, {"review_id": "QFyDoEus7e-t3JrFWHjQiA", "user_id": "47BkU3ahL7RgNW4lsEB-uQ", "user_name": "Barbara T.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I was up in Modesto for work for a week and was so happy to find a rock climbing gym in this small town! I went one night and I got lost getting here..It's located in downtown but downtown Modesto can be very empty and dark at night. Also, the gym is kind of hidden..I had to call the owner for directions. You have to walk into a building hallway (there are no signs out on the road of the rock climbing gym).This gym is smaller than the gyms I go in San Diego however there is a good amount of boulder and belay walls...Was able to chat with the owner a bit and was down to earth and everyone seemed friendly.. Would come back if I'm ever in town for work again!", "date": "6/8/2013"}, {"review_id": "kP9nuvxaKGtj4BelI3CqfQ", "user_id": "XN11xVCEo69YMxFZ_eV8VQ", "user_name": "Brittany P.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 2, "cool": 2, "text": "I've been climbing at Stonehenge for about 5 years and I love this place. When I first learned to belay, the owner (Derren) was very thorough at explaining the steps and safety checks. I was very nervous at first, so with the thorough lesson it put my mind at ease. Compared to other climbing gyms, the routes here are rated harder but they are more true to outdoor ratings.", "date": "1/4/2015"}, {"review_id": "FgGwHOXPiYgyA4CIxHD7Ow", "user_id": "GlENiA2gN8pziR_9o0TIHQ", "user_name": "Jon G.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I used to come here back in the 90's when I was in high school but haven't been back in years. The other day I decided to bring my kids and they had a blast. They now want to go there whenever we go on a family outing and we've been back about four times. My kids are getting over their fears and each time they get better. Friendly staff and a lot of fun.", "date": "6/18/2016"}, {"review_id": "EqPsntXtP6glcHiqMTOSMA", "user_id": "7zTFiKshfOk_m0zABi_4AQ", "user_name": "Adam H.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is one of Modesto's best kept secrets.  I have been there many times throughout the years and I always enjoy myself while I'm there.  The owner is very down to earth and helpful.  I'm not a very good climber at all and they still make me feel welcome everytime I'm there and help me improve.  I'm glad Modesto has kept this place alive.", "date": "7/15/2013"}, {"review_id": "jBYSXRxv9KARGEi2ebsTMg", "user_id": "1CxEPUwZgV4DUQC1ryN6kw", "user_name": "Jessica B.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "Great climbing gym!  The attendant taught me to belay in 5 min flat.  He was very attentive whilst being laid back.  There were a variety of climbers, from 6 yr old beginners to guys prepping for El Cap.  We are ditching our memberships at the gym and joining the rock climbing gym!", "date": "6/27/2014"}, {"review_id": "s5SWwTCiIzZZs6SyJNAxjA", "user_id": "FfWO_ZhXgM-JCbo6SHPHGw", "user_name": "Natalia G.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Took my boyfriend here and he loved it!  We were given a quick lesson and then got to start climbing right away.  You can go as long as you want but you do get tired, especially if you aren't someone who does this as a hobby.  We each climbed to the top of two walls and it was awesome,  Would totally recommend this to anyone looking to have a great time.  Definitely coming back", "date": "2/24/2014"}, {"review_id": "Q6nEgfHXgqLmCb1wg1J6gw", "user_id": "U835vdr2p36bJOPYK64C9A", "user_name": "Eman V.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "My review on this gym is out of necessity to climb. The gym is a lot smaller than I have ever climbed at. The day I went happen to be a group event that had a lot of people climbing in this small gym. Didn't allow much freedom to climb with so many people and children running up the wall. Wasn't terribly bad for $8 it was better than my alternative, which is not to climb. This place is the only indoor gym in town, and every outdoor location is a drive away. Necessity has it at 3 *** but it could easily be 2 **.", "date": "9/13/2014"}, {"review_id": "8WsXQfUaQo58Id1rKuZatQ", "user_id": "QsuWl5KzqtOK-5TMtiRUOQ", "user_name": "Nicholas J.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is my favorite spot to climb! There are a lot of routes and they try to change some of the walls every month to add variety. The ratings for the routes are very difficult. If you can climb a 5.10 indoor you can probably climb a 5.9 or a 5.9a here. The community of Stonehenge climbers is amazing! Everyone is very friendly and helpful.Thanks for the awesome gym!", "date": "5/28/2013"}, {"review_id": "z5A1gLmqNZSc4C0Ul3QjnA", "user_id": "t-ZXzaat8CFtUZQjBl5eoA", "user_name": "Harold S.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Tall walls, a variety of routes, helpful staff, friendly environment. Awesome. I try to go every week.", "date": "8/11/2014"}, {"review_id": "BkUUxg0iFIvJcc9HpMKirw", "user_id": "iX00Dtq8xXQsdj7fVFQlQQ", "user_name": "Samantha B.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff and a fun environment. Its the only one in town so it can get pretty busy at times but there is always plenty of space!", "date": "10/4/2015"}, {"review_id": "hblwfRuX5fm9xvmVn1ZbWw", "user_id": "fRXVH0lG8Tl5bSzIbOCB7w", "user_name": "Jenny K.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Stonehenge is the best climbing gym I have been to. You can tell care was taken with each route that is set up. They are fun, challenging, and true to their ratings. While they do require strength, they really demand technique. This is what I love best about the routes. Stonehenge is a great place to hone your climbing skills in preparation for outdoor climbing.Stonehenge is a local family-owned and run business. The owners are committed to ensuring climbers learn and have fun. You will feel welcome whether you are a first-time climber or have been climbing for decades. There's a real sense of community.", "date": "8/18/2012"}, {"review_id": "VovVzigGi2H6I7NPzcAWrQ", "user_id": "DmNMgonbGZK0f2JkNXzHpA", "user_name": "Lim S.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 6, "funny": 0, "cool": 3, "text": "I've been climbing at this gym for nearly a year now. I'm at Stonehenge 2 or 3 times a week. It is definitely one of the highlights of my week. Here are some reasons why I love it here.Owner/Staff - The gym is locally owned and operated by...the owners themselves, who are friendly as-can-be and knowledgeable.Atmosphere - FUN N' POSITIVE! Hands down! Nearly everyone here climbs outdoor, so endless tips and advice will be thrown at you for free. Just listen and you'll become a better and safer climber. WOW that sounded a little intimidating?. Seriously, It's not. Many people here are professionals or students who live a busy lifestyle.Routes and Problems - There are new routes and boulder problems almost every few weeks. So you'll never get bored. The rating for the routes are much tougher than the bay area gyms.", "date": "2/10/2009"}, {"review_id": "FPe-rIuWJaOb99cdP9EjFQ", "user_id": "dUFdPiOJST9RfjJaY-2X1w", "user_name": "Michelle C.", "business_id": "Ku5vilcEodzsSYoDOz2TjQ", "stars": 5, "useful": 8, "funny": 0, "cool": 4, "text": "This is a really neat place to find in Modesto, kind of in a nowhere zone downtown.  If you're a climber of any skill level, there's enough of a variety of routes to satisfy your burning forearms' needs.  One thing i really like about this place too is that it's roped, which makes for nice long tall routes as opposed to the lower traverses that you get at more bouldering-oriented gyms.  It's really low-key, there's usually a friendly dog or two floating around, and the folks are really chill that run it too.  Good prices, free water, cool people, good routes, I can dig it-", "date": "12/18/2006"}]