[{"review_id": "Hgx2PAcB7lMG7kSG2ByIpg", "user_id": "lpXK8wcpSxd28LaycO-_SA", "user_name": "Sean C.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came into the gym one day to blow of some steam. I ended up climbing for 2 hours and fell in love. As a kid I would climb everything from trees to buildings and water towers. Getting up there and climbing different routes was amazing. I am super competitive so I love that they have some challenging routes on the auto-belay section to keep it interesting.Fast forward a bit and now I take my little munchkins climbing. We have a family membership and go hangout there a couple times a week after school. Super fun way to hangout together and do something we all love. Not to mention its a fun way to get your workout in! They also have a pretty good workout facility with free weights and some machines.Thanks for a sweet place to climb and a new hobby for the whole family!", "date": "4/2/2019"}, {"review_id": "tIaTqLv4rlhW59HTGpHdHw", "user_id": "YpbeGhkLucqRx-mKo0J4Cg", "user_name": "Renna M.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "First time rock climbing and it was super fun! I actually have a fear of heights but walls and harnesses made me feel super comfortable! It does take a lot of upper body strength and is a GREAT workout! I barely climbed up two easy walls and I started to break a sweat. The first three walls are the easiest and are used to let people get used to the environment and learning how to \"let go\"! The other walls they offer are very challenging! They have this overhanging wall and it is very difficult and takes a lot of body strength. And the alternative walls are the ones that are color coordinated, which tests your strength by using one color to get to the top. And the walls have cute and silly names that show the difficulty next to it. In addition to the walls they also have bouldering and a moon wall. The bouldering walls are smaller and less spacious but are very challenging, and the moon wall is a extreme test which is for anyone who is interested. Overall is a great place to go rock climbing and would recommend to anyone looking for a wholesome time! The staff is also very friendly and kind and overall facility is super clean!", "date": "3/3/2019"}, {"review_id": "7SY31OnXa-5zYfEoxB0Omg", "user_id": "jOOXWy2-0lQSzrfXefnAbQ", "user_name": "Emily M.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This has been my home climbing gym since February 2017. I have climbed here at various frequencies. Although the dream is to be able to afford to climb 4 days a week I am at once or twice a month or 4 times a month. That being said this gym is affordable even more so if you invest in your own gear. A climb is $20, they also have an excellent 10 climb pass for $180. This gym is an amazing place everyone is friendly and there is a variety of skill levels. There are no egos here. I repeat: there are no egos here. I can watch people lead climb all day. Most of my technique has been honed through youtube videos and watching people climb but early on I did take a class with Dylan and that was money well spent. I enjoy the auto belays. I have yet to get really into bouldering. They have an awesome moonboard in the back so download theGym is clean and well ventilated. Staff is friendly. Crowds depends on circumstances really. I usually climb 3:30-4:30 and it isn't too busy there have also been times when I arrive at 11 am and it is crowded. Was packed at 8 on a Friday once. I went last week and shared the walls with a work group. And then in the summer one day I arrived to like 30 kids from the YMCA or what have you. So the crowd varies. Update-official member, climbing 3x a week. Still an awesome gym. And for people in the reviews commenting about being annoyed about being told they were belaying incorrectly, they probably were. City Beach was different, get with the program. And yeah no shoes in the bathroom, I don't want fecal matter getting on the holds. My only complaint is I think this gym can do more to educate/enforce etiquette, I have been here before when they are girl gangs hogging the routes or a loud couple being obnoxious in the bouldering area, or kids running around, etc etc. Otherwise they are good. I do wish they had more diversity in the VB V0-V1 bouldering like planet granite sv.", "date": "2/3/2019"}, {"review_id": "lU9Ar6MhAT3dvSPGSRE8ow", "user_id": "MRU6eKfofSFlwcFItAsftg", "user_name": "Jonathan S.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "After coming to the Peak for a week and a half, I have to say I am glad I signed up for this gym! Initially I thought that the bouldering rock would get super packed during the evening when people got off work but it doesn't get crowded, even from 6:30p - 8:30 pm. Everyone is really friendly and helps you out. Another cool perk that comes with your membership is free shoe rental so beginners you don't need to purchase your own shoe!  I recently found out that there are 4 squat racks in the back of the gym that barely anyone uses !", "date": "4/30/2019"}, {"review_id": "pbAu0ApqS71-Uh8laGVSAQ", "user_id": "YZVMO0G8kcK8Ft5VjMuVdQ", "user_name": "Anna A.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Nice wall climbing in Bay Area. The crew are so helpful and accommodating. So many walls to choose. My daughter and her friend wore their running shoes (so it's ok not to rent shoes), we rented harness and paid student day pass ($15/pax). Price wise, it's worth it. Thank you Jacob P. for the assistance.We will definitely come back.", "date": "4/19/2019"}, {"review_id": "Q90YaNbp8kvjPTrQFjMOSQ", "user_id": "dliupsToKzf6Jp2EPUWqOw", "user_name": "Vijay N.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My niece was in town visiting during spring break and was looking for a nice spot to climb. Peak of Fremont has several auto-belay routes, so if you are a casual climber you can come by, pay for a day pass and a harness, and climb on! The value for the money paid was excellent and they had all levels of routes, from easy to challenging. I would definitely recommend it if you're looking for a fun physical activity and have at least a little experience climbing (since the level of orientation you get at the wall is fairly minimal if you just get a day pass).", "date": "4/5/2019"}, {"review_id": "E_NFIKNkTptSVlbMN-tnzA", "user_id": "crCSdXMCgC2p3VmMZhKWFw", "user_name": "Ivy C.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 5, "funny": 3, "cool": 3, "text": "My team had an outing here with lunch, drinks, bocce ball, and rock climbing and everything was fantastic.They seated us immediately, and service was friendly and prompt. For a place that doesn't specialize in food, it definitely surpassed my expectations. Collectively, we ordered chicken parmesan, calamari, grilled salmon salad, and pasta. My salmon was grilled to perfection, with slightly crispy edges and juicy inside. Better than most salmon I've had elsewhere.They have a huge collection of whiskey. Glenlivet 12 was $10! I had no choice but to keep drinking from lunch through bocce ball.Bocce was fun. You can choose indoors on a hard, thin carpeted surface or outdoors. We played indoors and everyone enjoyed their time.Onto rock climbing. The young gentleman that gave us instructions was witty and engaging. He made the experience even more fun. Most of us went assuming we'd skip the rock climbing portion but due to his witty remarks or our drunken bravado, everyone ended up strapping in and giving it a go.There are various routes to choose. The mark each rock with numbers and letters so the higher the number or further down the alphabet, the more difficult it is.We started with the easiest and it was super easy, even for my drunk self. Now onto the harder wall (see my picture). Started out okay but man..your height, ability to grip, and strength comes into play. But if you can't ring the bell up top, no worries. You can glide back down and call it a day. I did end up making it to the top. But man it was tough for me. I had a lot of fun here! Great place for team building, family outings, groups of friends, what have you.", "date": "8/12/2018"}, {"review_id": "0eVFeHSHx9mHbBRW6UZtnA", "user_id": "oZ4zwTAR2C9kGUL2aCGccQ", "user_name": "Bert K.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Fun place to climb.Courteous front desk.Many routes, cool vibe here.Clean place; adjacent to an Italian bar/bocci place.Parking: EZ.Tip: after a few climbs, walk out the door and into the italian restaurant pub and play bocci or catch a Giants game. Nice!", "date": "7/11/2018"}, {"review_id": "idy33JpRfves9prRdWMkBw", "user_id": "00zdsqby2PAoWm8ggXq2Dw", "user_name": "Alex P.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "Many of the pre-rigged carabiners did not fully close by themselves 100% of the time. Would recommend replacing carabiners or maintenance to improve gate action.Staff giving belay test were not very knowledgeable. Specifically: when both hands are on the break strand in down position it doesn't matter which on top and I nearly got failed for this trivial difference in technique. Would recommend replacing staff.Only reason we went to this gym is because they had autobelay to keep our big group busy as not everyone can belay. If they had actually failed my test I would have left being unable to belay my group and recommended the rest of my large group to do the same.The lead climbing section of the gym was kinda awkward. saw more people bouldering in the area than climbing with a rope. The first draws were pretty high with hard moves down low. Would recommend gym to provide a stick clip as an option for safer climbing.Me: have climbed all over the world, Lead up to 5.12a, Climbing for 4 years.", "date": "2/19/2019"}, {"review_id": "DXc5sGOvA1sRv-b5iGFn5A", "user_id": "Kwj0OnUBnkXuJu1dbcesVg", "user_name": "Darlene N.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 3, "text": "I've been going here about twice a week for the past few months. The staff here is super friendly and welcoming. The price is a lot for a day pass but it's consistent with what you'd pay for any other climbing gym. I knew I would be coming often so I purchased the summer deal which was $150/3 months for first-time members and that was totally worth the price! They also have student discounts :) The bouldering routes are great for beginners (VB) and experts (V10+?) Also members get guests pasts so I've been able to introduce my friends to climbing. I'm still quite new to climbing so I can't speak much for how soft/hard the grading is but I'd say it's on the softer side (compared to San Diego climbing gyms). You can also belay! They have auto-belayers and I often see kids come in and have a lot of fun.", "date": "9/18/2018"}, {"review_id": "EBUnMZNeHeultRY4axYwHA", "user_id": "4sKtifdud33YJuTn34O-pQ", "user_name": "Kun L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Really nice front desk, shoutout to:Rubin,Priscilla,Jeff,Super nice humansIf you find jeff, challenge him to a pull up contest.Nice introductory course to people who dont rock climb and boulder. You're supposed to climb according to color, haha. Nice rocks and level variations and gym in the back. The gym: a small bouldering section in the front, can also boulder in the rock climbing areas too, but only to a certain point, more of a rock climbing gym.", "date": "8/12/2018"}, {"review_id": "E61V0OF1-9-I9RaU9EQoVQ", "user_id": "nPK70hN9kLQvgSzdDxTe9g", "user_name": "Jay T.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 1, "useful": 12, "funny": 5, "cool": 1, "text": "Stay away from Priscilla, an employee working at the front desk. It turned out she has a dark side and can suddenly become super disrespectful and mean. I've been going to this gym for about 20 years, from the days when it was called City Beach. In the last couple of years I've been visiting it on and off. I was there a couple of days ago with my two daughters, both aged less than 10. The harnesses they provided are really adult sizes, with very long straps. I commented that in the past there used to be smaller harnesses for children. I know for a fact that City Beach had those. This simple comment apparently triggered Priscilla's dark side. It was as if I unknowingly pressed a wrong button. She said there never was such harness.  She was probably a toddler or smaller when I started climbing at City Beach. Her behavior changed from then onwards.She kept watching us. That made me and my daughters very uncomfortable. She seemed to be looking for a reason to charge.At one point I got a harness to belay my daughters. I guess this gave her the reason she needed. She came, staring at us for sometime, then came up and claimed that I was not belaying properly. Any climber with a reasonable experience knows there are several ways you can use the gri-gri to belay. There is no single best method. I was shocked. I asked why, what's wrong. She claimed that she cannot tell me and that my way was wrong - that was it. I was appalled she became more aggressive and more disrespectful.Then with the satisfaction of a commander wining a hard-fought battle, she stated that they'd revoke my belay certification since I don't it \"properly.\" I was like, fine, I don't care about \"your\" belay certification.I just came here for some fun climbing with my daughters. Just leave me alone - I returned my harness and belay device.Just when I thought it was over, my daughter needed to go the bathroom urgently. While I was taking here to the bathroom, she yelled from behind \"heyy no climbing shoes in the bathroom\"This really made me angry. For 1) you can put a sign by the door so everyone knows 2) since when it's OK yelling to a customer with a small child about something they wouldn't possibly know about? What happened to courtesy and professionalism? Priscilla was beaming with another victory as she had a chance to yell at me.Then a manager came over. I told him about her behavior. He's like \"well, she's following our safety standards\". I mentioned that there's no one single rule in climbing. But he wasn't really listening. He just defended his employee's behavior, showing absolutely no concern for her extremely rude and disrespectful attitude. Basically they make up their own rules to make you uncomfortable and leave if they so decide based on their whims.Anyway I won't be going there anymore. I'm advising my friends likewise.I don't want Priscilla or anyone else there to unleash their fury at me or anyone I know.", "date": "10/29/2018"}, {"review_id": "AFcssWyw75-3QW4vbcowng", "user_id": "ZoELGLRucNH2WaPGpXmaPA", "user_name": "Shannen R.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 6, "funny": 4, "cool": 3, "text": "10 AUTO BELAYS, FREE CLIMBING, GRIP BARS, AND A CRASH CIRCUS LOOKING COURSE? YAY!The Peak is located right along the 680 Freeway and near many restaurants to eat afterwards. This climbing wonderland shares a space with Bocce Ball and a fancy restaurant. Once you open the doors, you're greeted right away with an employee. Someone will help you put on your harness and show you how to clip on and off the belays. That alone only takes 5 minutes. Afterwards, you can hook up and climb on your own. Climbing up was definitely fun. It took a few tries to let go and trust the auto belays. Once I got use to falling, it was easy to get down lol.There's different rock colors on each belay, so if you're thinking \"only 10 auto belays?,\" well think again.  You'll find yourself there for about 2 hours or until your arms and grip give out. It's that fun. Don't be shy to ring the bell when you get up, because I did!\"And I'm freeeeee, freeeeeee fallin'.\" For the elites and badasses, you're able to free climb and free fall onto cushions. Yes, I've said that right, no harnesses, just climb your heart out.You know what the second best part is? The pricing. Here, I'll break it down for you:- $20 for a DAY PASS!! You can literally go home and come back as many times as you want in that same day!- $2 for chalk! Trust me, you'll need it. It helps a lot. The bag has a clip for you to hook onto your harness, so don't worry about someone taking your chalk!- $5 for climbing shoes. I never rented one, but looking back and watching other people, I should have. They help a lot.I came on a Saturday at 12pm and at 8pm and I didn't have to wait in line for auto belays. My S/O and I had a great time and I'm sure we will be back soon!", "date": "3/19/2017"}, {"review_id": "YP-fh2ia_1fcSZbH-lE26Q", "user_id": "F_nC-9BTUB9cCK2xuGjtdA", "user_name": "Jeff W.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Brought the kids here for a weekend spent enjoying the autobelays and eachothers company. Allen, one of the desk staff there - even introduced me to the concept of lead climbing. Rad! Allen was so nice he grabbed dinner at campo, there-after, with our family. 10/10 would recommend!", "date": "1/7/2019"}, {"review_id": "RgSH2izmFgyee8ac2WDmXA", "user_id": "2vm89njX9UyhFpnnCgocFA", "user_name": "Catherine L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Super friendly staff with good climbing options. I dropped by for my first time on a Friday evening and the place was pretty fully with families, solo climbers, and groups of what seemed like regulars. $20 ($15 with student ID) for a one-time drop-in includes a harness so you're pretty much set to go unless if you want to rent shoes. There are 3 unmarked beginner walls, and there is a different section dedicated to bouldering. They have 9 or 10 different auto-belays which is actually very easy to use and not as terrifying as it seems.", "date": "10/9/2017"}, {"review_id": "N3tR4iscIxlr7IeJxu6z1A", "user_id": "PoYDXgL_ucmbNZpMfcLnmQ", "user_name": "Yvonne L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 15, "funny": 6, "cool": 5, "text": "This is important enough to put at the top of my review - AUTO BELAYS! Eight of them!  If you: - are an introvert - are shy - want to do your fitness without people bothering you - are done with being social by the time you get to the gym - never have friends around when you want to go climbing/working out - are friendlessthen this is a great climbing gym option.  Auto belays allow you to climb the top-roping routes by yourself.  You don't need a buddy, and if you're like me and work super late into the evening or your friends don't live nearby, then auto-belays are your answer.  It was the number of auto belays at this gym and the variety/difficulty of routes you could climb with them that convinced me to get a membership here after only being here once.Now, there are plenty of other social folks who climb at The Peak or who come in packs of 3 or 4, but I was so happy to find a climbing gym I could go to without hauling a friend with me or feeling like I would have to bother other folks when I want to climb a route and didn't have a belay partner.That said, if you are indeed friendless, you can also come here and this is a great place to make friends. The community here is super friendly.---I climbed for the first time at The Peak of Fremont and have to say that as a beginner climber, The Peak is very un-intimidating, welcoming, and friendly.A friend and I came here for the first time on a weekend afternoon.  We were greeted at the front desk and signed our liability waivers electronically, paid, and got our rental equipment in short order.  There was some kind of promo going on this month, so all rentals needed (harness, chalk, and shoes) were included in the drop-in price - $15! That's much cheaper than I've seen at other local climbing gyms.Since it was my first time climbing, the front desk guy gave us a quick run-down of how to use our harness and how to clip into the auto-belays, and explained the numbering system and some safety tips.  Then he sent us off to explore.  My subsequent visits the various front desk folks have been equally friendly and have always answered my questions knowledgeably, with a dash of humor thrown in.There was a good number of people there, but we never had to wait for a route to become available, and this seems to be pretty consistent during the evenings when I come as well.  You could definitely smell that this was a gym, but the ventilation was pretty good and after awhile you just stopped noticing the vague smell of body odor. Lots of people were climbing on the top-roping routes as well as the auto-belays, and a fair number were also at the bouldering section of the gym as well.  I also saw a number of kids climbing here that first Sunday, so it seems very kid-friendly as well.The padding was appropriately thick and all of the climbing areas were very clearly marked off.  There's an open area near the back with an obstacle course above (I'm told it's only opened during group events, like for team building or special occasion reservations), a smith machine, and some basic gym stuff though no free weights of any kind.Overall I had a great time.  I've been several times since that initial first time, and love the experience and environment enough to get a membership.  The perks are pretty good, as is the price, and even though I've heard this place isn't as big as Planet Granite, the location and pricing is good enough that I don't mind while I'm still wearing my beginner wings.  The routes seem to be changed out pretty regularly, and even as a beginner I found enough routes to occupy me on each visit without being bored. My only criticism is I do wish that they had a little bit more in the way of free weights, for more options in terms of alternating my workouts.  They have a lot of space available in the back area (especially since the obstacle course isn't usually open) so there's a good amount of room for everyone.  However, it's a very minor criticism and I am otherwise very happy with my membership here. Highly recommended!", "date": "11/18/2016"}, {"review_id": "9u1IcnSDbfDuJFAgBkPRCQ", "user_id": "-TBFZ48Er0nXjSZpG4BmBA", "user_name": "Jaime F.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 3, "funny": 3, "cool": 2, "text": "This is a great indoor climbing facility to start out at because of the auto-belayer.  In fact, this is where I first tried out indoor climbing. They have different routes for different levels for climbing and bouldering.I'm all about trying different fitness experiences, so I had a lot of fun at The Peak and I'm hooked to indoor climbing. Lifting your body weight is a great exercise. It is inexpensive and it's a good deal getting a pass, equipment, and entry throughout the day. The most difficult part will be the first ascent and doing a trust fall with the auto-belayer from a towering height. Just trust it will support your weight and that you won't come tumbling down from up there. Everyone experiences this the first time. The flailing and inner scream are all part of the first time you just let go and let yourself fall.", "date": "7/8/2017"}, {"review_id": "1wT7V7sUBGyrFmRja36Ufg", "user_id": "WhBn4AXzLwZUpLXHr3ax1w", "user_name": "VH ..", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Climbed here for a few months while I was in the area. Overall, its a pretty decent gym. WHAT I LIKE- Community. This is a smaller gym, so people say hi and faces become familiar. Unlike other climbing gyms, the environment felt very welcoming, which is great because climbing is really about community. - Small size. The gym is pretty small, though they pack quite a few routes into the space. The nice side of this is that even when it gets busy, you never have to wait more than a few minutes for a route.- Autobelays. Most bay area gyms lack autobelays, so the fact that Peak offers 9 is noteworthy (4 are strictly beginner routes, the other 5 have 5.7-13 routes). I loved being able to climb at odd hours without having to convince a friend to meet me at bizarre times.- Staff. The staff is chill and friendly. They're welcoming, helpful, and make an effort to meet climbers. They seem to like what they do, which makes the experience that much better.- Moonboard!!!WHAT CAN BE IMPROVED- Amenities. They're pretty limited. No lockers (just open cubbies), so you have to tote your phone and keys around all the time. No showers, so you can't climb if you need to go anywhere decent afterwards. Restrooms are outside the gym and shared with the neighboring restaurant. Workout area is tired and only has 1 of everything, though there is neat obstacle course. - Routesetting. I like that routes turn over every 2 months or so, but I was underwhelmed with the top rope setting. I felt like the routes lacked creativity and I wasn't doing much problem solving, even with the harder routes. Most routes felt relatively similar. Still a good workout, but a large part of the fun of climbing is the creative problem solving.Other notes: - Grading is fairly soft here, but it's consistent- This is a great gym for beginners. Plenty of basic routes to help you get your feet wet- Parking is plentiful- Prices here are notably lower than the competition, though you don't get as many amenities. Overall, a good experience. When I'm in the area again, I'll definitely be climbing there.", "date": "8/14/2018"}, {"review_id": "rPUM3F3fK1d5uMPR7L1sMg", "user_id": "KCjgTeJU5eUXGVFM7bM1wQ", "user_name": "Okapi C.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "We had a free day pass coupon and went here to check it out. Fun day. Good exercise and range of wall climbing. But the space is a little small so lots of people and you sometimes would need to wait in line for others. You also need to pay for chalk, which I was hoping would be free with a day pass - at least that made more sense to me!The bouldering section wasn't that great. I much prefer the actual climbing sections, but I do wish we couldn't done some of the repel stuff. We did the automatic ones, which were fun. If it was a bit cheaper, then we would do this regularly, but a bit pricey for our taste. Fun experience though! And friendly staff.", "date": "7/7/2017"}, {"review_id": "DNUnu8JZ6CP8MVWo_8H2KA", "user_id": "ZPCTSorijsJnP7ZHElMdjQ", "user_name": "Crissy B.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 3, "useful": 0, "funny": 2, "cool": 0, "text": "It's a cute place almost like city beach. They don't offer family military discounts only for the individual.", "date": "7/9/2018"}, {"review_id": "UtKXU6iouiJc8nzfkyLqeQ", "user_id": "aZ0o1iKdV5Rifl36swAaDw", "user_name": "Lam L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "Went here with a free trial pass from a friend.  It's small compare to other but the community is closer. People just chill and hang around after bouldering and trying to solve the next climbing puzzle.  I didn't realize you have to plan ahead before just climbing up. I'm a newb so my arms was dead after a little bit.  Need to learn to use my legs ...for beginner ... get CHALK ... lot of CHALK!the parking lot in front is small, go on the backside, there's plenty there. also, this gym is inside the damn restaurant ...", "date": "5/31/2017"}, {"review_id": "Vez2X90nWDHhJ4anNuHJCw", "user_id": "0QoZaoVpYtP2_1yBFiJ4og", "user_name": "Tamara A.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My S/O and I tried rock climbing for the first time here! The auto belaying system was perfect for us and anyone looking to start! The environment was really welcoming and everyone seemed very kind and helpful, especially Ruben, the man who rung us up and showed us the ropes. I'd definitely come again.", "date": "9/10/2018"}, {"review_id": "Pd2_zC8jGPDyz7l_v7ZVFA", "user_id": "LQblQGt0pWe7oCdLeajLJQ", "user_name": "Ryutaro M.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I started rock climbing here and have been here twice. Im working on wall since I'm still level 0-1. Since they have many challenges on walls, even I can spend 1hrs to go over all the v0 and some v1. Beginner tip: you might experience skin peelings but it happen to everyone until your skin gets strong.  Front has first aid kit ask for it if you bleed.", "date": "4/23/2017"}, {"review_id": "9MYjstQrJo5xIMCL3uKQHw", "user_id": "EKFLVzbPiBZB70uc2UYdKQ", "user_name": "Asheley D.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 9, "funny": 7, "cool": 8, "text": "Ah i love this place so much!!! I go like twice a week to do some rock climbing or bouldering to make use of my membership ~$50 per month for students. Very reasonable price considering they offer free equipment rentals (shoes, harness, chalk), free bailey class and also you get to bring a friend in for free once a month!! (Valued @$20) and if thrh are brand new can also bring them in for free!!", "date": "2/27/2018"}, {"review_id": "Q2Ucw3bGj2HOV8ngyi-0Xw", "user_id": "Kq8ffh-Lp1n9Bul28pOK6w", "user_name": "Yoyo L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Seriously that was my official first time of rock climbing!! My experience here is fun and secured. I always afraid of heights, but I would love to challenge myself from any kind of sports activities! Rock climbing is one of the best way to do it! I would highly recommend this place for all levels of climbers INCLUDING KIDS! Services are friendly and helpful, shoes rental are available and super affordable too!! Definitely will visit here again!", "date": "4/17/2017"}, {"review_id": "VdtS6xgB1cc8XntKvtk-5g", "user_id": "6s66QKwS5zz7l_kTSFX31A", "user_name": "R P.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I was fortunate to have a few months off and signed up for a membership here to learn a bit about climbing. The auto-belays are so great especially for a novice - I was able to come in alone and get started. I decided to take a couple classes and worked with Jonathan Dang. I highly recommend the investment and working with him - he's an excellent tutor and knows what to say, when, how much, and what motivates you.  I was able to immediately put into practice what he taught me and felt a little bad-ass when I climbed something I hadn't been able to complete before! How fun is that!", "date": "5/15/2018"}, {"review_id": "oXn2c8z0tnbJz5YILrZa7g", "user_id": "zsF1HD0f8mG6WmD2T6YGnQ", "user_name": "Leah A.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 6, "funny": 1, "cool": 3, "text": "Came here for a belay class at 7:30pm on a Friday with some friends. I've gone rock climbing at 2-3 other places in my life, but that's spread out over like 20 years so I always forget how to do this stuff lol. I've been to Climb Works in Berkeley, Planet Granite in Sunnyvale, and City Beach before it got taken over by Peak of Fremont. Let me start off by saying the staff here is BY FAR the friendliest!!Over the phone, the person said the lesson would take about 30 min but we took a whopping like 1 hour so kudos to Riley (I think that's his name) for being so patient! Had tons of fun here and I definitely recommend coming here! I want to come back! It is also the cheapest indoor rock climbing place I've come across. For a class, harness rental and shoe rental it was about $32 a person. It wasn't too crowded on Friday night either.Finding this place is a little tricky, you have enter through the back. The building says \"Bocce Ball\" huge instead of Peak of Fremont.", "date": "10/27/2016"}, {"review_id": "54oH3szx44L1K8PoGkPn0w", "user_id": "TWrRTAtqfNwBNNK9RbJQGg", "user_name": "Theresa G.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "They have. Friendly staff that is always all SMILES. Use to be City beach and now are under renovation. You can soon play Bocce ball here.", "date": "7/25/2016"}, {"review_id": "6iJ5qD739Eg0sYnzD9Xcfg", "user_id": "_SoZj64tT-tngb6Yk8l7xQ", "user_name": "Yennie L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time rock climbing. It was actually scary for me because I keep thinking those grips aren't sturdy. So I tried climbing straight up and way to the top! Wasn't bad at all. Once you get the drift of it you'll keep climbing. Fun date~", "date": "6/4/2017"}, {"review_id": "JTMgeDIVcefiu0vec_Idqw", "user_id": "ogZG89a-naCWJVfMAevt8w", "user_name": "Marshal R.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Located inside the Campo Di Bocce. The parking lot was kind of a headache to find because I thought you could simply access it from the Auto Mall street.... nope, have to go around. Just use waze or maps, I just thought I was savvy enough to get there without it.Anyways, had an overall good and fun experience for my brother's birthday. Used the auto-belay for the first time (I usually just boulder). It was awesome that the harness was already included in the price.With that being said, the boulder section seemed pretty cramped and short, wish it extended a little longer. Also wish there were just a few more auto-belay's set up. When it got busy, almost all of them were in use.Will I come back again? There's a really good chance that I will!", "date": "2/14/2017"}, {"review_id": "wieP0gngwnr--Eikw-6GGw", "user_id": "RxODyKKlDRuuZNNZQPS64w", "user_name": "Tony L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 7, "funny": 4, "cool": 6, "text": "If you're new to rock climbing, go the Peak of Fremont.This is by far the friendliest and most accessible climbing gym in the Bay Area, and this is the only rock climbing gym where i have seen parents take their kids. This is also the most inexpensive climbing gym in the Bay Area.Additionally, this is the only gym that I've seen in the Bay Area with auto belays, so you can climb taller paths without the need for a partner. The auto belays work perfectly, and assist you down with a staggered motion. The only thing about auto belays is that if you fall, you'll most likely end up going down all the way, because you will not have a partner to catch you in the same position. You will not be able to rest with the support of a partner. I remember when I was frustrated with a toprope problem, a staff was walking by and gave me a quick tip on how to get over the crux of the problem. The people here are what separate this gym from others, as they seem to genuinely care that you are enjoying your experience here. Keep in mind that this gym is on the smaller side, so it doesn't take too long to explore every path. I'd say it's about half the size of Planet Granite Sunnyvale, if that. The Peak offers toprope, bouldering, and lead climbing paths. Most of the gym is toprope and lead, and just a small part of it is bouldering. Their website offers a good overview of the paths offered. thepeakoffremont.com/pdf…Climb on!5", "date": "11/6/2016"}, {"review_id": "KdWS9ymb2GBxXtchDI2stA", "user_id": "0ecT_Ql6NMMo-DSUa0cx3Q", "user_name": "Jason W.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "Now that I've been climbing here for a good few months, I can't help but reiterate how much I love this gym.I've been to all the PG locations as well as Bridges and the environment, friendliness and people just pale in comparison to this gym. I've come to know a lot of regulars and I'm always greeted with a fist bump or smile. People are never snobby about their abilities and it's common to see people climbing V6s and V7s cheering on others just embarking on their bouldering journey and sending their first V2s.The staff continues to be friendly and knowledgable which only makes the experience all the better. The routes are still well thought out and provide a good amount of variety. Lastly, this place is never too crowded. Sure it gets busy but nothing that prevents you from getting a good climb in. I honestly love this gym and look forward to coming in every single time. I hope that never changes; keep it up guys!", "date": "8/25/2016"}, {"review_id": "B2KJ6grDMUZr8WA5Pb7x9w", "user_id": "n6qrzw7_Rkz2M-pUE44ibg", "user_name": "Chris V.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is awesome. It's pretty much my second home. Everyone is friendly, welcoming and always willing to give you some climbing advice or just cheer you on. They also have the best Famous Amos cookies in Fremont.", "date": "4/30/2017"}, {"review_id": "-WWnOYFNO8lFEv2RPTmFDQ", "user_id": "VyTgTb5Xdl_NZu_uLziOYQ", "user_name": "William M.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "I would probably give this place a 3.5 but bumped it up because the staff was so cool. I went here once with Jason W. during a visit to the Bay Area and bouldered for about 2-3 hours. There's also toproping/lead available as well as auto-belay, but I didn't touch those. The bouldering problems here are very diverse with a wide range of wall orientations, though it was lighter on slabs/verticals and skewed a little towards overhangs/caves. My highest send at my local gym in Boston was a V4 and I sent a V4 here, so grading seems decently accurate. My only complaint is that some of the holds (especially the feet) are pretty greasy with visible black smears from other climbers' shoe rubber. I guess that can be a good thing if you want to work on perfecting your footwork.The vibe was really cool. The climbers and staff were very friendly so I could see myself having fun if I frequented this gym.", "date": "8/24/2016"}, {"review_id": "5dCDHJaE0yc4ryAc4jUagw", "user_id": "a2mQNfHKPlg64_YAW7Wplw", "user_name": "Kevin H.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Staff there is very friendly. Got in and got climbing within 10 minutes. This place is beginner friendly, even though I saw a lot of climbing veterans there. Everyone is so friendly and easy to talk to, including the other customers. Great place for climbing.", "date": "9/6/2017"}, {"review_id": "5APcP0BQ24nzlCch_iGl4g", "user_id": "sKW0PCfD7BZfaNrXzurpVQ", "user_name": "Demitri M.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The staff are friendly, helpful, personable, and avail themselves to answer questions. They install new routes and clean the stones frequently enough to keep things interesting, even for someone who goes there frequently. Creative, challenging route-setters.My one big complaint is that there is not really any room to change into active wear. Your options are to arrive wearing whatever clothes you intend to climb in, change in your car, or awkwardly use a stall in the adjacent restaurant's bathroom (and if there is no rule against this, there probably will be soon, if enough people end up doing it).", "date": "12/6/2016"}, {"review_id": "KSWv0Fwi7bxBT3HksUVg9A", "user_id": "ZGXOdqaIcwQc1xpB_L_QcA", "user_name": "Andrew R.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was awesome. The prices were significantly cheaper than in my home town. There were plenty of different routes when using the auto systems. I went at opening 11am and I shared the gym with two other people for the first two hours. The staff was friendly and the facility was extremely clean and well kept. I wish this gym wasn't on the other side of the country. The shoes and chalk bag came with the early bird session for 12 bucks. 11-3. Thanks for the great time!", "date": "11/1/2016"}, {"review_id": "5qo3cCmJrCVoMfrskbEOiA", "user_id": "oVrNDNOycwFfq1FjT20_HQ", "user_name": "J B.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Huge thanks to Eric, staff,and manager, Jacob, for such great service!  Able to answer all my questions with ease and made my rock-climbing, re-experience (I've done in past, but a very long time ago) a great one.  I had an enjoyable Saturday night of rock climbing fun.  Will definitely be back for sure!", "date": "3/12/2018"}, {"review_id": "aEdCcYg05RyiYXyXVdFXfw", "user_id": "zpk3dAG9xqBzwBjh0jBMbg", "user_name": "Xi Z.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "City Beach changed management and now it is Peak of Fremont.As of today (4/21/2016), only rock climbing is available and almost the same as it was before.  - They change the routes frequently. - Autobelay is available with some weight on easier routes so first timer would not need experienced partner (belayer) to start climbing. (But in common people are afraid a bit more about that autobelay than a real people belay top-rope) - Prices for membership I think changed a little bit. Benefits did not change. - Staff is all very friendly and helpful, good folks.Sports bar and other facilities are under re-construction, and should be available soon I guess.Definitely worth coming in and try (and get hooked up).", "date": "4/21/2016"}, {"review_id": "FZBCE9kEcwyvhJ24Uyv9ng", "user_id": "sfF46f2qp5avHMAP8wRSNQ", "user_name": "Angela R.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love climbing here! Staff has always been helpful and most are easy to approach. I absolutely LOVE the auto belays; there's a good variety of difficulty for each. Routes are changed often. The bouldering area is fun but easily gets crowded. I suggest visiting right when they open or before 5 to avoid large crowds.", "date": "8/2/2017"}, {"review_id": "uez4uhWnqsgOTjmKJ7TrYA", "user_id": "jHfFtAQnYm6TcLdMyQ8JyA", "user_name": "Phillip E.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is a ton of fun. Great workout, friendly staff, massive space. I highly recommend for anyone looking to take on a new sport that is equal parts challenging and therapeutic.", "date": "5/27/2017"}, {"review_id": "zOLA3y_KfdcLat-dYgJ2Sg", "user_id": "gV5qjtZ_txQhtY6hUr76-w", "user_name": "Natalie K.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been climbing here for a little over a month and it's been nothing but great!- wide variation in routes: everything from 5.8s to 5.12s to accommodate all levels of climbing- several auto-belay devices spread throughout the gym, meaning you can come without a partner and still get lots of good top roping in- routes are changed frequently enough so that you don't get bored, and left up long enough so that you can work on the ones that take practice over a matter of weeks- super friendly staff who are fun and encouraging regardless of your level of climbing, no elitism- reasonable membership fees (cheaper than Planet Granite)- family-friendly environment: you'll see climbers of all ages and levels hereIt can get a little crowded in the evenings and on weekends, but that's to be expected, and it's never so bad that there are lines or anything. I find that going anytime before 5 p.m. or after 8 p.m. works well if you're trying to avoid the rush.", "date": "5/2/2017"}, {"review_id": "sM1zrZMoaRK4pOcJS76IkA", "user_id": "d3Bo5XEL_vk8dGg_vjhdJQ", "user_name": "Nathan T.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "No sandbagging here. So don't come here to feel good about yourself. Come here to push yourself. Why would you climb anywhere else?", "date": "8/24/2016"}, {"review_id": "Rymc9FYee8t1m0Ij2Tj63Q", "user_id": "KamjEHv0lMPgL_7hZJeXtg", "user_name": "Ida L.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my favorite indoor facility, all staffs are friendly and professional.  You can always get beta from fellow climbers or the staffs there.  I feel totally welcome each time I enter the gym.  They have autobelay from 5.5 to 5.12 (or maybe 5.11d).  It's a perfect place for anyone at any age.", "date": "5/20/2016"}, {"review_id": "XqfX4nXsEt50SBCGqy8RCQ", "user_id": "bTU3UctYbrHVO_fLqN759Q", "user_name": "Kristoffer R.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "This is a pretty cool rock gym. It used to be called City Beach but it's now under new ownership. The staff are the same and they're great. I love the community and the fact that they change the routes and problems often. Great place to climb and awesome members.", "date": "4/14/2016"}, {"review_id": "hzY7xzo3Y7H1aPXnGPXGGA", "user_id": "3AemO54ArRgy7Dr4ZX2DIg", "user_name": "Thuy D.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great customer service with friendly knowledgeable staff. Perfect activity for all ages and skill level.", "date": "7/31/2017"}, {"review_id": "i5z7giHhaaSwfmL54AT_Mg", "user_id": "Ocasc1UwxtDEVbS39c-Mnw", "user_name": "Tyler B.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Tremendous staff and facilities. We brought our five and seven year old for the little lizards class and they are now hooked on climbing. The staff has great patience and does a Wonderful job of explaining technique to the kids. Amazing activity to get involved in, especially at Peak.", "date": "11/26/2016"}, {"review_id": "GPIYjU9BbXsF2kvf3SledA", "user_id": "U2GvhdmmystOMq0ZgPWZ4w", "user_name": "Dave K.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been climbing here since 2014. Great routes, great staff, and most importantly, a great community. The gym overall is currently (hoping for expansion one day with the new ownership!) on the small side compared to other gyms in the bay area, and additional workout equipment/machines is minimal. But at least for me the whole reason I come here is to have fun while staying in shape... and I really don't consider lifting weights fun.Also, this is one of the cheaper, if not cheapest places to go for a day or membership, and I just saw they've got some pretty good deals this summer.Here's the link to this gym before the mgmt change if curious:yelp.com/biz/city-beach-…", "date": "6/4/2016"}, {"review_id": "lKcWuB5daLcK-bH4q5qTVQ", "user_id": "M--TddSJTvXTQWhrA1iqUA", "user_name": "John M.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is awesome. The staff were extremely welcoming and friendly, especially to somebody who doesn't have much experience climbing. Jonathan was very helpful and made our experience great. We will definitely return.", "date": "5/20/2016"}, {"review_id": "idfdgILLvretyl454LdxRQ", "user_id": "c5XhIjV2qAZPfso-HGH9VQ", "user_name": "Hazel C.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Currently under construction but they have a good deal with the equipment included. What I really like about this place is that you dont need a partner to do rockclimbing as you can do it on your own. The facilities are well maintained.", "date": "6/10/2016"}, {"review_id": "B1_JRBCeWIb4HA2T476uwA", "user_id": "2SWC2aMbEx-oyltaJFGoUg", "user_name": "Fran P.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is too cool! AND relatively cheap. $18 for a whole day's worth of rock climbing. They also have a membership you can join that runs roughly 30 a month (if my memory serves me right, don't quote me on that). We went on November 19 and the service that morning with the two gentlemen was superb. They were sweet and funny. We arrived right when they opened. At that time, there was only maybe 3 other parties there. We stayed for roughly two hours... and it was PACKED. So I do have the recommendation of coming on a weekday if you don't like crowds (of kids at that). Now unfortunately, I am NOT athletic in any way or shape so I wasn't able to utilize the full day pass as much. And by the time the crowd came, we decided it was our time to go. But when I wasn't attempting to climb the walls, I was thoroughly enjoying watching other experts do so. My husband has been nagging to come back ever since. I only wish there was a cheaper option for those who would stick with the easiest walls. That would make it more affordable to come back for me. But on another special occasion, we will be back!", "date": "1/10/2017"}, {"review_id": "msyX8b5aAyT_9fmY3UBXyg", "user_id": "Y4upEeAyc9xaGNlHMMiaTA", "user_name": "Kristine B.", "business_id": "yTw59B9_fH110QiEVFizyA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great family climbing gym! The monthly membership is reasonably priced and my family just loves this place!", "date": "11/15/2016"}]