[{"review_id": "Jw4KCpTwoFrPlXVLb2b13w", "user_id": "vLAqRlzIoCKqGMzuHikPVw", "user_name": "Lauren A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Staff was nice, especially Gerry!! Haven't done (indoor) rock climbing in almost a decade, so I was super rusty. He took a minute or two out of his time to give us some tips. Thank you, Gerry!! This place had a bunch of auto-belay/beginner-friendly walls, too. Has a basic gym on the second floor and they also offer yoga classes. Really thinking about getting a membership and ditching my gym.", "date": "4/16/2019"}, {"review_id": "ippDxeHlKcztwrkDjR-01g", "user_id": "f891N4WVz01ZyQPTMokChA", "user_name": "Charles H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going to this gym for a whole year, and I don't ever question the membership fee or my commitment to this gym.The staff here are super friendly and knowledgeable.  They're willing to help you with any services or even route questions.  I often see them chatting it up with other regulars, which really emphasizes that this not only a gym, but also a community.The bouldering routes are where my friend and I often like to climb.  I really enjoy their front and back wall where they explore balancing puzzles and other unique tactics.  I'm currently a V2 climber, and I feel they have a lot of routes for a beginner like me.  Sections of the bouldering wall rotate every week meaning that each route will be on the wall for about a month.So far, I know how to belay from their complimentary-for-members classes.  They use a belay device (no grigris), which you can borrow from the front desk without any charge (at least for members).  There are numerous top rope routes, often ranging from 5.4 to 5.11F.  I don't use them that often because my friend enjoys bouldering more, but I always like to hop on to auto-belays and climb a few of their gigantic walls.  They have a community board for those who want to make a new friend and/or practice some belay/lead climbing.  Sections of the top-rope routes change every 2-4 weeks meaning that each route will be on the wall for about 2-4 months.  Don't worry, there's a LOT of walls to climb, so you won't be bored.There's a fitness center upstairs that I like to use on occassion.  It has the basics: dumbells, squat/bench rack, bikes, treadmills, rowing machines, and ropes.  They also have an open-air studio which houses classes for yoga (which is also complimentary for members).  I often go to the yoga classes after climbing, and the yoga instructors are often very enjoyable.This gym also has events.  Recently, they had a competitive climbing events.  Sometimes there will be sales on certain items and visiting venders.  They even had a flea-market-esque sale where you can bring in your own gear for sale and buy someone else's used treasures.  It's all kind of exciting and they do a good job updating you when these events will be coming.For the men/non-binary restroom, they have showers, complimentary towels, a locker room, and a sauna.  They also have complimentary coffee and tea if you happen to be climbing before noon.  Also, I love their water bottle refill station.  It sounds kind of silly to really rave about, but their whole gym has an air of eco-friendliness and open-mindness that really allows you to feel comfortable there.I often recommend friends to join if they can afford the membership (about $81 a month).  They occasionally have deals to waive the initiation fee, but if you're heavily considering joining, I wouldn't hesitate.", "date": "3/11/2019"}, {"review_id": "FZ1adsS4LMFjT3onhiA7Ww", "user_id": "KixiVskse_oGoVMehboSGA", "user_name": "Grace K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "The Stronghold Climbing Gym is the best climbing gym I've ever been to. It's HUGE!!! They offer bouldering, top rope, and lead! It's located inside of an old factory and the ceilings are ultra high. This means, the routes are a lot higher than most other gyms I've been to. SO COOL!The staff was extremely professional and kind. I had a lesson with Kevin and he was awesome! I noticed that they offer personal training there and there were approximately 8 trainers with various levels/history of climbing. Rates seemed very fair. Members receive a very large discount vs. non-members. There are a small handful of auto-belay systems on some walls, which I appreciate. You can't always go with a friend so this makes it much easier to be consistent. Also, the gym is DOG FRIENDLY! Whhhhatt?! Yes, that's correct! If you have a well behaved dog, you can bring them with you!!! SO RAD! Oh! There's a sauna and showers in the locker rooms! On the second floor, you'll find a small but mighty gym section with free weights, ropes to climb, power rack, treadmills, Concept 2 rowing machines, rope machine, rice bucket, and some kettlebells. There's also a little yoga studio up there. Across from the gym area was a large section of holds to help increase your climbing skills. The only downside was the lack of parking. It was raining and I had to trek a ways to get to there. Otherwise, I love the area it's in. Tons of cool businesses in the Arts District so you can spend a whole day there if you wanted to! I will definitely be back (with my dog)!", "date": "2/10/2019"}, {"review_id": "WRt3MA5UynsdidllQzW10w", "user_id": "LbCGiFjcTpjiYmhffM4CZg", "user_name": "Jessica G.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really nice instructors and staff. Great classes for beginners. Parking can be a bit of a hassle but it's not the gym's fault.", "date": "5/21/2019"}, {"review_id": "-lTfeKOEkuQO_dW3m29aEA", "user_id": "5WNpVilRzHWPky9uZNsQtw", "user_name": "Coleen J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "PROS: - best place in LA to lead climb indoors!- great sense of community with all the other climbers - community input on problem difficulty; tags that climbers can rate with sharpie- very friendly owner (Peter) - autobelays on certain walls!!- unique location for climbing gym- dog-friendly!!!!!- they sell a very large selection of climbing books - small training section on top of one of the walls (they have a moonboard) - they offer a 3-hr beginner lead class that is pretty extensive and cheaper than the class they offer at Touchstone - can get really cold in the winter time CONS: - difficult parking at night- desk staff not too friendly or helpful- predominantly geared towards rope climbers; bouldering section isn't the largest - bathroom had free lockers available but most of them had faulty locks that wouldn't open", "date": "12/27/2018"}, {"review_id": "UApILz1Vh_2zHzuQCZbRJw", "user_id": "8kdoqTNo5q15S1k3_cz4LA", "user_name": "Sherry C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I purchased a Groupon for an Intro to Climbing class. It was my first time learning how to climb. Kevin, our instructor, was super friendly, patient, and welcomed our questions. I definitely applaud his teaching! The intro class takes you through belaying, how to use the equipment, and lots of safety rules and reminders. They provide shoes for the class as well. Great beginning lesson. They also allow you to stay as long as you like until closing if you come in for the intro class. Would have loved to stay longer if I could have!The gym itself is really nice with its amenities. With places to sit and hang out, complimentary coffee and tea, complimentary towels, I could see the appeal of having membership. It's more than just a climbing gym -- it even has gym equipment upstairs, as well as yoga classes and a sauna in the bathroom. Dogs are also allowed (always a huge plus!) -- most were tied to the railings near the entrances and were so well-behaved. Such an excellent experience! Would definitely consider returning to this gym if I continue this hobby. :)", "date": "11/20/2018"}, {"review_id": "V-Nda_f9BYaydXz8HB7lTA", "user_id": "NqkcMnIXGNbWL7AlHrDmIw", "user_name": "Melanie D.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 8, "funny": 0, "cool": 5, "text": "Have you ever wanted to take a rock climbing class in an unpretentious gym? Well, this place fits the bill.The space is pretty large but can get busy. The cost of the class will buy you about an hour or so of instruction, shoes, and a harness to use for the day. Gloves are not necessary. Jacob is an excellent instructor. There are options to free/boulder climb as well as to climb using a rope, with or without a partner. I would try both. Parking - free street parking. The gym itself does not allow parking on the premises", "date": "3/23/2018"}, {"review_id": "npRGQ2OBSuQB2v262cUPHQ", "user_id": "b0qYu-6vewGbVM8NvZGRpw", "user_name": "Michael K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place! The facilities have a great flow. I took the Intro to Rock Climbing with my fiancé. Dexter was super genuine and a great instructor. Actually, any of the staff we ran into had such great vibes and we will definitely be back--hopefully turn into regulars or members, hah!", "date": "5/1/2019"}, {"review_id": "ZIFgnugx4a68d9ytatFqDQ", "user_id": "mgVXcePWy6zBIXqqDrhzxw", "user_name": "Tim C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 4, "funny": 2, "cool": 1, "text": "I can't believe I didn't know about this place until now. For some reason, I always only went to LA Boulder in the Art District but Stronghold Climbing has so much more.What Stronghold Climbing gym has: Boulder, rock climbing, a gym on the second floor, shower, locker rooms, sauna, a relatively spacious area with tables for people to study, books, free wifi and a lot of dogs, at least today.I think the staff could have been more engaging especially when three guys (us) show up telling him that it was our first time at Stronghold. It would've been more welcoming as well if he told us how to use any of those ropes that are hanging down the wall everywhere, or that we beginners should only use those clip in ropes. We were a little lost in the beginning.More engaging doesn't mean not friendly. It just means he could use more common sense and guide new customers through the process without having to be asked first.Overall, the crowd is good, every climber here is helpful and nice to you. I think this is my new climbing spot since all the prices in LA are the same and LA Boulder doesn't have that much as Stronghold.", "date": "9/4/2018"}, {"review_id": "iArNUu4An_d6B-ovbwBh1Q", "user_id": "E2iXg7ywWuJHrp8V6JN9Yg", "user_name": "Lorena G.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I absolutely love this place. I'm new to the sport and been coming here for 4 months now. The staff are really friendly, the place feels like a community. Would highly recommend this place if you want to get into climbing.", "date": "4/10/2019"}, {"review_id": "IY9LWoiQT3kxIRMEParzaQ", "user_id": "bUlDbZ2wXWQm3NDtla62_Q", "user_name": "Diana T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 6, "funny": 3, "cool": 4, "text": "My bf took me here with a Groupon he received as a gift. We had a 1.5 hour Intro to Climbing Class at 9:00AM. Davis was our instructor for the day. Upon walking in you will see iPads near the entrance where you can register if it is your first time visiting. After, we went to the front desk where they handed us climbing shoes and a harness which was necessary for the class we were about to take. Davis was a great instructor, informative, and funny. We learned the basics about climbing, tying a proper knot/loop, and safety checks. After the class and climbing a bit, we were able to check out the other walls offered at the gym. By the time our class ended which was around 10:30AM, the gym was pretty packed! Which I'm not surprised about because this gym was such a fun experience and it was really clean. There's a small gym upstairs which I didn't get to check out but in the future, maybe! The only reason why I am giving this place 4/5 stars is because the shoes I had to borrow for the class were really smelly.. Makes me a little iffy for sanitary reasons. Would recommend bringing your own climbing shoes if rock climbing is a leisure activity for you.", "date": "5/30/2018"}, {"review_id": "0ZpLAAmsLTgMTHbnS9DV9g", "user_id": "r77nLa1fT9pGJreGnMZOOw", "user_name": "Russell N.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Oh man I miss this place. Member over four years, loved every minute. Moved to Long Beach and it is too far to commute.I've been to a lot of climbing gyms across the country and this is by far the best one I've visited in every regard. -Staff is always awesome-auto belays on point-lead ropes available-great training area-amazing route setting! These guys are absolute pros!Stronghold, I love you!", "date": "7/21/2018"}, {"review_id": "xfER3FpA3du73TB8hkoApA", "user_id": "He4byaOwuw0qrIct45LAxw", "user_name": "Heide S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "The BF and I took a beginners belaying class today along with two others.  Our instructors name was Kevin who was awesome.  The BF liked him so much, he bought him a breakfast burrito from Angel City Brewery to which Kevin looked thoroughly surprised.  Kevin did a fantastic job at teaching us the fundamental basics! We learned how to tie ropes and work the belaying system in less than an hour.  Along with the beginner class, we were given day passes along with equipment rental for the entire day.  We ended up spending about 5 hours here! Time sure does fly when you're having fun.  On a side note, we are SUPER sore! Definitely not use to using those muscle groups on a regular basis but it feels good.Looking forward to our next visit.", "date": "1/21/2018"}, {"review_id": "strlLo4XXKKkKFeg3zPcZw", "user_id": "TrvK-RiV0Qymo3Q5fcVhNg", "user_name": "May L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 2, "cool": 2, "text": "I found this place on Groupon and I'm glad! For $35, both my friend and I were able to attend a beginner's rock climbing class. Parking can be quite difficult to find since you're actually not allowed to park inside the gate, but there is street parking. Before we were able to get started, we had to sign a waiver and then get our necessary equipment (shoe and harness). Our instructor was very patient, knowledgeable, and helpful towards our group. He covered all the basics of rock climbing and let us practice under his guidance. The class was about two hours long but after it was over, we were free to climb on our own until closing. The place was bright, clean, and spacious. This place is definitely worth checking out if you have nothing to do and want to try something new, fun and challenging. I without a doubt would come back to take my belay test and maybe even get a membership.", "date": "3/14/2019"}, {"review_id": "BebGn6bxb4XaaRKYi0GIKg", "user_id": "inyvlbfbCHC5JWIsv-PokQ", "user_name": "Carrie L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a great experience taking the intro to climbing class. Kevin was super helpful and friendly and made the whole process a lot easier to digest.", "date": "5/4/2019"}, {"review_id": "nEOm-n83eD1LP6xvLBDEPA", "user_id": "pDLiTcL6X1erVXdb9l_uGg", "user_name": "Nelson W.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym has it all. Newcomers to climbing will be met by some of the friendliest, most competent staff I've met anywhere. More experienced climbers will find settings and amenities better than most anywhere in Los Angeles. Rentals (lead rope, harness, ATC devices, chalk bags) are available with day passes. Very kid-friendly as well.For beginners: I recommend signing up for a class or coming with a more experienced friend so you can start belaying and climbing top-rope - the stereotypical climbing experience. There are auto-belays set throughout the wall that you can use to climb by yourself. There is also a substantial boulder wall that you can climb if you're comfortable taking small falls.For climbers: the gym offers rope for lead climbing. There is also a portion of the wall dedicated to underhanging, lead-specific routes, which provide plenty of difficulty. Above the boulder wall are fingerboards, tension board, and moon board for training. Opposite this is a small gym with dumbbells, bicycles, treadmills, powerlifting bars, and rubber weights.", "date": "12/25/2018"}, {"review_id": "3BEhcGt989VgF7aH68RX3w", "user_id": "RkD0U17HrBeGsaW4nHjCCA", "user_name": "Sharon C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Today was my first time at this gym, but I love it! Super friendly and informative staff, great course selection, and just good vibes all around. I went on a weekday morning so it wasn't packed at all. I'll definitely be back!", "date": "1/8/2019"}, {"review_id": "F-p7_7QlRoz7FxvIVWQ-mQ", "user_id": "blMurV14aZB0cb-E6vZ-zA", "user_name": "Rome T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Met a new friend through work. She's very active, loves indoor rock climbing. I always wanted to try it out. She was able to get me in for free, I think full members can do that once a month, HOOKED UP BABY!Went there after work, 4ish on a Friday. Limited parking space but plenty on the street. Electronic check-in, great patio to hang out, upstairs gym, locker rooms, water fountain, training area, yoga..., the list goes on. They have self retracting lifelines, good stuff for solo climbers. I was told that they frequently change the climbing positions, this will keep things interesting. Only thing, wish there was AC but all good, don't mind getting sweaty!", "date": "8/19/2018"}, {"review_id": "7Q8w2jCVZ3uv9DIFjo0vwg", "user_id": "gFrQBswOcog_CUaQIjFwpQ", "user_name": "Justin B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Pretty stoked on Stronghold. A bunch of us took a lead class with David and were super impressed with both the depth of his climbing knowledge and his ability to easily convey sometimes complex ideas. Clearly he cares about seeing climbers properly trained. On top of that we all had a great time and now we're all practicing lead climbing, indoors and out.", "date": "9/29/2018"}, {"review_id": "ZWTMw6YrQ3L_jZL_dw42Bg", "user_id": "C2vKwWgOF-vUQ43WUEoqwg", "user_name": "Nathania Y.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I went to try the wall climbing sports for the first time here. Purchased the wall climbing 3 hours lesson from Groupon and was really glad I did it. It was so fun and rewarding. Our instructor, Jacob was very informative and detailed and he was also very helpful. At first me and my bf were afraid that I might not be able to support my bf because of all the knots and procedures (I'm a lil bit slow on these things), but Jacob helped me step by step until me and my bf both could enjoy climbing those walls without worrying about our lives. We cannot wait until we can go back again here to conquer those walls again.", "date": "10/14/2017"}, {"review_id": "KWepMca5SBBLXF8_4eCK1g", "user_id": "m7-OVE9R2eXD6ZPk23u9vQ", "user_name": "Adam T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This is my zen place. I love the atmosphere here--all about comaraderie and collaboration and facing fears and improving incrementally. It's a mental and physical challenge, and it's addictive in the best possible way. The prices are reasonable, and a membership gives you a free guest pass so you can get your friends addicted too.", "date": "1/24/2018"}, {"review_id": "BwkQtCm-HnhUJCrdg61fXQ", "user_id": "4UUTGrV8ouHJvtIwwhrpGg", "user_name": "Lina C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "This has got to be one of the coolest experiences of my life.  I remember climbing walls as a kid but this was totally different experience. I really love trying out new things so when my girlfriend told me she bought a Groupon to go rock climbing- I had to say yes!  It was a great deal--for two people you can take a 3 hour rock climbing course at The Stronghold Climbing Gym for about $35... Definitely worth it if you want to bring a friend or bring a date (ahem, to the gentlemen out there wanting to impress the ladies!)Our instructor Jacob was absolutely informative and helpful.  He was attentive with everyone in our group (about 10 people) and did a wonderful job showing us the ropes (Haha get it?),  The first 1 1/2-2 hours we learned the basics--how to tie the knot, safety precautions, using the belay--and then slowly we had the freedom to roam around and climb other parts of the gym.  This is definitely a workout!  My arms are killing me as I type this review, but I mean I had to do it for the Yelp since it's so fresh in my mind. They also have a gym membership here so if you are wanting to pick up on rock climbing as a hobby, that would probably be best for you.  They also have a few machines upstairs and a sections towards the front where you can climb without any ropes.  Hopefully I'll go back again soon!Thanks again Jacob for a great session!", "date": "5/13/2017"}, {"review_id": "xGo6yHRMZd8iLTv9zacjUQ", "user_id": "9rgiTp7kcoJ0cOY6uQDn4g", "user_name": "Arthur M.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 4, "funny": 2, "cool": 5, "text": "The Stronghold is crushing it, giving the LA climbing community a base of operations. The place was built by climbers for climbers. When I walked in and confronted the massive boulders, a cave and the mountainous climbing walls towering beyond, I was like whoa. The indoor climbing facility was way bigger than I was prepared for: photos do not really convey the height of the climbing walls, which are nestled into every nook and cranny of the historic Edison power plant building. All skills levels are welcomed, even somebody like me that has no experience a total noob. The helpful people at the front desk were totally welcoming to this first timer and their professionalism and friendliness put me at ease: I was a noob in the capable hands of the pros. They even got me laughing talking about fun items (like the number 2 most important thing to bring climbing - a portable toilet system.)  Route setters post the Stronghold's latest routes up the walls (changed every few weeks) on vimeo (see below for link) a really cool touch that made me want to check out their new creative challenges. The managers and staff are down to earth and involved in all aspects of the climbing world. Non-profits store adventuring gear behind the walls, to take underpriveledged LA youth on backpacking trips to nature. There is a wood-floored canopy-covered yoga room, for climbers to take classes that improve coordination, balance and flexibility. The smokestack visible from the freeway is now home to a lookout on the upper walls, as well as an art installation. When I visited the smokestack housed this amazing magnetic pendulum.  There is a lot going on here, but the strongest feeling is the love and passion for climbing at The Stronghold, and it's contagious.The latest videos of climbing routes and bouldering puzzles: vimeo.com/strongholdclimb", "date": "1/12/2017"}, {"review_id": "uCqhmpQ4mpShlT_fxIzfyA", "user_id": "PAh1MePTPlm23vW4CdFJlg", "user_name": "Phil K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Climbing gym is the new thing!!  There are many variety of challenges and they are fun. If you want go higher, you must to take a class to learn how to use a rope. You will spend approximately $30 for 3hours. After 3hours, you are too tired to stay. It is totally worth the trip.", "date": "7/4/2018"}, {"review_id": "BbRegIunXPe7InFv-veoMQ", "user_id": "0MolFeE6qem5HQAVh61GAg", "user_name": "Jennifer C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "First time rock climbing and signed up for the belay class with Jacob. A three hour course was informational and really prepared me to Belay properly. Instructor was not only knowledgeable but he created a fun and safe environment for beginners. Plenty of opportunities to practice in class. The class comes with harness, atc and shoes. You can ask for chalk. As for the facility, it is  located in a historic building in DTLA....absolutely gorgous! Inside there are various skills level walls. The service is on point and the facility is clean.", "date": "2/18/2017"}, {"review_id": "YkejscmxUrj1EhKEEfsO2w", "user_id": "WCHNBBLEPwgWILfbKrUiCQ", "user_name": "Jackson H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "It's a good gym, but honestly it gets a one stare because of the service. The staff was unhelpful with testing. Let alone there is no real teaching going on. There were ppl left and right with missed up harnesses top roping (dangers!!!!). The buddy board will just forget that bs no one goes here alone. Honestly save your money and go to the gym in Clover city.", "date": "3/2/2019"}, {"review_id": "aLLTJ2roO5slO6rckFIuiQ", "user_id": "VgvYo9eG3Jzos8PgDALWdg", "user_name": "Cortney B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Since I began my weight loss journey I have wanted to step out of comfort zone and try different things. Rock climbing has been on my bucket list for sometime now. Therefore, it was time to face my fears of heights while I was at it.  I took the intro course and I was so fascinated by the lango and just learning something new. I had an excellent instructor who really took her time,checked in on me and encouraged me every step of the way. I would have to say I am now addicted to rock climbing and I am looking forward my next rock climbing course. Thank you stronghold climbing!", "date": "3/26/2018"}, {"review_id": "LPx-3J3_UhVzaO-qvQ8KNg", "user_id": "XJ4tRbfeAVOcKFvhb0LCEQ", "user_name": "Shuang T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "i'm still super exhausted，but i love it，lol，first time coming here，got a friend like right after 10mins，she is super nice and helpful，and thank Tom as well for showing me the parking lot，the staff was very friendly and helpful too，i had a good time，definitely will come back again，my arms hurt", "date": "10/15/2018"}, {"review_id": "4UEmLqdwBGw8ZDv2LL7uLw", "user_id": "BLmMuOjMcSzlo6sY2Jef7A", "user_name": "Mark S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "can spend all day here, and I do!  Great staff and great vibe!  Challenging for all levels and there's always help around if you need it.", "date": "9/11/2018"}, {"review_id": "4pJoO7l-f_8t4MzJhGs-4w", "user_id": "tk9O-CtU5I74zBV9EruTcw", "user_name": "Sandie B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 4, "text": "Wow! This place is amazing. Maybe the best climbing gym I've ever been to. There are plenty of options for climbers of all levels, as well as a huge bouldering wall with a variety of levels. It's $26 for a day climbing pass and harness/shoe rental, and totally worth it. There's also a gym upstairs and plenty of places to sit and relax between climbs.", "date": "5/29/2017"}, {"review_id": "3PsVEJJEU9EdN_rrRwIkUw", "user_id": "7NeR2QJ_jgUQuLUQ3fvAtg", "user_name": "Fourty F.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 2, "cool": 1, "text": "Man...if you hate standing in one place lifting a heavy object up and down...or maybe you like the rush of lifting weights but feel like you're not getting anywhere in your gym life (I'm going literal here)- why don't you lift that already heavy body up and down a wall? Climbing is a great team sport, every one plays coach/spotter/cheerleader (gender-non-specific) as well as star. You take turns. You do the damn thing...then do it again. While you work on your mind and body your partner is simultaneously building his/her/their communication skills (verbal and nonverbal cues) creating trust. With climbing you can really see if someone has your back. (\"Saved your life, etc., etc.!\" - not. funny.)Climbing is a mental challenge (the puzzles, the anxiety, the mental focus required to calm the storm before pinpointing a toe-push off a dime-sized hold while ripping your fingernails back to high noon) as it is a physical one (obviously...it's a full body workout: cardio + strength/endurance training that is rad af). It's a meditation-meet-marathon-type thang...if you like that sort of thang, and you have to be on point. Challenge yourself already, man. Don't be afraid to be afraid...smash that plateau, son! (used here \"Son\" is a term of non-gender specific endearment like \"Dude.\")But if you're still like, \"Bro, I like ab selfies...\", to that I say, \"If you like looking at yourself in the mirror publicly - head upstairs...you can lift weights there AND there's a mirror.\" It's a win-fing-win here folks.So hit up this climbing gym already...then head over to Pho 87: they finally have a veggie broth option.Oh yeah...make sure you triple check your knots and equipment...then: Climb on!...or break a leg- your choice!(Advice: On shoes - Rent first. Give it a month. Then buy shoes...gym shoes are like bowling shoes, nah mean...I wouldn't want to have to always wear your jock strap, G...they are also pretty slick because of their non-marking soles which hinder your progression up the grades. Just FYI)", "date": "11/19/2017"}, {"review_id": "yMtiNfyA7py6Z7UuYXd5AA", "user_id": "qhryBW9fYxP5WOzFe830xg", "user_name": "James K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 2, "useful": 6, "funny": 2, "cool": 0, "text": "Came here to climb for the first time a few weeks ago. I am not from the area but decided to go with a few friends. The facilities were clean and the routes were decent enough. However, I was a little shocked to see how little oversight there was from the staff when it came to safety. There was nobody out on the floor to monitor climbers and no one to help people with the autobelaying systems. I saw beginner-ish climbers who were clueless and doing stupid things. Kids were also running around with the autobelay system hooked onto them with no supervision. I've never used an autobelay but the ones here seemed pretty janky and untrustworthy... having a belay partner would be much safer. All the other climbing gyms I've been to... safety has been paramount. Here, the staff seemed more interested in hanging out in their own world behind the counter than helping people out. Maybe it was a fluke but it was irresponsible at best. All it takes is one accident.", "date": "10/23/2017"}, {"review_id": "-kXgqPDFR1cUEf1KpjwmtQ", "user_id": "Zs--nR-h5jt6Dar5Q3xLNw", "user_name": "Mair B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Took my husband here for his birthday and our 2 year old son to have some fun bouldering. Had a great time, nice clean modern open space and friendly staff. Easy parking. Easy to find.", "date": "2/14/2018"}, {"review_id": "-CTJz18vf0wVK9J-Sa1MrA", "user_id": "Fxwud1iD19j8QCXGKA4C8g", "user_name": "Nina Y.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "As my first climbing gym, it holds a special place in my heart. Between fun climbing and bouldering routes, helpful staff, a small area with workout equipment, classes, and fun events, it's a great choice. They have showers, and just installed a brand new sauna! A big plus for me was the free group training bouldering sessions every other week that really helped with my technique. Only a few minor cons:1. I wish grigri or edelrid ohm devices were available for use. There's a large weight difference between me and my partner, and the sandbags are awkward to use. 2. The yoga studio is walled off by only a curtain, so you can still hear the energetic music playing while you're trying to listen the instructor and focus on breath work. Playing some chill music during the class would be an easy fix. So many great things about this place, but most importantly it's the energy there... welcoming, passionate, and free-spirited.", "date": "12/26/2017"}, {"review_id": "I7zzJg58T45kNqbz_zhZsA", "user_id": "3QKSFQMslWZSNb-OVYVcSw", "user_name": "Lisa Y.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Parking: park between the gate and horse structure.Gym: it's a good sized gym with bouldering, ropes, weights and a small closed off yoga room. The bouldering problems feels a little more challenging than the gyms I've been to in LA. They have good setters. The gym gets pretty crowded and packed around 5ish everyday. And the only down side is that there's no AC, so during the summers it does get humid and hot.They have loads of fun events here. Check out their calendar and it's a $20 daily pass.", "date": "8/3/2016"}, {"review_id": "xwXiN-_1KOuumQSdKuyPmg", "user_id": "OL6cr4tT0nxGIs-YRaUyxQ", "user_name": "Marlinn V.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Check me out! I am afraid of heights, but this place is the prefect place to get over your fears and live on the edge a little! Everyone is just so helpful and encouraging and it is a great environment to make mini accomplishments and feel great about yourself! Price is decent and staff members are friendly and helpful. Can't wait to climb again!", "date": "10/5/2017"}, {"review_id": "x_yWBXXVhm0RP_0smARlzw", "user_id": "cdN2BB8_WKemSxqHj-1HFQ", "user_name": "Brian T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I went to this gym for the first time early September because I really wanted to learn how to rock climb. It was a lot harder than expected, but the community is amazing. Although I am still a little self conscious of what I do, everyone is more than willing to help. I got a membership the second time I came because the place also has a mini gym on the second level. You could get a decent workout with the equipment they have, but obviously it isn't going to compare to a regular gym. However, I do appreciate the option of just using the gym there. The environment is really nice that is dog friendly along with people from all ages.I took the beginner's class and it was a great way to learn how to top rope. I enjoy this more and hope to do this more as I find a climbing buddy because these walls are higher and it feels much safer having someone holding you up, unlike bouldering. However, the bouldering is good for practice and learning more of the techniques.", "date": "10/1/2017"}, {"review_id": "3B3WUU-1ux7ZdRq1LGzRbA", "user_id": "XeA-uvp_NJs5VziuO8wOzw", "user_name": "Jenni V.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 2, "funny": 1, "cool": 0, "text": "First off I want to start off by saying I LOVE this gym and I enjoy being here and the facility is really great.I'm giving this place a 3 star, versus a 5 star that it deserves, mainly because I think there is a serious concern that I notice and I think that it should be addressed ASAP.The crowd here at night are very unsafe, I saw four people belaying incorrectly in one night last night with their hand either high up the entire time or off the brake/hands-off at certain moments. (And the worst part is, this seems to be a common thing here as I have witnessed this on several accounts on several different nights). I think that it is up to the staff to keep an eye out on their customers to prevent accidents early on. Lucky their climbers have not taken a fall while they are belaying incorrectly but how long will the luck last? No ill-will here, I am hoping to raise some awareness since people's safety is on the line (literally)--happy climbing!", "date": "10/6/2017"}, {"review_id": "Vu3SFcayLGdlmBcEHOl_xQ", "user_id": "AO3xp3f4lan1EuMqXgexmw", "user_name": "Lisa D.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This is my second time here and I absolutely enjoyed it. I've never bouldered or rappelled before but the people here are nice and welcoming. They showed me how to use the gear and gave me some tips. It's a great workout - you'll get sore the next day! Looking forward to back soon!", "date": "4/20/2017"}, {"review_id": "IEPd37MI-Uh2Fwy3L2pzOg", "user_id": "KnS4X8dUK0CYBWt8Uw6f3g", "user_name": "Brandon H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "We used the groupon for the top-roping class which was about $16 per person (covers the cost of the class and gear). From what I remember, our instructors name was Kevin. He was extremely helpful and very informative. Within 30 minutes, he was able to teach my entire group how to belay one another and we were able to enjoy the rest of the day climbing. They have tons of top-roping walls and also a couple other classes that you can take. They also have bouldering, not as many options to climb, but good enough. My gf who didnt get the groupon paid around $20 for an all day pass. Overall, it was a great experience and I will definitely be back!", "date": "4/12/2018"}, {"review_id": "h_HhnpupymMZcjfH1eB_Eg", "user_id": "th7I6RJ9ttXzC34cMfjn8w", "user_name": "Tellie N.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 12, "funny": 11, "cool": 12, "text": "Went here Saturday afternoon not that much people which is good. I really like this place good work out for upper body and it's cheap $25 for whole day climbing. Also they offer belay class for those people who are first timer and need someone to belay their friends.", "date": "8/4/2015"}, {"review_id": "Er8uBPiOniXrjY_2b8mvsA", "user_id": "CP_MkQpYN5qEYrlOgeUCQg", "user_name": "Richard R.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 6, "funny": 0, "cool": 0, "text": "Let me start by saying that the gym is in a really cool area, the facilities are great and the fact that they offer fitness and climbing classes is awesome. Now that I got all the positives out of the way, let me mention a HUGE negative. I happened to be in the area and thought I'd drop in n a busy Saturday to see the facility and maybe get a bit more info for myself and my family (of 6). It was clearly busy, so I overlooked the fact that of the 6 people behind the desk nobody bothered to acknowledge me walking up. However, when I walked up to one of the staff and mentioned that I had been interested in checking the place out. She responded with sarcasm and a general attitude as if not wanting to be bothered by me. I'm no Alex Honnold, but I have been climbing off and on for years and was a member at Hanger 18. And in the 7 years I ran MMA and Jiu Jitsu schools, a general rule we had was always be polite, welcoming and accommodating. Now I'd rather not bash the place because it really is a great facility and provides a lot for its members at a good rate. But, whoever is in charge may want to take heed that their staffers may be costing them money with their less than friendly attitude.", "date": "1/13/2018"}, {"review_id": "m8UfToa6seHwaqi0PyCRmg", "user_id": "hPu9aXKSgq1tcSBnm0-H8A", "user_name": "Erin C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I've been a member at stronghold for 1 year and I've loved every minute of it. I was using everyone's buddy passes for almost 6 months and decided that I was going to consolidate my regular gym and climbing gym into one (it made a lot of sense for my budget). In the past year, they've made a ton of changes and reservations--you can tell that they put a lot heart and thought into this gym and cultivating a certain type of culture.The gym consists of:- Bouldering Routes. There are plenty of routes for beginners. They also do a great job hosting regular free and paid classes to help you get started. I took one on managing the fear of falling and it was very helpful especially since I was coming back from a knee injury. If you top out on the bouldering side, there's a workout area up there with a moon board and other training mechanisms. - Top Rock/Lead Routes. The tallest part of the gym is ~45 feet. There are walls of varying heights which is helpful especially when you're getting started or showing new people around the gym. - Work Out/Gym Area. The second floor has a yoga studio space and a full gym workout area (treadmills, rowers, barbells, kettle bells, bikes). I have plenty of space to both Olympic lift and power lift when it's not that crowded. There is sometimes a wait if you're trying to lift around 4:30/5pm on a weekday but it moves pretty quickly. You can also use the yoga studio space to meditate and stretch when there isn't a class. They've got blocks, straps, mats, etc. if you don't have your own equipment. - Sauna. The most recent addition is the sauna and it smells so DELICIOUS! They also give you free towels now. They also have a shower if you want to save on your water bill.Staff:I've gotten to know the staff at the gym (and their personal music taste). It's an easy place to meet people, doesn't have a corporate feel. Everyone is super friendly (well I guess most climbers are friendly) and loves talking about their climbing passion indoors and outdoors.Tips:- It gets a bit tough to park when it's really busy so you need to park on an adjacent street. It's only 300-500 feet further so it's really not that bad even on the busiest night of the week.- They provide shower, conditioner and body soap in the showers which is clutch especially when you forget to bring some.- The rental climbing shoes aren't the best and the harness isn't very comfortable but that's because they're rentals. I finally caved and bought my gear which is a good thing since they're starting to charge members for rentals.- They have these sweet hammocks that you can lay in and rest in if you're waiting for your friends to get to the gym or you're working from the gym. - There's free coffee and tea before noon every day which I appreciate. You just need to bring your own coffee mug. - Take advantage of the yoga classes because they're geared towards climbers.- Join the Buddy Maker facebook group to find friends and someone to belay you.", "date": "1/22/2018"}, {"review_id": "qGLocX-h3KBMJQi_p_acIw", "user_id": "SkfcgOcMJoDR4zIH5R9h6Q", "user_name": "Mikey M.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Definitely will make a second visit. This is a great spot for all skill levels and I have a newfound respect for the climbing community. This was my first time great, instructors I was able to get certified to support another climber. It's a good workout and wonderful way to yet you mind and body. Only negative is the shoe rentals the Lysol isn't cutting it shoes stink I even through my sock away afterwards wouldn't dare go barefoot. May look into purchasing my own shoes but love the environment everyone was positive and helpful.", "date": "3/4/2017"}, {"review_id": "BWiJF9G-5Xmf6ESVANieXw", "user_id": "lufa4bHQd3XLYQE1zXis0g", "user_name": "Lisa S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "After climbing Sender One in Santa Ana, I don't know if I can give any other gym 5 stars. At the same time, this was probably the most fun I've had out of the other ones I've tried. The gym itself is pretty hot, however. There is no air, and although they have large fans going in various areas, it doesn't reach everywhere. Let's just say I was sweating. I already have an issue with sweaty hands, so my chalk bag was being put to maximum use.Speaking of my chalk bag, the first one handed to me was broken. When I put it around my waist, the clasp would just release and the darn thing would fall off. I tried in vain to make it work about a dozen times before bringing it back up to the front desk. They were out of replacements, but the guy told me to just grab a random one lying on any mat. I felt weird about that, but I did, since I guess they just get abandoned by members. The gear was adequate, though it was different than what I've used before. I had to do a couple run throughs before taking my belay test. After that, we were off! We did a bit of climbing, and then some bouldering, but my forearms and hands were giving out, so I had to quit. If I lived closer, I might come here more, but for now, I'm trekking down to Santa Ana.", "date": "10/19/2016"}, {"review_id": "PQgbOzyXaVfZrTeCuHMDmw", "user_id": "1BwJB8gp3hkgOdGvuBxK5g", "user_name": "Jorga H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went to Stronghold Climbing Gym today. It's at the Brewery in Lincoln Heights, in the building with the giant smokestack. Inside are several huge walls with climbing stuff attached to them.Generally friendly and helpful staff.Very easy to sign in - waivers are done on iPads at the front, then you step down to the front desk and pay - $26 to use the facilities for the day, which also covered rental of shoes and a chalk bag. There's a bunch of walls, some have auto-rappelers, which brake as you drop off the wall, and then in the back are the large walls with real rappelling gear. There's also a smaller workout area with a couple of ellipticals, a pulley machine, a couple climbing ropes and some low-lying rings (presumably for TRX-type stuff); there's also a curtained-off area for yoga classes.There are various color-coded climbs. I tried a few, in all I did 4 different climbs, the blue, green, and yellow ones at the front, and behind that wall, a red one. I also tried the auto rappeler thing, but there was a woman waiting to use it who started giving me unsolicited advice and I wasn't about any of that - I just wanted to use it at my own pace; I don't know why she had to use that one, there were several others which weren't being used, but since that one was a little hidden, I guess she preferred that one; I appreciate that she wanted to help, but I just wanted to do my thing today. It was a pretty great workout; I haven't used my body like that in so long; if felt great. I was moving and sweating.  I'm sure I'll be sore tomorrow. I think it's something I could get into a bit. I'd like to come back and try the intro to climbing class.", "date": "10/14/2017"}, {"review_id": "Vshd95zudq5rQIjJ4cSClg", "user_id": "RSYQFwanogpeWezcl-AR9Q", "user_name": "Steve L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Family had a great time here, including our 4 year old.  As a bit of advice, if you're going with kids, go when it isn't as busy, to give them a bit more space, and so you don't have to worry about people falling on top of them.  Most people are pretty conscious about safety, but at the same time, some can get really focused, and probably don't want to have to worry about who they're going to potentially fall on top of.  Friendly employees, and lots of options to pick from.  While it's a bit of a trek, we may give this spot a few more visits.", "date": "1/9/2017"}, {"review_id": "4pQmYTS8Ehsu0pVVnzcToA", "user_id": "U5r7sDMnb0_PP9IQ8IFxQg", "user_name": "Chris S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "This was my first time at a climbing gym. What I liked most is that you don't feel intimidated by the chronic climbers. You feel welcomed to come in as a novice. There are climbing areas for all skill levels. I don't know if I will be pursuing rock climbing as a hobby, but I will definitely try this again at Stronghold.", "date": "7/27/2017"}, {"review_id": "-yvwUtV2GWCqjE4oFsfTvQ", "user_id": "GJqrc-E7kTaP9ct4NFeWqw", "user_name": "Sandy Y.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 26, "funny": 16, "cool": 20, "text": "Came here with some friends & totally enjoyed my time here. Before you arrive, definitely check out the website to make sure you're aware of all the rules & safety precautions & especially to fill out the waiver prior to arriving to the gym. This will save you so much time, especially when all you want to do when you get there is just get started to climb & belay! We arrived on a Saturday morning and found the gym located toward some warehouse looking buildings. Parking around the area is pretty abundant. Note: there's no actual parking lot per se to the gym. It's more parking spots around the neighborhood. For myself, I parked a little bit further down the way and just walked over; just a couple extra steps walking distance more. When you enter through the doors, the entire gym is brightly lit & really spacious. At the front, you sign in & sign the obligatory waiver if you haven't online yet. They'll locate it & then you'll be on your way (just make sure not to sign too far before your appointment time & it takes a while for their system to pull up your signed waiver since they'll have a lot in the system). At the front, they fit you with the necessary equipment such as climbing chalk, D links, harnesses, ropes, etc. needed for belaying or free-climb. Since I was there for a belay class, they'll direct your toward your group and then you get the full intro to belaying course & the necessary safety course precaution warnings on how to do it safely and to have fun with it prior to wandering off into the actual harder climbs toward the back of the gym. With a full locker room with restrooms, showers, lockers & sinks to clean up after as well as a full gym on site as well, this is a pretty awesome place to just have fun and get a nice change in pace to the typical workout!", "date": "5/3/2016"}, {"review_id": "g9vE1tXZSo7gGorrfRRowg", "user_id": "w5bAI7USuCvyl8kZzj6sQw", "user_name": "Diana W.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 4, "funny": 2, "cool": 2, "text": "Gym membership includes rental, a guest per month, upstairs free yoga classes, mini gym, showers for around $70-$80? Thats a pretty good deal. Located near Lincoln Heights, East LA. Came with friends to check out the place. I'm impressed!Great place to climb. Great community of climbers. Come alone, come with friends, come with a dog? Yes, they allow responsible good pets. One of the few gyms I've seen that has height!The gym is upstairs with a private room for classes like yoga. Thats awesome!!! The place includes so much!!! Even your guests are allowed free rentals (harness, shoes).This gym is clean, organized. Plenty of seats. There are some small tables around the gym in case you wanted to rest or have a friend waiting.", "date": "5/12/2016"}, {"review_id": "Mtx2oeavUtuoZAF-_84Mtg", "user_id": "ajued3knaY8RTBDGPhL-wQ", "user_name": "Gayane G.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place was great! I had a lot of fun! It was my first time climbing, I was scared at first but ended up not wanting to leave! It's a perfect place for an indoor rock climbing!", "date": "6/28/2017"}, {"review_id": "BdhH_JuoFZpnQMcOM4_hXQ", "user_id": "in0bHRzDpAhmeS4vhVCdRw", "user_name": "Ram G.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Best gym ever! Tessa is the coolest employee there! Love that it is dog friendly. Love when they have events!!!", "date": "2/20/2018"}, {"review_id": "usg96vHRzHJP0YhxNrqqmg", "user_id": "Ocg1Q42K_9mbTxsJFPK7Ow", "user_name": "Tabit B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "This is probably one of my favorite climbing gyms. If the membership was more in my price range, I would come here more often.The staff is pleasant, friendly, and willing to accommodate to your needs. The last time I was here they had bouldering, top rope, and lead climbing sections. They also offer many levels of climbing lessons (ranging from beginner to advanced). My favorite part of this gym was the fact that they allowed dogs. For those that may be allergic, it might not be your best bet. However, if you love animals and want to meet some great people then this is the place for you.The pricing for a day pass, beginner lessons, and rental gear was very reasonable. Although nothing beats hangar 18 prices, this place definitely offers more bang for your buck. If you're looking for a trendy place to workout and catch up with friends then this is the place for you.", "date": "4/6/2016"}, {"review_id": "RljpeaKfiVewLrgp4lQtfw", "user_id": "Gqdykv1mSGCwv8g-AaAytw", "user_name": "Andrew T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 6, "funny": 1, "cool": 1, "text": "AMAZING climbing gym for both newer climbers and the more experienced. I came here with a few friends the other day and was pleasantly surprised with just how big this place was. I definitely think it tailors more for top rope climbing over bouldering, but honestly there's a little bit of everything for everyone. There's even a yoga studio and a gym area upstairs with some barbells and workout equipment if you want.Parking is a little hard to find, but jsut keep looking,as there are lots nearby with a Brewery and art gallery around as well.  I think the day pass and equipment rental came out to $26 and includes everything from the harness, ATC, shoes, and chalk bag!", "date": "1/26/2016"}, {"review_id": "ezr9YV6wcZ-EFpvG4GoOQA", "user_id": "jvdPKx8FAQxUFCiVFIZHQg", "user_name": "Taren M.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Great climbing, great community. Everyone is super helpful and willing to engage! Love this place!", "date": "10/29/2017"}, {"review_id": "f0U5szrxGyriw_zkAb1PKg", "user_id": "sJ5G8jkpku03ha0FiIlawA", "user_name": "Jen L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Didn't make it to the gym.  The man who answered the phone could not give me any information and kept pushing me to go online.", "date": "2/6/2018"}, {"review_id": "yhnmPcWB2d7BQGfDrWAYrw", "user_id": "iVYrYz3UTH6PWoI9HJWu_g", "user_name": "Reid K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Came here to try out the free climbs, and switch things up with my workouts. Paid a reasonable day free and was able to rent equipment for myself and gf seamlessly. The front desk guy showed us around and we were able to do the auto-belets and  spotted climbs. Also had free range to the bouldering area as well. Challenging and easy routes, it's great for every skill level. The gym was comfortable, with regular members and newbies.", "date": "3/7/2017"}, {"review_id": "_cEIVA7m73zOl1yFICTMTg", "user_id": "3kZ_SKMWRAOf6HC-Oz7Kag", "user_name": "Edric H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 1, "cool": 3, "text": "This place is a gem. The instructors, Josh and Brian, are incredibly approachable and informative in their classes. The holds are very well maintained and I see the workers constantly touching them up to ensure they don't get too smoothed out. Their auto belays make it really convenient for you to top-rope if you can't find someone to belay you and the gym is very well ventilated. However, in the summer, it does get really stuffy and hot, but I've definitely seen much worse and can deal with it just fine. They also have a basic assortment of weights upstairs for those who want to get their lifting (including squatting and benching) or cardio on (treadmills). With all this in mind, I think their membership dues are reasonable (my first impression was that it was expensive, but have since changed my mind) and the gym still gets a little crowded during peak hours. The patrons here are friendly and very encouraging. If they see you struggle, they give useful tips and motivate you. I almost feel encouraged to fail (because that's how you eventually succeed, right?).There's plenty of convenient parking. FYI, you're not supposed to park past the security gate if you're not a resident.", "date": "12/5/2015"}, {"review_id": "ZynoDVBFqcafB141-irVpw", "user_id": "oX9Lk-2cLtpfWXceoG2ySQ", "user_name": "Sterling T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym in LA for all the reasons that climbers hold dear to our hearts. Highly recommend this gym to those who want more honest grading and a lovely climbing community", "date": "1/9/2018"}, {"review_id": "kmHPJ7ta-Z-6oFGIoUucqQ", "user_id": "7z50dr2py6G8YyFHIn4KFQ", "user_name": "Matt H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Ever since joining my climbing gym in OC, I have not had much reason to check out other gyms, but a buddy wanted to head up here for a little variety, and we had a great time. The gym is medium sized, but they make good use of space and have plenty of climbs. The lead routes are interspersed with the top rope routes, but I did not notice anything you could not lead (there are routes you can't top rope though). The wall height varies from probably in the 40' range to probably around 60', with a mix of vertical and overhung routes.  There is also a roof section where you can get your bat hang on if that is what floats your boat, with a max length of probably 15-20' of pure horizontal climbing.The walls look to be painted with a slight texture, not as grippy as the modular systems like Walltopia puts out.  Still, it is a variety, and variety is the spice of life.  They supply a lead rope, so you don't have to drag yours along, but you need your own belay device, even for top rope. The check out test is very low key (at least it was for me), and I did the TR and lead test at the same time. Another nice feature is that the clips are spaced out in the 8 foot range, so both the grades and the clipping feel a little truer to outdoor climbing.", "date": "4/25/2016"}, {"review_id": "ar1WBjIDVe6lLOOL5FLiPw", "user_id": "yuI2gGQZbzTeXx6C9N3aiQ", "user_name": "Chloe C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I've only been here once but I will definitely be coming back again. People are really nice here and there is just generally a really great vibe. I asked a random person there if they needed a belayer after a friend left and had a great time together. The equipment rented out are also of very high quality from harness to ATCs to shoes. They just have a HUGE selection of climbs here of varying difficulties. I did both bouldering and rope climbing when I was there after passing the simple belay test. All the routes were clearly marked with the appropriate difficulty. The ones that are new have a little tag next to them for you to mark down what you think the difficulty is. They also have autobelay machines on some of the climbs for you to try out. Just one warning however: There is no AC here but that won't stop me from coming back here!", "date": "9/5/2017"}, {"review_id": "4p8f_imA4Fo4q8uV6iaCtA", "user_id": "5UEBtcOGOhmOkCjeEmeCGw", "user_name": "Matthew J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "One of the best climbing gyms I've been so far.  I live in Woodland Hills and in 2016 I went about 10 times.  Wish I had a gym of this caliber in the SFV.", "date": "1/3/2017"}, {"review_id": "th_93dhxyO50GL2FKy241Q", "user_id": "5r0PU9KUkNIp3C0Krk10MA", "user_name": "Christopher H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 7, "funny": 5, "cool": 2, "text": "So for my money, this is the biggest bang for the buck in LA by far. Cliffs of Id may come close once they get their roped sections up, but for now Stronghold is the reigning king of the area, not to mention 15 minutes closer to the SGV.And I'm not saying this as a new climber who happened upon a Groupon or came to the gym on a lark. I drive in from Pasadena at least twice a week, if not more, to get on the walls here due to the quality of the route setting, the frequency of new problems and routes and the top shelf staff who makes it all gel. As someone who has been climbing for over a decade I feel it important to point out that most of the negative reviews of Stronghold are born of ignorance or stupidity. Two very different things mind you. Simply put, this is an amazing place for new climbers to learn about our craft as well as seasoned pros, both old and young, looking for realistic indoor ratings. In addition to the friendly staff, many of us who climb there regularly are more than willing to spend a session with new climbers, making sure they are safe and understand the risks.... IF said gumbies are willing to listen and rank low on the D-Bag scale. Monthly potlucks, awesome classes, killer gear demos and most importantly, a regular crew of amazing climbers really sets this place apart. When I walk in (even on heavy gravity days) I feel surrounded by family or by friends I've not yet met. This describes the one word key to any high caliber climbing area or gym: community. I personally feel it's something abundant at Stronghold...All of this on top of long roped routes, incredibly creative bouldering, air conditioning and stupid close proximity to Barbara's where one can find post session respite with killer food and drink!?I live less than ten minutes from a climbing gym, yet I choose to brave LA traffic at least twice a week to visit the Stronghold. That alone should tell you something. I've lead for real 5.10c in Joshua Tree, where I've spent no small amount of time, frequented Bishop, Idyllwild, Red Rock, the High Desert, Santa Monica's and even made a few trips to The Ditch. Want to get strong, have fun, meet amazing people and climb some really quality stuff? This is the place! I am first and foremost a trad climber with a driving passion to push pebbles and I wholeheartedly endorse The Stronghold. (No gumbies were harmed in the making of this message!)", "date": "5/7/2016"}, {"review_id": "IK76zPShvcNloPsMPBd2Lg", "user_id": "wLh4YepDaBzQ1JMrj5fDzQ", "user_name": "Karen C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 8, "funny": 5, "cool": 5, "text": "This place is huge and maximizes it's use of  Half of the gym is for bouldering, with the other half on the rope, with this being the gutted out Brewery you can climb really high. The second level on top of the bouldering area is for training: there are power balls of various sizes, campus boards, fingerboards and a challenging moonboard. On the other side above check in is their gym area: knee raise/dip station, rowing machine, stationary bike, treadmill, elliptical, kettlebells, a pair of gymnastic rings, battle rope, jump ropes, weighted medicine balls, stability exercise ball and monkey bar/chin-up/pull-up station. It's a well-though out compact gym within a climbing gym! There was also a canvas enclosed \"room\", where people were participating in a yoga class. For the bouldering section the routes seemed much easier rated than my go-to gym ARC in Arcadia. This is a plus when bringing friends that are new to climbing. The ability to complete routes, will have friends feeling accomplished and keep the enthusiasm high resulting in a desire for future climbing. You can seriously spend you day just on the bouldering section, the transverse red/black that goes across the entire section was a fun surprise. I am seriously going to come back here with my harness and spend sometime on the ropes. The 46 foot walls just looks glorious. :OCheck-in as a first-timer was a cinch with the mini iPads. Snack area was looking a bit spartan. Parking is limited to street, but not it's not too difficult to score a spot. Slightly pricier than other gyms to climb for the day, $20 for a day pass. If you live nearby really consider investing in a membership, since they also have classes and what seems like a sweet gym set-up. Lots of hip folk here, felt out of place with my lack of tattoos and edgy haircut. ;) .", "date": "2/17/2015"}, {"review_id": "OYFnO2kTrZdDPPNwEQqqrQ", "user_id": "3KK7L2Q6NMfJA1Ky4Ntmdg", "user_name": "Ivy W.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 9, "funny": 3, "cool": 7, "text": "Stronghold is the only rock climbing gym I've been to. Thanks to my boyfriend, who has membership and can bring a guest for free once a month, I've gone twice now. Although I absolutely hate and fear heights, I still strangely enjoyed myself. Rope climbing route levels range from 5.5 (kiddie) to 5.14 (professional). I started at 5.6, which was terrifying, but finished the level and felt really proud of myself. I've tried 5.7 and gave up halfway up as it was just too difficult, tiring, and scary -- but next time, I'll finish it! Beginners should do a belay class (~3 hours long), where the staff teaches you about the history of climbing as a sport, safety, and lets you practice climbing. Otherwise, if you've gone climbing before, bring a partner who can belay you or you can rely on the auto-belay. There's only two, but they're usually free cos people bring their friends. There's also bouldering, yoga, and a full weight gym on the second floor.The facility is very clean, although there are faint smells of worn socks, which is expected as everyone is mostly barefoot. The women's restroom is spotless and includes multiple stalls, lockers, and showers, which is neat for those of you who want to freshen up immediately after climbing. I also love that the water from the sink is hot and they provide lotion for your hands after you rough them up by climbing.I have no other rock climbing gym to compare to, but Stronghold is so great, I doubt I'll go anywhere else.", "date": "11/24/2014"}, {"review_id": "S-s1u28Pt53rV-ohDNE77Q", "user_id": "ypGxSrICjmoEV7xkJpn1-g", "user_name": "Eric G.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "So many top rope routes to climb! I've never seen so many top rope climbs in an indoor gym before! They have a lot of climbs for different skill levels as well! Signed up for a membership after a month of going here! Well worth the money plus they have a mini gym upstairs.", "date": "4/26/2017"}, {"review_id": "Q4koYAh3gjqVFz3dKMW03A", "user_id": "f0uwLEHPIuNWgFuUNd473Q", "user_name": "Jacelyn K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I'm currently a member here, just got membership. Have been climbing a little over a year at different gyms. Facilities: Parking is good. Shower is 2 for women and 2 for men, includes shampoo, conditioner, and body wash. Has lockers, which allow you to set combinations for it. Everything was really clean. Upstairs includes weights, equipment, treadmill, yoga- like a regular gym. There's another side of the 2nd story dedicated to rock climbing training- moonboard, etc etc. Top Roping: Routes are pretty good, soft on the setting. They also allow you to help them determine the difficulty of the routes. There's 3 auto-belays for the gym, each one able to do 2-3 routes. Bouldering: This is where I subtracted stars. They're bouldering is sub-par in terms of route setting. I use to climb at ARC and the routes in Stronghold have nothing to compare to it. Not much creativity, not much use of technique. Just a lot of crappy holds to bump up the difficulty. There's not much joy in solving the problem. That's about it for the gym. I'm here to top-rope, and all the problems I mentioned won't be noticeable to a beginner, so that works out. But, when I have no partner, I'm forced to boulder. I boulder to get stronger and to perfect technique- that's not working out here.", "date": "8/26/2016"}, {"review_id": "dG1u7zZRpl0wJxwYKQXl_w", "user_id": "YTbw-MlWdtABuFBPAbyL8w", "user_name": "Robert K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Several autobelays. A decent bouldering area considering it's small. Excellent variety of top roping and lead climbing routes between 5.5 and high 5.12s, including long routes on a really cool flat roof section. Members get a free guest pass per month.Disappointing that they require an \"initiation fee\".", "date": "9/9/2016"}, {"review_id": "u2PczDIxePkC6y9BxFWoOg", "user_id": "F_5BsfMMZwUWvzJTO8DhPw", "user_name": "Jessica M.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "My friend bought me a Groupon for an intro rock climbing, belay class at Stronghold. I was super excited, upon arrival. They have a gorgeous facility, multiple rock walls with varying difficulty levels. They also have a bouldering area with padded mats on the floor, as well as a yoga studio upstairs. Everyone at the front desk was friendly. I went on the weekend, around mid morning, not too busy. When I showed them my Groupon, it included free shoe rental. I told them my size and they gave me the most foul-smelling shoes. I barely wanted to touch them, let alone wear them! It smelled like something had died in them... I put them on reluctantly and joined the class. The class was a lot of fun! We learned basic knots, how to wear the harness, and eventually took turns climbing the wall. At the end they said that now we've completed the beginners course we were certified to come back and climb on our own. I learned a lot but as a beginner, I would definitely need a refresher course! Flash forward two weeks later I noticed my feet smelled nasty... I put two and two together and realized I must have picked up some disgusting foot fungus from the shoes I rented.  I was able to get rid of the smell by soaking my feet in Epsom salt water, but seriously Stronghold, use some odor eater, or just clean your rental shoes! If I ever go back, I'm definitely bringing my own shoes.", "date": "2/9/2018"}, {"review_id": "Carm7VJnPppyUkzY-9q37g", "user_id": "XY3EYqtx3qP7wesNNGRiTg", "user_name": "Andrea S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 2, "funny": 1, "cool": 1, "text": "I found this place through Groupon when I was looking for something different to do for my birthday. My husband and I took the beginner intro group class which was taught by Jacob (I think..? The guy had Doc Martens on). I guess I kinda learned how to climb with a partner and also belay for my partner. It was kind of disappointing that the class was actually less than an hour, the deal said it would be typically 3 hours. I didn't feel so comfortable with the instructor, as a first timer I didn't feel all that welcomed to the world of rock climbing. He wasn't very clear on his instructions and would give me the \"are you kidding me?\" face when I would say I'm too scared to keep going up any higher. I didn't even know how to get down from a climb because he never mentioned the part where you have to push off the wall with your feet as you descend. My knee got pretty banged up because of that, my legs were just flailing all over the place until my husband told me what to do because he saw someone else doing it at the gym. I probably enjoyed myself the most when we were able to just go on our own. We used the auto belays a lot and the bouldering area which was a lot of fun. I loved the location and the space in general. The people climbing at the gym were pretty chill too. Highly doubt I'll ever come back to this gym but will prob try out other places at The Brewery in the future.", "date": "3/15/2017"}, {"review_id": "jTTbjTsC2zFsbrbMHUBfdQ", "user_id": "ogXbtFvgABAY7BGrBCqnaA", "user_name": "Megan V.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "the bouldering area was decent. Good pads for dismounts and bails. More for top rope experience. we went here to learn how to lead climb and the instructor was very nice and knowledgeable. The difficulty of the problems set seem to lie in between Rock City and Factory Boulder's routes. Those are our home gyms. Kinda cool that the whole thing was inside an old brewery.", "date": "8/29/2016"}, {"review_id": "foVFeBjxG3pzm9UIhRGB_g", "user_id": "SLDM9BygfiJUTS0Tv4e6_g", "user_name": "Charlene H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome open space with wide and tall walls all around. Easy going friendly crowd. Easy parking. Good sense of community around the brewery complex.", "date": "9/10/2016"}, {"review_id": "HtWI2G7zB9dRxIfly34Bug", "user_id": "r_8u_Y66XJ01M8OBoqG4ew", "user_name": "Joayn T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I absolutely loved my experience being a member here when I lived in downtown. They change up the routes often, it's never crowded in the early morning, and they have a gym with a squat rack.", "date": "5/16/2017"}, {"review_id": "JK6p3Ev7grGiH8S85GadrA", "user_id": "dStGuNNdAJwokuAb2H3eNA", "user_name": "Givi K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I have been here a couple of times. It is an amazing climbing gym for beginners like me. They teach you everything and go out of their way to make sure you are happy. Even though I had taken the training and I am belay certified, I still had some questions. Tessa answered all my and my friend's questions and gave us additionals tips about climbing.The place also has a lifting equipment on the second floor where you can work out as in a regular gym. I would definitely become a member If I lived closer.", "date": "3/6/2016"}, {"review_id": "3MpkpQci9LJ1LlYNkuwMCg", "user_id": "8ejAu4v4DOgGr53GlUODHA", "user_name": "Patrice R.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's hot in heeerrrr! Lol nonetheless a great workout and awesome climbs. I'll for sure be back. The only reason it's not 5 stars is the price. It's $27 for the day pass, but I can only get 5-8 climbs in before I'm completely beat.", "date": "8/7/2016"}, {"review_id": "PYp72hFfzbnlz2nqZFrTJg", "user_id": "89rHaoBL5RfElA6xkj-5FA", "user_name": "Michael K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Had a great time here. Parkings great. Staffs great. Nice environment/ community. Went with my coworker (who's been here before) and had a blast. Actually taking some of my friends next weekend because I enjoyed it so much.", "date": "11/24/2017"}, {"review_id": "WxhSpYg7JKkPxVPijbtwAQ", "user_id": "9v83UksZrkThOiE584GRBQ", "user_name": "Oulie T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 13, "funny": 8, "cool": 10, "text": "Gorgeous repurposed space for a climbing gym. Hipsterriffic to the Max. Love the impressive smoke stack. Reminds me of being in DTLA over by Bestia. Industrial chic. There are brick walls, lots of metal and of course because it's a climbing gym lots of padding! Rumor is that the walls were created by a local artist. They are blasted with sand to create the gritty texture. Extra hipster points. East LA sorely needed a climbing gym that included ropes. Stronghold fills that void.", "date": "3/4/2014"}, {"review_id": "LSolllOPxE_dRM4OGCulYA", "user_id": "C4JtecqGYloSbuuqAwfD0Q", "user_name": "Martha S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 1, "cool": 3, "text": "Please don't come here! It's amazing but I don't want it to get too crowded. Everyone here is super friendly and helpful. I'm a total n00b but they entertain all my silly questions. Even the other climbers are friendly! Tons of routes, gym equipment, classes, a little convenience store for the noshes, some gear for sale, everything you could ask for. Plus, how many of you can say your gym is woke AF?! I didn't think so. I've seen them do ASL climbing classes, a benefit for planned parenthood, they participated in the women's march, need I say more. So, I'm in love and you probably will be too.", "date": "2/14/2017"}, {"review_id": "oxiqtYmYPBAqKyc8ZcGzKg", "user_id": "rouO-Po26ztrJGl_h4BuQw", "user_name": "Aileen C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Used a groupon for the beginner's class and loved it! James(that's the name I remember) was a great instructor! He was really patient with everyone in the class, and I really appreciate that. The gym kinda smelled, but I got used to it after awhile and figured it would smell. Not a big deal at all. I'm also not sure how parking is prime time, but I went around 3pm on a Saturday and there was plenty. I would definitely get a membership there if I weren't a broke post-grad student.", "date": "3/19/2016"}, {"review_id": "dcJauaEWyRmctDv_7tz3tA", "user_id": "fDqIijPYpagyHsZBBlTztQ", "user_name": "Michele S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing facilities and absolutely fun routes.  There's a lot of great stemming routes that are challenging and loads of fun.  There's certainly a lot more climbing here than bouldering, and a real nice leading section as well (including that beautiful arch you see in the photos).  Really, my only complaint is that the ratings seemed a little soft (as in a 5.10 should have only been a 5.9, ect), but they also have the great idea of putting tags under the route names and letting people add their own ratings and scores.  I would dock the yelp rating down to 4.5/5 because of this, but really, this is a really minor complaint.I also noticed that they have a ton of programs to help you learn the basics of rock climbing (a three part multi pitch workshop caught my eye), but I live too far away to personally take advantage of these classes.  If you're in to rock climbing (or not yet) I definitely recommend checking this place out!  It's one of the best ones I've been to.", "date": "8/22/2016"}, {"review_id": "34XKLQzbUrONbeSXas42EA", "user_id": "_E1aAQ0Yrf0QHGkiG5oqlQ", "user_name": "Quinn V.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 6, "funny": 4, "cool": 5, "text": "Best rope climbing gym in LA county, hands down. Everything is brand new and clean. Gear rentals are free for members. Good rental shoes. Fun place. Their intro climb is free for members. That's the belay class. Other places run u $20-30. Their climbing movements class is also free. That is like a technique or foundations class at other places. I can't believe that one is free w membership! I took it w peter. He was knowledgeable and really nice. Learned some very helpful techniques I can practice to climb better. Yoga was fun n laid back w Tessa. This place is highly recommended. Not crowded on peak climbing days like Tuesday and Thursday.", "date": "3/12/2014"}, {"review_id": "3x07Lojfi9yGbh0nDOC2Rw", "user_id": "vmct6SMzG2vP-L15mmxG3A", "user_name": "Wilson Y.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Awesome staff and wonderful gym. Only took off a star because their ropes are really stiff and abrasive. My hands got beat up more from the ropes than the wall.", "date": "5/29/2017"}, {"review_id": "ufYymG292wLTGm93L6HmEw", "user_id": "2s30z8R4sXi2ulXZelgUiw", "user_name": "Julia A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "The Stronghold Climbing Gym is F. U. N place! My friend has been convincing for the longest time to go rock climbing with her. One day, I said yes and we scheduled to go the following Tuesday at 7pm.My friend, friend's boyfriend, and I met up at this gym. Soon as I got in, I signed my death away. Lol! I didn't pay anything because friend's boyfriend had a free pass for me. This was my first time rock climbing, and it was not bad. They have a lot of different levels you can try. We ended up staying for three hours. Good time and great work out!Make sure to stretch a lot before you start and drink a lot of water.", "date": "12/5/2015"}, {"review_id": "nHmL9SWdxDHqh_fdfVSHGw", "user_id": "hTmMiui8do0uZhun7cpWYg", "user_name": "Bex H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "planned a birthday event here yesterday and we all took the introductory class to climbing. The class itself was long but informational and def. necessary as it is a pretty serious situation if someone falls or get hurt. Ive gone rock climbing and bouldering before and but always had someone belay me and took care of all the rope tying so this time around i actually learned the Ropes (pun intended) ! I couldn't get the belaying in the beginning as i have literally no coordination and a lazy learner, but one of the other instructor stopped by and literally forced me to get it ! I thanked him later for pounding the lesson into me, because i eventually got it. Although i didn't belay again after that, i still got the concept and i enjoyed myself the rest of the night!", "date": "6/15/2017"}, {"review_id": "x9gpINWv10UCsUiAh_zj2A", "user_id": "jNJW4XEVy1C_51WYFsRH7A", "user_name": "Kelly F.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I can not say enough good things about the staff at this gym. They went above and beyond to make my sons 11th birthday absolutely perfect. Their chill vibe and incredible expertise made all the kids comfortable! The space is fun and challenging with tons of different level areas. The kids did not want to leave and the staff did not hustle us out when our time was up. An absolutely fantastic experience in every way. Thanks again!!", "date": "3/13/2016"}, {"review_id": "e3n2UD0UX2z2bQLv1BH2uA", "user_id": "QWfyxUKBXDcUYCjUSbbEVw", "user_name": "Juan B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 5, "funny": 0, "cool": 1, "text": "There are some misconceptions posted by some of the yelpers for Stronghold Gym that I need to point out. Warren W. mentioned how Stronghold \"doesn't have the belay and lead hooks tied on the ropes\" (I'm going to assume he's referring to autobelays where you don't need a belayer) like other gyms. And then he goes on to complain how the front desk wouldn't let him on and teach him how to tie the rope i under 5 min. That's a big no-no. There's a lot more to tying knots onto your harness than what it seems.You have to learn how to belay, how to tie on knots, learn how to read when your climber is going to fall and catch his fall, etc. And even in that one or two hour class, you still won't be perfect with belaying. If the front desk tells you that it's not a good idea to learn how to tie into a knot, it's for you safety. Belaying is an important skill that one must master and learn, as your climber is trusting his/her life on you.So I would take caution with Warren W.'s review and take the darn belaying class. And I'm speaking with a year's worth of climbing experience and even then I still feel like a newb.AnywayI went with several of my friends to Stronghold for the lead climbing class.It's much cheaper than Sender One's or Boulderdash's lead climbing class. Peter, our teacher, was excellent in covering how to clip in, rope payout, belaying, and learning how to brace the whipper. I'll do say that I wish there was more one-on-one time with student and teacher to observe your lead belaying and clipping in, but that's probably due to the size of the class. I highly recommend the class. I probably should practice some more before we take off the top rope belay.As far as facilities go, their top rope/lead walls are incredible. The walls are 65 foot long or so I've been told. They have three autobelays, plenty of top-rope routes, and a nice little bouldering section. I flashed a 5.10a on one of their autobelays and it was incredible, but man is the climb so pumpy on your forearms. It's a lot harder without belayer.I'll do say that one of the issues I have with the gym is air conditioning control. It's hot as sin if LA is experiencing a hot day. Whatever, it's just me nitpicking.I would recommend this for any climbers of all skill level. Keep in mind that it's a great idea to learn how to belay or take the belay class before coming here. Anyway, would love to come back.", "date": "9/7/2015"}, {"review_id": "mE9cEvR5n-95M1EOtnPqXg", "user_id": "Dn5EVVGsF8hfz5JdOksxrg", "user_name": "Warren W.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 1, "useful": 12, "funny": 9, "cool": 5, "text": "Came here with my girlfriend and we were both first timers to this rock climbing gym. We got the hardness on and we were ready to climb.But, this rock climbing gym doesn't have the belay and lead hooks tied on the ropes like the other rock climbing gyms I've been to. Ok, no problem so I go  to the front desk and ask for help on how to tie the rope to belay and lead. The person helping me just kept saying you need to get certified and go ask other climbers for help. I mean seriously, why couldn't you spend 5 minutes helping us. So I just gladly asked for a refund  and went elsewhere .So if you're new to rock climbing or don't know how to tie the rope, I suggest you don't come here  because they're not really helpful in teaching you at all. It is not that complicated, and it really only takes 5 mins to teach how to tie the rope.", "date": "7/19/2015"}, {"review_id": "WEH5JDKGIstwbiW_hI2xxw", "user_id": "ztx4p5JivHYzNeIv3Hv0Vw", "user_name": "Sarah B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I just LOVE this place. I have visited 3 climbing gyms in LA and this is definitely my favorite. It has a bouldering area, which is fun, but more importantly it has LOTS of top ropes and lots of places to practice lead climbing (which is pretty rare I guess ?). Plus a gym and a yoga studio in the upstairs area. The place is pretty big, There is vertical climbing, shorter and higher routes, overhanging stuff, even a pretty nasty roof that looks super impressive. Each route has a grade and a board for feedback where climbers give their impressions about the route (what grade it should be and if it was fun climbing or not). There are also self belay devices, and the staff is pretty friendly. I also love the fact that they are open so early and so late, convenient for awkward hours.", "date": "1/5/2016"}, {"review_id": "l1rR8za-KkkLhnIVtm1hpw", "user_id": "lTC60LZayL70gHlWU4w2mQ", "user_name": "Allen E.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This is a great spot to start climbing it's a fair price for the day pass and includes all rental equipment, would definitely go again", "date": "2/4/2017"}, {"review_id": "1HbKAU-_VAQbYIu757HPKQ", "user_id": "PKZ-dQwkTDX518gdyUtDYw", "user_name": "Amy P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 2, "cool": 3, "text": "Redeemed a Groupon here. Matt was very helpful, this tall guy wasn't so helpful. Anyways, Brian was our instructor and and did a very great no teaching us the basics. I've taken a couple of beginner classes over the years, but this one's the best. The facility even has a gym and a clean locker room with showers. $75 - I think it's worth it. I would join.", "date": "8/30/2015"}, {"review_id": "_NADnDQEobo33uwuZlM7Iw", "user_id": "v71j3sOdMPvCXf1jilgHpA", "user_name": "Ariana A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I bought the Groupon for a friends birthday. We both had a great time! I would say though that for the average groupon person with no experience, the people at the gym understandably take the climbing very seriously. The only critique I would have is to have a little more and fun and excitement form the instructor. Not saying he was bad, but I don't think someone that buys a Groupon is planning to rock climb down in a mountain. Anyways his name is Jacob and feel bad I didn't have any cash to tip!! Sorry! Fyi bring cash with you. He was very thorough and strict about the proper method of climbing. Contrary to what other reviewers have said, yes it is a 3 hour class and you can stay at the gym until they close from my understanding. The first hour and a half or so is learning the proper way to climb. The last hour is to actually do the climbing and then the instructor will leave you to it for how ever long you want to stay. I feel this is definitely more of an adult activity rather than for kids. There is  a super cute artsy restaurant hidden in the neighborhood behind the gym. Get the guacamole, it's good! We will be back again for sure! Also, without the Groupon, it is not too expensive for what you get!", "date": "5/13/2017"}, {"review_id": "jp9ql2infQy4Uki3eODCnw", "user_id": "NiHvOZSFWycbhwplLZ24hw", "user_name": "Jason L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 3, "cool": 2, "text": "If I could compare this building to a reptile, it would be a chameleon. Sure fooled me. I thought my female companion was taking me to a brewery (because the smokestack above read THE BREWERY) but it was a rock-climbing gym. Amazing. Spice is the variety of life. My fingers are still recovering because the blisters exploded.", "date": "8/14/2015"}, {"review_id": "rwu4ynHiQr6PHn05ZUFjiQ", "user_id": "66moHUUSg3jEulYgPu7iGA", "user_name": "Jason J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Their cold brew works, but I haven't tried the food yet. Honestly, this place is better for climbing.", "date": "10/30/2016"}, {"review_id": "-GQva4PSOp5g0Oh2i_CFVg", "user_id": "MRQmDo5j5k25_Pbm2qm-rg", "user_name": "Megumi H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Best facility in the Pasadena/DTLA area for top roping. No AC is the down fall but hey! Fall and Winter is coming!", "date": "10/12/2016"}, {"review_id": "0_2QK2eVqt5k5g3ggmZODw", "user_id": "HHS9a3wrUQ89NwFOWGVe0A", "user_name": "Kirsten C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I love this place. I try to come 2-3 times a week. It is always clean. Employees are very kind. Great environment.", "date": "2/12/2017"}, {"review_id": "nbxVPO93fiG4fRqEr5lAAg", "user_id": "-Ul50ULXyPG_E1o3f8K6Kw", "user_name": "Amber T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Staff is super friendly and helpful. Brian was a superb rock climbing instructor!", "date": "11/21/2016"}, {"review_id": "WnvYG_uFNoQjeIqzewvEjA", "user_id": "MpZncpousIHwzR2VUiOl8A", "user_name": "Jessica M.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 2, "useful": 1, "funny": 2, "cool": 0, "text": "The place is great but i cut out 2 stars because of the rude receptionist/worker there. I came on Wednesday and the guy greeted us rudely. First when i was paying, instead of taking care of it first he was blatantly talking to his friend about a guy who cracked his head and went to the hospital for doing rock climbing (how comforting to hear that BEFORE doing the activity). Second, he didn't even offer me the equipment needed when i paid $6 (thank God i was here the day before so I knew the equipment). This is my 2nd time to do this so i'm considered new and not an expert at all. It is NOT SAFE to just go climb and not using anything when you're not an expert, everyone knows that. Third, when I asked for a 39 size shoe, he gave me size 5,5 US size shoes (since when 39 equals to 5,5 US size? It equals to size 36!). I mean what kind of bull is he trying to pull here? Overall, it wasn't a pleasant experience at all with the receptionist. The stars are for the place itself but i'm not planning to come back anytime soon :(", "date": "9/7/2016"}, {"review_id": "SXXh32WONP_YsEVhVWnOFg", "user_id": "u_2nLTRa_t3PLu_NNK0_3g", "user_name": "Melissa A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "A really great gym and a wonderful community. Stronghold is a great place for both new climbers and experienced rock masters. I love how both super experienced climbers and new ones mix so happily and I think that thier classes are great at teaching the skills safely and correctly (which is higher because safety really really is key I this sport). The staff has always been great and helpful.", "date": "9/20/2016"}, {"review_id": "-cFEyE73Js98WNaU0xERNw", "user_id": "irsY_DjPgSZoXblK6Dlwdw", "user_name": "Barry T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I've been here a few times with some friends. I think that this is one of the better rock climbing gyms that I've been to. First of all, they allow dogs here, and being a dog owner, that's an automatically PLUS in my book. Secondly, they have a variety of routes from easy to very challenging. I'm still very much a beginner so it was easy for me to find a handful of routes that were easy enough for me to complete and challenging enough for me to feel good about. They also have a small gym up stairs with a few deadweights, and treadmills. I had a few freebies since I know someone who was a member. I did have to pay once and it cost $25 bucks for the day. The other members here are very supportive. Rock Climbing in general is full of supportive people.", "date": "4/12/2015"}, {"review_id": "DJe5k8ha558NMjR2GAqLHw", "user_id": "WdccGSeguB_TbrZO8okWFA", "user_name": "Giao T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "I've only been to one other climbing gym before a long time ago so I admit I don't have much to compare to. I also don't even pay for this (my wonderful sister has been but I'll pay next rounds) so I'm not sure about the value here. But being \"encouraged\" to come by my sister and her boyfriend, I do admit that I enjoy it. It's fun and yes, there's the joy/thrill in completing the climbs.Anyhow, why I like it. I've been here a couple of times and thought that I would be bored of the routes but it turns out they seem to change them out often to keep the routes fresh which is great. It's spacious enough so that even when it gets crowded it's not bad and there's no wait. And they have routes for people at all levels. The bathroom and change room are clean (compared to the 24 hour fitness I go to for my regular workouts which is really really bad). And the staff (as well as other climbers/guests) are nice and pleasant. Oh, and we brought my cousin once too and renting the equipment (harness and shoes) was like $5. Nice!We'll be continuing to come here.  =)", "date": "4/5/2015"}, {"review_id": "66Uj6VHLnQLCVogR2qTgcA", "user_id": "TmKW9WZyvRXv7v9e9GORPg", "user_name": "Chi T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 4, "funny": 0, "cool": 3, "text": "Stronghold Climbing Gym is a solid 5 in my book.  I gave this gym a 5 star on my original review for their varied routes that change regularly.  For my update, I'd like to also add that their customer service is exceptional. They go above and beyond to make their customer happy.  And happy, I am very. Stronghold has a holiday special. With the purchase of a $50 gift card (good towards anything in the gym), you get one free day pass. Now, this is a great deal because a day visit is $20. Anyway, I purchased two gift cards. The first one was for $100, which was mailed to me within 5 days.  The second one was for $150. I was sent the confirmation email and was expecting to receive the gift card within a week. Well, I eagerly awaited its arrival every day for a week. And on the seventh day, I sent Stronghold an email asking for the status of said card.  I got an immediate reply from Kate, who said she would ask the staff member who was in charge of gift cards to look into my order. Sure enough, true to her word, she sent me an email later that evening and said that they had made a mistake and will fix that immediately.  Kate had someone hand deliver the gift card to my house and also included an additional free day pass with my order.  Not only that, but I also got a t-shirt for the inconvenience.  Now, I don't know about you, but I have never had such a pleasant customer service experience.  Stronghold was prompt in replying to my email and looked into this matter immediately. Thank you, Kate for the wonderful service I was given.  I look forward to using my free day passes and spending my gift cards and will highly recommend Stronghold for both the routes and customer service.", "date": "12/23/2014"}, {"review_id": "T-R9wS00W8Fr39-wqBUQCA", "user_id": "Ye-LrOk3iTQprYmwuhjU5Q", "user_name": "Shanika H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 3, "funny": 3, "cool": 4, "text": "So. Many. Routes.They've got suuuuuper tall climbs, so it's definitely a workout!I wish i had more monies so that I can become a member a this climbing gym!The routes are marked with tape, and that can be a problem if you need to look down to fix your footing or if you're reversing down a path, but it's all good. The gym can get a little warm, so they have the most giant fans I have ever seen in my life going when necessary. There's a small workout area in the second floor loft where you can go h.a.m. on the weights and blow out your quads on a stationary bike. haha.It's kind of overwhelming for a newbie like me! If it's your VERY first time, you'll have to register on the mounted ipads as you come in (sign a waiver, blah, blah , blah). If you've NEVER climbed before, make sure you sign up for their introductory classes (or at least know the basics of how to belay and climb) because you will need to pass the belay test, just like any other climbing gym. The bouldering area is insane! So many problems, you can't get bored!Street parking, but the gym is located on a more private street just off the freeway.Usually you can find a spot.I have one complaint: the harnesses have a horizontal belay loop and I just don't understand how to use them without the ATC hooked in a funky position. Maybe I am just too stupid to get it together. Maybe I have two complaints: the ropes are a bit more stiff than the ones i\"m used to using at another gym. maybe I am just really naive, and correct me if I am wrong, but I seem to catch the rope more in the belay device a lot more at this gym. It MUST be me!Anyway, once I get my own gear, it will be perfectly fine.", "date": "12/1/2014"}, {"review_id": "aB7AZrgMhQ-d1K756DBVAA", "user_id": "xQ6meuhtTiNVCurX-UVMNQ", "user_name": "Albertine V.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Nice people, great environment, good routes for all stages of climbers and a gym and bouldering section. NICEEEEE", "date": "12/14/2016"}, {"review_id": "AfnxRkOHmTc8HDuvYgZifw", "user_id": "ETOnePvbyqnWrp5fmZ8R-Q", "user_name": "Norah S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "As a new climber, that is the great place, the coach is awesome! We learned a lot of new climbing skill!Staff so nice in there!Excellent experience with my friend!", "date": "8/9/2016"}, {"review_id": "A-eLrcdF3NlIEGWrBiLhFw", "user_id": "nQJw1DUqU1elxnr7mPIZ-g", "user_name": "Kate J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Took my son here and he loved it. Very helpful staff and cool atmosphere. Also, check out the coffee house to the left of the gym (just past the L.A. Gun Club). Very good chai lattes.", "date": "12/22/2016"}, {"review_id": "RX55yLWBbO7xpC-uSgnMVg", "user_id": "2zCb13JGQMwkVbYoC_u_Ig", "user_name": "Kristanna F.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "Fun for the whole family! Great staff, awesome vibe. Cool location. If you are looking for a great workout, a new hobby, or just something different to try, this is the place.", "date": "1/21/2015"}, {"review_id": "wxB46TrbgfUSVLzNP95nTw", "user_id": "KaJIyLaE9VJHA2FdiSbQxg", "user_name": "Martha C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 5, "funny": 1, "cool": 2, "text": "Yay for Stronghold!!! I moved here recently from CO so I'm pretty spoiled when it comes to climbing gyms, and this place is legit. The routes are set really well and there's a great variety of style and movement. Grading seemed spot on as well. They reset the routes and boulder problems often enough that there is always something new to climb. The space is beautiful, everything is clean and brand new, and all the staff members are super friendly. They have a whiteboard where you can write your name if you need a belay partner, as well as a facebook group to make plans for meeting up with people. I love when gyms do stuff like this, I think it helps so much to foster a community vibe and it's great for people new to climbing or new to the area. So basically, they rule.", "date": "9/8/2014"}, {"review_id": "Vv2geHfP7Sqf-Ji_jywI-w", "user_id": "pncUQvH7cQY0X408e-olbQ", "user_name": "Cindy C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Probably my favorite indoor gym in the immediate LA vicinity. This spot is located in the Brewery Complex near DTLA and houses 50 foot walls, a few auto-belays, great bouldering section, workout machines, and a new moon board training area above the bouldering wall. There's free parking on the avenue right outside the complex (DON'T PARK INSIDE THE GATE AS ALL THAT PARKING IS RESERVED FOR THE VARIOUS TENANTS OF THE COMPLEX). They sell a great variety of fitness snacks for that mid-climbing break time, and some books/mags/gear. If you get lead certified here, they provide the rope!This gym is spacious and the routes are always interesting and challenging, and the walls are super grippy (not to mention sharp, as you'll see by the various bloody remnants of climbers scraping themselves on the wall...) During the summer when it's extra hot in LA, the gym can get a bit steamy especially at the top of the climb where there are skylights and the heat collects, but they do have several large industrial fans to help keep the air circulating. The gym is well-lit and has never seemed too crowded to me. Post-climb, you can grab a beer at the bar that's back in the complex. You exit the gym, turn L around the corner of the gym, and then head through the park on the right hand side, and look for the metal stairwell at the left edge of the building past the little park/parking lot and go up the stairs to the bar. They have a great happy hour and decent beer collection, and some typical bar fare.We easily spend all day climbing here on different routes and still want to go back for more. The tall walls offer great endurance training, especially when you go up and down a few times in a row. I sweat my hardest climbing here. :) Or wait, no, I glow. ;) If you follow them on Instagram they'll know your name and be able to check you in more quickly when you enter, too, if you're lucky. Hi Vic!", "date": "2/22/2015"}, {"review_id": "lxfOEHWf4l__fwAqWgEK0g", "user_id": "zDaucGvJCuM3_PsGc1jA2w", "user_name": "Ian A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 4, "funny": 0, "cool": 4, "text": "I should write a review for this place because I go here at least 4 times a week. You could call me a gym rat I guess but I love climbing so much.  This place is amazing. The route setting is fun and challenging no matter what level of climber you are. I'm more of a rope climber so this place is perfect for what I need from a gym. I climb around the 5.11+ range and they feel like the ratings of real outdoor 5.11's. I take the yoga classes on Wednesday and Fridays and it is awesome. Also the gym area upstairs is great for training and cardio.  The bouldering area is not the best but it is good enough for me. The route setting is a little weird sometimes but they reflect the actual grades of bouldering outdoors.", "date": "8/3/2014"}, {"review_id": "w2DUqSp5UPiKB4ksN94qUA", "user_id": "aC7wx9w95dIi1p2z0d0weg", "user_name": "Bin H.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "My first time climbing and won't be my last!Came to Stronghold for a friend's birthday bash.. it was about a dozen of us, and the staff were SO helpful and attentive. The women's restroom on the first floor had two shower stalls and a bunch of lockers. The loft-like second floor has a small gym and studio for classes, and can also be curtained off to host private parties.Overall, it was fun and I would love to return.", "date": "10/8/2014"}, {"review_id": "kYkLRrajvFndiVQgu0S8iw", "user_id": "kyD1pd29Lwg49Epnyh9waQ", "user_name": "Stacey T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is amazing! I tried climbing at another gym in Orange County, but wanted to go to a climbing gym in the L.A. area. Luckily, I found a Groupon deal for an introduction to rock climbing class! Yes! The teacher was great and the staff is amazing. They look like they enjoy being at work.A few days after taking the class I got a membership here, which is a pretty good deal. Membership includes a pass to the fitness center upstairs, yoga/fitness classes, free rentals and a free buddy pass (per calendar month).I only have one recommendation for the managers at Stronghold - please please please make sanitization wipes more available in the fitness area. Last time I went you guys ran out.", "date": "7/8/2015"}, {"review_id": "IkdulDZLRqJj3lRLgUyVDA", "user_id": "_qvjWcsf5S8HN3_RbIrg0A", "user_name": "April D.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "My daughter asked to have her birthday party at a climbing gym, and we chose Stronghold because it was the closest. So glad we did. They were great from start to finish. Kate in particular was really helpful, and great with the kids (all age 7). The upstairs party space is simple, but gives the parents a nice place to hang out and watch the kids while they climb. Their ipad sign-in makes the release forms super easy. All in all it was very laid back and the kids had a blast. Highly recommended.", "date": "7/20/2014"}, {"review_id": "3GbWON5nd96_B8QDoU9LQA", "user_id": "mylFciJk-TBfWpL49DEIPg", "user_name": "Paula V.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A little pricey for me. I've never been rock climbing and they kind of just throw you into the wild if it's your first time. But in the end I had a great time!! Will be back!!", "date": "9/15/2016"}, {"review_id": "obLgeLsguiOpZkXVYRNGwA", "user_id": "YnfBrSjEWqOJ7Q654kDDuQ", "user_name": "Tiger C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Tons of space for climbing, bouldering, and a gym. Four auto belays which is nice too if you don't have a friend to go with! I will be coming back!", "date": "5/26/2016"}, {"review_id": "jPBYIB6dACA8CaSPTyvxfA", "user_id": "JAxL8SXLKArORqwew_Fccw", "user_name": "Lang T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This place rules. Came here with a friend- was a bit intimidated as I have a slight fear of heights...but damn once you're in the zone it's hard to focus on anything except trying to get to the top. Very safe and everyone who goes is down-to-earth. Will definitely come back! Just gotta work on my core and strengthening my hands/arms...the burn hurt was insane...I have a feeling I'll be sore tomorrow!", "date": "1/15/2015"}, {"review_id": "VTJqOGCDIue1HCPMtuQLbA", "user_id": "g8PiHA91eXw9YD-UYzZRDg", "user_name": "Sandy L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 6, "funny": 2, "cool": 2, "text": "Bouldering is a really relaxing and meditative activity for me so I was keen to find my inner zen with my bf at, Stronghold, one of the newest climbing gyms in East LA.  First off, the location is beautiful. I love that the climbing gym is in a repurposed brewery. The exposed scaffolding and brick walls are a gorgeous backdrop to the climbing walls and there is a really hipster juxtaposition going on here. It's almost like this climbing facility belongs in the arts district and not Lincoln Heights! With that being said, we came on a Sunday around noon and parking was not difficult. It should be noted that all Stronghold gym members should park on Ave 21, before the gate. Once we entered the gym, we signed a waiver on the iPad minis by the entrance and were charged $20 a person for an all-day pass with $4.00 shoe, harness and chalk bag rentals. We started with the bouldering first and it was a disappointing and underwhelming experience. I've bouldered at ARC in Arcadia, CA before and found their walls to be higher and have significantly more routes. I wish Stronghold had more V0 and VB routes to select from because I did not see too many. From what I observed, it was easy for many people to top-out as the walls aren't too high (around 16 feet). My bf and I also decided to try the auto belays and he loved it! It's awesome that our day passes included the auto belays as this was my first time using one. As more people entered the gym, I noticed a lot of them were belaying. If you're into belaying, then I think Stronghold is an excellent climbing gym for you. There were so many high walls and a variety of difficulty in the routes for belaying! The 2nd floor overlooks all the climbing action and has a small fitness area complete with: a treadmill, a weight section and an area for yoga. This was a welcome escape for my hands and arms as I decided to take a break from the climbing and focus on running for a bit. Bottom line: Since this is a new gym, everything is still brand spankin' new--including the restrooms and lockers! I was amazed at how large and clean the bathrooms were. The lockers in the women's restroom were also self-locking so I felt my belongings were very secure while I climbed. For me, I think I would rate the gym 3 stars overall because of the bouldering walls. For future improvements, I would LOVE to see an expanded bouldering section with higher walls. My sore forearms and arms will surely thank you!", "date": "4/15/2014"}, {"review_id": "54b0X0CrewTAV9s2i8bW_w", "user_id": "cU33gqGqV-ENFtFAhaQxlA", "user_name": "Jun K.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 3, "cool": 3, "text": "Is heres every employer is so nice. Kind and profesional.So. Really really exiting. Already I bring 6person at here. Cuz super super exiting~~~When I begining. I go weekly 1 or 2time. But nowI go allmost everyday! If I have time for climbingI go everyday! Im recomend u do it! It so good!", "date": "4/29/2014"}, {"review_id": "f3kbvGJfNH9zGEs6iPK-gA", "user_id": "7h2FgR1rwzg4Y6fw1ymIYQ", "user_name": "Kathleen L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This place is like my second home! I became a member when it first opened and haven't looked back! here are some tips for newcomers:- If you're new to climbing and don't have any experienced friends to take you, definitely get an intro to rock climbing class from groupon. Otherwise you'll only be able to boulder (short walls, no rope) or use the 3 autobelays in the roped area. - If you buy a day pass that includes access to everything in the gym, so you can also try out a yoga or core class to get your money's worth! - Don't hesitate to ask staff members for help or advice. They are awesome! Super nice, caring people. - If you've climbed elsewhere, you still need to take a belay test for top-roping, and lead test for lead climbing but they are pretty straightforward. If you haven't climbed in awhile, ask a staff member to give you a quick review.- Head to Barbara's brewery next door for a post-climb beer and food -Plenty of parking in the long driveway except for weekday nights, when it can get crowded. Just drive past the building and park in the lots behind it. - Free wifi- Membership is kinda expensive, but it's worth it because I go several times a week and can't imagine life without it!", "date": "1/18/2016"}, {"review_id": "f8cUNyhmtOqhJxYbSGHIWQ", "user_id": "M2H9EyyADuJL74XUyz3Gow", "user_name": "May F.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "As a recently graduate from grad school, I don't have the money to join yet. So I've been here only with friends' guest passes. But the past few times I've been here, I've had a GREAT times. In fact, I went there just this past Saturday. The facility was still clean, routes were new and fresh, and most importantly, the staff members were still super duper friendly. Side note: they are always on Instagram showing supports to climbers. Personally, it makes me feel like a part of a big family. I pray that SH will keep up the work. I'm certain that I will be a member once I secure a job hehe :)", "date": "5/19/2015"}, {"review_id": "PbOBPbMnRNnCy8w5UnGmEA", "user_id": "XesdWUodGwNJ5rgQ06vj2A", "user_name": "Shannon C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "We came here a couple weeks ago for a belated birthday celebration. I'm not an avid climber so I was happy that they had two auto-belays in the gym. The staff was so very friendly and helpful. Unfortunately, my husband twisted his ankle on a climb, but they were very helpful to provide ice, an ACE bandage wrap, and send us home with crutches even! I just found them to be over and beyond helpful and kind to us.A couple friends and I kept climbing and I love the very tall walls/ceilings and great natural light this gym has. A couple larger bouldering walls greet you in the entrance and then further back there are plenty of ropes for rock climbing and belaying. I hope to come back soon. The sign-in process was a bit of a drag as you have to fill out a lot of personal information and a waiver pre-climb. Probably not that much more than any other gym, but it would be great if they could someone speed that process up. The spot downtown is where the old Brewery used to be, parking is pretty reliable, but it would be better if there was a sign outside letting climbers know where the safe parking spots are. We had to come in and out to check the sign inside the gym and re-park our cars. Thankfully, parking is free.", "date": "10/28/2014"}, {"review_id": "Kg1Q67f8K_PQ5IPURHkCZQ", "user_id": "XG_e2TpRjhNO3Tj3QR85GQ", "user_name": "Lydia L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place. The staff are very friendly. Lots of options if you want to boulder or rope climb, and they even have a few self belay ropes if you don't have a climbing partner.", "date": "7/1/2017"}, {"review_id": "dU1tSlh7kUSIkft0TLxGyg", "user_id": "IbUQ_HC9nd66uwgXAg4hyA", "user_name": "Ann M.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "I took the lead climbing class with Bryan last Sunday and it was great!!I took the class because I took a lead climbing class at another climbing gym and it was a less than desirable experience. The class was big (11 people) but it didn't actually matter. Plenty of personalized attention, great information, he made sure to watch all of our falls. Emphasis on safety. Also love the gym itself. The walls are high, almost all the walls are top rope and lead accessible and the route setting is great. Bouldering section is great too. They just need air conditioning.", "date": "5/23/2015"}, {"review_id": "5oYxy8Guvj_75fLQSgJXWw", "user_id": "2KfGK4NzuAlTQ0FZs16PmA", "user_name": "Abby S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 2, "cool": 3, "text": "I love this gym! The staff was very friendly. There is a nice bouldering area that features top out routes as well as some roof climbing which is nice. I haven't been on the ropes yet but there is an impressive amount of routes for those who want to do top rope or sport. I also saw some sweet looking crack climbs. The gym also offers a decent weight lifting area with tread mills and rowing machines. I was very happy with my first visit and became a member!", "date": "3/6/2014"}, {"review_id": "sOsVsEIslblcAfoUTidjiA", "user_id": "7PFLzhiWRRt-HDPxnzxGQg", "user_name": "Shiva A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I went there yesterday and enjoyed it very much. The location is easy to find with lots of parking space.  Staff is very friendly and attentive and for new comers explain everything and make them feel welcome. There are lots walls to climb so you don't feel you are on anybody's way. The bathroom and changing room is clean and neat. There is a $20 entrance fee and $5 rental fee which is pretty reasonable. And you can stay there as long as they are open which means you can go have lunch or dinner near the gym and come back and climb again. Can't wait to go back.", "date": "3/9/2015"}, {"review_id": "bGFPcObSVBLMhOaqPF51zA", "user_id": "Tc0Ql84bMMblTvEY3aQQ3A", "user_name": "F. A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "Overall, a very clean and safe gym with a vibrant climbing community. Excellent instructors and friendly owners. Good classes, although I find the material is covered a little too quickly for total beginners.My only gripes with the Stronghold are the high day-pass price ($20?!) and the attitudes of a few employees (in particular, I find Mikey consistently rude to men and overly friendly to women).", "date": "2/1/2015"}, {"review_id": "zyk4-xzwD2o3K2gyQwzo0g", "user_id": "1r0RcZSZMMew25-erVa-YA", "user_name": "Maria E.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This was my first time here, came here with my daughter and her friend (age 10 & 9) and they really enjoyed it.  We used their auto belaying system as you need training to be able to belay someone.  The staff is friendly, the facility is bright and clean and they had 5 stations for auto belaying which was enough to keep us busy for a couple of hours.  We paid the day fee and were able to leave and come back throughout the day.  Would definitely look into getting trained in belaying.", "date": "4/6/2016"}, {"review_id": "fkjI0TcYCHlp7-inEQm5Ww", "user_id": "hCl77Kb1IMUP83L07l1DDg", "user_name": "Kazuaki J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Wish I could climb outdoors all the time.  Working full time as a desk jockey though, being a member at Stronghold is the next best thing for an after work climbing fix.  This place gets so many things right for a lead climbing gym.  46 foot walls, well though out space, quality route-setting, and frequent changing of routes to keep things fresh.  The weight training and machine areas are really good and not an afterthought like some other climbing gyms.  The staff and vibe here are friendly and people generally look out for each other.  Climbing grades here feel fairly accurate compared to outdoor sport grades at local areas.", "date": "11/20/2015"}, {"review_id": "uCTN_KAxxuvFgF3Ybk5ITw", "user_id": "i1iatyVSG2t9vBNrZe4qmA", "user_name": "Phoebe J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is just amazing!! All of the staff are super kind and helpful. Jess was so helpful when I first got into climbing, and she is such an awesome teacher!", "date": "2/28/2016"}, {"review_id": "pRaC9I7Gz2HQR4QCV5wTkg", "user_id": "uGGHA66wwUgphT_-oeGh5g", "user_name": "Evan O.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This. Place. Is. Awesome. Went last Saturday and attended the Intro to Climbing class. Highly recommend this place and will be coming back soon.", "date": "5/7/2017"}, {"review_id": "Ua6nL3-UnuPAEjQ2eeVGug", "user_id": "Sh47N3lS0sHKLxdjUP9_Ng", "user_name": "Lisa N.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love this place!! I've been a member for a while now and I love that they change their routes a lot. nice staff members, fun atmosphere...i've been asked multiple times by staff on my way out, \"did you have fun?\" and my answer is always a resounding yes :)", "date": "1/29/2016"}, {"review_id": "a_ld1HGtMNymmJnuRsn3Cg", "user_id": "E8585EFyVYI9EXTIbBuEtA", "user_name": "Kat L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Both my boyfriend and I came back because the Stronghold location is very convenient, there is free parking on the street, and the facilities are new and clean.  This time around I had a better experience.  Brian kindly reviewed the ropes and belaying with us and my two friends.  Brian was super patient and kind.  The gym was pretty empty because it was fourth of July weekend.  I left on a positive note.  I left my sunglasses in a locker last time I was here, and it was in the lost and found.  If you go, I recommend going when it isn't busy for beginners.", "date": "7/17/2014"}, {"review_id": "lKMgo03YnRbvSWBD8eayRQ", "user_id": "645nzT5M-CF-32QUWgR_hQ", "user_name": "Hila S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my nephew and my niece to that place and it was overwhelming!  We loved it! The kids had so much fun and we will definitely be back!", "date": "4/13/2016"}, {"review_id": "6eAlaoyYMBAJEyUWj1zaYg", "user_id": "V3pAIoKS9I67Ik7zzYL1uA", "user_name": "Jenny G.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came to this gym a few weeks ago with the pass from a friend. Was glad to find a nice gym that was well ventilated! (compared to the hangar 18 gym I usually go to). Half of the gym is bouldering, and the other half is top rope (with some auto belays). The route ratings are pretty fair, and I like that the wall were tacky enough for me to climb on.  The top rope section has super high walls- great for endurance climbing.Not sure if there's a student discount, but if there is, I'd definitely come more often.", "date": "1/19/2015"}, {"review_id": "sqom235ObXWFywnShAKc_A", "user_id": "ehEY_fMop11EYnejGRUyug", "user_name": "Cat P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Best time to beat the crowd for you nine to fivers? That would be weekends when the gym opens. I highly recommend taking the class to learn how to top-rope. It was incredibly helpful and has us hooked on a new sport.", "date": "10/22/2015"}, {"review_id": "lg07y_t3C9I-kApqkp4AFg", "user_id": "nVxYIjL8hBYGvrAtSILz0Q", "user_name": "Anthony M.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I usually climb at Sender One but ventured north to meet a buddy who was visiting friends in the area from out of town.  I'd also been wanting to check out Stronghold.  First, this is a solid gym, I'd probably say 4.5 stars, which is darn good.  Staff was very friendly and professional.  I was able to do the waiver and belay check in quick order.  The setting was very good for the most part.  I also liked that the grades weren't too soft.  I love my home gym, Sender, but the grades a bit generous at times.  Routes were plenty long and had nice movement.It was also clean and well-lit.  Some gyms are just dingy and dark.  Even better, there is a microbrewery around the corner!I'd certainly climb here periodically for a change-up. My only minor issue was parking.  Great job y'all-thanks for the hospitality!Update:  I went this weekend again and like the gym even more.  The route setting is great and more true to outside, although no gym can replicate what it feels like to be on a JTree 5.8 and thinking \"WTF!!!!!  This is a 5.8?!\"  And wondering where your next piece is....I like it so much I got a punch pass even though I am am member at Sender One, which is also a super solid gym with a great staff.  It's good to change it up be is you get used to a \"style\" and your home gym and even start to remember how individual holds feel. My only issue with Sender is not a complaint really, but a sign they're doing stuff right.  It's a freaking zoo sometimes.  The route setting at Sender is superb, as is Stronghold, but Sender assigns ratings that are too soft IMO.  Most gym staffs by far will tell you that this is a marketing issue in that it encourages new climbers rather than discouraging them.  The concern here is that so many people are new to the sport and transitioning outside quickly without the long mentoring process of the past.  They are mistake prone and much more likely to get in a jam.  they climb hard in a gym and think it equates to outside.  Outside is DIFFERENT.  And DANGEROUS.  They often will have large groups at the crag--this isn't a good idea new folks.  Just don't do it.  It makes communication harder and monopolizes moderate routes.So, for Stronghold, Kudos!  Great staff too.  The crew on 3/26/16 was helpful, cool, professional, friendly.", "date": "3/27/2016"}, {"review_id": "_ttAkNo07IoWWRGWwZ8qEw", "user_id": "Xj0_OxzcfcQM6ZpiOg3KDA", "user_name": "Craig P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 7, "funny": 0, "cool": 3, "text": "WHAT YOU NEED TO KNOW: the golden standard for climbing gyms. $20 for a day pass, $25 for pass and gear, $75 init. + $75/mo for membership with a guest pass once a month. Park on the street, not behind the gate. Make friends or you will not have a great time. Every 4 star review is from a newbie who does not know how good they have it. The staff at stronghold are the most knowledgeable and caring people I've ever met through the climbing community.The routes are challenging and varied, with stemmy routes, pumpy routes, balancey routes, tall routes, short routes, roof routes, one route two routs red routes blue routes. starts at 5.6 and ends at 5.14+. Bouldering is geared towards medium experienced people, but there are a handful of beginner routes.Memberships are expensive, but you get what you pay for. With freeweights upstairs, its easily worth it. Upstairs has a powerlifting cage, with one barbell and two fat/axle bars (strongmen stand up). they need one or two more barbells but that's okay. The wait is a bit long depending on who's working, do what you want. Apparently yoga is great but i'm not into that stuff. Its a privilege to climb here. Reward caring business owners and keep the dream alive by getting a membership and climb often!", "date": "1/29/2015"}, {"review_id": "mDmCI5yxwXwjqiA7uqKMPg", "user_id": "3UaVN3KNVJCMIIfRowawJQ", "user_name": "Brian T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 6, "funny": 0, "cool": 3, "text": "I haven't been to EVERY climbing gym in Greater LA but I've been to more than a few and this is by far the best. The routesetting is high quality, the facilities are great - the people who work here are super cool. They have 3 cracks and a superbitchin lead arch which is generally way too pumpy for me unless they put up a moderately easy-ish route in there... But they have everything for everyone - from the badass to total beginner. I notice most of the 4 star reviews are from newer folk who like some reviewer ahead of me wrote \"don't know how good they have it\", just go here and support an awesome Independent climbing gym and don't complain about \"not enough V0s\" or whatever. You'll be better than that after coming here a couple more times anyway.", "date": "2/5/2015"}, {"review_id": "yAd0N5V8GRU64W7NEfA6iA", "user_id": "OMelkCTJSF6C46A-trXgSg", "user_name": "Raymond A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 2, "useful": 10, "funny": 5, "cool": 3, "text": "Been here many times and its always been great. With that said... an ASSociate \"Mikey\" made our group feel uncomfortable.  He approached us on a lead climb and didn't mention he worked at the gym. He criticized our techniques with attitude to a point that did not make us feel welcomed. His approach ruined our climb, night, and most importantly our outlook on the way the gym is overall handled by the associates. Hopefully our next experience is better.", "date": "11/12/2014"}, {"review_id": "QkCFQD58X_4NEMl07TbPhg", "user_id": "6P99jV0uTp7pLLYu72afug", "user_name": "Ellen S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "I've been a member since October 2014. I used to be a member of Rockreation when I lived on the Westside, and have been to the LA.B, both in LA, but have also tried world class gyms in other cities. In general I find the gym acceptable and comfortable, and am content here. WHAT I LIKE: 1. They change their routes regularly and often... they have good route setters.2. Friendly staff3. Sufficient gym upstairs4. The music is never too offensive or obnoxious.5. Locker room has locks and plenty of lockers. 6. Plenty of parking.7. Members get to bring a guest for free each month.WHAT I WISH THEY WOULD CHANGE (in case management is reading): 1. Every gym I've been to has a family membership. They should too if they want to stay competitive. The second another nearby gym opens with family membership, I'll switch. Paying 2 initiation fees and individual fees/month for me and my husband? That is comparatively way more $$ than other gyms. 2. Their intro to climbing class is NOT UP TO PAR. I took it after taking Rockreation's so could directly compare. The owner spent 30 entire minutes talking about the history of climbing - which is not necessary for this type of class. He could have at least let us sit during that portion, but instead we stood the entire time and kept thinking it was about to be over. For brand new beginners who need to take a belay/intro class, the best use of time is making sure they know how to safely handle climbing equipment.  He needs an assistant. I repeatedly saw (and continue to when I am climbing) people in his intro class make really BAD, DANGEROUS MISTAKES. I sincerely feel he doesn't teach climbers how to belay properly considering the class is 3 hours. 3. It could definitely be cleaner.  All climbing gyms get covered in chalk, but I've been to gyms that are 30 years old, and if you don't attempt to clean it regularly, it gets worse and more disgusting.4. They don't have enough female employees there, thus the women's bathroom is consistently out of soap and/or paper towels.", "date": "3/5/2015"}, {"review_id": "6d7VGwvM_OEN1IjBz_ooCQ", "user_id": "xpeIE7asC-AZS1hj-DLGMA", "user_name": "Ricky P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I've been going here for 9 months now and it just continues to get better. There have been numerous improvements throughout the gym, which shows how the owner(s) value our feedback and want to provide the best climbing/training/yoga/work out experience possible. Problems change out every 4 weeks and they are always fun and challenging. There are various community events throughout the month as well. Parking can be difficult at times - usually during evening yoga classes. Membership prices are extremely fair, considering all you have access to: unlimited yoga, olympic weights + other high-quality equipment, a robust climbing-specific training area, and of course bouldering and roped climbing. Overall, a great addition to the neighborhood.", "date": "6/14/2015"}, {"review_id": "klKXbXepX5YqGl7Yp3wX5A", "user_id": "_Ow2qqG9GmrzB7mm2LYh-A", "user_name": "Lace J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This is my favorite gym in L.A. It gets a bit warm in the summer but the walls are tall, the staff are awesome and the setting is sweet. Even when it's warm its still an awesome gym and you'll definitely get strong. They're in a cool spot with a good vibe and the local community is really welcoming and friendly. I highly recommend the youth team if you have kids, the coach is awesome. :D", "date": "10/18/2015"}, {"review_id": "Iuyq_M6JCr69GDAbPLnl8w", "user_id": "6xSWspGXDv6yXqE--i2Abg", "user_name": "Bobby D.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place rocks. Helpful staff, fun routes, killer location, awesome vintage building, beautiful people, workout equipment, yoga room...what else could one want? Can't recommend this place enough--getting my membership was the best decision of the year.", "date": "7/31/2015"}, {"review_id": "-mIiZCVpXEBLdKf7p8HFXA", "user_id": "-uN_cCZ2-5I_vEhUinPF4w", "user_name": "Mark V.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I learned how to lead climb here.  The owner of the gym taught the class.  Just yesterday I lead climbed my first Rockreation 5.10b thanks to Stronghold.  I believe the owners name is Peter.  Great class and their setting is amazing and fun for endurance building (huge walls).  If I lived on the east side I would be a regular at this gym.", "date": "8/10/2016"}, {"review_id": "3agYqFAfpHzMJqN1gOgqiw", "user_id": "xPYrlO912sf7hJW8-Q54SA", "user_name": "Emily C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This review is mainly for the introduction to climbing class! Positives - Our instructor (Brian?) was wonderful! Gave great explanations (how and WHY to do things) and paid attention while we were learning to climb (so you always knew he'd be there if you were at the top and the belayer needed assistance with lowering you, etc). Also, his corrections given were really great and didn't leave you feeling stupid or incompetent. Overall, he was really enthusiastic about climbing and it made the class and evening enjoyable. The gym itself was very open and clean looking. Putting it inside an old brewery was really cool, with the exposed brick and vaulted ceilings! The information in the class was really informative without including excessive info. I've climbed before, but it helped refresh how to belay and reminded me how to tie into the harness, etc.They have locker rooms and showers (with lockers that don't need your own lock). The equipment seemed well maintained and effective.Offer a wide selection of nutrition bars and drinks so you can grab something if you forgot to eat before or get hungry during. The community in the gym seemed really positive and friendly. Most of the time we were paying attention to the class, but the couple climbs we did after class were easy to find a place to climb. Price - the price of the class was very reasonable, and it's great that they refund it if you become a member. Things to consider - (These may appear to be negatives, but actually just require a little bit of extra planning and don't detract from the five star review at all!) Parking - street parking, but it's in a sort of designated area for the gym. Seems like it could be pretty tricky, so plan to have to search a little for parking, rather than just pulling into a lot.No A/C - I assume this is because of the beautiful vaulted ceilings and not wanting to obstruct the view of the exposed brick. They do, however, have a LOT of fans throughout the gym. It really only seems concerning when you first walk in, but you get used to the temperature. I didn't find that this was a hindrance at all. Just make sure you wear clothing to keep cool and drink water!! Overall, I look forward to attending the gym again to climb and would recommend it to anyone in the area looking to learn how to climb or who already know how to climb!", "date": "8/4/2016"}, {"review_id": "skHNEMc2mgycKIVvdjSeQA", "user_id": "5lcYn2JxyPAaX4FpulB_4g", "user_name": "Kellie T.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 3, "funny": 0, "cool": 1, "text": "Love the climbs here; wish the workers were as friendly as LAB, though. All the workers come off like they don't really care and some really suck at making eye contact.", "date": "1/30/2015"}, {"review_id": "bV4pKpZ7GzxUKXLaqz75mw", "user_id": "q9vKUmj5IS71nqv8VmdGIw", "user_name": "Jenn S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "I had been waiting for a climbing gym to open up on this side of LA and it has been so awesome ever since they opened their doors. Peter and Kate, the owners, are so sweet and welcoming. The gym is clean and they update their routes regularly. The facility pretty much has everything you would need in a climbing gym and more! My boyfriend and I have a membership here and just love Stronghold!", "date": "10/7/2014"}, {"review_id": "qQeNALnoph49YmUoJ6jcjg", "user_id": "NXRMxfNzgEDwK6b7eRx1KA", "user_name": "Jake A.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 3, "useful": 3, "funny": 1, "cool": 1, "text": "This is no doubt a great facility in terms of the size of walls, varied routes, and other offerings like classes. The problem is the staff is generally not very welcoming, in particular the skinny white guy w the long dreads who seems to always be there. Some staff are pretty helpful but the vibe I get overall is not welcoming and I think new climbers often need a warm welcome because the scene here in LA is overall not friendly (I'm from east coast). If I was the owner I'd put my efforts into hiring people who are not just good climbers but also people who can help change the overall culture of the climbing scene at the gym. It starts w the staff.", "date": "10/5/2014"}, {"review_id": "OPRI0dGOSBWqsNPlwFVw5w", "user_id": "q4tTJz3kICfMqZPc0d87KA", "user_name": "Al L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's pretty expensive for bouldering with a $20 day pass and $4 shoe rentals. However, the routes and problems are very beginner friendly and fun to figure out. There are multiple sections with varying degrees of difficulty and incline, with some cave problems as well. We got here at 10am on a Monday morning, and there were only two other climbers. When we left at noon, the number of climbers increased to about 10, but still not crowded at all. Overall, a great place for bouldering.", "date": "8/10/2015"}, {"review_id": "_tAMtuSGWfYZ1xUq8uEwBQ", "user_id": "STvevL5VoeB3wCOZgde2yQ", "user_name": "Christopher C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love the stronghold climbing gym!!! As a weightlifter, I feel that this is the perfect place to test not only your strength, but your ability to apply that strength with your overall fluidity and nimbleness. Regardless if this place is busy or not, you will definitely have yourself a great time!", "date": "8/12/2015"}, {"review_id": "pd8EFYk9Usqczuj6OrjOVQ", "user_id": "3D7GEnzPuwCJRfunKH5-jg", "user_name": "Patricia Z.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This is the best climbing gym that I have ever been to. The routes are constantly being update and I have yet to find a loose/spinning hold (although they do have a sheet to report them on). They also keep great data on the available routes and allow you to make comments regarding your perceived difficulty verses their rating. There are two auto belays as well as a dry erase board to advertise that you are looking for a belay partner, so you have options if you're there alone and would like to do a little more than just bouldering.", "date": "12/21/2014"}, {"review_id": "pB-1Dfu5pGKnQ2gltzURuA", "user_id": "k2Fucu42DpcoK-YM-bc0rQ", "user_name": "Mona J.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 3, "text": "Wonderful re-use of old Brewery! The staff is super friendly and helpful! I recommend the core class with Chelsea. So far I can only do one class a week, my goal is to take the class twice a week! The climbs do change each month! Other climbers are super friend and finding a belay partner is easy, sign up on the white board between the changing rooms. Better yet, bring your friends!!! I was hooked the first time I went, which was April 6th, 2014!!!", "date": "5/9/2014"}, {"review_id": "5fKR09JzJM-AiQrwkP35sw", "user_id": "5mynCwXX-4mCvnAHcrfj9Q", "user_name": "Sarah P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love this place! Great for beginners. My boyfriend brought me and is isn't think I could do it. Now we go almost every week. Great community feel and helpful staff.", "date": "11/6/2014"}, {"review_id": "pXwU81SnnCXxWYfLMiFx2g", "user_id": "5hJR7ljJbhFgOaLi8iz5pQ", "user_name": "Mireya R.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I purchased a Groupon for a introduction to climbing class and toprope belay instruction and it was great. Staff was helpful, routes looked like so much fun and the gym was ver clean. I will be going back very soon.", "date": "6/4/2015"}, {"review_id": "uJR45f8e3dEAaFfrTOPEtw", "user_id": "cXteuU2LB7ba_jDPKI-B5g", "user_name": "McKenzie L.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Absolutely love this place!!!  I'm relatively new to climbing, but it's clear that Stronghold is the best!  The intro class was great, and informative about climbing history in general.  I was also impressed that the class was taught by the owner, who clearly has a passion for climbing - it's so inspiring!Climbing has been awesome - routes are good and it's never been too busy (though I do try to go on more off-times).  The small workout area is perfect to fit in some cardio, and I absolutely love Saturday yoga with Tessa!  I canceled my \"regular\" gym membership and never looked back!", "date": "12/20/2014"}, {"review_id": "X-BiSFvTfRlJrFEqsfPgYw", "user_id": "fVF6ZInrs2e7bqcem0t9Nw", "user_name": "M W.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "For far to long Los Angeles was a desert to climbing gyms.   This place is awesome, It's clean, doesn't smell like feet, has many routes to climb, longer climbs and routes in all different levels.  The staff is super helpful, and the vibe chill.  If you have never climbed before and don't know how to belay, check out what time the intro classes are before you come.", "date": "4/30/2015"}, {"review_id": "KdetsH9j1NZTexdM27cTeQ", "user_id": "-vwjs3l9RWN-FNdI2sZIhQ", "user_name": "Asil S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Incredible experience with the three kids we brought today! Kudos to Peter and Katie who were incredible coaches and so patient! The kids learned a lot about self-esteem and confidence today...such a great time!", "date": "4/12/2014"}, {"review_id": "_Yub__QSAwz5HlkZnucVHQ", "user_id": "oinIrzljytrWH-DUWnipNw", "user_name": "Veronica B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "This is the best rock climbing gym in Los Angeles. The space is clean, there are a variety of different routes, and the staff is so helpful! I was blown away by how courteous they were. Melissa helped us sign in and answered all of our questions, and Matt B. went above and beyond to make sure we were safe and ready to climb. Awesome bouldering and top rope climbing. Also, prices are very fair and I can't wait to sign up for a membership. Thank you, Stronghold!", "date": "4/6/2014"}, {"review_id": "fULEN9m4JmCWDGmTxlFgjQ", "user_id": "50B1pX2IEe041zM5-27aAw", "user_name": "Francisco P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Great place I have never climbed and I end up seeing this place is just down the street from where I live so I checked it out and it was amazing I loved it and the price was perfect", "date": "9/23/2014"}, {"review_id": "Zz0GALYu6qzsYmsqPKvVdA", "user_id": "RnE9x6wgj8ADR_G7kHho2w", "user_name": "Jess P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "SO MUCH FUNNNN Though I wish they would offer various and frequent classes", "date": "4/24/2015"}, {"review_id": "Kdd-LPsdb1WW8jW-B3uNHw", "user_id": "QSndLRED5q3IwFeUdWjddA", "user_name": "Ashley F.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I went last night with my bf and some friends and woke up talking about this place and our experience. Not only did we get a hell of a work-out but the staff and environment far exceeded our expectations. After we had gotten a couple climbs in the owner of the gym actually came around to see how things were going and chat for a little bit...THAT's customer service. We can't wait to go back! This place is truly a gem!!!", "date": "8/9/2014"}, {"review_id": "cyERYTG6d6dhROPRTEn5Ug", "user_id": "mO8xFXho1yTycuuyIZNcfQ", "user_name": "Clyde S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hot dog,Is there rock climbing in LA? If you thought the answer was \"no. no. no.\" you were \"wrong, wrong, wrong.\" This is the place to learn to belay, lead, and get your burn on. Man, am I glad it's there. Right next to a bar with 16 beers on tap for after... Whaddya want?", "date": "2/1/2015"}, {"review_id": "ZG-Gm5LdGsWcoRIiwj5lXw", "user_id": "GgPkckoToZr8In1IvQk4xA", "user_name": "Robert D.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This place has so much going on. It's not just a climbing gym with your standard bouldering and climbing routes, but instead it's a climber's conditioning paradise. They have some of the most enjoyable walls I've climbed indoors as well as some pretty fun and challenging bouldering. It doesn't end there; they have an entire set of conditioning/training apparatuses available to strengthen hand/finger grip and upper body. When I saw this, I was like \"damn, this is where I can finally attain kung fu grip status!\", then I turned around and noticed that they have an entire rogue fitness power rack setup on the other side of the gym. Not only did I tear up my hands and work my arms from hours of climbing, but I got some ring work and squats in too! My body hated me the next morning, but it doesn't matter because now I know where to receive the best training/conditioning possible for surviving and navigating a post-zombie apocalypse world (zombies can't climb).", "date": "8/25/2015"}, {"review_id": "riCDXUGk4uJG1D7-xwhCjw", "user_id": "86hUrV3BrwjKiDRw007zlQ", "user_name": "Andrew O.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 2, "useful": 13, "funny": 1, "cool": 2, "text": "Let me start off with saying I love this place, the people are really nice and everything is well when I come here. However, unfortunately today while one of my friends was belaying a lead and gentlemen came up behind her and grabbed the rope without saying anything, I confronted him, he only said \"what's up dude\" not respecting a paying customer (me). His reason for doing this was because to him, she was belaying wrong. a couple of minutes later when we figure out that he accually worked there and was not some random dude grabbing the rope. He had all the right to do what he did if he told us before hand, the part that rubbed me the wrong way was his attitude. Mikey could have had a better attitude but he decided not to. This hurts me because I rep strong hold and tell most of my climbing friends to go and check it out, unfortunately now I have to mention this negative experience. We left soon after due to a ruin and awkward night. Sorry for the negativity but this really pissed me off.", "date": "11/12/2014"}, {"review_id": "PZr-gkuV-zdzpofM1sN4VQ", "user_id": "NVc9Zq_rxvBly8I7GxKF-A", "user_name": "Stephanie Y.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice height on the routes and helpful staff.  As far as safety, they're a little loosie-goosie with what people are doing, but that's probably b/c they're new.  Overall, I'm a fan and will visit again when in the area.", "date": "7/2/2014"}, {"review_id": "VqNLOWeDwZ7yuLtaDlCXsQ", "user_id": "dTYorCFDLoX4ElYrzdAfpw", "user_name": "Emilio R.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 2, "useful": 9, "funny": 2, "cool": 0, "text": "Looking around for a new climbing gym to join and decided to check out their website. Noticed they were having a free showing of Reel Rock 9 tonight, thought it'd be a good time to check em out. Waiver process is fast and fluid, I brought all my own gear so I didn't need to check out anything. They make you become belay certified if you want to belay and lead certified if you want to lead, no problem. Matt was a great employee and led my belay certification and in a few minutes I was belaying my girlfriend and friend on other routes. Later I decided to do my lead certification, I've led many routes outdoors and am very comfortable sport climbing. I asked their employee Kate to help me, she was more than willing to help me out with any problem I had, and promptly looked for someone who could do the certification. She brought me Victor. Victor made me feel like he had better things to do and reminded me that they were closing soon and the fact that I wanted to do this now was unimportant to him. I led the route and came down. Victor said unfortunately he was going to have to fail me because my timing is bad and it was just a bad time for him, he told me he would pass me any other day but right now he just couldn't because he was busy. 1 minute later Victor is on a slack line taking photos, pretty busy huh Vic? I'll head else where to another gym, I gave this place an extra star due to the variety of climbs and Matt and Kate, they were very helpful.", "date": "11/9/2014"}, {"review_id": "YCqNrlY90spLzVorswXZmA", "user_id": "N1aRdDiHu_krLw6q9bMthA", "user_name": "Blake Z.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun. Clean, good rock features, spacious, bomber holds. I'm a member at Rockreation but I think I'll start thinking about a switch...", "date": "8/14/2014"}, {"review_id": "AB6c0Z8k4txxCMt9mvK2yw", "user_id": "V5MSLbHC5CnmgDzD6s_BkQ", "user_name": "Mark S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "Stronghold is THE climbing gym! Why? The routes are higher, better set, its cleaner than any other gym in the area and the staff is superb. The entire gym is super clean, including the bathrooms, complete with lockers and showers.   Now for the key part for me......  the staff is very knowledgeable and very willing to help the newcomer and the folks that have been climbing awhile. I have gotten the cold shoulder at other gyms from staff including the owner of one of the local gyms. Not Here. Vic always greets me with a smile and he rocked my belay test giving me pointers that I didn't know and I've been climbing over 10 years. Great guy! The owners; Kate and Peter, are so helpful and super friendly too. They are very hands on with all the classes and everything that goes on in facility. Their passion for climbing and the sport is evident in the facility which is top notch. LA is lucky to have them.   When it comes to indoor climbing..... I won't climb any other place.", "date": "11/15/2014"}, {"review_id": "e1dR1leMxKzLQVgq3EurXA", "user_id": "90DdLdhSlcYafGIGMO7M1g", "user_name": "Mari. C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "This place is hot, its not good for climbing and it smelled in there. They need to get Air conditioner in this location. Our group felt awful afterwards, you get exhausted a lot quicker because its warm inside.", "date": "9/29/2015"}, {"review_id": "5XZPB2S52sT6MeIr1Jij4g", "user_id": "dtWKwwLhIjLiF0IXl2f8uw", "user_name": "Borboleta G.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is awesome!! I had a great experience.  There are lots of different options to climb.  I am new to climbing and felt there were all different levels of climbers.", "date": "1/27/2015"}, {"review_id": "AdDEQmAqOlIrCdrZWXecLg", "user_id": "NWCE4KJZRksQ395xYlnMgg", "user_name": "Clinton Y.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Love this place! it's convenient and well maintained. There's always a vertical problem available for solving even during peak hours.", "date": "3/6/2015"}, {"review_id": "EmgSEO1U08iUUNRNX3pVdA", "user_id": "51VNn-_i5iTWFQ06VI_4jg", "user_name": "Neal C.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 3, "funny": 3, "cool": 4, "text": "Tons of routes, friendly service, great atmosphere. Will def be back.", "date": "3/9/2014"}, {"review_id": "UnxjZplTX8WCExDqDOtRCw", "user_id": "jyCRQnbtr_wI5BDaGpTcbA", "user_name": "Christina B.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had my son's birthday party here in early December and we had never been.  I'm always looking for unique ideas for my kids birthdays and this was a huge hit with 15 9-10 year old kids.  Great staff and the kids had a blast!  We kept running out of pizza so luckily there is one close by and I kept calling them and they delivered quickly for these hungry kids!  My son has been going to the kids class every Saturday from 3:30-5:30 and we think he's found his \"thing\".  He doesn't love soccer or baseball so this has been so great for our little monkey.  Kids can use the gym upstairs too during these 2 hours and there are instructors that work with them there too! Amazing!  You can leave your kids as they say on the Web site but I would not recommend it as the instructors don't keep that close of an eye on each kid.  Sometimes the classes are super full and while their waiting for a rope the kids will go and climb the boulders but are also free to be able to just walk out and nobody would notice.  I bring my work or read while I'm there.  I think that I'm going to start working out with one of the trainers while my son is climbing.  This way we both get in a workout!  Amazing location and beautiful building!!", "date": "3/16/2015"}, {"review_id": "8phd-RNCjYKd8ddOgBBfAw", "user_id": "07e33hQfUnu1X7X91KT0Kw", "user_name": "John D.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "The rock wall is gorgeous. Soooo much bigger and expansive than I had imagined. Very impressive climbs. The best part: the staff. So helpful, kind, and encouraging. Such a chill family vibe! Loved every minute of it!", "date": "5/9/2014"}, {"review_id": "p2sCujDvxoTFJTSmqbUt8A", "user_id": "4jektikoynhC13AyfS1Eew", "user_name": "Bryan S.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice gym.  Nice long routes.  Friendly staff.  The owner was very nice and approachable.  Was a more expensive than other gyms I have been to (we bought day passes).  I would recommend this place.", "date": "2/12/2015"}, {"review_id": "85UxrNyIT1n9UBQSeKMtAQ", "user_id": "Tpv0xrh3C6JYbkwU7I-Y6Q", "user_name": "Annie P.", "business_id": "8KZ0f0Do0Iq0tKcl4R3pmQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "The gym facility is good, but they have terrible membership service. By terrible I mean they don't care about their members at all. It takes days for them to respond to an email (and you CAN'T get any service regarding your membership done at the front desk: only through emails) and they are definitely not flexible when it comes to pausing membership. If you have an emergency and can't use the gym, make sure to pause it at least 10 days ahead. I asked for an email 3 days before the first date of the month, was given the wrong email, waited for days, then emailed them again. By this point they charged my card. They don't even have the decency or courtesy to address my questions, just a template email. No explanation. Not even a \"regretfully we can't due to etc reason.\" They recently raised their already very high price to 10% more, yet no more service is being offered. If there's another gym near me, I'd quit in a heartbeat.", "date": "1/2/2016"}]