[{"review_id": "ifDssWJSrLS_Iwzhp6u18Q", "user_id": "ynVPMVRLBPgVbMpvHz59KQ", "user_name": "Kyle P.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I signed up and paid partially to do yoga and partially to support. Maybe I'll try bouldering...but I just wanted to say that I really appreciate you guys creating the upstairrs as public space for people to just chill, work, drink tea, watching boulderers, etc. So kind of you guys to offer that.", "date": "5/2/2019"}, {"review_id": "rg7xiOxjFRsckeQHeCnPiQ", "user_id": "ZWUwCxcp3Kbr-ayaOW8oWw", "user_name": "Eric O.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Fun, challenging, all-weather, all-hours.  I think I'll try this for a month!  My kids enjoyed it, but I do look forward to coming after hours without them but with a friend!", "date": "9/22/2018"}, {"review_id": "CjcPJzdx0-YhTOmidi4zGQ", "user_id": "MccuFzWXDbEzW4F6LoMz5Q", "user_name": "Jenny K.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 3, "funny": 1, "cool": 3, "text": "(Placeholder for review to follow later today)I'm here with some friends that have been here before. They are taking us climbing for the first time, whee!", "date": "6/28/2015"}, {"review_id": "nPc5NDskiXC_WeSxdnf6Yg", "user_id": "ibMyMW8vKreZz9xb6RWUww", "user_name": "Kristen D.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "What a fantastic gym! Creative route setting, exciting (and a little scary) top-out bouldering in the middle, and lots of varied styles of climbing available. They also have a neat self-propelling climbing treadmill, which looked fun - though I didn't try.The staff/owners are also exceptionally kind. Overall, an awesome place!", "date": "6/9/2017"}, {"review_id": "oJ2b8whzIOf1VrwYFF9rNw", "user_id": "_M5sUKFHKofDcd1Z1pPnzA", "user_name": "Josh I.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Was initially invited to go climbing at Vital by a friend and it sounded like it would be a good time. After my second visit I became a member and now I got two to three times a week. It's always a great time and good challenge. I look forward to every visit! Thanks Vital team!!!", "date": "4/4/2017"}, {"review_id": "U8wETZ2-2Jv4LLU-SR6zrg", "user_id": "5UwufHvqz0b7MNkLngUIxQ", "user_name": "PJ S.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The start of our Spring Break!  Our kids are 6 & 7. We wanted to introduce them to something different, and it was well worth the bucks!  The staff was very helpful. They told us the ropes of their facility and got us acquainted with the course. With a bit of hesitation with getting the kids to the top of any obstacle, they quickly got the hang of it and then, we couldn't stop them. The gym wasn't too shabby either. The had a small set of free weights, a couple of yoga/stretch mats, pull up bar, bikes, and a pulley in the downstairs area next to the boulder climbing area. Upstairs was a clean sitting area equipped with a couch, table and chairs (bar stools), and an honor system of a buck or two for coffee and tea. Dogs are welcomed in the lower floor area too! There are cubbies on two walls for storing your personal items. Shoe rentals are available for $2. We appreciated seeing children of various ages on the course as well!  We are interested in the membership for the family. It looks like four visits a month would pay for the membership!  A definite outing for your family. Try it out!", "date": "4/7/2017"}, {"review_id": "XgaoCvzb1dVFPZJi_6LakQ", "user_id": "d1aa_YHCsnQD5YbapejKgg", "user_name": "Jessica H.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Just moved to the area and wanted a climbing gym to train/workout at (hey weekend warrior'ing). Vital fit the bill and I've been impressed with it after a month of regular visits. Though the gym caters solely to bouldering, the setters do a great job of putting up new problems regularly. Problems are pretty thoughtful, too. The community is friendly and welcoming. Vital also has an area of equipment and other goods that's got all the basics you need for general workouts. I also like the specific to climbing training equipment they have -- treadwall, hangboards, etc. 24 hour access for members is also nice! Wish there was an in-house shower and more standard locker rooms so folks could get their sweat on then head directly to work or wherever but hey, that's a small item on the wishlist. Overall, would definitely recommend!", "date": "8/1/2017"}, {"review_id": "YKsIr8_vC_K2d14KshqtZA", "user_id": "RPwc2fSDeyuGfWiDYZjOzg", "user_name": "Chris P.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "TL;DR 10/10 would recommend.I'm pretty sure I was the last person in my group of friends to sign up but I wish I had joined months ago. This place is rad and welcoming to all ages and skill levels. By no means am I in shape (yet) but I'm still able to thoroughly enjoy my time and I'm slowly getting better. The top floor of Vital is a well kept, aesthetically pleasing, lounge complete with a coffee and tea bar. The coffee and tea are provided on an honor system and everything is $1, about as easy as it gets. There is a sectioned off lounge area if you'd prefer a quieter environment, such as studying for exams etc. As a student that lives two blocks away downtown, this place is everything I want. As you make your way down the stairs during open hours you're greeted by an employee. If you're new and signing up or a guest to try it out you'll be treated like family. The music is controlled via Pandora and you're able to change the music at any time. Don't be that guy that changes the station every other song, nobody likes that guy. You're also able to connect your own device to play music, say, off your phone. This is great when you're the only one there at 1-2am. As mentioned earlier, mostly everything is a trusted honor system that continues to work because people respect it. You can bring guests when business hours are closed, there is a spot to drop off cash or you can have your account charged. Drinks and snacks are also $1. They have chalk, chalk bags, and t-shirts for purchase too. They have shoe rentals available, I highly recommend them if you do not have climbing shoes.There are many climbing routes to choose from catering to all skill levels. I think they change bits and pieces every week but I'm not entirely sure. There is a slack line for those that are interested, personally I'm probably the worst at it but it's still fun to attempt. There are free weights available, I think a rowing machine, medicine balls, and more to help improve muscles and workout.I could ramble more but I think you get the picture. This place is great, embodies the best of Bellingham, and definitely worth -at least- checking out.", "date": "10/4/2016"}, {"review_id": "Z7gVDtaoFFVEDrsdTmbgPQ", "user_id": "XGYoqQnxWdf0MNuKNZ0c_A", "user_name": "Justin J.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to improve your skills, meet new friends, and just do something active. Love the way they run this place, membership is worth it. Go try it out!!", "date": "7/1/2017"}, {"review_id": "W__NjyLvRvIfbMxX3oKfEg", "user_id": "sEj4kXHgWtws-T4wFaS7nQ", "user_name": "Ashley K.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Vital Climbing Gym is my home away from home. I can go in any time, any day with my membership (student discounted) and take part in their many events and morning membership included yoga. I love inviting friends and getting them to guess pass in so I can have more climbing buddies. It is a clean, fun, safe, friendly atmosphere.The only thing I wish is for a more private work out area in the gym but it gets me out of my comfort bubble.Great place to strengthen your mind and body!", "date": "8/10/2016"}, {"review_id": "3X-M0uh8ImeBM31No6ukyQ", "user_id": "f0whMCrTEkQs7Uveg5h5Gw", "user_name": "Jeromy B.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best indoor climbing in town. Great bouldering (no ropes and harnesses just massive padded mats), fun slack line, and continually changed routes on a good schedule with enough time to project a route for a couple weeks before it is changes. Great for kids great for grandparents, great for beginners and great for seasoned vets. Must go.", "date": "5/2/2016"}, {"review_id": "GJAPrAl9OfpZDbOzY7Rf5g", "user_id": "nn_96dfF48j7i2FOaF_j6A", "user_name": "Shannon D.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Vital Climbing Gym is nothing but a pleasant experience! It's a great atmosphere for all ages, the members are all wonderful people, the staff is humble and knowledgeable, and last but not least the problems are so creative and offer a variety of climbing styles. I genuinely love spending every second here. Overall, there is a welcoming sense of community here. Vital is killing it. A+ for all your hard work.", "date": "11/1/2015"}, {"review_id": "grw4AGM2qcL2i7dGbo9QVw", "user_id": "GmVmStbEFe3EEaVZ9QKa9g", "user_name": "Jon N.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's a small, well-laid-out facility with great route setters and a nice community feeling. They've done a fantastic job starting this gym.  Members put their picture cards on a board when they visit, which helps people meet each other, and members tend to take responsibility for the place. The latter is emphasized because the gym stays open 24 hrs a day, so the last guy at night should shut off the lights. They have a nice hang-out spot with coffee and Internet upstairs.Also, it is relatively inexpensive to join. As potential minuses - - I think that in general a gym should have showers, or at least a dedicated spot for washing up afterwards, and this gym doesn't. - The gym uses a color code for routes instead of the standard bouldering V-grades. This makes it harder to track one's progress and compare to problems done elsewhere. (Other gyms that have started with the color system have switched over.) At the very least, they could help users make the conversion with a chart and perhaps added notes to each route.- As someone else mentioned, the holds might seem dirty to some users. I'm not bothered by it, but some others might be. Seems like a good washing system between settings might help. But all in all, a fantastic gym.", "date": "4/18/2016"}, {"review_id": "3vi3eSpuLS6h1VMnNw-vOw", "user_id": "4rOOG-__izDdEef3Ou40YA", "user_name": "Alani W.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Seriously fun place to be! The community vibe really thrives here and the staff is really kind and helpful!", "date": "11/2/2016"}, {"review_id": "8oQaUwBC8gNYCXQJApiOdQ", "user_id": "3ofq8mc4cgosK_ie-wCUCw", "user_name": "Cee I.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had never been climbing before, but when my partner and i attended as guests, we bought memberships the same day.We're both actually afraid of heights, but for the 15+ years i've been an adult, this has been the only time i've had fun getting exercise. With guided routes that vary in difficulty, heavy padding to land on if/when you fall, and a helpful, friendly staff & cheerful fellow climbers, this is a welcoming place for beginners, and still a challenging place for everyone else.", "date": "12/2/2015"}, {"review_id": "oHkrH70IOoieRXeHMuKqmw", "user_id": "A_fwyUJJcsR9VrETfyw-8Q", "user_name": "Alex K.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is so great. There are a lot of great routes at various levels and the facilities are super nice and clean. The upstairs is a great place to do work and homework or just hang out! I love this place! It's so cool that it's open 24 hours! I can't say enough good things about this place! Also it's not too expensive, great price. The people that work at vital are also super super nice!", "date": "11/1/2016"}, {"review_id": "TYoZNR4oEbCpnqw0ogrYng", "user_id": "P57Jt8fkdz4Vp2LS6NwKkA", "user_name": "sunseed n.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A great gym. Clean with friendly staff and members, and good climbing, of course. A little pricy...", "date": "11/18/2016"}, {"review_id": "HPXrrk8mYAx1ELTHaZ5HBA", "user_id": "6eHpvRd-J8_gYWzEl8plRw", "user_name": "Nick C.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm not a hardcore climber but a month into my membership, I'm really impressed with Vital. Great space, clean, friendly staff, cheap rentals, weights, yoga mats, yoga class in the morning. But mostly, I love the welcoming community that has created a palpable culture that makes you feel great when you walk in the door.  Thanks and see you tonight!", "date": "9/1/2016"}, {"review_id": "KloPnrf-3v5h7DGf-nk77A", "user_id": "Pm4QAAnXbIRcg6y72eyItg", "user_name": "Robert B.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "awesome concept of having a 24hr member climbing gym....only downside is there's no roped climbing...only bouldering which is cool but I like having both options. Being that it's bouldering only and is kinda small, I think the pricing could be $10-15 bucks/mo. less...the holds are also dirtier than any other gym I've been too. Usually have whitish hands from chalk, but the holds here get black from dirt/debris which usually make your hands the same color...", "date": "12/15/2015"}, {"review_id": "rOsVQGHghYgLg9887jhAzw", "user_id": "B7UmPW8aWAxAizkkEsd_ZQ", "user_name": "Nick M.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A great place to boulder with an awesome staff, consistent route setting, and a great social atmosphere. Plus it's circuit graded so if you're looking for endurance it's nice to pick a color and send quantity over grade. I give it four stars for the lack of space and no ropes. Not for quality. I've climbed at gyms all around the country and this is a perfect fit for b-ham. It's been an amazing place to meet new people and train hard for the outdoor objectives. Climb on!!", "date": "3/2/2017"}, {"review_id": "OpclRZqzyUEFaLGLtL1dYQ", "user_id": "8BLXZIMDFc99T1CNyv6aeg", "user_name": "Mac D.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is my favorite climbing gym I have been to. The problems are fun, They keep me motivated to climb, plus they change a wall every week, and I love the different styles of climbing this gym has to offer. The staff is welcoming and  Nice. Atmosphere is clean and simple and open. I get a real sense of community from the members and staff helping each other progress in there climbing. And rates are pretty good compared to other gyms I have been too. They are very member orientated with 24 hour access. This is a great place to come with the whole family, friends, or even alone when you wanna get out of the rain.", "date": "11/1/2015"}, {"review_id": "fuv8wYSkPdVJmFSIGCyTfQ", "user_id": "t62_5ylAMBNSaZmZhAQGig", "user_name": "Jonathan W.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Forgot to mention how great their pet-friendly policy is. Vital is really a community and it fufills that with how they do things!", "date": "3/2/2016"}, {"review_id": "wq94q3AAvEq-byvyPaobqw", "user_id": "Z0mZaycao1LJwOxj1Mmy_A", "user_name": "Rebecca L.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Very disappointed. Was told open til 9 pm got there with kids and it was closed. Checked Internet and called states open til 9. Now disappointed kids", "date": "3/11/2016"}, {"review_id": "cWAOIIOW6XqpG88jo8UftA", "user_id": "aqVgculUWpv9_4C4srLOkw", "user_name": "Ralph H.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great spot.  I especially like the all-hours access and wide variety of routes.", "date": "12/3/2016"}, {"review_id": "XZWJCMIaiNEmSsSBa4YHww", "user_id": "g-2wFG1RGIHdABqPOqMUHg", "user_name": "Josh W.", "business_id": "Dtvkr8jNiByiusDV92HO6Q", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went climbing here for the first time ever. They have a great facility that is clean and well kept. The employees are friendly and more than happy to answer any questions you have. A day pass is reasonably priced and they also have shoes to rent. The different climbing routes are clearly marked and change frequently. Vital has a friendly atmosphere where experienced and new climbers alike will have a great time and not feel out of place. I highly recommend vital to anyone.", "date": "1/6/2016"}]