[{"review_id": "i8wPFlgfLPP_aQ70XRr2aQ", "user_id": "XjRJEHEiR8C0lRQadOO-hQ", "user_name": "Robert F.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice and clean facility with very friendly and helpful staff. They change up the climbing configuration often so each time you come there is a new challenge!!!", "date": "2/14/2019"}, {"review_id": "isaHCkSVEafJgPyGX2Ms5A", "user_id": "WJ3zVAquKfM-mooNVKwK-w", "user_name": "David W.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my son for a little adventure and had a blast. Great place for experiencing an indoor climbing facility. Greeted upon arrival and given a layout of how the place works, great staff. Lots of challenges for us beginners, and a fun atmosphere. The place is well kept and will definitely be coming back. My son didn't want to leave, but his hands and blisters told him it was time to go.Highly recommend checking it out or taking the kids for a great place to get that energy out", "date": "9/8/2018"}, {"review_id": "wxvAKN2j3O37OE7kxEMULw", "user_id": "GDjjtKd457mft8rVpOhYmQ", "user_name": "Kevin C.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Vital may be a little smaller when it comes to climbing gyms, but the price, proximity, and amenities are unparalleled. Vital has a vital (haha) relationship of trust with their members: you have 24/7 access to the gym without any supervision. They allow members a code to enter the gym and take whoever they want. They give their membership ownership of the space, which I think is really cool!The space is smaller for sure, but the trust factor and intimacy of the space is a plus! Can't wait to get a membership.", "date": "1/3/2018"}, {"review_id": "NOuuMF09GVPKjXeF8nhs8w", "user_id": "pZ4wtX80zY-FOcX0UWp_dw", "user_name": "Matt N.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "A friend of mine got me into climbing and I've been coming here once a week ever since. The gym is clean and run by friendly staff, the environment is open and relaxed. Great hangout for Friday nights with a student discount too!", "date": "5/11/2018"}, {"review_id": "qUVir8cQtmSfWezgvCwRiA", "user_id": "wherp3ta-Mwro40eS-m-qQ", "user_name": "Edith V.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 3, "funny": 2, "cool": 3, "text": "I was working on an assignment out here when I decided to go rock climbing. I tried the one day pass for $10. The guy at the front was really nice. He gave me a quick tour of everything before I got started. He also helped me climb by giving me tips/suggestions. I really enjoyed coming here. This spot is well kept, and the ambiance is awesome.Thanks again!", "date": "5/27/2016"}, {"review_id": "o9swH_KMXMto1ssbiJitHA", "user_id": "2gxFCQ30YMpWC8Ob1HW5kg", "user_name": "Desiree Z.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Pretty awesome place. Friendly staff, clean gym and kid friendly. My arms are still shaking the morning after! Staff recommended having kids try climbing without renting shoes and this saved me $32...so thank you!", "date": "9/10/2017"}, {"review_id": "TXAv4HBg1sVDokNxJwUuPg", "user_id": "Ayu7pe_qCTGYQsOoIfJGsg", "user_name": "Jim D.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 1, "useful": 5, "funny": 9, "cool": 1, "text": "The implications that played into my decision of giving this establishment 1 star is solely off of one man. The employee(a white caucasian with a curly mustache) was very rude and unfriendly to me and my 7 year old daughter. We arrived at the Vital Climbing Gym in Murrieta for a Father/Daughters day out when this man ruined it!!!!!We arrived there on a Friday afternoon when that man approached us. He had gingivitis and I could smell his breath 10 ft away. It sickens me. He also was very rude and harrassed us when he didn't let us pay 5$ for the friday after 5 deal. It was only 4:45!!! Step up your game Vital gym. Im also a black male and Im pretty sure thats why he was so rude to us with the looks he was giving me.The guys below", "date": "6/24/2016"}, {"review_id": "YdUfbvZKInobwEJAVHXhrg", "user_id": "f8efbZHkKPF8bwVWEXrvYg", "user_name": "AJ B.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "So, I was in the area visiting family and have been meaning to stop by and check out VITAL. I must say, I really love this place it utilizes their space to the max and the staff are friendly. Everyone knows community is what drives rock climbing, and they deliver. Now the only reason I am giving them 4 stars is due to their grading. I would say there 6-7 are 4 and 5's, but that honestly is all subjective. I can't wait to come back and bring my brother, honestly. Oh and they serve espresso :)", "date": "3/5/2017"}, {"review_id": "pGzwx0715sKRyhah2a6ygg", "user_id": "VIzdDidGKGIGBaGZ61ZkNA", "user_name": "Tammie W.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This is an awesome place to bring your kids it's inexpensive, your kids are exercising and they don't even know it, it also gives your kids something fun to do! You can sit on one of there couches or stools and watch, they have a little exercise room upstairs overlooking the place, the staff is super friendly they have a nice bathroom, and a drinking fountain, first aid kit, ice pack if anyone gets hurt.We brought 5 kids ( ages 6-15) one Saturday for 5 hours and they had a blast, they challenged each other, gave each other praises, helped one another, it was really neat to sit back and watch all them come together and work together as a team this place is great!! And everyone had a great time!!", "date": "3/23/2014"}, {"review_id": "0-FbKAJbx7UCc8moQL3oXw", "user_id": "D2_A_mjYVDYhla2RcZSdbw", "user_name": "Scott M.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Good gym for beginners. The employees will help you with everything, and is pretty cheap for a day pass. So we went in for a day pass, and we left with memberships.", "date": "5/1/2017"}, {"review_id": "GZwmvmsDu1ybqS6hTh4t7A", "user_id": "vmZ9vF0jSald1ncxbYsgWA", "user_name": "Lenae M.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this gym! Everyone who works there is super nice and helpful, the climbs are really fun and challenging, I can't wait to go back!", "date": "1/16/2017"}, {"review_id": "OZ_gb4o2Ra0jOtFYMLUw0g", "user_id": "E5sak5KgcMQc-ZvLZKG-WA", "user_name": "Cher B.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is small but it has lots of fun bouldering walls to climb. He kids looked like Spider-Man. We had so much fun", "date": "8/5/2016"}, {"review_id": "O1aV9iK363LzmF8ikf3y2A", "user_id": "L64ug_DwBznqi-dCjrLlLA", "user_name": "Cherry P.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love this place! My sister started taking me a couple months back and it was one of the coolest places I've ever been. You can climb, hangout, do homework, train. Everyone is so welcoming and will help you if you need it. Plus  once you're a member you get 24 hour access!", "date": "8/1/2017"}, {"review_id": "GEKhzeBQrptzx6b-UxK8Qg", "user_id": "zkhr5t8bbprJ1NzRJZfg3Q", "user_name": "Rey L.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Normally I climb at hangar 24 in riverside, this is mostly a bouldering gym which is ok!! I wish they had a few more tags for beginners!! But that's ok, I love how vital has so much and the atmosphere is amazing!! I seriously think this is where I can spend my Friday's!! Their Studen deals are amazing! And have fun events!", "date": "2/26/2015"}, {"review_id": "j5fXUCkazAX9574SbyCDBw", "user_id": "eEKPfJ-UCn0jiWcLUS_ixA", "user_name": "Julie G.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Damn you JTree for being too freakin hot to climb in. Boo thang and I planned this awesome camping trip to JTree right before the Independence Day weekend which ended up being a 3 days vacation in Palm Springs at a cute boutique resort style hotel spending a lot of our time soaking up the sun poolside staring at San Jacinto Mountain reminiscing about our last trip up to tram and wishing we were touching the coolness of large boulders. English majors, please feel free to edit my terrible run on sentence. We were feening a good climb after our intended 3 day climbing trip and yelped the closest climbing gym... an hour away. You'd think being right in the middle of JTree and Tram, there would be a decent indoor climbing gym during hot seasons as these for training in. Nope.  Anyways, we decided to come to Vital. Initially, I walked in and thought... Damn, this place smallll. After a closer look a minute later, I realized that there were a crap load of problems... good, technical problems too!  They had awesome volumes that I haven't seen, a top out boulder to the right, a long slack line dividing the room, a cute little training area in the little loft upstairs, and more...  Day passes for non members were cheap and we overall had a ton of fun! Great problems and very friendly staff. Gotta love the climbing community!Thanks for a rad climb Vital!", "date": "7/10/2014"}, {"review_id": "zAnWabvZrbBG4VVyP8D1IA", "user_id": "eOa41aW-GK4fWj4o89QRgw", "user_name": "Dylan S.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 3, "funny": 3, "cool": 2, "text": "This place is amazing. Excellent staff and great bouldering! My kids and I love it and always feel welcome when we climb there!", "date": "11/4/2015"}, {"review_id": "W1sVxtLlMwdjd_R-S25DRg", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE this gym! It's actually pretty small and it's only bouldering but the gym itself is pretty roomy and spacious. One of my favorite things about this place is the environment and atmosphere. The whole place has a super modern and innovative look to it which makes the entire gym pretty neat. The staff are super chill and friendly. The people I've met climbing here are awesome. I really enjoy climbing here. The free wifi and outlets are a plus. A place you can chill to do homework as well if need be. And you can change to a different pandora station that is playing at the gym while climbing too! I always look forward to coming here with my friends! Sending good vibes!", "date": "12/13/2014"}, {"review_id": "ffPkqXkdUpg9NY-sGclR7w", "user_id": "9T5YEDFgf6Dj0TOBhVa1kg", "user_name": "Ryan S.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I can't get enough of this place. My workout days are amazing and my recovery days are spent wishing I was working out. Please give it a shot. The customer service is on point and they make you want to be their friend. And one of the best parts is my muscle density is growing rapidly also I'm getting very cut and I don't even realize I'm working out. It's just a puzzle that has amazing rewards", "date": "8/8/2014"}, {"review_id": "VoM2IeHgE0DEPX4Iw87gQQ", "user_id": "PxdMC9va64L0Z_PVM4YntQ", "user_name": "Steve B.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Climbing indoors with AC 24/7!!!! They reset very often compared to other gyms and the texture on the walls just feel better then cemet walls. 5 out of 5 stats will climb again!", "date": "6/26/2015"}, {"review_id": "akx8I8vLdl949hrYdPjJSA", "user_id": "QH4MkXe3vV6-z1nNZ-H_bg", "user_name": "Steven P.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is clean fun and the staff is great (especially) the bearded man. I recommend it for beginner all the way up to expert levels.", "date": "8/24/2014"}, {"review_id": "WmulpnYWS3_e8BBR5PPBJw", "user_id": "NQEkiGCriFb62MZ9v9ZaVQ", "user_name": "Nicollette Z.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vital climbing gym is awesome! I love their superhero Sunday, 5 dollar day pass with free shoe rental! The people who work here are awesome, especially Dylan!!", "date": "8/24/2014"}, {"review_id": "miCZmXYH9nlxySQiReDIGQ", "user_id": "vZXlTqHBtjp06Q_OgKLstw", "user_name": "Clarence Y.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Long story short, I was dragged out to the nearby casino against my will. I quickly searched up a close climbing gym, and found Vital. Well actually FINDING the place was a mission and a half (drive up the driveway and it's the block to the right), but it definitely made this trip better. Susanna (sp?) was super cool and rad and helped me get set up with a day pass. The place was a good size, not overwhelming nor claustrophobic. I did a few bouldering problems, petting the store dog in between, and thoroughly enjoyed myself. I got stuck on one of the problems, and all the regulars came over and we all were trying to work it out together; definitely made me feel welcomed.Definitely gives me a reason not to gripe if I come back to Temecula.", "date": "9/24/2015"}, {"review_id": "9y50wCT7cADDEAUCJzFKDw", "user_id": "xCDvbp5pkGgPF37Q2F1dNg", "user_name": "Sarah P.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 6, "funny": 6, "cool": 4, "text": "Awesome staff, great facility....you can climb and when you get tired, you can plop yourself on the couch and watch a movie!  The people here are always really encouraging and friendly.  The route setting is challenging, creative and fun.  What more could you ask for in a bouldering gym?Also, it is stupid to give a place a 1-star rating because it doesn't have ropes.  Vital never claimed to be anything but a bouldering gym.  It wouldn't be open 24/7 if there were ropes...that would be too dangerous.  And for the other reviewer complaining that Vital's routes are too hard.....maybe you should actually go climb outdoors and see how the ratings feel out there...HAH!Vital rocks!!-Pickles", "date": "11/7/2012"}, {"review_id": "HInNMkb84eBU2MGFuQdScA", "user_id": "g66MLMmdq52dhv5_vu7EkQ", "user_name": "Fumi M.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I've been frequenting Vital's bouldering gym in Carlsbad since they first opened their door and it rocks. The community including the climbers, staff members and the owners of the gym are all amazing and I have truly enjoyed spending time with everyone in and out of the gym.Let me tell you people living in the 951, I am envious of this new location. There is many to highlight but here are a few:18 ft wallsTop out bouldering!Awesome cave problemsCampus boardDid I mention that facility is open 24/7 for members?I have no doubt in my mind that this place will be THE place to climb in the 951! Keep rocking the rock Vital crew!", "date": "7/30/2011"}, {"review_id": "2nmpSc851DnjhC1GnS4tUg", "user_id": "YRk5lkXS7fyK46lbbUMufQ", "user_name": "Erik B.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great community, great climbing. The routes are changed weekly so there is always something new to work on. Members can get in and climb any time, day or night. There is a small weight set as well.", "date": "11/1/2016"}, {"review_id": "BmCmBDAQokM7xuuq8DjXdQ", "user_id": "PjaXnc424yMIc6JUxTIfVQ", "user_name": "Stephen B.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Suzy went out if her way to help our kids!  Very patient and attentive with a smile and constant encouragement.  :) Thank You!!!", "date": "7/17/2016"}, {"review_id": "vTZbl5eRMbOb0Lm41ACADw", "user_id": "LFMMq-lrYte9s8ej9enBPQ", "user_name": "Dave W.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "They rock!rGreat place to take your kids to boulder and learn some of the basics.  They allowed us to go in and climb for Free on our first day.  Since then we have been back 2 other times. I told my brother about it and he and his son bought a membership.The cool thing is you have unlimited access 24/7 with a membership.  We are in the middle of football season so it just doesn''t work timewise for our family.  But my 4 boys loved it.  I'm sure we will go back after football season.There are plenty of challenging climbs and also a host of easy ones for people who are just starting out.  everyone in the gym is super helpful  the staff and the other climbers.  Great experience.", "date": "10/15/2012"}, {"review_id": "9sIky6KcxBKPOT00o_g8uw", "user_id": "Qt1dJPIXggyoPX_x1wXdcw", "user_name": "Mike B.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome bouldering gym. Great staff and great, challenging routes that get reset every week. They have a topout wall, cave, workout equipment, music system that you can setup yourself, and coffee bar. Best part though is the 24/7 model for members, so I can get in a solid morning workout and focus on my climbing without having to work around crowds or wait until they open.", "date": "5/3/2016"}, {"review_id": "2uJkwbeo1Bgzl7E6pgn8ew", "user_id": "n_u_l3BLFEKaSZ_Ncx4AKQ", "user_name": "Rachel S.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I'll be honest, I've never really considered Murrieta to be a destination, but now that Vital is up and running, I'm pretty sure I'll be heading that direction on a bi-weekly basis.  I, too, am a Carlsbad Vital member, and I love that Vital's owners were able to preserve the intimate feel of their first gym in a noticeably larger space.  It was awesome to see a lot of familiar faces and meet some super cool new folks during Vital's opening day extravaganza, and it's clear that the welcoming attitude associated with the Westerly location has traveled East with no problem.  Friendly atmosphere and kick-ass membership base aside, this gym is gorgeous and has plenty of space to sit and watch other people climb (or work on your computer with the free WiFi!).  Espresso and snacks are also handy in case you need an added boost of energy to make it up the wall.Most importantly, Vital has helped me to establish the confidence, physical awareness, and friendship group that now motivate me to climb both indoors and out.  The routes in the 951 are varied in complexity and technique, but they consistently maintain a high degree of elegance and flow (which is GREAT since you'll constantly be building your skill set as well as your bod!).  I've become a better climber than I ever thought I could be since joining Carlsbad Vital, and I have no doubt that the new walls, cave, and top-out boulder in Murrieta will hone my technique and physique even more!", "date": "8/4/2011"}, {"review_id": "pbqlT4q5VK3Z5aBwJmNMUQ", "user_id": "TuJ8u8KCbz_tZb2C2mS3Ww", "user_name": "Seth L.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Been climbing on and off at vital for around 5 years now and it has been great. I've been to hangar 24 in Riverside and one thing that I always like about Vital is the 24 hour access as a member, being able to control the music, a water fountain  (hangar 24 didn't have one) and a top lift where you can lift and do yoga. Overall the vibe at vital is great with staff always there to help you with a route and the members there are great too.", "date": "11/2/2015"}, {"review_id": "c4WQb-3Nq4ULLl4dXfsv_w", "user_id": "kHjoIyXD5Y80EcgKnFn_Jg", "user_name": "Helen B.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I just left this place, and let me tell you: it is so exciting to have such a beautiful bouldering facility so close at hand! My husband and I have been driving to Threshold in Riverside, and the gas alone meant that climbing was essentially out of our price range. But Vital Climbing gym is awesome! We just bought memberships tonight, and will be here on a regular basis. It has wonderful amenities, convenient (and unending) hours, and a very cool \"fabbed\" feel to the fixtures and appliances. Part of me wants to keep it all to myself, it's that great. Look it up and try it out!", "date": "8/2/2011"}, {"review_id": "2TwYY_XY04s2NQ3DbtLJ7Q", "user_id": "bfFoZ3NfacFOIhwwoUd3cQ", "user_name": "Travis H.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Fantastic Gym! Very Clean! A lot of neat features inside.   The wall is great! Soft ratings... but for a gym its average.  It is bouldering only, however, because there isn't any ropes or harnesses (life safety devices) insurance allows it to be open 24/7!  And for Sean H., gym climbing isn't real rock climbing anyway, it should only be used for training... So stop whining. You should be happy that there is a gym finally open here in town. Especially since its 24 hours!So on a good note, since people like pessimistic Sean don't come around, it makes it a great, fun, energetic and encouraging atmosphere. Great for kids too!", "date": "8/25/2011"}, {"review_id": "oxojhmQGy9nkKp9311vDFQ", "user_id": "AfQcJKJcYsMcCiL5FFuJAA", "user_name": "Travis T.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 4, "useful": 1, "funny": 2, "cool": 0, "text": "I would have given 5 stars if they didn't charge my two year old to climb when I am a paying member. I understand not givnig out freebies but she can't even \"reach\" the holds. I do love the setup and since I can't climb at normal hours the 24/7 time frame is great. Quality coffee for a buck, affordable shoe rentals, wifi, video screen, and reading area. My personal favorite is the top out section.This is bouldering only so come work on technique & strength. If your hard up to rest on a rope and too good for technique go outdoors.", "date": "8/10/2011"}, {"review_id": "cumtoh7LLtLdPyP2Ahx_yA", "user_id": "e1Qf6z13rcDFEGqTXy1SEw", "user_name": "Eddy R.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place... Best climbing and bouldering gym around! 24 hours, 100% laid back and it's the honor system. I've been a member for over 2 years and haven't been disappointed. There's always new routes, and the staff are awesome", "date": "1/29/2014"}, {"review_id": "m1143WWIBZdV8Ca5FQGuig", "user_id": "ZscI4eAL6F39p-Y2ajVfvg", "user_name": "Noname T.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I loved this place! i went there with a few friends the other night and i had alot of fun!this place is the bees knees!", "date": "9/11/2011"}, {"review_id": "vqPQBww4E0MStd3CkF1k7Q", "user_id": "8Zo8gsHZGusQ2oqEBk3JTw", "user_name": "aissa d.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Tried out rock climbing yesterday for the first time ever... LOVED IT. Nick Franko taught a great intro clinic. I only fell once and it didn't even hurt. I do work out a lot and just wanted to change up my gym routine. Will def be going back!", "date": "5/31/2013"}, {"review_id": "3kgK4qB5ghI_ctE5-GG6dA", "user_id": "2oiPE2rww3Ofw09aishi2A", "user_name": "Adrian R.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 6, "funny": 0, "cool": 3, "text": "Once again another great review for Vital. The owner just installed two wooden finger boards and had the routes reset. The place is awesome, Bree and the rest of the staff are super-helpful (as well as knowledgeable) and they a great coffee bar. The idea is great, a 24 hour climbing gym on the honor system ( with a bunch if CC cameras to make sure you color within the lines). I your looking for Family Fitness, go join Family Fitness. If your looking for Cross-Fit, there are some great   Cross-Fit gyms in the area; but if you want a great personable indoor bouldering gym at a reasonable price- VITAL is it !!!", "date": "2/1/2012"}, {"review_id": "YxVBuDHUJd7i1S8_hTdeBw", "user_id": "KkcqZbd4xa_1dQEkxstrlQ", "user_name": "George H.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is awesome!  A bouldering only gym, but that allows for it to be opened 24/7.  Long top out routes for all abilities and levels.  They have one of the best campus boards I have seen with 20 something rungs and the ability to adjust the angle.  Relaxing lounge area upstairs with free wifi ,drinks and snack for a dollar and even a communal ipad to play some tunes or surf the web.  Get some.", "date": "8/30/2011"}, {"review_id": "md0EHBkrnUkfZNJuprfTZA", "user_id": "8bHTHzVCh_gkDYgbgHK-8Q", "user_name": "Sean H.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "Only bouldering? I want top rope and lead climbing. I was very disappointed. I would still recommend hanger 18 in riverside or rock reation in Costa Mesa, those are real climbing gyms. If your going to build a gym that's open 24/7 cater to everyone's wants in climbing. I was not impressed at all, very disappointed.", "date": "7/31/2011"}, {"review_id": "ZYJKD_6SpbXsRVM0gmsoJw", "user_id": "OCy6ixC8tXbFKuvneitRjw", "user_name": "Todd L.", "business_id": "DA91L5ZyppOG7-l4wQOSVw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The Murrieta facility is a great environment for some quality family time.  I joined Vital along with my two daughters because they love to do the rock climbing walls at various fairs and festivals and I figured this would be something they would enjoy.  Yep, we all love it.  It's a great workout, and there is no price that can be put on sharing that effort with your kids. My youngest is short, but she scrambles up and down the wall and is gaining a great amount of strength and dexterity as a result.  The facility just reset half of the long wall so all those routes are new.  Sometimes it's also fun to just sit back, relax, and watch some of the better climbers, trying to pick up cues for techniques and strategy.  The clientele are generally friendly and the environment is family friendly (ignoring the occasional teens who sag and show their chones, at least my girls think they're idiots).", "date": "2/6/2012"}]