{"review_id": "D7PkA4YPYXLq9IwU656sQg", "user_id": "V9nI-J4RozutuyA77rdNvw", "user_name": "Bridgette M.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome activity for all ages! We had a Birthday party at Desert Rocks and absolutely loved it. The staff is knowledgeable and accommodating. The space is clean and well cared for. We enjoyed ourselves so much we decided to join for the month. I highly recommend checking this place out for some indoor fun!", "date": "5/3/2019"}
{"review_id": "I0HUn3j_8GLwyrPdp9ywuQ", "user_id": "FHQ4P0jxns7K2UJpGkhAFg", "user_name": "Stripey R.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Ok wanted to get a fast and furious workout on our road trip and Joshua tree was too windy. They just raised their day pass, which is fine. The front desk guy was super nice! The place was clean and nice looking.My buddy paid, put his shoes on and realized he was car sick/flu? from our 8 hours of driving and they didn't offer to refund his day pass. That was kinda sad :( he didn't climb... went back to van.I stayed for about 1.5 hours and have to say their bouldering routes were ok.... warmed up with all the V.0, V.1 and most V.2s and usually can make a 4x4 with my work out, but their routes were hard, which is ok, but all seemed to be of the same 'type' without variation as they got harder, if that makes since. And the mat was a little on the very hard side for 'older' knees and didn't want to jump down from top, so down climbed everything. There were no downclimb assist holds. Anywho, cut my day short, was glad to get on something to break up the day.. but would think twice about paying again :)", "date": "3/17/2019"}
{"review_id": "fTonXQxX-tbLgMXJ2PVUHw", "user_id": "skGHgMwVy5S4G2XWPJbpWQ", "user_name": "Emily T.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is sooo much fun! This is definitely a new go-to date night. We went hiking before which was a mistake, so we only ended up staying about an hour and half, but we had a blaze. We did the automatic one so no one was really required. We were glad the staff taught us how to be safe and watch us get be hang of it, and then stepped back and let us do our thing. Occasionally checking in and giving us tips on how to make climbing easier and more effective! Great for team outings, dates, parties and more. If you're looking for an indoor activity with summer right around the corner. This is the place to come go!", "date": "2/10/2019"}
{"review_id": "B0ni7p9RkpNI1qQ4R-q4vg", "user_id": "yzDqwC-sf33mZVTDqFTbIQ", "user_name": "Emily C.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had my daughters 10th bday party here. The place was clean and the staff was extremely friendly and helpful. We had a group of kids from 2 to 13 years and everyone including the parents had a blast! We had the private party room for 2 hours and then after that we were still able to climb and weren't kicked out the door like every other place we have had partys! We have had partys almost every place you can have a kids party and this was by far the best! Will definitely be coming back!", "date": "2/24/2019"}
{"review_id": "P9sUOQw5DhWur3jrL9QhiQ", "user_id": "KyKTq5rNnZp86GYK9abZfA", "user_name": "Jason M.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place ROCKS!! (No pun intended) The entire staff, no lye. The instructors are so helpful, patient and happy! You can tell that they really love their jobs that ore they're just very pleasant folk, hippies at heart.", "date": "6/23/2018"}
{"review_id": "3FdHLHiKKapimEunjd3IDQ", "user_id": "DCFmmkkLCLaNuX9bd9WTGA", "user_name": "Zell G.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Came here for the first time today to celebrate my birthday. Very fun if you're into being active! Including the gear rental, it was $25 dollars each per person for 5 days! How awesome was that. Definitely will be returning again! Make sure you guys fill out the waiver online or at the location.", "date": "1/6/2018"}
{"review_id": "CcJCoFFY2KWHRKZUF4pRMg", "user_id": "dznAAucTseAmHm7_KHnGkw", "user_name": "Javier M.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "We attended a BDAY party for one of my son's classmates. The place is NEW, clean and the parking is ample. The staff was courteous, helpful and PATIENT. Yes, every party has a couple of rug rats.My 8 year old had a ball as did the others that were climbing. It was definitely a challenge that I'd like for my 6 year old daughter. We will be back so my young ones can test themselves with their strength and the mental aspect of breaking through a plateau. BTW, it WAS very safe", "date": "9/12/2016"}
{"review_id": "Vb2vhJTRNbu4oBSBh4fDig", "user_id": "TlMK-Ad_NLIHCX1XCwrqSw", "user_name": "Dominique F.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "What a fun place to go for a day of fun, exercise and adventure. Friendly staff, great safety equipment. Turns out that you don't need to be in shape to climb a rock. Just look at me, lol.The best deal is $25 for five days of climbing that includes equipment. What a deal! Five bucks a day, wow.Great, modern building, freeway close. Cool private climbing room for parties or team building. What a fun way to get a workout.", "date": "9/21/2016"}
{"review_id": "faaygZB0RYP-M-f2fGm4cw", "user_id": "1aopcDnQ_9TRG2XcgMExRQ", "user_name": "Tyler N.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was great even for a first timer. Prices are reasonable and everybody kept a positive vibe going. Will definitely come back when in the area", "date": "8/18/2018"}
{"review_id": "WAAgDsb7reQdhVon9-iPHw", "user_id": "83M6TBPJegzynQuCTXOVTg", "user_name": "Jj A.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Our family loved it! My 7 year old and 4 year old had a blast climbing. My 2 year old didn't actually climb but tried what she could and had a lot of fun. We purchased the 5 day pass for $25. The kids were more confident and adventurous the second time around. Definitely a fun family adventure, especially if you can go more than once!", "date": "3/27/2017"}
{"review_id": "2PaTXaokHxJvQAZ2zNJx3g", "user_id": "EqyRxxfeX_suyCQnQXs5tw", "user_name": "Rose H.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had my son's birthday party here. The owners Kristen and Steve are fantastic.  I booked it by phone, left my deposit, and they followed up a few days before the event  just like they said they would.  Participants can fill out their waivers online which saves time and lets them start climbing as soon as they arrive.  We had a staff member, Tara, dedicated to us the entire time and she was so great with the kids.  The staff will help with set up and clean up too, all for a VERY reasonable price.  Well worth it!  The facility is clean and well maintained, and everyone is so friendly. They have drop-in prices, memberships, kids climbing club, and gear rental. Highly recommend!!!", "date": "8/26/2018"}
{"review_id": "9fNd5bsGE9E1PDvq7ame1g", "user_id": "Nb_joRfpAbRsXLOCU_1KLw", "user_name": "Leslie J.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We love this place! A perfect place to cool off on a hot day but stay active and STRONG! Family oriented and very friendly staff. Prices are affordable for good equipment and unlimited day passes. It's a little off the beaten path so we don't come here as often as we would like but it's become a favorite spot ever since our first visit last year. This would be a great place for parties, hangouts with new friends, active dates, and for anyone looking for a new challenge before heading to Joshua Tree. Can't wait to go again!", "date": "8/14/2017"}
{"review_id": "_MCkxQrT1kiQ394Qrb5dRA", "user_id": "LqvghEYxYVZ3NKxrT5flaw", "user_name": "Rebecca D.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "My boyfriend an I came here after seeing an add at the Palm Springs visitor center. I use to rock climb 4x a week in Santa Cruz back in the day and let me tell you that this gym is legit. It's brand new and spacious. There's bouldering and top rope for all levels. My boyfriend had never climbed before and there were plenty of route for him and lots for me too! There were more experienced climbers working on tough routes too! We got a one day pass and rented the equipment. There's one room that has two automatic belay ropes so you don't need anyone to belay you below! That nice if you're on your own and want to top rope... Or if you want to race the person you climbing with. The staff was very kind. The owner (who claims he's in his 50s but hardly looks 40) was one of the nicest people I have ever met. He did some routes with us and belated us a few times too! We had dinner reservations afterwards so I changed in their bathroom and it was clean. No showers tho. Me and my boyfriend can't wait to go back next time we visit!", "date": "10/7/2015"}
{"review_id": "VnsuPq7rONwxtKVFzsQj6A", "user_id": "RGyHm5Cb1_kLQRDq6odybA", "user_name": "Jim C.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What a great alternative to your run of the mill exercise routine!  \"Newby\" or expert, this facility delivers.  Owners, Kristen and Steve are on site and go out of their way to make your time there as pleasant and fun as possible.  The upper and lower body work out is intense, but you don't realize it... until later maybe.  As a chiropractor who is telling patients to find ways to enjoy being mobile, no matter what you choose to find enjoyable, I can tell you this is a terrific option!", "date": "3/22/2017"}
{"review_id": "1lmUzWPq_hyAChe1qr1h1w", "user_id": "xN1oQajnQaiHTWqr2QdR5A", "user_name": "Mike W.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Had no idea what to expect. Kids planned it for Father's Day. Staff was super friendly and patient. All sorts of stuff to climb. From free climbing to auto belay and then the hard stuff. They provide the shoes and they are always nearby to encourage and give tips. Will definitely come back.", "date": "6/19/2016"}
{"review_id": "vk-UeUWxQyUar_7ekE8bdg", "user_id": "qlNRUt-_Kwln5VR-YJwXdw", "user_name": "Rochelle A.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place! Really enjoy my work outs here. Attention to detail on all the climbing routes. Super staff. My climbing has really improved and the kids like to join in", "date": "9/21/2016"}
{"review_id": "xinXiCLC10eyHVuwJS0qXg", "user_id": "-atHTw1PzgfpDFW9YyCufA", "user_name": "Sweet Berry F.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Had an amazing time learning to rock climb! the staff and owner are patient and friendly! can't wait to go back!they also had great prices!THANK YOU", "date": "7/6/2016"}
{"review_id": "ZX0ABaipDnvhiCSnKpk--g", "user_id": "mMdjYaLp8fTx3tumBgrcEw", "user_name": "Jessica M.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "After seeing some friends post pictures on Facebook of their kids enjoying this place, I decided to check it out as a potential location for my daughter's 4th birthday. I chatted with Steve, the owner, over the phone and put down a deposit in the same conversation. There were probably 20 of us between climbers and spectators at my daughter's party. Both the kids and adults had a GREAT time! I am sad I didn't know about them sooner! Located a bit off of Indian Cyn in North Palm Springs, we didn't know they've been tucked amongst the commercial buildings for a whole year! Plan a party, an office team building event, a date, or just go climbing solo for some exercise! A must experience. A great place. Helpful people. I'm sure we'll be back.Thanks Steve!!", "date": "10/11/2016"}
{"review_id": "kNpvq2nzxH-FqHo9U4djyg", "user_id": "RXqIH6JHrskEvPIcI5TsOw", "user_name": "Meara S.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went today and I had such a blast. I'm a newbie and Kristen took great care of me. I enjoyed my time there and cannot wait to come back.", "date": "1/10/2017"}
{"review_id": "xpm8LlAuMaVZGdkbKWro1w", "user_id": "Oe0E-VnEzhq1xlifHPxp-g", "user_name": "Dang L.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Amazing medium sized indoor rock climbing gym.  If you are thinking about trying rock climbing or super into rock climbing, then you will love it here at Desert Rocks.  They have many different options for beginner to advanced climbing trails.  They have just as many options when it comes to bouldering as well.  There were even kid-friendly (6 year old+) options.  The staff are super nice and patient.  I have a staff member belay me and he was perfectly fine holding me there for 15+ minutes.  I was too tired to continue climbing, but too stubborn to go back down.  I just rested up there until my strength back to finish the climb.  If you are shy, there are also self belay options.  You just strap yourself in and do not need anybody to belay you.  Another great feature of this rock climbing gym is that it is not super crowded.  I was surprised that such a gem like this was not super packed.  The coachella aerial fitness (see my review on this for more details) hosts aerial fitness classes upstairs on Sundays, Wednesdays and Fridays.  You should definitely check that out if you are already here climbing.  Best of all, decent prices for all that the gym has to offer.  I highly recommend rock climbers, adrenaline junkies and pretty much everybody check out this gym", "date": "7/20/2016"}
{"review_id": "o_i_OaqkN7l44Dc9XVAVzg", "user_id": "6J8U0z-wFvrK7waE5Rg9VQ", "user_name": "rebecca r.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "The place is clean and well organized. It is easy to climb with any level of experience. I highly recommend this activity for ages 5years and up. We are playing our next birthday party. The owners are available and engaged. Awesome indoor activity in the heat of the desert!!!!", "date": "9/4/2015"}
{"review_id": "XG7xv8Xk9IoKuJ53Sum-5A", "user_id": "Rdd_4ux2NHiSh5VkbC_LGw", "user_name": "Leah K.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "For being newly opened it was a great place for the kids to spend a couple hours indoors. They currentlydo not have wifi but they are working toward getting it for customers to use.  A little pricey but overall kids scored it a 4 stars!", "date": "8/4/2015"}
{"review_id": "NReKLWp9GTnKTZPOO21Saw", "user_id": "QyCV0-nbSwsPtUnPXKPkmw", "user_name": "Pantea F.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym! Steve showed us the ropes (har har) and we were quickly up and running, er climbing. Signed up for a monthly membership and hope to go at least 3 or 4 more times this month.", "date": "7/25/2016"}
{"review_id": "fUG6cCbKnRDLtVNtK9XJwA", "user_id": "sDnpnyryj3SaeNLNdqljlA", "user_name": "Jered L.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was awesome!!! I saw their flyer at the barbershop a couple weeks ago and had to check it out. I took the whole family and we had a blast. Whether it's for a random trip or a party, your sure to find dun for the whole family. The facility was nice and clean, equipment was good and the staff was super friendly. Go check it out", "date": "5/22/2016"}
{"review_id": "BWJjr3nJV3rLyC0NgHGfsg", "user_id": "XeAG9VO6V3LfIsYFbgm9nQ", "user_name": "Chris F.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Gotta go try it- the owners Steve and Kristen are great and very helpful. They were attentive to the kids and taught patiently. Plenty of room to climb and spread out. We cannot wait to go back. Thank you for a wonderful experience!", "date": "9/20/2016"}
{"review_id": "jLjgElEherHxLhN8I00nSQ", "user_id": "ICS2XU6l6dochTOxEldV3w", "user_name": "Claire R.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We live just up the road and recently heard about this location. We are so glad we came! It was 110 degrees out and we were still able to get a great workout and stay cool in the middle of the day in DHS! The staff were very friendly, helpful and supportive. We will definitely go back!", "date": "7/18/2016"}
{"review_id": "Mm6-KSQidlaT5EJcy7AmGA", "user_id": "aDSbR8QJN5PWg2HE5cA4GA", "user_name": "Kathy G.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Just had my son's 7th birthday party here.  I honestly didn't know what to expect as we had never been before.  WOW every single child at the party had an amazing time.  The place was clean and the party room was a perfect size.  Every staff member we worked with was extremely professional, nice and helpful.  My son had an awesome time.  Thanks guys for making his party ROCK!", "date": "9/10/2016"}
{"review_id": "t-WyRqj3sf-Zqogszd_rtg", "user_id": "_89G0B4QDNi2dS300BYx9g", "user_name": "Desert C.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What an awesome place! Not only is this facility impressive to see, but the experience is first rate. Desert Rocks is meticulously clean, spacious and well organized (not to mention colorful!). The staff is very knowledgeable, courteous and helpful. I brought several members from my gym and we were given 5 star treatment (hence the 5 stars in return). Everyone had a great time!  I highly recommend visiting, whether you're a novice or an experienced climber. You'll love it!-Cheryl C.", "date": "5/17/2016"}
{"review_id": "4R2nAjhHMpt6n0fIaB4u9A", "user_id": "g13WIHY1heUSizPh5ZH1ew", "user_name": "Johnny B.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Finally a climbing gym that caters to us desert folk. A smaller gym compared to the others out in SoCal, but it does require you to drive at least 1hr outside of the valley. The bouldering wall has a good variety for all skill levels, top rope routes are good as well, lead climbs are few so dont plan on climbing many of those routes. Grading is pretty similar to most socal gyms, I was able to flash most of the lower ones. However if you need any beta just ask the staff, they are more than happy to help you top out and cheer you on. There is room upstairs for workout classes, hopefully a spire will be built in the center for more climbing and lastly more bolts set for the lead climbers. From opening to present, it took about 3-4 months for routes to be reset if you bug the staff enough they might do it sooner ;) but pretty standard as well. Just hit up joshua if you get bored or need some outdoor fixes.", "date": "10/5/2015"}
{"review_id": "Dvwjsi-IiYbCjWZbShHIGA", "user_id": "1iy-prWVfYXdOvuA1tWXuA", "user_name": "Melissa C.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a ladies only corporate event here yesterday and the staff was outstanding! They made us all feel right at home, gave us fun AND challenging activities, and ended with a power abs session that we're all still feeling! Great job!", "date": "1/28/2016"}
{"review_id": "kcbo-eWfqTtY1xxej8059w", "user_id": "5i4wGnIUmkuaTyS05o926Q", "user_name": "C W.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing! I came in randomly and found that every staff member and even the owner went above and beyond to make sure they could help me. I an tremendously happy with the experience.  I have had here and find my self addicted to coming back almost everyday. This place has literally changed my life.", "date": "2/2/2016"}
{"review_id": "BKSfm2KYM_iHKzAhEyGPPA", "user_id": "NplYe7wHd5PxDkXL8skR3g", "user_name": "Amanda M.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had such a wonderful experience here! I am a novice climber, so I can't speak to the quality of climbs here, but the customer service was great and it was a really fun day. Staff was very friendly, and spent a lot of time with my friends and me making sure we could belay, use the auto-belay, and giving us tips and a tour of the gym. I felt safe, relaxed, and comfortable. Overall a really low-key, welcoming place. I will absolutely be back.", "date": "7/19/2015"}
{"review_id": "eTpt0dRUqCtuFtJ7ojA2vQ", "user_id": "Qm621c4r_AM-LrjNijF2Eg", "user_name": "Brian M.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great - friendly and helpful staff, diverse climbing options for all levels, awesome atmosphere, etc. Finally a climbing gym in the Coachella Valley!", "date": "7/21/2015"}
{"review_id": "rs5ihCF5SDIX-x0ptl-Ecw", "user_id": "m7LjYEbAv4YuyqH1O6VByA", "user_name": "Hannah L.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Desert Rocks is new in PS but is run by pros who know their climbing. There are all levels of runs to test your skills. What I really liked is the owner, Steve was there to give tips, help with spotting when needed and suggested things to try. It was like a private lesson! True climbers will find and appreciate this great facility but it can be equally fun for families who want to beat the heat. We will be back for more!", "date": "8/31/2015"}
{"review_id": "bakreOuGmySC02U8bpDjbQ", "user_id": "PLdrXM_mrY6Ig6MSPwswLA", "user_name": "Madison E.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to bring your family! All the staff members are so helpful and encouraging! The owners are so amazing!", "date": "7/26/2015"}
{"review_id": "mAwH9Bwh46Kperv1mww82A", "user_id": "8_z9K54KMvmnNXSTv1ezVA", "user_name": "Lynda S.", "business_id": "Bccp_MZWExiVhksE2oLgGg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We scheduled a club activity at Desert Rocks and was delighted with the level of service and attention by Steve and his staff.  Our beginner students learned about belaying through the patience and endurance of Steve and his staff!  Plus, the advanced students had unlimited access to more challenging climbs - both with a more advanced belay wall and a free climb wall.  My daughter delighted in what she referred to as the \"bunny slopes\" - a free climb wall for beginners.  This gym has everything for any level of climber.  I strongly recommend Desert Rocks!", "date": "4/7/2016"}
