{"review_id": "UwBJUxkbsyyE8B7i5I9HFg", "user_id": "jV2SKFxdiBTFss4DcHI5zA", "user_name": "Christian G.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Went here for the first time today and I loved it. I'm a beginner so took the easy routes. I liked how they were labeled so you can know exactly what you were getting into. I never felt judge by those around and the check in process was easy and fast. They do have a $5 card limit so I had to get shoes and chalk (was going to share chalk with my friend), but nothing to fuss about. I enjoyed it and hopefully I'll be back!", "date": "3/31/2019"}
{"review_id": "c7FOYaCuQsZKBBJnIsxxtQ", "user_id": "WOsrmI8LkJ6weo-cUd5hlQ", "user_name": "Taylor Z.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A great place to go bouldering with lots of walls to climb. Even though there was a ton of people, there was enough space and walls to climb that I didn't have to wait on anyone. There is a tiny workout area with a squat rack and bench, rowing, and some cardio equipment in the front.It's about $25 for a day and $5 for a package (comes with chalk and shoes). The surrounding area also has a couple breweries and food, so its a great place to do a day of climbing and than get some grub afterward.", "date": "1/14/2019"}
{"review_id": "OZ-7tS6TTDU38TPoyRsuTA", "user_id": "DuXmWWntHtL1mzUoFqTs6g", "user_name": "Lauren Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the place where my boyfriend and I go when we just want to boulder. Entering this place was like eye-candy and seeing how spacious this Touchstone gym was made us very excited like kids going to the playground. From what I recall from our last visits (2 times here at Dogpatch Boulders), we had a great time here just focusing on bouldering where we stayed for almost 3 hours, or 3 hours I believe.  There are several bouldering problems, and they even have a children section for climbing! So it's kid-friendly too.Parking was never a problem here. It's pretty open when it comes to parking, or at least maybe we've just been lucky on our visits here. Entering this gym was a chill experience, especially the staff members were nice and friendly. They asked if we needed gears such as chalk bags or shoes, which we already had. But for the staffs working there to still ask us was them reassuring with us, and that is definitely great customer service. They even sell merchandise wear, climbing shoes, and yummy Odwalla proteins drinks. My favorite go to whenever I'm done with my bouldering sesh. Overall, I'm coming back to this gym when I'm in the city.", "date": "12/30/2018"}
{"review_id": "CSLHA5-sHnwP9-NE8lSbiw", "user_id": "3rPVCO27TQw73rjTTPE4iw", "user_name": "Jon K.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Incredible and endless bouldering.  Crazy arches, pitches, slab and even a youth hidden training center.  So much fun every time. Staff are awesome and eager to help you have positive climbing experience. One of many Touchstone gyms and they're all awesome. Pads are very cushy and I even intentionally practiced falling on my back on the roof (upside down) with no injury. Sets are always creative and challenging regardless of grade.", "date": "4/11/2019"}
{"review_id": "LPCEa0QemNHeqxB0WqeRAA", "user_id": "sHDozyifQXMu_0Xu9vojuQ", "user_name": "Daniel R.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I am a member at Berkeley Touchstone Ironworks and decided to come here for the day with friends. The gym is not easy to get to from the east bay but it's worth the trip. Dogpatch is massive with enough to keep you busy for the entire afternoon. If you ever get tired of the weekend crowds that normally swarm the east bay Touchstone gyms, give this place a try.", "date": "3/17/2019"}
{"review_id": "tB5adSrwdnhcjCP-Lntw1g", "user_id": "0G2XdKnulsJKCCIFPzuFtw", "user_name": "Patricia C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went bouldering for the first time here with some friends and went for the rocks marked V0's. I'll admit I get anxious when I'm even 3 feet above the ground. This experience was a great workout and although I didn't complete any of the challenges (scaling the walls using one rock color) I came away with greater confidence in falling (those mats are quite comfy and really did an amazing job in lessening the impact of my many falls) and overall satisfaction in facing my fear of heights. Thanks for making this such an awesome experience!", "date": "2/9/2019"}
{"review_id": "Vq60wqC5SafhgfZoAySOug", "user_id": "frKGteePNZWqWudkM_y4gw", "user_name": "Dillon T.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Cons:Today's customer service could use a bit of work as the person working the desk this morning was not the most inviting. His demeanor was one of \"I'd rather be anywhere else right now than working.\" This gym always feels like it's lacking the culture and community that many other climbing gyms have. Moving on!Pros/Story:As a Bay Area based climber--that has climbed at numerous gyms throughout California--I have to say that Dogpatch is still one of my favorite gyms to take new climbers. I have taken many people climbing for their first times to this gym and a majority of the time they really enjoy their climbing experience to the point of wanting to plan future climbs! I think a big factor as to why Dogpatch is so great for new climbers is its large size. This is definitely one of the biggest bouldering gyms around and with that comes a variety of routes and difficulties for people of all levels! While this place can get pretty packed, I typically taking new climbers during times when I know there won't be masses of people. This allows for more than enough open space and routes to teach them the basics and allow them multiple attempts. After we left my friend decided to look into climbing gyms around her school so that she can be better prepared for our next climbing trip. That was so exciting to hear especially since she was originally so scared to go bouldering!I recommend coming here for their space, variety, and hours of operation.", "date": "8/3/2018"}
{"review_id": "c6QUFRfcZ3gXtcX3rY49dA", "user_id": "IBVcDuf0ffAXl6-WPw_16g", "user_name": "Allison D.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The only other touchstone gym I've gone to is in Culver City, and thought nothing else could compare. But Dogpatch is superrrr good for bouldering. There are endless amounts of walls and you definitely can't finish all of them in one visit. If only I lived closer would I get a membership because it's such a nice gym. There's also street parking around which is super surprising for SF. You might need to park in the back, but I didn't mind. It's a tough tie between here and Granite Planet SF!", "date": "8/1/2018"}
{"review_id": "xKZ48C5-eggPLeCVVdg_eg", "user_id": "tlxpbxBH8tNdM5bUmt4iww", "user_name": "Danielle G.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 6, "funny": 2, "cool": 5, "text": "It was my first time bouldering and I loved it! We arranged an intro class because our group had several bouldering virgins. Our instructor was basically there to 1) teach us climber etiquette 2) teach us how to fall safely which basically equates to not being an a-hole during your stay or acquiring an injury or broken bone. The space: so much wall space to explore. All the problems, which is cool bouldering talk for a climbing route, are labeled by difficulty and color coded. Our group tended to gravitate to some of the V0 or V1 problems and take turns trying to conquer them. Your belongings: There is plenty of shelf space throughout the facility. The shelving is open, but the space seemed fairly safe and we didn't wander too far away from our bags. Definitely bring some water.Shoe rentals: Why do they have to stink? There doesn't seem to be a sanitation spray strong enough to wipe out the stench of sweaty socks. If this becomes a regular thing for me, I'll definitely look into getting shoes of my own.You can plan on spending an entire afternoon here and climb until you can barely bend your fingers. This was a super fun and challenging activity!", "date": "5/9/2018"}
{"review_id": "rnReFPHqnQc-_gAlv62CUg", "user_id": "sTW0gS1reTlPhrZYCDKH7A", "user_name": "Amanda C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "My boyfriend took me here for the first time the other day and we had a fun time! We took an introduction course which is around 30 minutes before we were free to boulder anywhere. It was around $30 per person, but for a regular day pass (after intro class) is $25 per person. An entire day for $25 isn't bad, but honestly, after 2 hours, I already felt like it was pushing it. Upon entering you'll see the front desk where you check-in/pay for your day pass. They have shoe and chalk bag rentals as well! There were half sizes available for the shoes, but they do run small so size up to your comfort. Make sure you learn how to properly fall before bouldering because many of those injuries happen. There are about 12 levels and I couldn't get pass level 2 as a first timer. This space is very spacious with lots of different climbing patterns and walls, however, it does get crowded, but we were able to find spots to try because every here is really courtesy and takes turns. There's also a gym with weights and treadmills, too. Definitely feeling the soreness today, but fun and worth a try!", "date": "2/17/2019"}
{"review_id": "Lkw0-lD8JtiL9-PrUvZahQ", "user_id": "4lWnLmNdW3mAOIMgxqqyPA", "user_name": "Raoul D.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 4, "funny": 1, "cool": 0, "text": "The focus here is on bouldering. No top rope routes, no lead climbing, but lots and lots of bouldering and a very small workout area with dumbells, a rack, and a bench or two. It can get pretty crowded on weekdays, but usually a friendly and polite crowd so you can get a good amount of climbing in. It is a definite hotspot for car break ins though, as almost all of my friends who climb there have had their cars broken into repeatedly. You often see broken glass on the sidewalks surrounding the gym, so expect to pay a bit of a \"glass tax\" for climbing there.", "date": "10/16/2018"}
{"review_id": "hpNNqbYsSsEeducvpFX-Pg", "user_id": "UHHrI1tzlhIJjXUbPmpLdg", "user_name": "Cassandra K.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 1, "cool": 4, "text": "Had so much fun coming here! My friend and I came on a Wednesday around 11am and stayed maybe until 1pm! My guess is that on a week day around that time may be the best time to go because it was definitely not as packed as most of the photos show on their Yelp page. If you go before 2pm, you can get a day pass (though you'll probably get tired within two hours) for $20 instead of $25. We rented shoes for $4, and a chalk bag for $1. My normal shoe size is a 5.5 and I wore size 6 shoes and they were a little tight, but manageable. Next time I might try a 6.5. My friend is normally a size 7 in shoes but ended up wearing a 9 or 9.5! The staff up front are really nice and will make sure you get the right shoe size if it's your first time there :)We went in, signed the waiver, got our shoes and chalk situated (one chalk bag is definitely enough for two beginners to share lol), and put our things in cubbies by the front! The bathrooms are located near the front end and they even sell kombucha and clif bars and other snacks!I've been to a touchstone gym in El Cerrito before and my friend has gone to Diablo Rock gym in Concord, and we both agreed that Dogpatch seems to be way harder than the ones we've been to! No slack line at this location like the one in El Cerrito, but the walls were definitely enough of a challenge. Parking may be a bit of a hassle, but if you can't find street parking there is a small parking lot on the street that's behind the gym that's $6 for two hours or $16 for all day :) I think it's called Lot 87? Look up the nearest parking lot on the Waze app!", "date": "4/3/2018"}
{"review_id": "ImLYK90aLjiKPRFy4PmEAw", "user_id": "uWgNriFuUOG-d0345E12iA", "user_name": "Colin S.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "This gym just keeps getting larger. There are an uncountable amount of bouldering problems of all levels here. It can get super packed on weeknights after work, but with all the wall space you really only feel the crowds in the locker room. The staff has been friendly and helpful any time I've needed them. I'd recommend this spot to beginners and experts alike.", "date": "1/8/2019"}
{"review_id": "ogJwrZ5PD7A--28KbatdVQ", "user_id": "XphBdRaMldLjZWL4qioM-A", "user_name": "Lo F.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best bouldering gym. So many people of all different levels of ability.. so many problems and lots of space. Hi ball and lo ball problems. Friendly staff.  Very small selection of drinks and food though.. definitely need to fix that and the shoe and pad selection is sad too.", "date": "4/6/2019"}
{"review_id": "-t31RFIHpbyiajs4RGbQIA", "user_id": "yfRPxK0Yq2Xmgw0ioCtHZQ", "user_name": "Cecile ..", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is spacious with lots of bouldering. Bouldering routes coordinate with the level of intensity indicated. You'll get a fun \"workout.\" They also have treadmills and weights. The lockers and bathrooms were clean. Friendly staff.", "date": "1/25/2019"}
{"review_id": "MI42Cr74uIUNDlubb07d_Q", "user_id": "O7URsBFp5CG5_ODrHj_aRg", "user_name": "Joe M.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Quite possibly my favorite bouldering gym in the Bay Area!PARKING - 4/5It's SF... What're you gonna do :P However, I will say that there is NO need to pay for parking here. There's decent free street parking on 3rd St (especially on the west side for some reason). There's also free unlimited parking in an industrial lot the next block over on Illinois between 22nd and 23rd, although it's often full during the day. Otherwise the surrounding neighborhood has a good amount of free 2-hour parking, which is more than enough time to get in a good climbing session.ROUTESETTING - 5/5Plenty of routes for all levels of difficulty, ensuring that the hundreds of climbers who visit every day have enough to keep them busy without having to wait too long for their turn. Some walls are actually pretty high, but there is more than enough padding to break your fall. I love that the wall itself is textured do that you can actually smear on it.STAFF - 5/5Always attentive and helpful!FACILITIES - 4.5/5Plenty of shelves for people to store their stuff. Never felt like my stuff was going to get stolen, because climbers just aren't that kind of people. Bathrooms are clean. My only (very minor) gripe is that the automatic hand dryer only detects your hands if they're practically touching the underside of the machine, which isn't very sanitary lol.", "date": "2/9/2018"}
{"review_id": "-AmFPn7L5HDhr7ET_JKszg", "user_id": "SK0lbeqT6fpZ3CC7P7Xnvg", "user_name": "Kristin Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Cool bouldering only gym.The space here is nice and wide open - plenty of areas to rest between problems (or chat with your friends).  I thought the grading was pretty consistent with my hometown gym, maybe a little bit easier.  At my home gym I typically only climb up to V2, here I was cruising on V2s, and projecting V3/4.The archway in the middle of the gym is really cool looking, but basically impossible to climb on unless you can climb the one 5.12b that is set on it.Otherwise, there was a really good mixture of grades found throughout the whole gym.  Plenty to keep anyone at any level occupied for a while.", "date": "12/7/2017"}
{"review_id": "JKPRk8Nzt0IE-5cg5QBcSg", "user_id": "DMw8wwgcuLZVZERGDctMng", "user_name": "Krystelle b.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Great bouldering and facilities. Bad customer service when you call in and ask for lost and found items.", "date": "3/10/2019"}
{"review_id": "ewZhbyYaRiUe6I5fdgtHQw", "user_id": "9oh-luWgcorE1uF8Jh0XSA", "user_name": "Thu P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So much fun! I had friends with guest passes, so I was able to tag along to boulder for the first time on Saturday afternoon. It was so fun, to do and to watch. I had to rent shoes (kinda gross, bring your own socks), and there was a changing room with showers and lockers. There are levels that are clearly labeled; I've never done it before so I stuck only to V0s. I couldn't do some of them, but no shame!", "date": "6/25/2018"}
{"review_id": "mSK4Q7HHUNbB7iVb1iOP9g", "user_id": "mKzNgV2c0ppCD78e0d0C_w", "user_name": "Samantha F.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 4, "funny": 1, "cool": 1, "text": "If you prefer bouldering over rock climbing, this is the place for you! They have varies routes of different difficulty levels. I love how each wall contains a variety of levels from V0 to V8 and not just a wall for all easy routes or  just all hard routes. You can find a V0 or V1 at any wall if you are a beginner so you are not limited to one wall. They even have a toldders section with a slide which is super adroable! They utilize they're walls pretty well and have a wide variety of different types of walls as well from slants, to slopes and ones curving in and out. I would say about half the walls let you climb all the way up and provide you with a easy way  down. Some walls don't and can be pretty high, so if you're lightweight afraid of heights/falling I would suggest sticking to the routes that let you to climb to the top of the platforms. Other amenities include, treadmills and I saw 1 squat/bench rack near the very back. Their bathrooms all have showers and lockers like with other climbing/bouldering facilities. They also sell snacks and bottle drinks. Parking is mostly residential around the area. It's not a very crowded place so that is a plus. They also have bike parking inside. The pricing is the only thing that would lead me to hesitate about coming back.$20 for day pass + $4 shoe rental. I know this price is the average for climbing/bouldering but I wish it were cheaper", "date": "12/20/2016"}
{"review_id": "o2Ewi0s2jbD7NPqV_eDBMg", "user_id": "iBv-WPffIo_6pERUWJlLDQ", "user_name": "Jess Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "This is possibly my least favorite climbing gym ever, but I know I'll be back. It's kind of a love hate relationship.I was a member here for about a year after moving here from SD/LA. I've been to about 15 gyms throughout CA and this one is definitely the dirtiest. EVERY other gym I've been to has signs in the restroom telling people not to wear their climbing shoes in the restroom, except the Touchstone NorCal gyms. My friend complained about the lack of shoe signs to them last week so hopefully things change next time I go. Last time I was there, I went to wash my hands after my session. In just one minute, I saw 3 people with climbing shoes on in the restroom. I don't even want to think about how many people do that per day. The restroom isn't the cleanest place, especially when it's 7pm and the bin is overflowing with paper towels. They definitely need someone to clean out those bins and the restroom more often. Every time I go to the restroom, there are piles of trash on the floor because they just don't clean it out enough. I can go on for days about how this gym is just the dirtiest ever (and not just about the bathroom), but I think I should move on. I love how big the gym is. It's the biggest bouldering gym I've been to, especially since they just opened the expansion on the right hand side. I hate how busy the gym is though. It is fine that it is busy, but DB doesn't really teach gym etiquette to newbies. A lot of time, people just walk right under you, into your fall zone. Last time, some guy also stood and blocked a section of the wall because he wanted to do this one problem and it kind of traversed two different sections. It's fine waiting, but wait behind and find a good time to jump on the problem. It's rude to block the wall because so many people are waiting... we get that you want to climb, but so do we. He blocked an entire section by standing in front of the wall for two minutes waiting for his problem to open up and kept trying to block us from climbing until I called him out on it.I also like the setting style better at other gyms. It might be because of how large this gym is, but I feel like it is kind of uninspired and all recycled sets from before.Touchstone in general is awesome, but I have so much gripes about this gym that I stopped my membership here a few months ago.** Also, I realized that I know of 4 people who have had their back windows smashed when they were parked behind the gym. If you do drive there, park somewhere on the side across the street, even if it's a bit of a walk. Parking behind the gym is easier but sketchy because it's more industrial / deserted.", "date": "2/3/2019"}
{"review_id": "OeBhqrjHgLwEe8qCK-VYjg", "user_id": "G-yOucON3iJIxCSpxSJ1YA", "user_name": "Peter P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "A very chill and large bouldering gym in SF. Lots of space and lots of routes that are pretty well set. Staff were friendly and welcoming and the cost for a day pass at $20-25 depending on what time of day is on par with other climbing gyms in the city. Really liked the wide open lay out of the gym where you didn't feel crowded waiting for climbs. This place will satisfy your bouldering urge, will definitely be back for more", "date": "10/17/2017"}
{"review_id": "Eff2mHj3UF5X-kU2ah99IQ", "user_id": "h3CUVrO5yzV9mWkzye8ajQ", "user_name": "Marissa C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Strictly bouldering only here. It's not just fun to boulder, but it's also very entertaining to WATCH the more experienced boulderers! It's so amazing to see them spider man upside down and stuff. So crazy! Everyone is super friendly and supportive too even if you're a V1.", "date": "2/21/2018"}
{"review_id": "w8PfVsDoLksJhOSEFRM1PA", "user_id": "di1Lpu1CgalyotISa8eISw", "user_name": "Kenny L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 6, "funny": 5, "cool": 5, "text": "First timer, rookie wallclimber, and unsure what to expect from Dogpatch Boulders? My advice is just do it! I had a great time checking out this place. It wasn't intimidating at all; there is a wide range of levels here (start with 0), and I felt like I got a great workout in working out muscles I hardly ever use! It feels awesome typing this up next the day! My forearms are definitely feeling it. For a guest pass, it was $20 for a day pass and $4 for  rental climbing shoes. For whatever reason, don't wear socks, and be sure to get the right shoe size. They recommend wearing comfortable clothes; I stuck with a loose fitting t shirt and durable pants, but shorts would also work great. They have plenty of bike parking and actual street parking was a breeze on weekends. They also have some weights and treadmills here to supplement your bouldering. The atmosphere here is great; it felt fun, exciting, and encouraging. I felt like a little kid again that had just stumbled upon a brand new playground. Climbing felt like a workout and puzzle. Going at in with a headful of steam, and then stepping back and thinking what was the best path and what was the best strategy. Granted, my technique and form were awful, but most importantly, I knew how to fall and get down with very low risk of actually getting hurt.As silly as it sounds, I felt accomplished doing the beginner climbs. It was a similar feeling to that of a skateboarder who had just landed a trick they had been trying all day. I gave knucks to my buddy who came with me, and I was amped for the next challenge. Even watching other people succeed and reach the \"finish line\" of their climbs was in an odd way motivating and fulfilling. The inverted walls were a lot harder than it seemed, and it was one of the last climbs that I left on. It gave me a sense of motivation for my next visit (whenever that is), and got me excited again. Who knew getting a good workout could be so fun? Keep in mind, I'm just your average dude with an average build, but it was still super fun. Bring some friends, and check this place out if you're looking for a different type of workout.", "date": "8/29/2016"}
{"review_id": "qjd1K5zA_b1aBodtZpwaqQ", "user_id": "meIimWr8fIFePSIBc2cGVA", "user_name": "Lyman C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 4, "funny": 1, "cool": 3, "text": "A boulder's playground.  I feel like the levels here are harder than planet granite bouldering.  V0 are not tough at all here, V1 takes a little bit of skill, V2 just kind of smacks you in the face like what just happened.  Normally I'm V3 to V4 at planet granite. Here I'm only a V2 at best.  I still had fun.  Might have to come here more often and find a few friends to boulder together.$25 dollar for a day pass.", "date": "1/31/2017"}
{"review_id": "-kFQiLYdQ4lNCL2olIcoSg", "user_id": "W3pB9iiIEkkCjX18gtYnMw", "user_name": "Stacy D.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Visited this gym on my one week trip to SF.  Really enjoyed the bouldering here.  This is the biggest bouldering gym I've ever been to and even with all the square footage, it is soooo crowded that you have to wait to try every single route.  Came on a Thursday night around 7PM and it was prime time, when I left around 9:30PM it was still pretty crowded.  Climbing sure is popular!The walls are much taller than the bouldering gym I normally go to so no wonder why I got tired faster than normal.  But there are so many types of walls and routes you'll never run out of problems.  Bummed that I only have time to come here once and I'll never see those problems again!", "date": "3/20/2017"}
{"review_id": "U9YqiWPOtTDOVot9HzEgpA", "user_id": "SEP2LxRGM0d2EMn4QT61zw", "user_name": "R R.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My favorite place for bouldering! The only reason I give 4 starts is that they don't sell chalk there which doesnt make sense to me. They only sell chalk ball.", "date": "7/8/2018"}
{"review_id": "9VM4STkm6_bbuCuogtyPhQ", "user_id": "bwBTC-rt3NsXCRhaqb1fWA", "user_name": "Sophia L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 11, "funny": 6, "cool": 9, "text": "TL;DR Huge gym w/ endless walls, but not beginner friendly I came here with three friends, one experienced, and the other two beginners like myself. I've been bouldering twice before Dogpatch, and I'm so glad I did because I would be so intimidated here. Everyone seemed to be a regular and were at a v6 or higher, I never saw anyone else at a v0 or v1. The v0s that I was trying felt like more like a v1 or v2 than a v0. Even my experienced friend said that the v0s and v1s are more difficult here than at other climbing gyms. Dogpatch seems to be a great climbing gym for experienced climbers, especially since the walls are endless. This place is huge, I don't think anyone could get bored of the routes since there are so many to try. Dogpatch is on the pricier side at $25 for a day pass, and $20 before 3pm only on weekdays. I was here for 3 hours and wasn't even able to try all the v0s because this place is so large and spacious! I had a great time, but probably wouldn't come here again b/c it's not beginner friendly and it's pricier than average. I would recommend this gym if you're an experienced climber and are looking for a challenge!", "date": "7/17/2017"}
{"review_id": "rDlALDA9SaVtaIGBndEHqw", "user_id": "xiBGreimmO1XYqznZIwv1w", "user_name": "Brandon Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 1, "cool": 3, "text": "My favorite place to get some bouldering climbs in, Dogpatch is the spot!This review should be taken with a grain of salt, as I'm biased in that I prefer bouldering much more to ropes, and when I boulder, I boulder and don't use other exercise equipment. That being said, the space is huge, and continually expanding. It gets crowded after work hours, and you'll sometimes have to wait to get on a problem, but there are many to choose from, of varying difficulty levels, and most everyone in the gym is pretty chill and willing to give tips. Parking can be a bit of a challenge, especially if construction is going on, and I've learned that Friday late morning is near impossible because people park and leave cars there to take the train, but better times are a couple hours before closing, or early on the weekends.Happy Bouldering!", "date": "11/27/2016"}
{"review_id": "_-7uJu3Q3QCnJ35HbE4Fdw", "user_id": "Hc1VOdWgLIZ4ZeK83iGM_Q", "user_name": "Anna H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "In January of this year, I opted in to get a gym membership at Touchstone, since my friend from work at the time convinced me to (No initiation fee, yay!) I wasn't an active climbing member the first few months until I started working down the street from it in May. The gym is super spacious and is supplied with various routes for different types of climbers. I've been to the Studio in SJ, PG in Sunnyvale, PG in Presidio, and Mission Cliffs but Dogpatch Boulders is still my favorite rock climbing gym. Would highly recommend getting a membership here if you're a solo climbing ( I like bouldering more than top rope). Also, if you're not sure about getting a membership, I would wait until they waive the initiation fee ($100). They usually have this in January because you know... New Year, New Me (amiright).FAIR WARNING: The area is still a little run down with sketchy activities in the area. Would recommend NOT leaving anything in your car if you decide to park anywhere on Illinois street (street behind DP Boulders).", "date": "10/14/2017"}
{"review_id": "O1hqw3xRHJF2PKJRxudM8A", "user_id": "ohHURArHTDPE1PRGE8OzuQ", "user_name": "Katie C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 2, "cool": 1, "text": "If you boulder, this place is like heaven. SO MANY ROUTES. And good/varied routes at that. The space is huge, the staff is friendly and the bathrooms are clean. Overall, dreamy, dreamy place.", "date": "12/24/2016"}
{"review_id": "KNUwo5uMA199zr3ZUReHCg", "user_id": "4iOc4Fo-h6gZ-2zAJEM78g", "user_name": "Christina M.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 4, "funny": 16, "cool": 2, "text": "Looking to add some fun to my fitness routine, I decided to give climbing a shot. Dogpatch Boulders is conveniently located in Dogpatch with plenty of parking nearby. They even have indoor bike storage (wish I knew that before driving over). The employees are very friendly and the guy who led the beginners class I attended was great and very informative too. However, I docked this place a few stars because the climbing grabber things, or whatever you call them, were so coarse/rough that I couldn't climb more than an hour because my hands became so torn up. My hands were either throbbing, red, and/or sensitive for three days straight after I tried DB out. The daily rate for climbing and rentals came to $50 for me and my bf and since we were only able to climb an hour (his hands were much worse than mine because of the coarse stones), we didn't think the experience was worth the cost. Hopefully DB will consider using stones / grabber things that are not so coarse. Nonetheless, it was clear that I did get a workout from my one hour climb since my forearms were sore the next day...which made typing difficult, ha!", "date": "8/27/2016"}
{"review_id": "UGAkUzXR6_JeuOZKn-qprA", "user_id": "P4Td3m5oMGZGTfDVZzgztg", "user_name": "Edward W.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "I don't have membership here, but I probably drop by about twice a month. This place has the highest bouldering walls I've ever been on and can be daunting at times. I usually come on weekends in the morning/early afternoon and it's never too crowded. There are plenty of V0-V3 problems for beginners and I always feel like there are new routes to climb since I don't come all that often.Some walls let you top over, which is quite fun yet scary at times when you're near the top. I've also had friends injure themselves from falling off these walls since they are so tall and the cushions weren't all that great. They have since replaced the cushions and it seems much sturdier yet has enough give. My only gripe is the day pass is $20, but that is on par with other gyms. On the plus side, they have dedicated bike parking inside, so often times I will ride my bike here as a warm up before climbing.", "date": "10/19/2016"}
{"review_id": "sextYW32l5i2d4qyMd-Prw", "user_id": "DqkTHW550y-S3W0VcDubPA", "user_name": "Dennis C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This was the first time I went bouldering and I had a great time! It's huge--although I don't have a basis for comparison--and seems to have tons of options for each skill level. There were more than enough v0 - v2's to keep me occupied for an entire day. I found that the degree of difficulty varied quite a bit, even within levels, but I imagine that's the case anywhere. We came on a Friday morning and still encountered a few dozen people so I'm sure it gets quite crowded during peak hours.A single visit is kinda pricey but it's definitely worth the fun if you stay (slash last) for a couple hours. I believe there's a little gym in the back corner too, if you're looking for that.I can't wait to come back!", "date": "9/1/2017"}
{"review_id": "egZHbEL3RqAYAHjBZ3sFwQ", "user_id": "vtEhzcp4bGlXfxzmb-xqvw", "user_name": "Alexander L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I've been a member here for a few months now, and this gym is definitely awesome!Great community, lots of friendly people to help you with the bouldering problems, TONS of problems, and a nice squishy mat to fall on... what more could you want?I've taken a few friends bouldering with the guest pass that they have, and they all seemed to enjoy it. With so many problems, waiting for wall time is generally not an issue. There are also easy problems mixed with harder ones, so climbers of all kinds of experience can climb together!The fact that it's open super late (11pm) on Tu/Th is also terrific for bouldering after work.", "date": "1/27/2018"}
{"review_id": "9PLwSBVFn-8FuL4TrhU5mg", "user_id": "Mfzz1HFtQSIBBQKDWMW7Ig", "user_name": "Ashley G.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "I love this place so much! It is a HUGE bouldering gym (no top rope). They have a wide variety of routes for all levels of experience that they change on a regular basis. They have a separate kids section & it looks like they are opening up a yoga section. They have a few bikes, treadmills, & ellipticals (like 2-3)They take good care of their gym (it's well maintained & clean).They have lockers I. The locker rooms but also have plenty of cubbies where you can safely keep you stuff near the climbing areas. Small cons the bathroom stalls are super small & they don't have a sauna like many other climbing gyms but they do have showers.It's just a few blocks from the Caltrain station & a Muni stop. There is plenty of bike parking indoors & out. It can sometimes be tricky to find parking for your car depending on the time of day but it is free parking in the area.They sell a small amount of food & drinks & also climbing gear (shoes, chalk, clothes, etc).", "date": "5/28/2017"}
{"review_id": "0LeucSeS22gRoO43dkoVQQ", "user_id": "cr2oPullBmjhu_0HR_s-Pg", "user_name": "Eileen Joy P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 3, "funny": 2, "cool": 1, "text": "My friend and I were on our way to yoga but we decided to try something new and came here. I've never rock climbed and was terrified! After awhile of contemplation I finally started climbing and once I reached more than halfway up I remembered that I was scared of heights. My palms started getting sweaty and my arms felt like noodles! Luckily I was able to find a lower rock to step down a bit and jumped off. I kept trying to reach the top but would stop at the same spot every time. I'm determined to come back and face my fears! However, the facility is nice. I expected it to be bigger but they were doing construction to add more walls. As a first timer, they should have told us to follow the colors. We just chose any rock that was easy to get our hands on until someone had told us otherwise. We felt dumb. A day pass is $25 + $4 for chalk and shoes", "date": "6/19/2016"}
{"review_id": "_AbpdoRFy9efoczLCHQ41w", "user_id": "eA3BatFsAVNjGTLnkZiEtQ", "user_name": "Monica Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I called customer service and they replied the next day and said that they would retrain their staff. Hopefully they did. We haven't been back since.", "date": "8/9/2018"}
{"review_id": "xKz3kikx-3n1ZMiHaBGviw", "user_id": "aFBQko4yhl66_UgVfAlnRQ", "user_name": "Amy T.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 6, "funny": 7, "cool": 7, "text": "Dogpatch is heaven on earth for boulderers. The entire gym is dedicated to bouldering!!! WAT! Yes, you heard it right folks. A whole gym and it's all filled with dope ass bouldering problems.I come here occasionally & since I'm a member at PG I just get the day pass for $20. The locker room is very small, like a tenth of the size of PG SF locker rooms. But plenty of cubbies scattered throughout the gym. There's some exercise equipment also but I only come here for the bouldering so I've never touched the machines. In terms of bouldering, there are a TON of diverse routes. You can essentially top out on 80% of the walls. And it's scary AF LOL. Topping out on these walls is extra terrifying because the walls are so high and oddly shaped and slabby and man, be careful or just down climb LOL. There's really a wall for every climber here. Tons of high balls and roofs and painfully angled walls -- you name it, they got it. Because there's so many walls and problems, there's a ton of diversity in terms of how the routes are set. Every time I've been there though, there's been a major lack of crimps; mostly jugs, slippers, pinches. I love crimps so I would enjoy more of those routes but also maybe I'm just missing all he crimpy routes because there's literally hundreds to have a go at and I probably just didn't see them. ANYWAYS FOR SURE CHECK OUT DOGPATCH IF YOU LOVE BOULDERING. Or if you wanna try it out! It's definitely a great place to hang and climb", "date": "12/20/2016"}
{"review_id": "h1iuLmk0q2bUnII-eMJiOA", "user_id": "3tmJi1o-upSeb0Q2O5sh6Q", "user_name": "Benson M.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 3, "funny": 2, "cool": 3, "text": "This is a really cool place to go with a group of friends, your ride or die partner, or just going there by yourself. Not only is it a cool place to go workout and have fun but it is located in the Mission, so you can probably grab some delicious food right after which makes it feel like a hidden gem. I was also able to rekindle my fire for climbing after so many years of no action. So, if anything I must thank this place and it's an amazing facility for helping me. I would say that the price was 'good' considering that I only go for the early bird special because those are the times that I am free and want a good deal. Overall, I really like this place a lot just because I know I can get a good deal if I do the early bird special. But I am not a professional rock climber so I can't say \"This is the best place to go to!\" because I don't quite have the criteria but nonetheless check this place out!", "date": "1/7/2017"}
{"review_id": "geqyfA-KC3-1pbKw471Vgw", "user_id": "QemJbqYzbasjXnMbuy4xOw", "user_name": "Sara L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 3, "funny": 3, "cool": 3, "text": "I had such a great time with my boyfriend when we came on a rainy weekend. It was pretty crowded in the afternoon, but not to the point where it was bothersome or it required waiting before starting any of the problems. We each paid $20 for a day pass, plus $4 for shoes and $1 for a chalk bag (only need 1 chalk bag for two people though).I'm FAR from an experienced climber, so I love how the bouldering problems inside are super accommodating to all skill levels (v0-v12). I've seen online that they even have an option for first-timers to take a 30-minute class (2:30pm during weekends) that is covered by a day pass, so you don't even need an experienced friend to show you the ropes.GREAT place to go for a fun upper body workout, and you could even make it into a full body workout with the limited cardio and weight lifting equipment they have in the back.Two days after our visit, my back and shoulders are still sore...", "date": "12/22/2015"}
{"review_id": "1TIl11HqVAdIdgehCxVRXg", "user_id": "t9OAdJcdL3suwm0jsAzQEw", "user_name": "Leslie H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Bouldering is growing on me. This place is dedicated 100% to just bouldering. Lots of the structures allow you to top out, though I find it a bit sketchy on the top in some places because it's not flat, it gets narrow, and there are boxes and bars that you can hit your head on. Also, I've heard others say before that they've seen people stumble and fall off the top onto the mats below, which seems pretty dangerous. Of course, bouldering and rock climbing in general are dangerous activities, so engage at your own risk. They do a decent job of setting the problems and cleaning the holds, but I wish that they would replace the mats. The canvas is coated in some sort of plastic that is crumbling away and always sticks to my pants. Their locker room isn't huge, but it gets the job done. They also provide towels and soap and shampoo and conditioner, like the other Touchstone gyms. Guest passes cost $20, but you can get a punch card of 10 visits for $180.The front desk is pretty friendly. They don't have tape at the counter, but they'll usually scrounge up something for you if you ask.", "date": "4/20/2016"}
{"review_id": "SFMt_VdJ0e4Z0S46k_hqbw", "user_id": "4JBNPPPNTVxs0g9y6v70Mw", "user_name": "Gabrielle H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 2, "useful": 6, "funny": 1, "cool": 1, "text": "This place is... not clean at all. Grimy floors, grimy holds, grimy crash pads...I'm in the city for a couple days for business and I packed my climbing shoes specifically to check out Dogpatch at least one day after work. I was super excited to see it since it's the biggest Touchstone bouldering gym and I guess I'm a size queen.Yes there are tons of walls, lots of problems, but I'll have to agree with a review from a couple years ago saying that the problems felt... odd, and not creative or smart. Maybe I'm so used to the route setters in my home gym (Hollywood Boulders in LA, and sometimes Cliffs of Id in Culver City), but I didn't feel like anything was well-planned or even very fun, and I tried pretty much every wall, every route up to and including V4.A big miss is that every single hold is greasy and grimy and generally not-cared-for, and no I'm not using that as an excuse for whether or not I could send my routes. Gyms should be power washing holds at every reset, and replacing them as often as necessary - and it seems like not a single hold has been cleaned or otherwise maintained since this gym opened. I saw some guy vacuuming with a hose on one of the low top out areas but dude, that doesn't really help the real issue.Locker room was covered in chalk and dirt as well. I get it, it's a climbing gym and climbers use chalk, but there's no reason for every nook and cranny to have caked-up chalk and dirt. Have some pride.", "date": "10/24/2016"}
{"review_id": "lwcVZ8j1SoDY_ESkMTgAvg", "user_id": "RNeup32uyzXn77CyF98lUg", "user_name": "Lisa H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "My favorite place to boulder in the Bay Area! Its so gigantic that I could spend the entire day there and never run out of problems in my grade to climb. The walls are incredibly high but have a scratchy material that the other Touchstone gyms don't have so its quite easy to knick yourself in the knee if you fall off a problem. There's plenty of overhung caves and straight walls to choose from and it never gets unbearably crowded except for competitions. Some of the south walls have odd angles here and there which make the bouldering much more unique than other gyms. People are incredibly friendly too and always willing to help give beta when they see you struggling with a problem. The only cons I would say are that they unfortunately do not have much gym equipment, steam room, or lock rentals. Also some of the crash pads are falling apart and ripped so hopefully they will be replace soon. I come here on the weekends all the time and absolutely love it!", "date": "1/18/2016"}
{"review_id": "YTKQ6dckirWCrt6DJn3WSA", "user_id": "Xiv-cQouKxulhN_iMV2zUA", "user_name": "Jessica L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 4, "funny": 2, "cool": 1, "text": "Been to enough bouldering gyms across the nation that I can say this with certainty - this is one of the best bouldering gyms around. I've been to 8-10 other gyms by now and this is still number 1 for me (although Seattle's Bouldering Project is also superb). It is gigantic, it has a wide range of difficulties and styles, and it changes routes frequently enough that even regulars can never complain. Also, its ratings are the closest I've ever seen an indoor gym come to matching outdoor ratings - as in it rates harder than any other gym I've been to. Which is appreciated if you do both indoor and outdoor bouldering.That being said, there are some downsides: - Not really a workout space. There's a small area in the back with one rack and some weights, also some treadmills in the front, but no real gym. They did open a yoga room recently though, and have more unfilled space which I'm hoping they'll turn into a full-blown gym soon.- Too crowded on certain weekday nights, particularly Tuesday nights. They're open later on Tues/Thurs, so that might be the reason.- Parking is shady. Do not leave shit in view or you WILL get a broken window.Aside from those things though, this gym is great. Couldn't ask for a better home gym.(Side note: I'm actually laughing at the 3-star reviews on the front page because they're coming from people who came here ONCE, who've hardly ever climbed in their life, complaining about how the rocks are rough and make their hands hurt/chalky (lol, really?). Ya, that's 'cause Dogpatch gets fresh, new pieces, not worn down to a slippery gloss like at Mission Cliffs bouldering..)", "date": "9/20/2016"}
{"review_id": "S6Qh6KUS09BWYS2sVToiBA", "user_id": "-iiuT7X9wG37wGTxcsnklQ", "user_name": "Christine L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 2, "funny": 1, "cool": 0, "text": "I originally signed up for a membership at Mission Cliffs. Since Dogpatch Boulders is a Touchstone Climbing Gym I have been able to come twice on my current membership. It's located only .3mi away from the 22nd Caltrain station making it super convenient to visit.In comparison to mission cliffs the walls are much taller, but extremely fun. It's helping me get over my fear of heights (haha!). Also, I get that it's a gym, but Dogpatch Boulders actually smells a lot better than Mission Cliffs because it has better ventilation. I think DB is a converted warehouse because they let a lot of air in via an open garage on what looks like a loading dock.My biggest complaint is the sheer amount of people who come weekdays after work. The gym is much bigger than many of the climbing gyms I have seen, but it gets super crowded. I end up spending more time waiting for V0-V1 routes than actually climbing (I've only bouldered 3 times in my life now). Also, the locker room is cramped with only one small bench near the actual lockers. It looks like the locker room could also use a good cleaning.", "date": "11/1/2016"}
{"review_id": "9BixnlHBCciVB6yftLnGkA", "user_id": "AsYMm_O4H-mwmWbmeACDHw", "user_name": "Christopher L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "They have a lot of problems and I think around 11 levels so it caters to climbers of all levels. The place is pretty spacious for SF and even has an indoor area where you can park your bikes (a huge bonus for me). It has a great ambience, the climbers and staff are really friendly and the customer service is excellent. Great quality problems and always new problems to try out. They change / add new problems every week or so.They also sell a lot of climbing equipment. Shoes, chalk, tape, drinks, protein bars, you name it; they probably have it. I just started bouldering in the beginning of the summer and have been to a couple places in Toronto, but nothing like this. I just bought my membership recently and it's a really great place to climb.Did I mention they also have a mini weight lifting area! Awesome I can also do 90% of my original weight lifting workouts here because all I need are some dumb bells, barbell, plates, benches and a squat rack and I'm good to go.", "date": "10/8/2015"}
{"review_id": "rovcOgcOl3CGlP1Q2f-8mA", "user_id": "8ZxXfaU16WvGMGNCdKmBTg", "user_name": "Paul N.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing places for rock climbing with friends and family. Many choice and areas to tryouts. Highly recommended.", "date": "11/26/2017"}
{"review_id": "0i5TBDhZEGzzuRTIJbYN8A", "user_id": "y72ItXaidNFBHEZfti3EeQ", "user_name": "Erika S.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 2, "cool": 0, "text": "This is by far my favorite bouldering gym. I'm still a bit of a rookie, but I worked my way up to trying some V3s on this visit.I love how huge this place is, solely dedicated to bouldering. They even added a small section for kids that includes a slide to come down once they top out.It seems like they've recently replaced the crash pads because other reviews complain about a cracking plastic, but I saw nothing of the sort on the pads while I was there.The little box of tape, nail clippers, band aids, and triple antibiotic ointment must be new as well! It was very convenient to have such easy access to band aids, but we found it better to fold over the end of the tape (so it doesn't stick to your scrape), then just wrap your finger to continue climbing.While the holds and walls are a little more rough, I found that this helped with my grip and made me less messy about dragging myself along the wall.All of the climbers I met were very friendly and willing to provide advice. This even included two young people, likely around 10 years old who each had great climbing talent. It was really cool to see grown adults taking advice from some really cool kids!I will definitely be making my way back here, hopefully on a somewhat regular basis. My only reserve is that I need to figure out how to stretch so that my forearms aren't dead when I wake up the next day!", "date": "9/11/2016"}
{"review_id": "LuF4s54j7715DWMijpSdLQ", "user_id": "SddNitt8M4dCuhPGYox7nQ", "user_name": "Alex E.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Dogpatch Boulders is a great facility. I love the touchstone family of gyms, and this one does not disappoint. The entire gym is pretty much a bouldering area, with a few machines near the front (including an ergometer, which is my favorite), and a handful of weights in the back corner.  At the front of the gym, there is a very large area for bike parking and the locker rooms are adequate.  I have to admit, after climbing at Mission Cliffs and Cliffs of Id, I am slightly jealous that there is no sauna at Dogpatch Boulders, but oh well that is a minor detail. The bouldering area is really incredible, there are enjoyable and challenging problems for every skill level, and the routes are frequently updated and changed. The staff here is helpful and friendly, and I enjoy that this location frequently has various sales and specials on gear and other items. Keep up the great work!", "date": "2/5/2016"}
{"review_id": "fegXmVCxdhYRN57fEi2bhA", "user_id": "x2-TP8fd4G0OqkgDyKt3IA", "user_name": "Elaine N.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "My back... is so sore.This was my first time at Dogpatch Boulders - my friend recommended it since she has a monthly pass here and loves climbing/working out there. My friends and I went on a Tuesday before 3pm for the $15 day pass + $5 for shoe rental. I'm not the best climber, but I love the challenge and it's a great workout for your upper body. Since we went early in the day it was fairly empty, the receptionist was chill and helped us out with everything. It's an all-bouldering gym so there were tons of problems and I hear they change them up every so often which is nice! After climbing for ~2hrs, I checked out the cardio and weights too, the equipment is limited, but you can definitely make it work to get a full workout. Dogpatch is nice because parking is easy and its close to my house which is nice. Love this place, can't wait to go back.", "date": "8/18/2015"}
{"review_id": "QikX7WFrjNFh0ZgLGxt70g", "user_id": "Z1giyL333Abrtl0ULhDAmQ", "user_name": "Avadhut P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "First time bouldering in San Francisco, and I court be happier about my decision to pack my climbing shoes. This place is just like I imagined it to be. And perfect for an afternoon's climbing. The best part of it is an all-bouldering gym, which means plenty of problems! And I don't know if it was the timer of the day or the weekend, but it wasn't crowded at all. No waiting on problems. Come down here it you're ever in SF You will not regret it. Happy Klettering :-)", "date": "6/20/2015"}
{"review_id": "MMeMzkyJeZhWT1qPwGA3jQ", "user_id": "AE8nHSRPFlB4nh7CP8PlGQ", "user_name": "Tiffany Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 11, "funny": 8, "cool": 7, "text": "I came here for the first time last week, and I think it has ruined all other bouldering gyms for me. This gym is a bouldering paradise.It is a bit difficult to get here using public transportation, but it is pretty easy to find parking in this area. Day pass is $20 if your not a touchstone member, if I could come more often I would probably end up getting a touchstone membership so I could come here and Ironworks in Berkeley. The walls here are pretty high about 24 feet, so if you aren't comfortable climbing that high than your gonna have to be more careful than normal.  They have tons of arches, overhangs, etc. they have tons of different routes, styles, variety, etc.  The pads are really soft, thick, and only a little bit of bounce which I love because I am very wary of falling on bouncy pads. They have a really cute kids section with a slide and a castle. The walls here are super sticky and textured, so be careful when climbing or you will end up ripping your skin ( which I did several times)  Everyone here is really friendly and easy to talk to and I can't wait to go again.The grades are rather soft and vary alot in difficulty so try out a few to get the hang of them. I can't wait to come again!!", "date": "10/14/2014"}
{"review_id": "zQZDzuz_Lw_1m6njfgrcRQ", "user_id": "6kA8QonUBtuhEPvOM3NNuA", "user_name": "F M.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I came as a guest for my first time. The place looks amazing and I had great fun barely conquered some of the V0's (yep, had to swallow gallons of pride there).Most people were cool and there to have fun, a few were taking themselves a bit too seriously, (Smiling ain't no crime people!).I would have loved to get into it but can't justify that ridiculous cost:$25 per visit (I only lasted 1.5 hours)Then if you want to save a dollar or two you can sign up for membership where they hit you with $40+ admin fee's? (err common!).Real shame, it looked like something I could really get into and with some hardore dedication master a V2 (aim high kids!).", "date": "9/6/2017"}
{"review_id": "Tv04gm9mDS4v5DgXHv4_ww", "user_id": "R59tJkJw7AwnWqs-8YlwUw", "user_name": "David K.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Hands down, the best bouldering gym in the area. I love GWPC, and Ironworks is pretty solid, but if you're looking for bouldering there just isn't a comparison. We've got a group that goes after work once a week, and it's great motivation because it is a little bit of a hassle to get to (especially when you live in Oakland). But it's worth it for the variety of problems that are set, both in terms of difficulty and style. My only complaint is that they don't have block chalk for purchase. Completely blows my mind, but oh well.", "date": "3/24/2016"}
{"review_id": "zYBvx29yTYQKE05zjcwC9Q", "user_id": "dHejtT1pF9HacGDJmBDDEQ", "user_name": "Tim L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Awesome place for bouldering! Parking was kinda hard to find, just a heads up. Staff is nice and a small weight training area.", "date": "5/31/2017"}
{"review_id": "JVWxUZoHqiKOG7iyFLuRvQ", "user_id": "jzqLpVkB1rg9AssLKm7lvw", "user_name": "Wendy H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 5, "funny": 2, "cool": 3, "text": "I was just about to give up getting my almost-four-year-old to like climbing when we brought her to Dogpatch Boulders. Dogpatch has a whole corner of the gym devoted to kids routes. The holds are closer together to feel more natural for their little bodies. There is also a 20 foot tube slide that my daughter literally slid down 20 times. There is kind of a high ladder to climb up which made her nervous initially. But with some coaching, she made it to the top and was rewarded for her efforts with the fun slide. Climbing up to the slide multiple times helped her to overcome some of her fear of heights. Which, in turn, helped her to feel more confident on the kiddie climbing walls. She would rotate between the slide and the climbing walls. She even practiced the correct way to fall. Every so often I would find her curled up onto her back with a big smile on her face. Way to fall correctly, sweetie. Another major benefit of having a dedicated kids area is that I didn't have to be afraid of larger humans falling on her. The adult bouldering area was cool too. There is nothing like it. Great features, challenging problems, soft floor, and freakishly high routes that make you really work on your mental game.", "date": "5/8/2014"}
{"review_id": "WGnt1fJF8mGWvc0oHTGz8g", "user_id": "adKonsQWY64vJYglPotH5Q", "user_name": "Stefanie C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I got addicted to bouldering very fast, so Dogpatch was heaven for me. It's a pain to get here since it's in the middle of nowhere, but if you spend a few hours a week here, you really do feel like part of its community. Checking in, renting gear, and asking membership questions are all easy at the giant front desk. The whole place is open and spacious so you might either get excited or intimidated like me. Everyone is so friendly, so don't be afraid to make new friends!Locker rooms are decent, but you'll spend most of your time climbing, so let's move onto the main attraction. The walls at Dogpatch are super high, but I mean... you can go as far as you want. I love that all the routes are challenging because it truly makes you strive to get better over time. I have come back several times to attempt certain routes I'm determined to tackle. They change up the routes every so often, so that's good. Plenty of room for everyone to climb, though it will get especially on the weekends.Weights and cardio equipment are limited, but they really know how to maximize the space for bouldering! Love this place.", "date": "1/13/2015"}
{"review_id": "cLV_HV-icJkSq1czkewO6g", "user_id": "N9gcGZI9bxNHj9UIrZUeMQ", "user_name": "Da X.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time and loved it, but I do have a few complaints.#1: Price: $20 for a day pass and $5 for rentals? A noob isn't gonna climb all day, they'll be sore after an hour. If they lowered the price to $15-$20 all inclusive for a day, I bet they would get more business.#2: Rental Shoes: I would not wear them barefoot, you'll definitely get something. When putting back on your own shoes, go commando, better safe than sorry.Besides the price and smelly shoes, this is a great place to \"work out\"", "date": "3/31/2015"}
{"review_id": "wevrZckYKJssST2FkkS7mQ", "user_id": "0TDbSaEfXpL7JGsUux6MEA", "user_name": "Kristin C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Love this place. Came with a friend and now I'm addicted to bouldering and going rock climbing! The atmosphere is great - everyone is really kind and it's not too crowded.  There are tons of different levels scattered around the entire gym on different walls so theres not just \"one section\" for beginners, \"one section\" for intermediate levels, \"one section\" for expert levels.  It allows everyone to interact and watch people at all different skills! $20 for a daypass. Unlimited In's and Out's. Unleash your inner monkey :) Climb on.", "date": "2/18/2015"}
{"review_id": "WE-5HrGTYQGVPkN5PLeqrA", "user_id": "W4Nunz5c0nMfbkmG2n8Zzw", "user_name": "Tara B.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Wow. This place is amazing. We went last week with our three kids (ages 12, 12 and 6). They LOVED it. The place is the best I've seen with lots of space and tons of options for climbers. We saw people from a range of skill levels and everyone seemed to have a challenging climb. We will be back (and we live in Virginia). It was the highlight of our vacation for our kids.", "date": "1/5/2016"}
{"review_id": "eyVqcg5cm6dUNml4p4RvMw", "user_id": "8snEHq6CXi_DHdXNFHFuTA", "user_name": "Thomas O.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 2, "useful": 1, "funny": 2, "cool": 1, "text": "Pros:- Huge wall space- Awesome wall featuresCons:- Stale, boring setting- Horrible management- Expensive- Incredibly dirty floorsI left my shoes there, then called back to see if they were in the lost and found. On two separate occasions, the desk staff refused to check their lost and found. It takes 30 seconds, and literally any non-Touchstone gym would be happy to check. While there are a handful of fun problems, every time I go I feel like I climb the same stuff over and over. To be fair, it's probably just a product of having to set so much; eventually you just run out of ideas and start recycling stuff/throwing up ladders. I'm pretty done with Touchstone at this point.", "date": "11/7/2016"}
{"review_id": "pJJUadlwdhK1Jv_2EpfwFQ", "user_id": "gLke-4oih1t7urvoQAENcQ", "user_name": "Kevin L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty excited about this new Touchstone gym opening soon! The walls are up, the setters are laying down routes, t-shirts are being handed out, but no word yet on an official day that we can clamber on all the new holds.I thought Ironworks was awesome, but this place...is in a whole other league. We walked around just itchin' to hop on to everything.", "date": "1/16/2013"}
{"review_id": "DVqIaAImLE6QPxCGCLeJcw", "user_id": "UK29eI9itrCh0NtA0mWK8Q", "user_name": "Karen H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went climbing here yesterday and had so much fun! The walls are high, so I definitely recommend downclimbing a bit before jumping off. The levels are well calibrated and there is a huge variety of problems to try. The Muni T line will take you there easily and there are a lot of tasty restaurants and fun bars in the area for hanging out afterward. The changing area is a bit small, so come already dressed and leave your valuables at home.", "date": "3/28/2017"}
{"review_id": "h7qRMgipRgHrtQ1HZ1oW3Q", "user_id": "D-rKFBb1s4_4vpDA9Wjiog", "user_name": "Michael E.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm a member here, and I like it a lot.   It gets a little crowded here sometimes, and the ventilation could be better, but of the city's climbing gyms, it's the least crowded and most well ventilated.The route setting is usually pretty interesting, and people are nice here.", "date": "7/1/2014"}
{"review_id": "gGmAmiNda0FCWlGoat8cbQ", "user_id": "fWyR4HJvkQZG70LSe8J22g", "user_name": "Kathleen N.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Tap into your inner monkey, this place is a fun mutli-colored jungle! The atmosphere is lively with people tackling on their respective nemesis; everywhere you turn, you can see people helping each other out with tips & sound advice. There were also lots of people just hanging out, sprawled out on the mats. Very chill!I'm a top rope kind of gal, but I gave this bouldering thing a shot. Me + unsecured heights was initially no bueno. I eventually got comfortable with falling onto the cushiony mats. You definitely have to have or quickly develop the \"if you fall, get back up and try, try again\" mentality if you're height fearful like me lol.I'd like to come back and give some V1's and my fear of heights a run for their money!", "date": "6/24/2014"}
{"review_id": "eB2YeOI8N4yB0BH3o-uIuA", "user_id": "ef6LXyHUhfGIbjySzLWAwg", "user_name": "Urvi N.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 0, "funny": 4, "cool": 0, "text": "Plenty of routes so you won't have to wait long to start climbing but the holds are super rough on your hands. I've been climbing at PG recently and was expecting to keep climbing til arms were worn out- but my hands were pretty torn up before I could get to that point. Many of the holds had so much chalk on them, even while climbing without chalk initially I ended up with chalky hands. Also the difficulty variations between different V0s/v1s etc meant it wasn't clear when starting a problem what kind of route to expect. Some super easy others not so much. While I'm all for different types of climbs I wish that their labeling was consistent enough that planning workout was easier.", "date": "9/18/2016"}
{"review_id": "uFRx-bdImoLPtekrminI_A", "user_id": "BwweQ2GkdhNoq7uaZshKHA", "user_name": "Lisa N.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 7, "funny": 2, "cool": 4, "text": "I am a PG member, mainly because PG Sunnyvale is the best gym in the south bay (hollaa!) But if I lived any closer to Dogpatch, you can bet your bottom dollar that I'll be switching gyms! The layout is incredible. There are just so many problems, so many different walls, and so many great holds. The walls are tall, the angles are steep, and the problems are challenging but fun. They try to incorporate as much variety as they can in a bouldering gym, and that includes setting routes that are as long rope climbs (using the YDS to rate). You'll be bouldering routes for so long and so high it'll feel like you're water soloing or something; it's super fun! They've got top outs, stem problems, a killer arch, multiple overhangs of varying degrees, slab walls, roofs, training wall, and a children's play/climb area (it's a castle, how cool!)Day pass for non-members is $20, a price I am willing to pay every so often. Maybe investing in a 10 day pass would be a good idea...", "date": "3/20/2013"}
{"review_id": "OoVY9j6E5KdOBJlzMnO-8g", "user_id": "drS7OQ2AVHZHFoxBrxV6-Q", "user_name": "Joey M.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I was visiting friends in SF + the East Bay and when they were at work I thought, why not check out another climbing gym. I had brought just shoes so I figured I would go to a place that specialized in bouldering. Upon walking in I was pretty impressed, typical fill out waiver, pay for day pass. I needed to rent a chalk bag but I was there pretty early and so the employee let me have it for free. Score! Definite bonus points there, service was good. This place has a lot of interesting routes, and more than enough to keep me busy for a day, probably more than enough to keep someone busy for a long time. I typically climb V2s and have been trying to get a V3 and I felt like I had a lot I could work on here. They had a lot of cool features, arches, corners, and routes where you can top out, which I thought was great. -.5 stars for lack of anything besides boulding, even some sort of treadmill or something would be nice.-.5 stars for the materials of the walls. They were all sandpapery grip texture (is there a name for that?) This is nice for climbing but it really scratched up my knuckles. What can I say, I'm  a wuss.Overall this is a great place to climb, I highly reccomend it, especially if you don't minus my listed cons.", "date": "2/4/2014"}
{"review_id": "0njLNIhs_okqfKV9ZHm0vg", "user_id": "JuhkRE8QwxQe37i1T25Kxg", "user_name": "Melissa D.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best gym for bouldering in the Bay Area. The setters are amazing and thy change out routes really often so there is always something new to climb. Staff is incredibly helpful and knowledgeable (especially ERIK). This is my favorite place to visit for some indoor climb-time and its surrounded by amazing food EVERYWHERE in the area.", "date": "9/12/2017"}
{"review_id": "IV_bqbNq5Fv6zT-LBZpYUw", "user_id": "FXAhhvnsv92tr2OkMd6xcQ", "user_name": "Derrick L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "First visit back in a several months, hoping to re-establish a routine, but giving a single star for the \"early bird\" price special (before 300pm) of an additional $15 for a day pass, for a total of $35 for a day pass. This is a novel pricing structure that is opposite most gyms, that typically provide a discount for using their facilities during off-peak hours.The only reasons I can think of such a strange pricing structure are:1) that daytime staff are unable to handle off-peak volume (about 10-12 people during lunchtime two days ago).2) to encourage early daytime users to return during peak hours to increase volume during peak hours3) to increase peak hour volume4) to discourage off-peak, occasional (less than 2 times/month) gym users5) to discourage visitors6) to discourage families with young children (to take my two older boys, I would now need to pay $105 to give me the opportunity to supervise my two boys climbing) from being customers, who otherwise do not have after-school activities, homework, or home-cooked meals that usually take place during gym peak hours7) to encourage off-peak users to seek business at other climbing gyms (eg Planet Granite in Blemont costs about half ($18) for day-pass during off-peak hours) during off-peak hours.I am disappointed, but am perfectly fine taking my business, and current and future $$$ to non-touchstone gyms. I will update this post if I receive a response to my email to the business I sent a few days ago.", "date": "12/9/2016"}
{"review_id": "SeA9B2U3cIzutHOQDW8YyQ", "user_id": "XvhQQo3EDzg6Gqz8rplVjw", "user_name": "Brittany C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "This place is basically a playground for adults. (Although it's also good for kids: there's a pretty significant kids' section that's fun to traverse and some kid competition routes throughout the space that are very challenging.) According to the website, there 14,000 sq ft of climbing here, and it's all dedicated to bouldering routes! (That means no rope, for those of you unaware of climbing terminology.) Because the place is huge, you won't get bored. There's something for everyone, whether you're a beginner like me or have been climbing for a while. Everyone is friendly and willing to help guide or spot you as you challenge yourself on new puzzles. You also probably have to be more careful climbing at Dogpatch, since the walls are higher than normal and it's a bit dangerous to fall from the top. So look forward to a bit of an adrenaline rush and/or fear of heights kicking in.Staff is friendly and helpful, whether you're trying to get more information about your membership or purchasing/renting gear. Unfortunately this place is pretty hard to get to (Muni from Financial District/Mission Bay is not terrible; anywhere further will be a bit of a time investment) and not near much else, but it's well worth the bus ride (or the cost of Lyft/Uber).", "date": "2/1/2015"}
{"review_id": "q7Ub40BDMIpFO9Xmi8VCEg", "user_id": "FiJw2gPKJEiG9mqTiGsDMw", "user_name": "Henry L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 2, "useful": 12, "funny": 1, "cool": 1, "text": "I have been climbing for over a decade and have competed in USA climbing and have been to dozens of gyms all over the world as well as worked and set for several gyms.I recently moved here from salt lake, and was excited by the size and the geometry of this gym. BUT, they bit off far more than they can chew. the routes are very immaturely set and the cleanliness and refresh of problems is very poor. it's like when someone buys a mansion and doesn't have money left over to furnish or landscape it. I hope they are reading this and realize that a gym this size requires way more route setting and way more purchases of new holds. and way more lighting to enhance the atmosphere. please take it to the next level guys! there is so much missed potential here!", "date": "9/21/2014"}
{"review_id": "Xj_74UWNb3h2T73rO6HMmw", "user_id": "6gRsrxSGwlognf6RrfW5mw", "user_name": "Justin F.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 2, "useful": 7, "funny": 0, "cool": 1, "text": "Came here when visiting friends. The gym is nice, lots of wall space, although the pads are pretty chalky. The guy working the front desk when I arrived was very rude, took forever for him to finish his non-work related conversation with another coworker before helping me, and when I asked if they had any climbing tape he said \"yeah, for sale.\" What sort of gym tries so hard to nickel-and-dime its members that they don't even offer athletic tape? I get that I should have my own, and I normally do in my climbing bag, but all I brought on this trip from the East Coast was my shoes. For being part of a sport that is (in my humble opinion) all about collaboration and friendliness, the rudeness and cheapness of this gym was a thumbs down from me.", "date": "12/20/2015"}
{"review_id": "RcEYt2gVt_XfJWTQyqHMYg", "user_id": "vI2Oc__Y4ehNoO0S_v1QOg", "user_name": "Magda G.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I was able to get a free pass from my friend that has a membership. We went during the day so the pace was empty which was great - lots of different walls to clim on and challenge yourself, from V0 to V7. Little kids area and also some gym equipment as well. The day pass is $20 and you can purchase 10 trips for $180 so it is bit expensive, monthly pass is $75. The mats were very dirty and we had to wipe ourselves after and when I asked the guy working about groupons, he barked at me that he did not know anything about it but aside from that, I like the place.", "date": "4/3/2015"}
{"review_id": "GVx6G9eKiSXXbLhYdaJbWQ", "user_id": "ErhwhyV1GezRFmz7MAjCPA", "user_name": "Michael F.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 1, "funny": 2, "cool": 1, "text": "A fantastic addition to the Dogpatch neighborhood. Good vibes and nice facility. But...Three stars because:1. Setting could be better and changed more frequently. I'd say, \"lacks creativity.\"2. Setting for competitions shuts down half the gym for a week? C'mon guys. That's excessive. I'm all for competitions, but your members are paying a lot of money for access and are being denied. Other gyms set overnight or at most a day or two before the competition....oh, and can all you dingdongs that put stuff in lockers without a lock just stop?", "date": "12/4/2014"}
{"review_id": "efiZsfsS4woj-5fILsNNOg", "user_id": "rVs5Ttf3TcjX952G289c9w", "user_name": "Christina C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "What a fun place and a great upper body/arm workout!Came here for the first time and was a bit intimidated by all of the people who were jumping from one wall nubbin to another! But the receptionist was super friendly and encouraging and soon enough, I was scaling the walls as well :) (only V0s and V1s though haha).Great place to go with friends (or a cute date idea!) and I do want to come back to try some of the upside down hanging/climbing.Bonus: if you come before 3 pm on the weekdays, it's $15!", "date": "7/8/2015"}
{"review_id": "SzAEYTdRl57LJXVn3Xi0Vg", "user_id": "MOjD8gxi4siJ0jl0yM7xPg", "user_name": "Daniel K.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I thought I was spoiled with bouldering at Earthtreks in Rockville. Boy was I wrong. Dogpatch has boulders for MILES. They have high walls, short walls, easy climbs, and hard climbs. It is a boulderer's paradise. The gym is as clean as a rock climbing gym can be with padded flooring (which I hate). The staff are all cool. There's more than enough problems and space for everyone. I don't know what more you want me to say. STOP READING AND GO CHECK IT OUT!!", "date": "7/24/2016"}
{"review_id": "11OVs9QRnI94VGUpYnnAbg", "user_id": "WUY410r4dKhfA9ojp6dBww", "user_name": "Alysha V.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "Great facility! Dozens of routes, catering to all different skill levels and a good mix of terrain. The place is clean and well staffed. Been coming here just about once a week for the last few months!", "date": "1/28/2016"}
{"review_id": "f2TFSLTX2niGmCQnuq36UQ", "user_id": "6mSczadyhSs6d6V2AS_x7g", "user_name": "Jon S.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've been here a few times and it's always a good time. I love bouldering because you can do it alone or with friends, and it's a great workout for your body and your mind! I've been to other rock gyms and gotten a douchey vibe, but I feel like people here were pretty friendly and considerate! Not many wall hogs. This gym is on the pricey side though. $20 for a day pass and no student discounts. In Boston, I was paying $15 with a student discount (or $18 without), but perhaps this is the norm for the Bay Area. There are a ton of routes though with walls of different curvatures and overhangs. The walls have a surprising amount of grip to them which can be helpful if you need to use your foot to steady yourself on the wall when reaching, but is also more prone to unwanted scrapes. While the cost might keep me from coming as much as I want to, I'll definitely be back.  By far the largest bouldering gym I've ever been to, good routes, and easily accessible by Muni!", "date": "1/4/2015"}
{"review_id": "5zGgnNt0tVRZ4v6-h1wMgg", "user_id": "bImetErP_WtFSsbIgg_hDQ", "user_name": "Kitty K.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Dogpatch Boulders has become my santuary. I am extremely new to climbing, but there are tons of routes available for beginners as well as elites. I would give five stars, but some of the front desk staff act as though you're burdening them if you ask questions. Aren't they paid to be available to answer basic questions, or at least field them towards proper resources. Not very welcoming.", "date": "2/24/2015"}
{"review_id": "BftgnSavCNnXoa2dhc71Qg", "user_id": "jIZ9hSbuoqJWghsi4XVuzQ", "user_name": "Adam T.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 4, "funny": 5, "cool": 3, "text": "This gym is rad.  Big walls with lots of variety.  I love all the arches too.  I really wish there was a ladder or some other walk off, down climbing is annoying.   Also, the walls seem to be made out of grip tape or something and will shred your skin up if you fall on them and they are death on your shoes.The ratings are on the easy side, even for a gym, but you're probably climbing to keep in shape and not bag numbers so no biggie. I'd totally give a 5 star review if it was so damn expensive.  $20 for a bouldering session?  Can't swing that on the reg.  Give some student discounts or something, we are poor for christ sake. haha", "date": "1/1/2014"}
{"review_id": "jJtrs8kI15OiK8bWH2Kjjg", "user_id": "zEBXLEkIuy5OQW3VY52K6A", "user_name": "Nikolay V.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This place is *the* place.Prob largest climbing gym I've been to. Plenty of space and route variety (I do go weekend mornings though).Always has the best music--extremely rare for gyms in general.This one time they randomly gave out large bags of granola to the patrons.I also once got a free day pass because of a complex situation that I won't describe in detail that led to me paying something like $3 extra for another day pass. Without me asking for it--the front desk person just figured it out and chased me down to let me know he was giving me a free extra.", "date": "2/21/2015"}
{"review_id": "z_4NmVUo2hyVgM6l9bX4pg", "user_id": "DpQHCZu2qf96KP6thJRqOw", "user_name": "Kathleen M.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "The gym itself is incredible, soooo many boulders.  I love how they have such a variety of grades, so there's something for everyone.  The space is pretty big, and there are walls for topping out.  If I lived in SF I'd definitely be buying a membership.  The one drawback to Dogpatch was the guy behind the counter.  He was incredibly rude, and he didn't seem to be having an off day or anything, rather his attitude came across as condescending.  He was just snippy, and he just seemed annoyed.  Not the type of person I'd want to have at the front desk of a business.  The gym had hosted a comp the weekend before and the first time we went by half the gym was closed for the comp.  the day passes are $20, which I think is steep if half the problems are closed.", "date": "11/23/2015"}
{"review_id": "YGGe78wdw2DmWVuRZ-0G0g", "user_id": "lNxRaIO2wNqMkCcQ8hhtyQ", "user_name": "Kathleen W.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Oh, Dogpatch...for the past few months, I've been a part of an awesome group of climbers that close out the gym on Tuesday nights.  If you stick to a weekly schedule, you really start to get acquainted with the familiar faces - great way to meet people!If you LOVE bouldering, Dogpatch will be heaven for you. That said, bouldering was NOT my first love so it took me a while to warm up to this gym.  The walls at Dogpatch are higher than most (can you say 17 feet high)?  This makes certain top out areas very scary for a beginner climber, but REALLY fun for challenge seekers.  Sick features, plenty of challenging climbs at all angles, and caves...The setters spice up the routes pretty often (I'd say every two weeks).  With such a large gym, there's a little something for everyone...including a fun slide!!!  You must check this out. :]My quick summary -Pros:- Very tall walls- Regularly updated routes- Good variety of technical and physical climbs- Spacious, relaxed layout (choose to watch or climb)!- Kids section- SLIDE!- Friendly staff, awesome people- Close to light railCons:- No parking lot, but street parking is available- Weights/gym area is pretty small- No classes- SMaller locker room", "date": "4/24/2014"}
{"review_id": "RTsGFPS5Ms5CNgF7t21IIg", "user_id": "texSGaQT22qktQqJq3FOlg", "user_name": "Brandon Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This is such and awesome place for Bouldering. It's massive with lots of routes and so many types of walls. I only came here for 1 day for a few hours since I was on a trip but i'll definitely be coming back the next time. They don't have top rope but I also checked out Planet Granite and I felt that the Bouldering here was better.  I did feel that the rating system was all over the place based on the limited amount of routes that I did but I guess they have a bunch of different people setting them.", "date": "12/5/2014"}
{"review_id": "ljI6y5USrAMtsu2Yt0Utdw", "user_id": "hCLGgtfo4bCXOzGNuYHvdQ", "user_name": "Andrea F.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 2, "cool": 2, "text": "Climb, climb, climb, climb, we go climbing all the time, climbing up and climbing left, beating chalk off monkey chest, rollers treadmills by the door, eat a cliff bar climb some more, message hackers using slack, take a fixed gear from the rack, see you bro-gram out the door, round the block and CLIMB SOME MOAR", "date": "9/21/2015"}
{"review_id": "BO9Ygq7p_WP2Q-kPgMH6Wg", "user_id": "fOQvMmLa9LwjRaV1xuUGPA", "user_name": "Margaret S.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 2, "funny": 1, "cool": 0, "text": "Dogpatch Boulders is the largest bouldering gym in the country. Top off area, a bridge and a mixture great big tall walls and shorter walls. The space isn't utilized very well. There's a weenie little lifting site if you squint and a few cardio machines up front.  Bathrooms are tiny but the staff are really friendly and helpful. My friend was informed that adding her kids to her membership would only cost her 1 cent each.", "date": "2/8/2014"}
{"review_id": "HFY7KTvkJLQuxmV9pZm8xA", "user_id": "0Vb2IVR0hOYRfALlpLU-0w", "user_name": "Amar P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Update 3/17/16: Dogpatch Boulders has free Wi-Fi.  So does Mission Cliffs.  The More You Know (TM)", "date": "3/17/2016"}
{"review_id": "TWjNp8ypFjTRNpgZ69KTbg", "user_id": "ywI6YzxkoKyKC2JV4_19Sg", "user_name": "Reg E.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "This place is awesome!!!!!  It's super clean, really organized, and has such amazing natural lighting.  The rocks are clearly labeled and easily visible as you work your way up.Strictly bouldering with padded cushions all around to make that climb with a bit less hesitancy, and to break your unexpected falls.  This establishment offers a degree of difficulty ranging from easy- to not so easy.  First time climbers intermingled with highly experienced; it's definitely a good time just to watch those bring out the \"Spider-Man\" in them.  Dog patch is complete with free showers, little cubby holes to store your belongings, and a little free weight/cardio action.They rent out shoes, and chalk bags also.  I'd go up a whole size - size 1/2 on the shoes, they run a bit small.  Now go get your climb on!", "date": "12/5/2013"}
{"review_id": "TlOESExVaKmcZJXPmgTCTA", "user_id": "jbLwHsY8lpS_v157cNBZAg", "user_name": "Jenna K.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A rock climbing gym for bouldering only?! I AM IN LOVE! I recently took a small group there and we missed the intro to bouldering class by like 45 minutes.  The lady at the front desk offered to do an impromptu class for us and went over all of the basics with us.  The problems are great. There is a ton of space and a ton of problems packed into every square inch of the gym. There are also dyno walls, treadmills and weights.", "date": "12/30/2014"}
{"review_id": "0Xg9yqqfpwRFZe3qAT7Yhw", "user_id": "7wUczg1-5F3JxkZoRxisqw", "user_name": "Emily H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I'm not a climber, but three of my room mates and my boyfriend have climbed at this gym and they love it. It's mainly a bouldering gym but also has a couple machines (elliptical and treadmills).I came in yesterday to take advantage of the $0 initiation fee for January ($100 savings!) and signed my boyfriend up for a membership. The guys at the desk were charming, helpful and all around amazing. Made me feel really good about supporting a local climbing gym with great employees!Also: indoor bike parking!", "date": "1/31/2014"}
{"review_id": "dGcuSlu2lsF6eS3eLhKLnA", "user_id": "Z2JViLOEzLfCnsLwOO1-VQ", "user_name": "Allison T.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "For a $20 day pass, It's 14,000 square feet of on-the-wall fun! The walls aren't textured but with a variety of slopes, overhangs, corners, and positives, it's well worth the day pass fee. There's more than enough wall to really get in a good day's bouldering and enough contours to experience a ton of different problems. It's basically in the middle of a warehouse block. Parking is street parking, but it's two blocks from the caltrain... making it easily accessible. Sundays have people, but you can have a rather large chunk of wall all to yourself. My fav bouldering gym to date.", "date": "7/15/2014"}
{"review_id": "cp7gylA-A8P0o782Uj_x_g", "user_id": "PopQ_2hkWcgswqJGior-NQ", "user_name": "Miss W.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "A climbing review for climbers:Bouldering only. What could be better? I gave this place 5 stars because it is literally as good as it gets, at least in San Francisco. The sheer size of this place is amazing. SO much climbing area. But it still can get crowded in the popular spots. And we all know that it's not the quantity of holds but the quality of setting that makes a bouldering gym. For me personally, I don't use at least half of the gym. But it feels luxurious to be so choosy! The setting is pretty solid. It can be a little height dependent, but that affects pretty much only me. If you're tall and on the slab, yes Adam T., you're right. The rating will feel easy. If you're short you might struggle. Such is life. The holds can be slick, but that's par for the course. They could use a bigger steep cave lower to the ground. I want to climb parallel to the ground for 20 moves. There's nowhere to do that, not even if you're traversing. They have a lot of overhanging walls at about 15 feet, but that's not what I'm about. The gym in general is awesome. I have been 100% impressed with the staff here. They have a good shoe selection, the cubbies are out in the open and I don't worry my stuff will get stolen here. And can we talk about the showers??? Lovely. It has all indoor bike parking!!! But if you come here during the day and try to find parking, good luck to you, sir. At night it's not so bad. What would make this gym complete is a pull up bar. And yoga classes.", "date": "2/4/2014"}
{"review_id": "53KwA41WnkbdEh-CAKgqBA", "user_id": "ZXRj_7cpwq9bOV4RqTwuLA", "user_name": "Ryan A.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 3, "funny": 4, "cool": 0, "text": "Come here for the bouldering; it's expansive and second to none. That cannot be denied.And yeah, I'm gonna be the guy that only gives four stars. Overall the place is pretty rad, but there is definitely room for improvement. A small gym would be nice, even just for bodyweight exercises. And the music? I just don't get it -- a lot of the time it sounds like the soundtrack of Michaels Arts and Crafts, or even a wedding, or maybe a high school sweet heart mixtape from the 70s or 80s. Must be a hipster thing.", "date": "6/17/2013"}
{"review_id": "hJ3qDxXdCVJTLU_nOW_Kdg", "user_id": "S2xFYP8M7AxzxLacDIMgZg", "user_name": "Ryan L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "B*&D#B&*CB&*!!!I freakin' love this place. I've been to a couple rock climbing gyms, but this is definitely one of the best I've seen. They don't have top roping or lead climbing here. It's just pure bouldering bliss.It's a massive warehouse with topout sections and they have really high ceilings. In fact, I saw someone fall from the top and break an ankle or something. Ok, that's not cool. But I like the fact that it's high enough that it actually makes me feel like I'm outdoors. It's not a cramped space at all!They have a lot of REALLY cool problems and features. Sometimes you go to a gym and you are searching for different problems to try and keep finding yourself at the same ones. Here, there are just so many different bouldering problems, I feel like you can learn a lot here.I just wished I had more time to go here! I could easily go here every day if time allowed!", "date": "7/1/2013"}
{"review_id": "O7CZGPoC9N9xRtZdtKgS5A", "user_id": "hGng2Oyq8YhS7l8AzUG10Q", "user_name": "Alice A.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 3, "funny": 1, "cool": 3, "text": "A Touchstone gym entirely dedicated to bouldering!It's big, high (the bouldering walls are up to 17ft high), fun, and challenging.  The problems are spread out across different types of terrain, and for most, you top out and down climb.  There is a distinct feel of  camaraderie shared among boulderers that is cozier than sports climbers and it's evident here.  I like this vibe.  There is a sizable kids section which is great for families of climbers.  I almost wish I had a kid, because it would be so cool to do this as a family activity.  Alas, my cats will only climb trees and furniture.The parking is street parking, which was ok on a weeknight, the locker room is significantly smaller than other Touchstone gyms, but since this is not a full gym (no workout machines or equipment) it's probably going to be ok.  Most people didn't bother using the locker room anyway.  The day pass, if you don't have the membership, is $25 a day, $125 for a monthly pass.  This is another opportunity for me to be glad that I have the membership to Touchstone gyms.", "date": "5/15/2013"}
{"review_id": "bgNQ3Jd5tUqJIRfguMgvFA", "user_id": "irFk4niiXe5iR-C7mgjy_w", "user_name": "Tasha D.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "I am a total newbie, and I really enjoy this place but it is super challenging for me. In the locker rooms I hear the ladies who have been climbing for a while and are really good, and they are always complaining about how there are not enough difficult climbs. However, for me, there are very few I can climb to the top on, and when I make it up there, they often aren't near a ladder or anything, so I have to make it down, too. The first climb I ever did here, I got to the top and then promptly fell off the wall. On the bright side, I didn't hurt myself, and I'm still having fun clambering around here. Love the abundance of bike parking, the friendliness of the staff (and patrons!), and the few cardio machines, too.", "date": "9/24/2013"}
{"review_id": "84vQQCkFqHEENLwxuiBgmg", "user_id": "885qYsn6CKkG53mC_aXvJQ", "user_name": "Sabrina P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Dogpatch Boulders last week for the first time and I was in awe - this truly is a bouldering heaven!The entire floor is made out of soft mats and the gym itself is extremely spacious. When you get tired you can chill comfortably while watching other climbers on their routes. The walls are a lot taller than other gyms in the Bay Area which is awesome because the higher you go, the funner and more gratifying it is when you reach the top. The routes are challenging but not to a point where you give up; they'll make you determined to solve the problem. They also have a big children's slide that was extremely exciting for a 26-year old like myself to go down!After coming here I think Dogpatch has become my #1 favorite climbing gym, knocking PG in the Marina down to second.", "date": "5/29/2014"}
{"review_id": "RW5fvPlP_9V15glkiAUZIw", "user_id": "gdTAebkameev_DQq_NCZzw", "user_name": "Christine W.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time doing any type of climbing and I really loved it! Wish this wasn't so out of the way I would be here everyday! Came here for my friend's bday as she's really into it and wanted was all to try too. My bf is just naturally good at anything fitness or sports related so he got the hang of it quick. No surprise there -_- I didn't get to climb very far but was happy to take my time and my friend was giving me tips along the way. It's a cool vibe in here and there's a good mix of bouldering veterans and newbs like me and yeah there's a great kids section with the slide. The slide is fun you have to do it lol. All in all it's a massive space and there is plenty of room for everyone which I like. Definitely want to check out this place again!", "date": "4/13/2014"}
{"review_id": "HBpfv8GcHTrGkN0yL9HCrQ", "user_id": "HB91NjXLU4oFQdOF8IpDmw", "user_name": "Giuseppe B.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "The gym is great, but please pay attention at your bills if you do a subscription with them. They will keep charging your credit card even if you cancel the subscription. I also tried to contact them through the form on their website but haven't received an answer from them. The fact that the customers service is that bad is pretty sad, since I really liked this gym...", "date": "8/23/2016"}
{"review_id": "yCtvGX3U3Rqc-aeZvl86sA", "user_id": "mey9eKyRZa2SEH0fWrPOtg", "user_name": "L. S.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very friendly staff. Large open space with more routes than you would ever get bored with. We were from out of town and were made to feel at home.", "date": "12/25/2016"}
{"review_id": "N8SZAC5Y0J1Nl8Ts9O8yzA", "user_id": "FoiSlaz-JcYyZ5JBEiVk3g", "user_name": "Rich B.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing gym! Clean and great atmosphere. One of the largest gyms in the nation dedicated solely to bouldering (if you're looking for ropes climbing nearby, try Mission Cliffs - also part of Touchstone gyms).Unlimited Monthly pass is $79, plus an initiation fee. If you're unsure about commitment, get a 10-Pass for 10 visits at any time you choose and try it out! If you decide to get a monthly membership when your 10-Pass is used up, they waive the initiation fee :)", "date": "6/20/2014"}
{"review_id": "25nt8-Ak3o6E_mdF2OF-jA", "user_id": "jaKVT-FrN1UEox3E0-Pw3g", "user_name": "Jonathan H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a boulderer's dream. I've never seen such a large complex for bouldering (over 14000 square feet apparently). Good range of routes and difficulty + room to park bikes, a few treadmills and a small, uncrowded area to lift weights and practice crimping. Free wifi and a spacious lockerroom with showers. No sauna like mission cliffs but it is also less crowded.", "date": "11/18/2015"}
{"review_id": "W38E5hJhHBSzkZjuebxMuw", "user_id": "K6xBcMugJr9-3JRy5siR-g", "user_name": "Quest H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best Gym ever!!! Great community, space for a slackline (although you should bring your own), really awesome bouldering. What can I say, this place is the best climbing gym in San Francisco without a doubt", "date": "11/9/2015"}
{"review_id": "jJQk5FIxOiXq9qlhAgv_ZA", "user_id": "tdfKdI3XJVbR9aawyYVlFQ", "user_name": "Trish A.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Oh my. This place is a bouldering paradise. High clean lines everywhere you look! Problems of every style and variety you could ever imagine. Solid, seamless, hella thick pads to catch your inevitable falls. Great routes from an epic team of setters. They even have a super cute kids-only area, complete with castle fort and slide.I'm not a Touchstone member, but this gym is making it incredibly hard to resist the switch... If it were closer or more BART friendly, I'd be sold! Nevertheless, I forsee a lot of afternoons to be spent gettin pumped on these walls. Love this gym!!", "date": "3/25/2013"}
{"review_id": "RijeTSwOjj8ACRLluX8L_A", "user_id": "iQ2NUK2_E-zQKwvMmmWwkg", "user_name": "Brian S.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The place is HUUUGE!!! Since it is part of Touchstone, all the setting is the same. There are no \"bad\" or tweaky problems; however there are no \"unique\" problems (e.g., pockets, small crimps, or dynos).Currently, there is only bouldering. It would be nice to have weights and training for climbing equipment.", "date": "6/12/2013"}
{"review_id": "HXXfq-jQlJ2j9BJie9cFYw", "user_id": "8HA26oEtIuaYZMqVr0v2Yw", "user_name": "Tim H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time the other day and I loved it so much I was compelled to write a positive review on this place.I normally climb at PG in Sunnyvale, which, I absolutely love, but I've also been to several other gyms for bouldering, including Bridges in Berkeley. In spite of that, Dogpatch knocks out the competition hands down. For pure bouldering, this is the place to be.My only negative feedback is that I wish they one in the South Bay as well.", "date": "10/31/2013"}
{"review_id": "FXNWO-9fSz4vyoo9TW9Z5Q", "user_id": "yM6heLD8YJjMaA1uEL9-kw", "user_name": "Francis B.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A kids section, yes indeed, my oh my.  The kids section is a decent size with walls to climb, a castle and a curly slide.  My son played with other climber's boys, while I climbed on the rest of the walls.  This is a serious bouldering gym.  There are a variety of problems spread out on every wall so it seemed like one could climb anywhere and everywhere.  The walls are high,  15 to 20 feet. They did not feel too high when I was on easy problems, but they certainly did when I was on the harder grades.   I wonder what kind of insurance they have? It is a great addition to the city... a one of a kind place.", "date": "4/7/2013"}
{"review_id": "uwHQpE1YjM9y_8GG31x1SQ", "user_id": "fPIHZA500ZryA3pxgIhKtg", "user_name": "Andrew S.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 1, "useful": 1, "funny": 4, "cool": 0, "text": "Third day trying out dogpatch, i regularly climb v4s.  The walls are too high. Its just plain unsafe to jump or fall from the top 5' so its impossible to attempt anything near your limits unless its near the bottom.  Tried several v3s to substitute, for some reason the routes are not labeled the same.  I could do most the v3s, but none were very fun or creative routes and it was impossible to enjoy being on edge about the height.  Kept looking down to see if it was safe to fall, no fun.  Wont be coming back, maybe that's what the upper level climbers want, as long as it doesn't tax the route setters from keeping up at the reg. Gym i don't care. Plus theres just as many screaming children but only a few climbers to drown them out, and the chick at the desk was playing an ozzy album the entire time, as if to enhance the cool factor but it just got old after the first song...", "date": "7/31/2014"}
{"review_id": "CIhn3mwoz3gQzOghjyCXzw", "user_id": "YLtFYapeVt7h7YVEHfFFPQ", "user_name": "Finbarr T.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Used to regularly frequent Mission Cliffs for the bouldering. I haven't been there since Dogpatch Boulders opened up. This gym is huge and has a vast array of different climbing problems. It's clean and the routes get changed regularly.Parking is usually not a problem either right outside or around the back.", "date": "7/14/2013"}
{"review_id": "EME5S1WS_pCBWUucYLFhiA", "user_id": "BvAVIkX-VV2e6IKZ9M7iPw", "user_name": "Jacob A.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I could spend the rest of my life here. It's expensive, but it's the largest gym I've ever climbed in and the staff are super cool. I'll absolutely be coming back!", "date": "3/6/2015"}
{"review_id": "aHPHrEbPromMlW5Y7zogcQ", "user_id": "XN11xVCEo69YMxFZ_eV8VQ", "user_name": "Brittany P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 2, "cool": 1, "text": "Great big bouldering gym with lots of problems to work on. I really like the variety of the routes. It is a really great place to spend the day.", "date": "1/4/2015"}
{"review_id": "1MyA4oP4fStHXOKKhPQYGQ", "user_id": "V9jDEJ6fJz5k6p0DUc9iLQ", "user_name": "Nicholas L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This review is only for half a gym, as that was all that was open during the two member previews last week.High walls, great angles, well set problems, and top outs. This is as good as bouldering gets without being outside. When the gym opens, there should be over 300 problems set by the same crew that does all of the Touchstone routesetting. If you like bouldering at a Touchstone gym, you'll love bouldering here.One difference in the setting style here is the lack of a finishing designation at the top of the wall. Instead of a tape marking where to place your hand to finish the problem, it is expected that the climber just grab the top anywhere. Perhaps with the greater height, they didn't want to put riskier moves at the end.The walls are high. Taking a fall from 18 feet up can be a little hard to get used to. The 14 inches of foam with seamlessly stitched tarp over it lessens the blow enough to prevent injury, but it still isn't the most pleasant feeling.Besides the amazing terrain, what this gym has over all other Touchstone gyms is two sections with top-outs(!), a center arch (was sadly not climbable during the member preview), and a smaller back wall. Planet Granite just lost its big selling point for me.In my opinion this is the best climbing gym in the Bay Area. For roped climbing I'll obviously be sticking around Mission Cliffs, but Dogpatch is my new go to for bouldering.", "date": "2/13/2013"}
{"review_id": "o4Jy5YuMygq5WH6g1Fdqqg", "user_id": "4-x8fdz1uinLN1DIbPowYQ", "user_name": "Stephanie W.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Despite the slight omniscient smell of feet, I had a great time here. I attended an \"Intro to Bouldering\" class which will be as helpful as you make it and was impressed by the quality of the facilities and the amenities offered (treadmill, weights).", "date": "4/18/2014"}
{"review_id": "JWvnDXxcm-YymQD1x4CPpw", "user_id": "b7Bzz-iSF5r9gwy2fWBDww", "user_name": "K R.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Awesome! Just awesome. When I heard they were opening up, I was skeptical. But they did it right! Huge gym! Open routes. And cool FRIENDLY staff. Great for beginners. You could do V0 for days. And yet they still have the super tricky thinky stuff. Top outs on a lot of routes makes this place just exciting! I'm fairly big on trad/lead. But this place is my new favorite. Hope it doesn't get overrun. Yea, on second thoughtI take it all back. It sucks. You guys stay home. :))", "date": "11/30/2013"}
{"review_id": "JE2r8pFB4VsN7B9Zrzigtg", "user_id": "bve6WCxdUJ2YDKtWfeyU-Q", "user_name": "Adam H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is AMAZING! It's like a giant playground for adults!!!!!! I was in complete amazement the first time I came in, and I loved it so much I HAD to get a membership. All the routes are up for a decent amount of time allowing you to learn them and knock them down, then before you know it they change it up to make it fun and exciting all over again. Love this place and would recommend anyone looking for a great climbing gym to come by.", "date": "5/17/2015"}
{"review_id": "cbSA0w8vvhWRnrnrDLclYQ", "user_id": "Si09sIWjQh3AyXnxiC7xDg", "user_name": "Sam D.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Dogpatch is probably the best climbing gym I've been to: it's spacious and rarely crowded; the staff is knowledgeable; and the routes are varied and fun. There is so much variety, and there's never a worry about running out of things to climb. It's in the city, so was always a bit of a schlep for me, but always worth it. Dogpatch will always be the bouldering gym that I measure other gyms against. Unfortunately, I've yet to find one that measures up!", "date": "3/2/2016"}
{"review_id": "8T1vQYM4-uTEPJ07I2OJbQ", "user_id": "PbaWtLI4UwpIkdVhp92EzA", "user_name": "Meghan H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "This is one of the best bouldering gyms I've been to. Love the open space, high ball problems and the friendly staff. The only downside is they never clean the floors! It's one of the most filthy gyms, my new pants had dirt (not just chalk) and my feet always turn brown. So gross! By the end of my climbing session I hate to put my dirty feet in my shoes because there is no where to clean them off, other than a shower. They should really take more pride in their space and clean the floors.", "date": "3/18/2015"}
{"review_id": "0dolU9mYeGpRknEL_nrGuQ", "user_id": "zESRJzMJkTON3gdCkJYWjQ", "user_name": "Eugene B.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Large and spacious, friendly and fairly priced. Challenging for all levels.", "date": "3/12/2014"}
{"review_id": "8ZZdxfhQSaTrIIfyzz99bQ", "user_id": "Jrg2CYFbVXBdY7wUKp_aww", "user_name": "Dan H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is the best bouldering gym I've ever seen. My only complaints would be that the weight room area is too small and that the locker rooms is lacking considering the place is so new.", "date": "4/24/2014"}
{"review_id": "zK8bORwOj6bhFOionGi13g", "user_id": "XkLK2iBsgqF6mWwDfRgqqQ", "user_name": "Song P.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The height here scares me, because I like to be in a harness.  Still, it's new and spacious, and if you prefer bouldering, I don't know of a better indoor option with higher walls.  There are no weights and no real \"gym\" area, only 4-6 ellipticals and tread mills near the entrance.  I've never had to wait for a machine though.  People are there to climb, and it can be very entertaining just to watch sometimes.", "date": "11/12/2013"}
{"review_id": "deq_6hgueWD_AZZxhJX8Wg", "user_id": "Us_9GNwgcfdCHN4bqgwxTg", "user_name": "Mandy H.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Boulder paradise. Clean, new, massive, uncrowded, challenging. Half block from post-climb ice cream. Can I give six stars?", "date": "9/23/2013"}
{"review_id": "vren8IdWn1n3R_BcGz7xlQ", "user_id": "ImVfDOri1NG5UE5MEmqHJg", "user_name": "Henry Y.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "paradise for the boulderer in a part of the city where parking is free and not terribly difficult. soo many different surface angles to choose from and the high topouts take some getting used to (i still freak out). it's spartan if you want to do anything other than boulder, but that suits me. it would be nice if the passes were a little cheaper, cos if it were i'd go more often.", "date": "6/30/2013"}
{"review_id": "a_Cen0heGcZ2T2r8sc3MeA", "user_id": "fx_oas0OGcUWsAF_jOCx0Q", "user_name": "Paul A.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Touchstone just gets it. A gym just dedicated to bouldering, pure and simple. The layout of the gym is just massive: Slab, Overhangs and straight-up face. The floor is nicely padded so falling off of a 20 ft problem isn't that imitating. A lot of the original crew of route setters have left and they are breaking in new setters. Overall, a great place to boulder.", "date": "3/27/2013"}
{"review_id": "_fOoT8rOS_2hqAa3W4e_Gg", "user_id": "jeH8lPAhuPJOfn8G0XzaKg", "user_name": "Alan W.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I go to Touchstone's GWPC in Oakland most days but decided to stray away from the norm today. The setup of Dogpatch Boulders is great with many intriguing and challenging puzzles.  The space is massive and it's impossible to get bored from repitition due to so many route options.", "date": "4/12/2013"}
{"review_id": "rjdIRWRaMEmVp0iDtsnHDw", "user_id": "2N01swZ5nQuSTDwrF08qMQ", "user_name": "Dan F.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This ain't your grandma's bouldering. Dogpatch offers the greatest indoor climbing experience you can get! So much variety - it kicks my ass every time! ...in a good way :)", "date": "5/12/2013"}
{"review_id": "qMET8D5HgfBLye4Nrq2JCg", "user_id": "WaGqyYi3tsD29ILVy8AEFA", "user_name": "Brenda I.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Oh man, where do i start? This place is bomb diggity! Sweet staff, sweet routes, super sweet soft floor, they even have bathrooms installed now, oh and the space! There is so much space! Can't wait for the thing to be in full swing.", "date": "3/15/2013"}
{"review_id": "pYLdi3X6Pfm8td49rmUPlg", "user_id": "YnT6UYCcwDCoLdEKTMtV7Q", "user_name": "Chloe W.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came to this place because I was excited to see a gym exclusively devoted to bouldering. It lives up to the hype in that it is huge, has lots of options to top out, and as a beginner I was satisfied at the number of V0s and V1s. I only wish my fingers lasted longer! I didn't go for the 5th star though because it was a little dirty (my legs are covered in unidentified black stuff) and I didn't perceive a good gym culture that I look forward to.", "date": "2/11/2015"}
{"review_id": "PTLEyRWXnVg3LaILZM30JQ", "user_id": "DjlOT2cnbimXBAc1nzStKQ", "user_name": "Brian C.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This basically a grown up's playground. I love bouldering and this place is really nice since it doesn't have top-roping. There is a huge variety of climbing walls including a huge arch where you practice your overhanging skills. The day pass price is a bit steep, so make sure to come in with a friend who has a membership. The locker room can be a bit nicer, as it is kind of small and not as nice as PG's.", "date": "11/8/2014"}
{"review_id": "ENpj-PbFblU6lyfntFz8RA", "user_id": "3wqz5ZtM7k96nWxkB0YLjw", "user_name": "Chris T.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This is based on my first visit.  Signing in was easy, I got some loaner climbing shoes and chalk for no extra $.  This is bouldering like I've never seen before.  Huge, varied \"cliffs\".  Overhangs, corners, crevices and even a \"natural bridge\" type feature on the middle rock.  I spent a few hours and basically tried climbing all of the V0 difficulty routes I could find.  Even though these are the easiest routes, there was still a lot of variety and they were challenging for me.  I saw more experienced climbers performing feats of vertical movement that don't fit in with my understanding of gravity.  A day later, as I write this review, my aching muscles are telling me I got a good workout.  Can't wait to go back!", "date": "4/18/2013"}
{"review_id": "YdECsb82f7Y8rOEDNRKePw", "user_id": "NgbwCP9D7NwigoHAa-Txyw", "user_name": "Kathy L.", "business_id": "ecoN_Wu43bsU3MZbJRZEhg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I'm a very occasional (read: maybe a few times a year a tops) / beginner climber but I will be going more often now that this gym has opened in my neighborhood. This review is for the beginners out there... Each visit is $20 and shoe rentals are $4. If you don't have a recent waiver on file, you'll need to do that and bring your ID. You're supposed to watch a video online, but other than that there's no test of anything. At Mission Cliffs, you have to know how to tie knots, secure your harness, belay people etc. Here, there are no harnesses. The walls are quite high IMHO so if you fall and don't fall properly, I could see it being a bit dangerous. I personally find it really fun though if you take your time and know your limits and don't push yourself into a situation you can't handle. It's also really interesting to watch other people \"solve problems\" and then trying to figure things out on your own as well. The levels go from V0-V8 with V0 being the easiest. However, I have found not all V0s are created equal... there are parts of the gym where you are meant to / or can climb on top of the structure and then take a ladder down. The staff is really nice (shout out to bernard who to took the time to give me some beginner tips) and welcoming.", "date": "3/24/2013"}
