{"review_id": "1M16BwkuMrKRzIMFe8EE7Q", "user_id": "5E05eZELK0WX07fZOO4LkA", "user_name": "Alistair M.", "business_id": "ycO-JTtTUmVlICz5e0QZfg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Updated 12/21/2015:Staying true to my word, I'm giving them five stars. They fixed the lighting issue and it is a great place to climb. They are renovating a large portion in the back corner, so some of the routes are limited. The gym has amazing potential and is a very comfortable and fun atmosphere to go climbing. I highly recommend it to anyone who is coming through for a great climbing work out and experience.", "date": "12/21/2015"}
{"review_id": "L2nXpRwAkYy1BTHScf-_jQ", "user_id": "fHThU6VFrvW-qDNO_-QqYA", "user_name": "Brandon R.", "business_id": "ycO-JTtTUmVlICz5e0QZfg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great bouldering facility. Pleasant and helpful staff. The climbs are challenging; no soft grades as are usual in southern California. Great spot to get a rainy day climb in and meet some cool locals.", "date": "3/24/2018"}
{"review_id": "_dp0XNefJUg3u4lzuNpxeA", "user_id": "Du3q-roghYoQEJttfUW4Yw", "user_name": "Nu X.", "business_id": "ycO-JTtTUmVlICz5e0QZfg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place is awesome! Good place for a nice workout without it being too crowded. There's a small section of weights for use as well. Nice building, although the mats could use some cleaning. Clean bathrooms. Routes are clearly marked and staff is more than willing to help. Climbers I meet here are always really nice and would give you pointers. I would come more often if it wasn't so expensive. (I think I paid $13 for shoe rentals and for one day of climbing) But they also have packages and memberships and it helps if you come early in the day to get your money's worth. (Although I usually gas out after like an hour.) A really cool place for Arcata overall. I hear it's under new management. Excited to see the changes, although Matt was a really cool guy.Update: prices have gone up but the membership prices are extremely affordable!", "date": "2/12/2015"}
{"review_id": "Cs6Z5cy9dPTWFFAdwHCLbA", "user_id": "pdBo5X-_YB-1cXHe-F90EQ", "user_name": "Michael L.", "business_id": "ycO-JTtTUmVlICz5e0QZfg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "This place is a trip! Climbing gym and music venue rolled into one! I don't climb much, but this was a great place to learn to boulder.", "date": "11/8/2012"}
{"review_id": "t6N02GORd6vG-wo2VFDXpw", "user_id": "tbh4tNy7MsA95gKOOI2YOg", "user_name": "Dan W.", "business_id": "ycO-JTtTUmVlICz5e0QZfg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "This is an ok to great climbing gym, it all depends on who is staffing.  I think it is largely run by volunteers, so you never know what you are going to get.  The facility is great, so that is all that really matters as long as the staff don't get in the way.", "date": "3/8/2014"}
{"review_id": "k7YfwdWPPBlsMm4i6Xg7JA", "user_id": "9nsOJeveLJmMyDCayF5CHQ", "user_name": "Matt M.", "business_id": "ycO-JTtTUmVlICz5e0QZfg", "stars": 2, "useful": 5, "funny": 0, "cool": 0, "text": "Dirty, poorly maintained, terrible parking, dirty shoes and no staff on duty.  Routs are not rated or marked well at all.", "date": "1/7/2014"}
