{"review_id": "tJAnAI3IotvGGG-yH2UiEQ", "user_id": "ZnSa8MY5bXm1d_16V5TKfg", "user_name": "Elizabeth I.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Great place to climb!  I am short and some gyms don't get how to set challenging but doable courses for the height restricted.  Not this place!  I always get an amazing workout!  Staff is friendly and it's always clean too!", "date": "4/18/2019"}
{"review_id": "aZkrGsUZaJo4OvqkU2P5Ow", "user_id": "75Lr7OI851GUqbJn9Qm_EQ", "user_name": "Belinda B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I went rock climbing here and had an awesome time. The people working there are chill as well as the members that go.I climbed four times. Felt really sore after wards. Definitely a great work out. What I like about rock climbing the most is forgetting about life and figuring out how I'm going to reach the top. Great activity to let go of your stress or worries and feel victory.  I heard it's under $40 bucks a month to join, I cannot afford that, but if I could I would be in there three times a week Definitely recommend to try it out and have fun!", "date": "7/10/2018"}
{"review_id": "J8Z9Q2Gne5hyqVX4Ip08Pg", "user_id": "rT024OojWoPY_zsinrkT7w", "user_name": "Marya J.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super nice staff.  Huge place. Lots to choose from.  Kids loved it. I would definitely go back there. It was the perfect temperature in April however I would imagine that it gets pretty hot if they don't have air conditioning in the summer lots of top rope opportunities and bouldering.", "date": "2/14/2019"}
{"review_id": "cU6dkmPGIvBDi43w3lkXtw", "user_id": "f316qB5gt2pP84dYOSp8qw", "user_name": "Francis D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Small yet dense climbing gym.Large variety of bouldering problems along side a huge selection of auto belay, top roping and lead climbing.There's a dedicated training area on the second floor as well as a nice area to sit and lounge.The staff are SUPER friendly! Very knowledgeable and great to chat with.Parking is ample.", "date": "9/29/2018"}
{"review_id": "OhiNPLWULUfJGkupWD2u5A", "user_id": "sPK_Jdes7q7l3IQYKwoIdA", "user_name": "Roy And Kita L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Very dark, not as welcoming as the east riverside facility.  We were told this facility doesn't work with school aged kids when we went in but when we went to the other location as directed to do so by this facility we were informed that with our membership we can attend any of the 10 hanger 18 facilities available so there was a bit of misinformation there. We will continue to use the other locations but will probably not be coming back to this one.", "date": "3/14/2019"}
{"review_id": "e0Ne4AdW11VWKN_yysUMDw", "user_id": "DU0GQ88S5czT_79pQJMueg", "user_name": "J C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "They cut the youth climbing program, yet continue to host youth comps. They have made it nearly impossible for the youth team to continue to train.", "date": "2/24/2019"}
{"review_id": "AUekoy1VET2NX6-ai5nk6w", "user_id": "Sm546-z7mswBRnStKPmKEQ", "user_name": "Shareen D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Purchased a Groupon to go indoor rock climbing since I had never gone before and my friend and I got the one month membership passes. We came by on a Sunday evening and the guy who helped us was really friendly and informative (he has dreads and I don't remember his name). We were covered for our shoe and harness rentals since it was our first day and he taught us where and how to start. We tried the auto belay ropes since we haven't taken our intro classes yet and it was hard but a lot of fun! I did some light bouldering as well and I can't wait to keep going because I definitely want to get better at it. Also I anticipated this place to be a lot larger but it was spacious enough and not as busy thankfully. Update: after trying out the location off Iowa, I much prefer that one. The vibe is different, more people, more music, more friendliness. This one seems quiet and dull at times.", "date": "1/22/2018"}
{"review_id": "porOsBWx-6goFcIm5VCd4Q", "user_id": "Qus5dFRcTWJ7qLYlpIkp1Q", "user_name": "Lindsey A.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've gone here off and on for the past decade or so. Great place. Staff is always helpful and friendly. It had been a while since going due to me getting pregnant and then having a baby. I'm actually due to have another one, but I wanted to take my niece here for her birthday. Super awesome...they have full body harnesses so that I was still able to belay her. They have an array of climbs: top belay, autobelay, lead climbing, and a bouldering wall.  I recommended going, but not at peak heat on a hot day. It's well ventilated, but there's no a/c.", "date": "7/17/2018"}
{"review_id": "31OPYaOhyckGkpO3UY3a3A", "user_id": "zDatrdwTbW7bACokUsqaTA", "user_name": "Joe B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "We went here for a group event in summer of 2017.  It was miserable due to the AC being \"broken\"It was 103 degrees inside the party room and there were 3 pregnant women , including my wife in the room. Fast forward to 2018, we were going to book another group event and asked if the AC was working and were told it was. Surprise surprise , it wasn't working on the day of our event. We were told it had been broken for weeks. The excuse was that someone was called to fix it but never showed up. I understand things happen . The staff tried to remedy the issue by placing a bunch of fans inside the room. We turned them on and blew about a pound of dust all throughout the room .The fans sort of helped but what really rubbed me the wrong way was the owners inability to ensure their facility is maintained .  The climbing was excellent, I would really love to get my daughter climbing regularly, but not until y'all get some damn A/C. There were several parents who agreed  if the ac was working, they would bring business back to Hanger 18.", "date": "6/3/2018"}
{"review_id": "lexlk3GkTJ8hie3p1prbwg", "user_id": "f9PjYTdo_PRv6gBPkh2QfA", "user_name": "Rich L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym with plenty of bouldering and top roping options for all levels!! The staff is inviting and accommodating, which is a plus for first timers... too many climbing gyms I've experienced are intimidating and having a disinterested staff doesn't help people feel welcome. Would recommend this place to anyone interested in trying climbing or those looking for a gym to call home in riverside.", "date": "2/4/2018"}
{"review_id": "9vtgmLADr1BkUtdmVmGyhw", "user_id": "ANLMH6KUVB6gLeIC045veg", "user_name": "Tessa S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "We came here for the first time when we got invited to a birthday party. It seems like it's still under construction and really dusty in the rooms where the party was. But they have so much more to offer and really fun for kids. The staff are very helpful.", "date": "10/4/2017"}
{"review_id": "m_V6VCJdjpSVagk9fpovMg", "user_id": "WWWdcPZIRKE531P7wXWaDw", "user_name": "Chuck P.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Kids loved this. Couldn't get them to leave. They had never done this and loved itPeople were patient and helpful even though very croweded Some kids sighed up for memberships", "date": "11/25/2016"}
{"review_id": "ow9HDDKj9reZLzhKp-8M1g", "user_id": "Fg-rszz6WZmhRwGQu05YOg", "user_name": "Kyle N.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! I came here never climbing before wanting to originally just lose some weight. Now I find myself loosing weight I order to climb better along with truly finding a passion for climbing. The facility is very clean, the music is always on point and the staff is awesome!!! Especially Kyle and Daniel. They both are very experienced and always willing to help you out and \"show you the ropes\" (pun intended lol) they are always swapping out routes every few weeks or so so you never get bored. The only reason I give this 4 stars is because I wish there was some kind of onsite water fountain and a few more fans in order to keep the air circulating and I wish Kyle and Daniel could have more work hours because they deserve it and then being there truly makes your climbing experience a lot more enjoyable and a more sociable time! Other than that this place is awesome!", "date": "5/5/2018"}
{"review_id": "sNzERY7mCZ0bFE3q1TnNCg", "user_id": "dBiLqiNaEOIM5a3U8u-wYw", "user_name": "Jeanette C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Got the Groupon special for our three boys & wasn't let down! Arrived and the girl at the desk was really busy and said it would be a while, but Bobby came out & handled everything! Not only was he checking people in & out, he was showing how to climb, what to climb, & never seemed annoyed or to busy for our boys endless questions. It's my turn next & everyone wants passes so awesome job! Just because you use a Groupon doesn't mean you won't become a regular.", "date": "3/27/2018"}
{"review_id": "gaur0x4PUR_hX4s6hDj74w", "user_id": "QE42hl9EsOwnESM5G_SWWQ", "user_name": "Sarah R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Super chill gym. Staff is super nice and helpful (shoutout to Alexis!). The atmosphere is so much better than other bigger gyms that feel ego-ish sometimes. Just wish the walls were a bit taller but still great bouldering.", "date": "10/14/2018"}
{"review_id": "ZLWs15ltQdESrQyNvo3Nfg", "user_id": "Gqdykv1mSGCwv8g-AaAytw", "user_name": "Andrew T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 21, "funny": 7, "cool": 6, "text": "Never has it been so easy for me to switch an almost 5-star review to a 1 star review.I HIGHLY recommend avoiding this place at all costs. There are other bouldering gyms in the Los Angeles area and no need to put up with the unacceptably rude and unhelpful staff at this Hangar 18.I actually only came to this place twice, once for my first visit and once more to cancel my membership.Both times, I spoke to the same extremely rude employee, who not only was really unhelpful and attempted to charge me a full monthly membership charge, but gave me attitude when I told her I called ahead about the Tuesday special and student discount. The gym itself is still a solid bouldering gym, but the attitude of the people here was just ridiculous. They literally could care less about their customers, and although the gym was almost empty both times I came to visit, it seemed like the staff would rather do anything EXCEPT help me.They also gave me an incredibly hard time when I tried to cancel my membership, but honestly, the icing on the cake, and what really nails in their 100 to 0 review is the fact that the staff member I was talking to was a total jerk and asshole about everything.", "date": "8/19/2015"}
{"review_id": "zRcXqHWBiKurBpDWEpgssw", "user_id": "Ep2wHj694ebGuwAsZIk6gw", "user_name": "Chanica V.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 5, "funny": 4, "cool": 3, "text": "I first started rock climbing in college because my friends were fanatics and always did it so they invited me to go with them one day. A plus about the monthly membership is that you have one free guest pass a month so it's good to introduce the sport to those who haven't tried it. Also you can get free shoe rentals. After the first time climbing I ended up really enjoying it and purchased a Groupon for a two month unlimited membership. It was $53 for two months which is such a good deal because for students its $33 a month. They always have random deals on their website like two for one Tuesdays or $5 for a month of membership so be sure to check that out before you sign up! The staff is super friendly and the people that come here are really respectful too. I enjoy coming here in the afternoons because it gets pretty packed at night and you have to wait for people to climb so you're not all over each other. I liked that they started to purchase new rental shoes because the old ones started to get all stretched out and stuff. They have a lot of locations and it's nice that your membership gives you access to all the locations. If I lived near one of the locations I would definitely renew my membership but I'm about an hour away from any of them. I have only been to the Riverside by ucr location and the one in upland and I definitely prefer this one on Arlington.", "date": "7/9/2015"}
{"review_id": "TqjC2cHfhiWmcxBtxVAmgA", "user_id": "InBOInNAYhIk1ZHRJfb2NQ", "user_name": "Karla S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "My son loves this place. Thank you for taking the time to teach us and for making us feel welcomed. We love coming here at least twice a week.", "date": "8/8/2017"}
{"review_id": "seNm-UpRjUl6-3S_eX779A", "user_id": "HlH3QgbOInPckYtmUKft2A", "user_name": "Ashley B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Definitely the largest and best Hangar 18 gym. The staff here is great! They have a small gym upstairs, a large bouldering section, and a ton of rope routes for you to enjoy. There are a couple of auto belays if you don't have a partner to climb with also. The route setters are good about resetting often but the gym can get crowded during week nights. The people who climb here are chill though. Not 5 stars because again they refuse to use their air conditioning.", "date": "9/28/2017"}
{"review_id": "8FmTj_QhXE6dg30vC4SaAA", "user_id": "G1NAzWyjo1NKKg3mArnvxA", "user_name": "Tisch H.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Cool atmosphere, nice staff that is willing to help out first timers. The friendly staff made the experience non intimidating. Great workout if you want to break a sweat and try something different.", "date": "5/2/2015"}
{"review_id": "QSSdHKqpEvq2oVuFfauU5w", "user_id": "E6Ym0-9dokp1b9C_yM3Omw", "user_name": "Miguel A.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was amazingly great and it's a good place to start if your a beginner like me, the have different levels of rock climbing, it is a great work out and I recommend for all ages, have fun make the moment count and over come your strength in challenging yourself in life", "date": "2/18/2018"}
{"review_id": "ZueIg4moqUrEmnKPdM6ShA", "user_id": "tBPYl_amYeVKYjyG6cEq9A", "user_name": "Morgan D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "A word of warning: Call before you go!I've been climbing here a few years now following the unfortunate buyout of Thresh Hold (RIP) by this chain. The customer service I've experienced here is consistently underwhelming, but rarely does it actually interfere with access to the climbing itself so I've never felt the need to call it out. Today was a different story. A friend and I drove 30 and 45 minutes respectively each way to meet up here and climb at the time we typically do (6 pm, two hours before the advertised closing time on Saturdays). Today we arrived there only to be told the second we walked in that they had \"decided to close early for the day after the competition.\" We didn't get to climb a single route.Yes, they had a competition there earlier today. Yes, they'd posted flyers about it several weeks in advance. Nowhere on any of these flyers did they state that normal operating hours would not be in effect after the competition ended at 4 pm; in fact the flyer posted to their Facebook page stated the exact opposite - verbatim, \"The gym will continue normal business hours after the competition at 4:30 pm until closing.\" I'm so bummed the Hangar 18 chain is the only place to climb indoors locally, or I'd be taking my business elsewhere in a heartbeat. Will now be calling them for business hours every day before I leave to climb here, and highly recommend others with any sort of drive time do the same.", "date": "4/30/2016"}
{"review_id": "AMQY1g6Kt8U3Kr_DcSSV1Q", "user_id": "OSyC5DYQ_7UBdn12SkLdgA", "user_name": "Angel S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I absolutely LOVE this gym! I have been going here for almost a year and am much stronger now than when I started. Probably because I enjoy the gym so much... I usually go a few times a week The staff is super friendly and helpful and the gym is always clean. Fellow climbers are pretty cool and happy to lend tips when needed. I have gone to other Hangar 18s as well as other climbing gyms and this one is by far the best. Highlights- Plenty of bouldering walls for all levels- Lots of rope climbing walls to choose from, straight, slopers and everything in between- 4 auto belays that are on dedicated auto-belay walls meaning you can climb without someone deciding to use a rope that overlaps your route(s)- Staff is extremely knowledgeable and fun - Clean - Even when crowded, there is still room for everyone to have a good time (little to no waiting) - Lots of classes to choose from, a lounge area and gym", "date": "1/27/2016"}
{"review_id": "LdP4d8W22AoYEraCv7Y59g", "user_id": "rK7SGbL268sHrmz_Upldkw", "user_name": "Zoe O.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "SO happy I joined this gym! The staff is very helpful so I don't feel as intimidated when I'm trying harder walls. This is definitely one of my favorite hangars because of the selection of top rope walls and bouldering walls. I highly recommend taking the belay class as it opens up so many more options. There are options for every level and for kids too! With your membership it also includes yoga. I definitely recommend trying this gym out and if you have two people do two for Tuesday! Sammy the manager was super helpful and knowledgable. Ian our Belay instructor was more than willing to answer any questions to help us out.", "date": "10/19/2015"}
{"review_id": "ipPLNZAiszoFaiwbNE_ZIA", "user_id": "lKe8XYD2pBgqCvGduZb7Kg", "user_name": "Christi M.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Had a great time!! Our instructor was Matt, he's really funny and helped us out whenever needed.", "date": "2/20/2017"}
{"review_id": "sSOehjrd1nUB1KcRsdO9OA", "user_id": "-Odl0bdaHtlNVlwXvhdbdQ", "user_name": "Jeff W.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I have had a membership to Hangar for a couple of years now. There are 5 gyms for one price. This makes it very convenient to climb anywhere in the LA basin  I do wish they stayed open a little longer on the weekends. For bouldering H18 Riverside learn to play add-on if you need to progress past V3. Sets are all over the place. They recently got rid of their free shoes/harness with membership deal. So bring your own gear. Also they often have specials that are better than the membership prices so keep on the look out.", "date": "5/31/2016"}
{"review_id": "VLfHL_TZ7tb0FLHR57b3lg", "user_id": "SOrFqdGUThpQJzZ-SLrRuA", "user_name": "Maria K.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Great staff!I had zero experience when I came in. I was nervous about learning all the technical stuff.Ian helped us sign up and taught our belay lesson. He was really great! He was clear and direct but also really nice about making sure we got something right if we were having trouble. As the night went on, he was happy to explain things and answer any questions we had. All of this made for a friendly atmosphere.", "date": "11/1/2015"}
{"review_id": "sn0TOwxs6X4zwnL6QJ_eVg", "user_id": "ykxWLQvQB0gyxK3l9Tuhig", "user_name": "Anthony N.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "First time here and its greater than other places i tried out.  Must come and see to believe", "date": "12/3/2016"}
{"review_id": "phj1yKVQYt1cW77az2l1nA", "user_id": "fDqIijPYpagyHsZBBlTztQ", "user_name": "Michele S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I am absolutely impressed with this gym!  HUGE selection of rope climbing, large leading area, and a very nice bouldering area as well.  Staff seemed nice and helpful, too.  I look forward to visiting this place more often!  (Also, they played some great music while we were there!)", "date": "10/22/2016"}
{"review_id": "PE5OKuijRbbjNG5mCL3QSA", "user_id": "ColDXHcye16a3kym9W6n6A", "user_name": "Josh I.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've been climbing on and off here for about 4 years now, this place has improved a lot! For the better of course! They added a fitness area up stairs with plenty of classes you can take. The vibe in here is real chill! People are very nice. Very helpful weather if it's helping you with a bouldering problem or belaying you. The employees have changed in the past couple years too. I miss the old guys that used to work there, like Javi and Jake! Super chill dudes! The guys that work there now are pretty cool. Very stern on applying safety rules which are very important in the Climbing gym. The problems and routes always change! Keeps you on your toes so it doesn't get so boring climbing the same routes over and over again. Overall all I love this gym! Theirs really no other climbing Gyms Is rather be at then this place!", "date": "1/26/2014"}
{"review_id": "DAJKMQP8K3ruu5jPLkAI8A", "user_id": "1Rple7qozle5E9TYiaCojw", "user_name": "Moni K.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Neat place. My kids and I love this place. Great staff. They are very friendly and very helpful. Went out of their way to make us feel comfortable. Very courteous. Totally recommend this place.", "date": "8/1/2016"}
{"review_id": "Gq_SXpNS4EDaav_AU7vq0A", "user_id": "2Dzdq8nmh_47A5BD9hMfHA", "user_name": "Vanessa F.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "I haven't been to any other rock gyms but I sure do like Hangar 18!!!This is place is great. Huge space, a variety of people here. Great climbing routes & they even have bouldering here too! I love the staff too. They are really helpful and very chill. It's easy to go up to them and ask them a question. Very knowledgeable and always willing to give you tips. I like the climbing routes and how they have colored grips so you know what path you're on. You can belay with a friend or climb by yourself (they usually have 2 auto-belays set up). Or you can try bouldering!! It's a very versatile gym and I really enjoy coming here. Price is reasonable and is an all-day pass if you have time to return later. They also have Zumba and rock climbing class too!", "date": "11/20/2012"}
{"review_id": "u2LJZUfWJIBbTz4CzH4m3Q", "user_id": "mkDI5nzTAxAgP0QxN9Nf8g", "user_name": "Joel A.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This isn't the first place I've rock climbed but it IS my first home to learning the basics. I talk to new people every time I go, and make pretty good friends on the spot.  Climbers tend to be happy, healthy and positive so it's hard to have a bad experience here.  The staff is friendly and helpful so don't feel like an idiot asking questions.  They have competitions here occasionally and I see what I call \"pros\" practicing and amazing me of physical strength.  What more could you ask for at $28/month? There is a typical gym here also, but who cares when the stimulation derives from the infinite number of puzzles the bouldering and top roping offers. Get in there and climb, and repeat at least 2-3 times a week or month.  You won't regret it!", "date": "10/10/2014"}
{"review_id": "Dpsan6UsuDJCGP6HOzRIww", "user_id": "pQORsjUiMwEWxR7snbuwOA", "user_name": "Lindsey J.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "I received a sincere apology and a comp offer from management recently so I'm changing my rating. Seems like there was just some confusion among employees over policy!", "date": "5/19/2016"}
{"review_id": "we_Zmqf-gNXyM8spCi0LuQ", "user_id": "ClV7ubJ0gLYGtEPo7lLTcQ", "user_name": "G G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Facility is clean and always changing climbing course.  My kids and their friends always have so much fun when they r there.  People in the front are nice, knowledgable, and helpful.  Sunny is so patient and made us feel comfortable balaying our kids.  Many different courses to climb as well.  We like!", "date": "1/23/2015"}
{"review_id": "5R2wY2xqQ9wA0Mp1aIfq9w", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I absolutely love this Hangar 18 here in riverside! It's my main gym I climb at. The gym itself is probably one of the best for the Hangar 18 gyms. There's a ginormous boulder alone for bouldering. There's certain parts on the boulder where you can top out and other places you have to climb down. The walls spread around almost the entire gym with plenty of routes for top roping and a section alone with overhang routes for lead climbing. The climbing community is great. The great thing about getting into climbing or climbing as a regular is that you'll always meet random people climbing there that are more than willing to help you out. I've made so many friends there that every time I go I'm always bound to run into someone. Lots of friendly climbers, I climb with a lot of my friends and the staff are always super friendly and easy going. Everyone pretty much is willing to help (everyone going towards staff and regulars). Great place overall. Membership is a killer price, shoes and harness always included. It's super cheap monthly and if it's something you're willing to get into, it's definitely a great deal. They have different classes and lessons for members as well. Overall a fantastic place to climb and be at to learn how to be a stronger and better climber.", "date": "7/24/2014"}
{"review_id": "3YMFOsnlM2tuNW6RAwTang", "user_id": "UUz7pG3pC1341H0T73DOaw", "user_name": "Sandra S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I loved climbing! this place is big enough so even if you go when there are a lot of people you will have plenty of room to climb. I came here with two friends who are experienced and they showed me everything I needed to know. It was so much fun! I recommend this place to anyone interested in climbing. There is another Hangar 18 in Upland but it is a bit smaller.This was my first time here and I was not sure what to expect. Let me tell you that I am afraid of heights, but once you go up the first time, you will forget about your fear of heights!Overall great experience, the staff was very chill and friendly. They have different levels of difficulty which are numbered. The lower the number means its easier, and likewise the higher the number means it is more difficult. For my first time climbing I did pretty well, I got up to 5.8. You have the option to do bouldering which are the shorter walls and you don't use any rope. This is way harder than climbing with the rope becuase it requires mainly upper body strength. I only did bouldering once going up the easiest level. It was a great workout so be prepared to sweat and feel sore afterwards!", "date": "8/16/2014"}
{"review_id": "n_5KN0aJ_gVEDmJiZrCuFQ", "user_id": "zy4uTygjTL2KV2BfXrkUqA", "user_name": "Patrice T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 4, "funny": 1, "cool": 0, "text": "When I first started climbing I loved this gym and it is a very solid gym. But when it comes to the employees and customer service is where this gym fails. Especially one employee that just has the most negative attitude and even some what harasses and picks on climbers. I signed up for the membership a couple months back, being informed that being a member of this gym there are free rentals that come with it. Until one day I came and that same employee that always has something to say tried to charge me for shoes and charge me separate for harness. I explained to him how when signing the contract I signed up because of free rentals. He denied me and then pulled out my contract and forced me to sign that I have to pay for rentals, which he wrote in pen. I'm not saying all the employees there are like this, some are really awesome people, but a couple have just the most horrible customer service. Also with their new membership plan rentals are not included which doesn't make any sense when your paying over 30$ a month for a membership.", "date": "8/30/2015"}
{"review_id": "waJQLFUBaAbEV_wpVQ-Viw", "user_id": "FoLNHj5MDMXABwIVe06GgA", "user_name": "Stan V.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "The managers customer service could be better.  Fun place to climb and nice environment.  My son and niece are beginners and its a good place to learn the basics.", "date": "1/6/2016"}
{"review_id": "FMdW-BSbMoBLbebCJ6I5nA", "user_id": "FJfX6WP5Ns5nZEhifJzYDg", "user_name": "Thomas W.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "I started my climbing experience here and have been coming regularly since March '15. The atmosphere is great and most of the staff is very friendly and hands on. As I progress , there never seems to be a shortage of more experienced climbers who are more than willing to give tips and to climb with you. In my experience, the staff will help when approached. The reasons for four stars and not five , are only a couple things. The music: unless you bring headphones, you are subject to the tunes picked by the current staff; mainly using Pandora. Ex; as much as I love Frank Sinatra and hip hop, some styles may not always be condusive to a climbing atmosphere. The holds: are disgusting. Granted, it is climbing; which is expected to be gritty and dirty at times. Unlike outdoor rocks however, there is no natural ecosystem bringing in fresh air and naturally cleaning the holds. Finding caked on sweat and dried blood can make it hard to concentrate on a climb. Not to mention the overwhelming smell when up close to a not-so-new climb. I know they power wash the holds between sets, but they get pretty bad in between.That being said, I must say the rate at which they switch out routes is impressive; always something new every couple of weeks.And lastly; I tried yoga for the first time last week and loved it!!! It was very challening, yet fun and positive. Valerie was obviously a pro yogi and excellent instructor. No pressure to do all the advanced moves, though you can try.All in all; my favorite place to climb. Many friendships started here!", "date": "1/15/2016"}
{"review_id": "2lfNKU6X5sWuR_lWi-selw", "user_id": "MBvC-NkoMUbN5Kh9BWr8NA", "user_name": "nancy r.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 5, "funny": 0, "cool": 1, "text": "I drove 1 hr 30 min to climb to this place since my climbing gym was resetting routes for a comp. Drove out here and the place looks pretty neat in a small business area. Bouldering area is set up in the center while all the belay/ rope climbing is outside. Immediately tried some problems and the grades are pretty good. Only gripe about this place is the lighting. Some of the routes/problems are hard to see especially when there are similar colored holds ( ie, brown, orange)  next to each other with a yellowish light. A bit stronger fluorescent light would be great around the cave.Some holds were incredibly slippery without much texture while some others were really good. Love that the entire area is cushioned so you don't have to worry about getting hurt.Other than the lighting  it is cool but upgrade the holds and this place could be better. =]", "date": "9/30/2013"}
{"review_id": "K6dyWGgzRbgCkvecRXQ56w", "user_id": "ZBR4cWZpe7t3Zr7AIlxADA", "user_name": "Nathan H.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I keep seeing all these bad reviews about the staff not being helpful. That is the most ridiculous thing I have ever heard. I joined a week ago and  i am new to climbing so I don't really know what I'm doing. Anytime I am confused with how to get up a wall or just what gear to buy the staff has always been extremely  helpful. Yesterday my fiancé and I took the belay class with Ian. We could not of had a better  experience or teacher. He was so knowledgeable and helpful. Not to mention  he is probably  one of the nicest people you will ever meet. So to sum it up this gym is amazing I recommend  it to everyone.", "date": "10/17/2015"}
{"review_id": "0qo4ch9fpp6P7uxkh0itTw", "user_id": "UTs5d0Ts0XkFzlK5GLRCFQ", "user_name": "Lori S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place! The staff was very helpful and patient with me. I'll be back to improve my climbing skills.", "date": "3/19/2016"}
{"review_id": "vtvKZXR8lTL0JHPI95u8Zw", "user_id": "L0w392bA7gpWdPZVGFOQvw", "user_name": "Ariana C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 4, "funny": 2, "cool": 1, "text": "Great space to climb and below-average prices for membership and rental. A semi-frequent climber and sometimes-climbing-instructor, I was looking for a gym in the area to join. However, after a couple visits, I would have committed to a membership if it weren't for the actively vicious front desk staff and instructors. Every single person at the front seemed to go on the offensive as if asking to sign in and get equipment was something I didn't deserve. Later on the walls, I eavesdropped on a youth climbing class where the woman teaching was condescending and unnecessarily impatient with her young students of about 7 to 13 years old. She sounded like she was on a mission to destroy the supportive and collaborative atmosphere that I normally associate with climbing gyms, and while I hope her students continue to climb, I'm not sure that this location would be the best place to enroll new climbers.", "date": "2/16/2015"}
{"review_id": "sNSdNpFgmV6M4hWA0Bx-9A", "user_id": "J-V6Xs6uhAlL5WodLW7u2Q", "user_name": "Christi D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Went here for the first time to give rock climbing a try. The place was nice and the rock walls were alot of fun. I came back a second time for a belay lesson and the guy did a great job teaching me. I think that place could use a little better ventilation, it was hot outside and really hot inside the building!", "date": "9/10/2015"}
{"review_id": "Pm00niMSnCkYZPhPBTcotg", "user_id": "sQqiCY61hPUpzozwv3XYIg", "user_name": "Alisha W.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best rock climbing gym in the IE! They also have some auto belays for anyone who isn't trained how to use the regular ones. Only complaint is this place gets packed on weekends, but this is to be expected because it's the best climbing gym around with lots of walls that they are consistently changing so it's something new each time you go!", "date": "8/5/2014"}
{"review_id": "4qTEpFByW007v41bbsBI0g", "user_id": "XAJ-HhV3IsPezd_K-YDFig", "user_name": "Robert M.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Been a member for a few weeks, and have enjoyed it so far! The staff is extremely helpful. It was kind of scary walking into a place and rock climbing for the first time ever, but they really helped comfort us and explain everything throughly. I will definitely recommend it !", "date": "9/7/2015"}
{"review_id": "niy8SoZWkWD8vwdACHuxmA", "user_id": "Hnm9Pl0Unk5QJzM7D_J58Q", "user_name": "Anthony B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "I took my kids to rock climb today with a groupon and the staff there was great.We sent to the upland one and that place is a joke, but these guys in riverside are awesome!I highly recommend this place!Thank you, my kids had a blast!!!", "date": "2/28/2015"}
{"review_id": "7EBnd1EYTE0Ndqy53QVtuA", "user_id": "q6U1WfuQPM28EzGKk0NHXw", "user_name": "Paul L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "This is the biggest in door rock climbing gym I've ever seen. The staff is super friendly and knows pretty much everyone by name. The walls are constantly changing, giving the regulars nice, new challenges.Besides that, climbing is probably the best work out I've had in years. It challenges you both mentally and physically. I absolutely love it.", "date": "10/18/2012"}
{"review_id": "cmzK4NqoLYvWdaowXLHikA", "user_id": "IVpEIYe5o61ihWPjYnAR8Q", "user_name": "Nikki T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was our 1st time and the staff was amazing. Ian took his time to teach us and was very understanding. We were all wiped out, but it was so much fun and worth it. Can't wait to go back.", "date": "11/10/2016"}
{"review_id": "nOJI9HGyesafPbDw52taFw", "user_id": "5K8whzjKosj4bKdI6RX8lQ", "user_name": "Tom V.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This is the best climbing gym I've ever been too! Not only are the routes constantly updated, the facility is clean and spacious. The staff is extremely knowledgeable and helpful. I've been helped by Sammy, the manager at this Hangar 18, several times and she always goes above and beyond to make my girlfriend and I satisfied members! I recommend this location to anyone.", "date": "2/23/2015"}
{"review_id": "7Q2ZyOW7VXwVjvPK-y5t5g", "user_id": "MAjmYlZYHcigUpegCm9uig", "user_name": "David P.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 8, "funny": 5, "cool": 8, "text": "I've been to a lot of indoor rock climbing gyms and this is by far my favorite. I think the biggest issue for most indoor gyms is offering a balanced array of problems for climbers of all skills. Many gyms offer just a few easy/medium while having the rest of the gym full of V5's and 5.10+. Unfortunately these few easy/medium problems are not enough to help the learning climber get to the V5/5.10 level. More problems need to be offered to make the experience of improving climbing skills more enjoyable. Thankfully, Hangar 18 offers plenty of problems of varying difficulty making it possible for even the most novice climber have plenty of options to have fun for hours. Self-locking gri-gri's is super clutch. I felt a lot safer when I first started climbing knowing that these fail-resistant devices had my backOne reason why Hangar has such a great selection of problems is the size of the gym. Hangar 18 is huge and offers many different slopes and angles for climbers. Hangar also knows that...slopers and crimps are fun, but not for everyone. Some people just like jugs (pun intended). And Dyno problem lovers, I know you are out there! This place always has a few epic dyno's that will make your adrenaline pump!Gym is pretty much half top rope and half bouldering. The boulder is beautiful. It offers caves, vertical problems, inclined problems, ridges, and the ability to climb over the top and walk down the stairs. Top roping is also set up very well. The more challenging problems are on one side of the gym and the beginner problems are on the other side. This is cool because you are climbing with people of the same skill so it's easy to get along with those around you.Service overall is pretty friendly. David, the building manager, is always very friendly and plays great music. Ask him to play his own music...seriously it's the best climbing music I've heard.Hanger 18, along with Sushi Asahi and the Mission Inn, are absolutely the best part about Riverside.", "date": "5/29/2012"}
{"review_id": "yIbuZNw9A1kvJiTXokQh3A", "user_id": "5bgsQymr8HDT3tyC1N3Uhg", "user_name": "Sara C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "i like this place because it's big, newer, and great for beginners.  my friends and i booked a group lesson on weekend morning because none of them have ever rock climbed or belayed before, other than myself.  it had been a while for me, so i figured i could use a refresher course.we had a group of 8 so it was cheaper to book in advance and pay the $60 fee (you can divide that amongst your group), then you pay the additional $18 for rental gear and climb the rest of day. the group fee included lessons for approximately an hour and a half, which was plenty time for all of us to get a grasp of things.  our instructor was super cool and was attentive to us even after our lesson was over, making sure we were ok and asking if we needed any additional help.  there is definitely plenty of space to climb here but the beginner walls do get quite crowded.  plenty of top rope and bouldering for every level.  the membership fee (if you look on their website) is average like most other rock gyms because they do offer other fitness classes.  i highly recommend this place especially for groups and beginners learning for the first time.  other gyms i've been to should be visited after you've climbed here first. just my opinion.", "date": "9/7/2012"}
{"review_id": "n57I8csbRqgKTovxmpdZ4A", "user_id": "9v83UksZrkThOiE584GRBQ", "user_name": "Oulie T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 3, "funny": 0, "cool": 3, "text": "This is my second home. I love climbing here. I cant do a \"normal\" gym because it doesn't keep my attention. Thankfully Hanger keeps my Attention Deficit Disorder in Check. Climbing is a full body workout. Ur Abs, Ur Arms and Ur Legs, U will feel it everywhere the next day. I also love it because guys and girls are pretty much on the same level. U lift ur own body weight and climbing develops \"useful\" muscles not those stupid showy useless ones the normal gym gives u. Put a buff muscular gym guy on the wall and watch him FAIL. I love it:-) Climbers are super social and nice too. We are always giving each other advice \"beta\" (the moves) in finishing our \"problems\" (the route). U challenge yourself physically and mentally at Hanger in a great supportive social environment. The bouldering area here is spacious and the top out is a good height. There are tons of top ropes set up and a large area for lead climbing. They offer belay lessons daily and on Wednesdays Dave hosts super informative advanced lessons that will help u safely take ur indoor skills outdoors. I've noticed that climbers trained by Dave are super safe and conscientious when it comes to the Dangers of climbing. Come here if u want a well rounded, friendly climbing experience and if u see me around say hi!", "date": "6/29/2012"}
{"review_id": "mPX1V52Nr9Viyp2SAQOflQ", "user_id": "Y7upMMnVc3wr8UOQJyxP5w", "user_name": "Nonya B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "The gym itself is top notch. It's huge, they change the routes frequently, & do a nice job of mixing it up. The problem is the new staff. Last year they had a couple guys who were just amazing. Not only were they helpful, but they were really friendly. I have been twice this year & both times have been horrible. The first time they were unfriendly & unhelpful. This last time, they were so unbelievably rude that had I not been there with a group I would have requested a refund & left. They just recently bought out the competition when they acquired Threshold in East Riverside, so I guess there is no alternative, but I think once my membership runs out I'm going to try & find me another gym.Terrible Experience.", "date": "7/2/2014"}
{"review_id": "w_MhnTDaR3gNcQPpm9g80g", "user_id": "19iZmBS79299pY779D6NEg", "user_name": "Joe T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Dam I had such a good time here the staff is fun and helpful I'm a rookie and they made it a great experience for me didnt feel dumb at all. I'll come back most definitely so much fun.", "date": "11/28/2012"}
{"review_id": "WI7DLSTK4ky1SYdoyb0BLg", "user_id": "g1D1DcfD0RDabzTo3fk1bQ", "user_name": "Devon F.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Definitely my favorite of their gyms. There is a great variety to do and the staff is particularly helpful!", "date": "9/4/2015"}
{"review_id": "blSfHoFY5BiIxf-Xb7_Ihw", "user_id": "PVyZXgOkVtnU6966FDFhuw", "user_name": "Christi K.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 5, "funny": 4, "cool": 0, "text": "Boo. So disappointed... We were expecting so much more. Especially because the people that own Climb It holds owns the place - and I love their holds...The Experience: The BF and I walked in and waited at the counter for 10 minutes until someone came. If I was a person with a weaker set of ethics and morals, I could have just walked in and started climbing. The guy didn't offer a greeting or anything. Service was terrible. A day pass was $16... That's a bit steep. Luckily, we had our own gear so we didn't have to pay for anything else. About the gym: It looks pretty cool when you walk in. There is a huge, free standing boulder in the middle of the gym. The walls for top roping and lead climbing are very short compared to what we are used to, so we only bouldered. The problems were not great. 98% of the problems were not taped. They expect you to be able to just follow the route using the color of the holds. This would have been fine in the gym was better lit. There was a section of the boulder that had an overhanging, cave like area. You couldn't see anything in there! There are only certain areas you can top out on the boulder. On the other problems, you either need to down climb or jump down. Some parts of the floor are better cushioned than others. Be careful... I hurt my self jumping down on to some harder flooring. Overall, crappy experience. Maybe I'm just spoiled after climbing at some of the best gyms in the US - like The Spot in Boulder, CO but I would not recommend Hangar 18. I will definitely be checking out other gyms in the areas.", "date": "2/27/2012"}
{"review_id": "NuHLRZnLBYBWHQ3wRgYkcw", "user_id": "6HMq8qAhJ1BNn6xsjvw5qQ", "user_name": "Bryan S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I was a member here on & off. The atmosphere when i first joined more than a year ago was amazing. Everyone was easy to talk to and as a newbie people were more than willing to give you advice. I took a few months off due to an injury which prevented me from climbing. When I came back it was cool for the first week or so, but then all of a sudden when i asked for rental shoes which i always ask for they wanted to charge me. I was like WTF? Ive never been charged and they went over how they have a new policy and if you joined after some month your membership no longer includes unlimited rentals any longer. I tried explaining the situation and that it would have been stupid to continue my membership if I was injured and that i was dissatisfied with the basic membership that restricts you from climbing. I dropped the issue and the gym membership then and there. I can get a cheaper membership for weights at other places, I come here to climb but when you ruin the membership for profit you ruin a good thing.", "date": "4/8/2016"}
{"review_id": "hHeb9nxWQn_aEvi40RoTDA", "user_id": "Lbt6TfHtRsIiocHnxFQJFQ", "user_name": "Davina A.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 1, "funny": 1, "cool": 0, "text": "Rock climbing isn't really my go to thing when I'm looking for something fun to do. So when I came to hangar 18 for the first time, I was expecting to be treated with good customer service. As soon as my group got there we did not realize that you needed to be 18 in order to climb. Thinking we could pull a fast one a couple of my friends tried to fill out the waiver on their phone. Instead of being asked to not do that, they were basically mocked (I think his name was Adrian) I understand that it was something that shouldn't be done, but respect is always key in my eyes. I didn't climb because I was not willing to put my money into a place like this. Definitely won't be coming back. If I could give negative stars I would.", "date": "8/4/2014"}
{"review_id": "u9NqWjb8PsZXeQzNSlZwaw", "user_id": "6TsV1QT322MC77g-f49xAg", "user_name": "Nadine L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been going to Hangar 18 fitness since Feb 2013. What appealed to me at first was the fact that you could bring your children to the Fit Mommy classes. At first I was nervous that the work out was going to be wimpy... but boy was I wrong!! The awesome instructor (Bern's) worked my butt into shape. Since going to her classes I lost a total of 25lbs. Not to mention that the other members are super friendly.Plus she always mixes it up! we are never doing the same thing and I always feel challanged and never bored.Some of the things I really enjoy about the classes are that you aren't competing for space and you get special attention from the instructor. Plus, unlike a traditional gym... you don't have the sterotypical vibe of everyone being superfit and too good for you. Suggestion: I would like to go to other classes with different instructors, but can't bring my son. :(I love Hangar 18 Fitness!", "date": "7/24/2013"}
{"review_id": "g7mnJrTnAKl1FTsRrzGfzw", "user_id": "lXt8sN-LaJfnZp_fORfvKA", "user_name": "Arielle Y.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Birthday parties are a blast here. We had a big party here last month so we had their VIP lounge and they did really treat us like VIPs. My nephew was so happy and he and his friends had a hard time leaving the park. The host was so sweet and she really cared about the party so it made it really easy for us to talk to her and request things from her. We had 2 sets of bubble soccer games and that was such a great time. If you want a worry free birthday party definitely book your party at hangar.", "date": "5/9/2016"}
{"review_id": "y_TglfcOzQnmP5Q3capkbA", "user_id": "fdQJzzmg3jdVH5394191vw", "user_name": "Hannah B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been working out at Hangar 18 Fitness since last September. They were great with me when I was a workout beginner and I'm still being challeneged after they whipped me into shape. Marlena is really great about modifying exercises for your skill level or if you have injuries.  She also helps a lot with nutrition needs. Berns' classes are also killer and she entertains your kids while you work out.I like this place so much I asked for a job!", "date": "7/20/2013"}
{"review_id": "8wQSaGm0VcGTbMx5T3r03A", "user_id": "YBlyQ1BpcF4bvSBRSY71TA", "user_name": "Anthony R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing at hangar 18 for about 2 years years now I just love the climbs that they set up and the employees the are so nice and helpful. I don't think there has been one single time i have gone there that i have not had fun or had any problems with the employees being rude to me its the opposite they are alway ready to help me or the other climbers there.", "date": "5/23/2016"}
{"review_id": "lvsiHe7WaX0mxJhwlu2kAA", "user_id": "eZoPLbIMmgQ04I1KVk5dXQ", "user_name": "Dusty G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "one of two climbing gyms in Riverside. checked out Hangar 18 with a regular while I was out that way on a trip. I had a fun experience for sure. the bouldering was challenging, and the terrain was pretty sweet. I only got to top rope because all the lead sections were off-limits due to an upcoming comp, so I can't really comment on them...but considering that I was thinking \"oh man, I'd love to climb that one. and that one. OH and that one. that one too...\", I'd like to think I would have enjoying their lead climbing setting.the staff was friendly, the atmosphere was cool, and the gym itself was great. I would definitely go back and possibly bump the rating up to 4 stars after getting on some lead climbs (can't give it 5, I'm sorry but I'm spoiled by Earth Treks...).", "date": "5/21/2012"}
{"review_id": "VTLo3JTNd_RAb08mGxhGTw", "user_id": "bwTMwMstoj0QKQ9ztjbN7A", "user_name": "D M.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! We went with our kids who are 6 & 9 and met some other friends there. It was our first time and my son was doing the auto belay and got to the top and got stuck and started to freak out. The employees there were Amazing! (Victor) & (karl) their  approach on helping him conquer his fear and moving on was great!  By the end of the day my son  was back climbing the auto belays like nothing ever happened. I think there need to be more people like Victor employed!  Customer service is where it is at and hard to come by", "date": "11/27/2014"}
{"review_id": "iJoPtGy7h8pThA9gyLAAhw", "user_id": "n6VJmpwtH2g7P-Jw3kE3aQ", "user_name": "John D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place!  I have been coming here for about a month and a half.  Climbing was on my bucket list and I figured I would do it once or twice and get it out of my system.  Wrong!  The staff here is great and the environment is very relaxed.  Even when it it crowded everyone is very chill and positive.  I have also visited two other Hangar 18 locations in East Riverside and Upland.  I all of them, but Upland didn't have an autobelay and I don't boulder much.  Now that I have a regular climbing partner though, I might hit it again.", "date": "5/9/2016"}
{"review_id": "62JBgcon-3WofOhTESnozg", "user_id": "1bPMvQ6KvgpOvHgfEu1ZNA", "user_name": "Francis G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I started climbing about 5 months ago and now I can't get enough of it! This was the first indoor gym I ever climbed so when I first started it just looked liked a bunch of colored holds on the wall. The staff is kick ass, they explained the differences in grades and they give me good beta every now then and some solid motivation lol, would always recommend this gym! Plus they change the routes every Wednesday on different section to always keep it interesting. Keep it up hangar staff!", "date": "1/8/2015"}
{"review_id": "5_KwvRnUjdHRu5qkzLVkPw", "user_id": "lSYX-EZcZTf5U1bS1p_yTQ", "user_name": "Chase C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place to climb, lots of bouldering routes and good climbing. Price for membership is cheapest around and it gets you into more then one gym.", "date": "5/3/2014"}
{"review_id": "xV4F4OlHh9KEwaHIf2xLfg", "user_id": "A3EZXhbNouCSGGubr75kpw", "user_name": "Shelley W.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "You cannot beat the amazingly good deal of a membership here! I've been so spoiled being a member here for 2+ years. The gym membership is like HALF the price of some other gyms I've looked into. Their easy month cancellation's is a major plus, especially if you are a college student and are not in Riverside in the summer!The staff are nice and chill.They change the routes here somewhat often so it's nice to work on new problems! Oh and the problems are color coded which is nice so you know which ones are on and off when climbing!", "date": "9/1/2012"}
{"review_id": "clcuxvK8UnARHFMSxcOUcQ", "user_id": "vj40nsstbwTQ-rF538YiaA", "user_name": "Cynthia J.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 3, "funny": 2, "cool": 1, "text": "I was not impressed. Small and not newbe friendly. Plus there is no a/c so on a hot day even with tons of chalk you are slipping and slipping off the holds. The bouldering area is so tiny too. Better opinions than this in the area for sure.", "date": "7/5/2013"}
{"review_id": "99suvHyRBMsyfQ5nDky9gA", "user_id": "HXv4jCKNcOPPNJgahHfejQ", "user_name": "S B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm a big fan of climbing here. The routes are pretty interesting and there is a good variety of difficulty. Staff are alert and safety conscious. It's a very welcoming environment.", "date": "3/18/2014"}
{"review_id": "xJlWCp1T7SG9ivHXUL1oFg", "user_id": "7JBLvT2TXkLsVnRYv2AiOg", "user_name": "Mario P.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! I always go in there solo and only do bouldering. Everybody, including the staff, seem to be cool and helpful. I usually go in there, put my headphones on and climb...Perfect! No fluff, no tanning...just chalk, sweat, blood (occasionally), and some Danzig. Thanks Hangar 18.", "date": "10/18/2014"}
{"review_id": "E8fypSqsUIOi5FTeayS9Nw", "user_id": "89Kj6uk6ZPeUF2dWNYjajw", "user_name": "Christina B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Tried the upland Hangar and this one and I must say....this takes the cake.Usually I climb out in NY but it was a great experience to see what the scene's like in Cali.  It's cheaper and the holds were totally different.   Being able to climb an entire route based on a type of hold was really cool.  At gyms I've gone to they mix the holds up on a route, but because most climbs are a specific kind of texture/hold here, it almost feels more like real rock.The variety of climbs is awesome - and they have a crack climb!!  The upland one has a fist and finger.  The boulder is beautiful and the cave is a ton of fun.Only issue I had with this gym was that it ripped a humongous callous off my ring finger.  Have never had a callous rip off that bad, and it's been over 6 months of building it.  Was probably due to the texture of holds, or me just not being used to this west coast climbing!Overall good experience - and only $28 for college month membership, and no initiation fee makes it way worth it!", "date": "8/6/2012"}
{"review_id": "UFpkAQMPtBo-eoCcOs5Aew", "user_id": "kUYhUTXP7M3s9gSvCSd9FQ", "user_name": "Joe M.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 5, "funny": 0, "cool": 0, "text": "The facility itself is great but the employees and the manager himself is a person who does not know how to treat a person. Instead of courtesy and respect you instead get a unwarranted level of hostility that is befuddling. In my opinion customer service is one of the most important parts of customer relations that leads to repeat visits but after my trip to this hangar 18 I won't ever go back to them for any rock climbing I want to do. People should be treated as people and nothing less.", "date": "4/25/2015"}
{"review_id": "o694EakNz8oYJtBEByFFmg", "user_id": "5ZxXCGvKBWfDZCKk-_FRNg", "user_name": "Wendee H.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I had climbed a rock wall at my school's gym before, but it was not as fun as Hangar 18. The staff here are amazingly helpful and friendly. This is a great place for all levels of climbers. I was told they change the routes every so often so you'll never get bored. The place itself is spacious, clean and not stuffy. Though my friend and I are beginners, we did not feel intimidated by the other climbers or nervous.", "date": "5/30/2011"}
{"review_id": "EUrW9M2SODG2OAkwaA2GcQ", "user_id": "lOnPMouvFBu1hwC67O90Gw", "user_name": "Dustin T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I have been at Hangar 18 fitness since it first opened. I absolutely love it there. The staff is very fun and knowledgable, and they know just how far to push each individual. There is a very wide range of classes (boot camp, yoga, Crossfit, self defense and more) my favorite thing about the gym is all of the members are super fun, so you are just working out with your friends. I would definitely recommend it!", "date": "7/23/2013"}
{"review_id": "PPlyEw6uU8FmVgRkgeSb4A", "user_id": "JQGtwZuIQZuDpHtU8HRPxQ", "user_name": "Cuong T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Climbing gym yoga is much more different than yoga at a conventional gym facility. After climbing your heart out downstairs, why not head upstairs to be worked so that you can relax afterwards? Let all that tension melt away...", "date": "5/7/2014"}
{"review_id": "_MlbZyTLGlGMA5otUpoERg", "user_id": "WCQwAY5kSEzsDQSaOyaVrQ", "user_name": "Ann G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My kids and I are all newbies-we had a blast here and can't wait to go again. We decided to stay on the auto-belays (there were 4) and that was plenty of a challenge to keep us occupied for a few hours. My nine year old and thirteen year old had no problem, and we loved the chilled out, cooperative vibe that goes with climbing. We all could use a little more of that. You can take a $10 belay class which will give you many more climbing options, and we plan to do that next time. Adrian was really patient and helpful, and great with my kids. One of my daughters forgot to clip the rope to the wall and it went back up to the ceiling, he had to go get it. Sorry! ;) It is a little warm, but I preferred that-keeps your muscles warm and you work up a good sweat. Highly recommend!", "date": "7/9/2013"}
{"review_id": "Lhw1mCSW5InQKms8L1-k_w", "user_id": "iue0tvITPmgmDD6K_0ArEQ", "user_name": "Jenny C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "I love Hangar 18!  Thanks for recognizing that students have it tough these days and giving out a great monthly membership rate.  1. The staff is super friendly and informative.  2.  FREE lead classes for members.  The classes here are amazing.  I just finished the lead class taught by Dave and learned so much.  Unlike other gyms that teach it within a few hours, Hangar 18 lead class consists of four classes, each about 2 to 3 hours.  3. FREE yoga classes for members too!  Offered twice a week with great instructors.  CHA CHING!4. Great bouldering and top ropes are okay for beginners like me.  If you want higher walls, you can go to Upland for no extra charge.  They change it up each month, so you can try something new and not get bored.  So glad I don't have to drive to the OC for a climbing gym.P.S. They use grigri belay devices here as required by their insurance.  Never used one until coming here, but they just do a quick lesson for you.  Super easy and no biggie.", "date": "2/25/2011"}
{"review_id": "lJeMlkLMktHKpka8OZTD-w", "user_id": "sBp9LyzXXd5JfKbopftuqg", "user_name": "Miriam R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came here with four friends about 10 mo ago. It was out first time trying rock climbing. the guys there were friend and very patient as we asked, asked so many questions before doing our little adventure. it was a really fun experience. im looking forward to going back.", "date": "2/5/2014"}
{"review_id": "ZU391aK0cSOMohuyZIoTBg", "user_id": "E6oDGuz7RYwybAYkLNzUpA", "user_name": "Diane L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Went here on a Saturday afternoon, not too crowded. Halfway through the climb a bunch of kids came in for a birthday party. Their mom should really tell them not to walk under the ropes when someone is climbing, but I guess they'll learn when they get kicked in the head when someone slips while climbing. Some of the holds had so much chalk on them it was hard to tell what color they actually are, but I'm sure they clean them every once in awhile because last time I was here the holds were super clean.", "date": "1/25/2014"}
{"review_id": "eOUFTzxerx5MyYj8sZ_41g", "user_id": "-hez6ZRVuKC1IyH-ZPRKFg", "user_name": "Lori D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! My daughter and I learned to climb here and still go a couple times a month, it's the absolute best all over body workout!!  The staff is super friendly and helpful, especially Adrian! Also love the vibe here, most of the other climbers are really chill, but helpful if you have questions or if they see you struggling, they'll offer suggestions and encouragement. They change up their walls often, so there's always a new challenge waiting!", "date": "2/16/2014"}
{"review_id": "3lleebMjKixze7Zuv049dA", "user_id": "F3JG4sRj1HQ-0lrdJ5-g6g", "user_name": "Zoe R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "So many different kinds of classes you won't get bored. The classes are small so you get lots of personal attention from the instructors. It's challenging and fun!", "date": "9/18/2013"}
{"review_id": "8tOCaTjVaAWGtvykYMlygA", "user_id": "LQzOx_CemAEFZDv0BW54YQ", "user_name": "Alexandria B.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Super friendly staff and clean, too. There are a lot of old routes and they're slow to change to new ones and they also seem to be more difficult than at other gyms. Free shoe rental is rad for those that dont have shoes and they are great about teaching people that are new. I wish that the monthly climbing gym membership included more fitness classes, and I was surprised to learn that aside from one weekly yoga class, I'd have to buy an additional membership to take them. The membership and student prices are very reasonable too. I would recommend. Bring your kiddies!", "date": "11/23/2013"}
{"review_id": "bb-eFCtBlutatHgzOPIi3Q", "user_id": "qPQX5D6QYH3dRlBozadfQA", "user_name": "Myles A.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great climbing gym. The various climbs are great for every level of climber. The staff was friendly and helpful with everything. Even when one of my friends locked his keys in his car, they did everything they could to help us out. Their instruction for my friends who were new to climbing was very good. They easily understood everything and were climbing in no time.I was impressed by the fact that they use the expensive, user friendly Grigri belay devices which was great for people who don't have that much experience. The staff even stayed a little later than close because he said we looked like we were having too good of a time to tell us to stop, so he just let us climb until we were worn out.I particularly liked their bouldering section. It was challenging and offered a great variety of routes all around.All-in-all a great experience.", "date": "1/6/2011"}
{"review_id": "XNUYZfBKim3ydKc7_By0LQ", "user_id": "nztXLUJwhsXbkd2VfUgh2w", "user_name": "Stephanie G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have always wanted to try indoor rock climbing. I came on Mother's Day with my daughter and we had a great time. The staff was very friendly as soon as we walked in. Victor was the one that showed us how to use the equipment and get started. He was a great teacher and very patient. Had such a great time we do plan on going back soon and taking some more friends with us.", "date": "5/12/2014"}
{"review_id": "SdZiwMWnfAPlCwEmpM3YqA", "user_id": "hF2yV3WJnH4Hr2aWZtpGJg", "user_name": "Fatima R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been coming here for a few months now, me and my boyfriend love getting a workout bouldering its such a different experience than the gym. We usually boulder but every once in a while ill do the autoline. The place is big and they are always switching up the climbs and all the workers are friendly and ready to help you if you need it. The monthly pass is reasonable but make sure you get your moneys worth and try to go as much as you can", "date": "2/20/2014"}
{"review_id": "2Et2OJo1Dujy6O8q90ZeZQ", "user_id": "yKBeQiov6xf8KVAypD_s4g", "user_name": "Johanna L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This is one of the best rock gyms I've been to. It's really big and has a variety of walls/challenges for all difficulty levels. It's also fairly new, so you don't get that weird stench/stickiness that comes with other rock gyms. Also, the prices are reasonable and they have specials often! Couldn't get any better", "date": "11/5/2012"}
{"review_id": "Mpd0fiO0v__Vjnf7G0kayQ", "user_id": "FPDyjEX-LRoET4TLQytW1A", "user_name": "Ambrea P.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the closest climbing gym to me so infrequent it the most. I think the Hangar 18 in Upland has more variety, but the Riverside location is close to home for me. The staff is friendly and helpful. I'm on the newer, less advanced end so the variety is perfect for me. There are a lot of regulars there daily and totally family friendly place.", "date": "12/1/2013"}
{"review_id": "IoVnzJSEP0fq_WXKiHlrlQ", "user_id": "0l1WBKZN_NGwYjQ7BXroeg", "user_name": "Fritz D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "the was the funnest time we had in ages.i can't remember the name of the guy working there, but he was very nice (and patient with us newbies)  i was worried that the 11YO wouldn't be able to belay me (since i weigh more than double her body weight) but it was not a problem.  i don't understand how those friction rope thingies work, but i did not fall and crash to the ground.  i had envisioned her being lifted up off the ground if i lost footing. lolwe ended up buying a two-month membership at a place closer to home. we're about 45 miles away from this place it was super-fun.  i definitely recommend it.  i am not in great shape. and there was another woman there that was definitely larger than i am.  she was climbing up and having a blast.  don't worry if you can't do a pull-up (i can't even come close)  the rope helps hold you up to climb.", "date": "8/9/2012"}
{"review_id": "egiO0SiHgb0gRUs5NFuuCA", "user_id": "CSOVEtxfxO8JD-GORjzECQ", "user_name": "Amanda E.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 7, "funny": 1, "cool": 2, "text": "I can't wait to get back here and do this again!!! I went to Hangar 18 for the first time yesterday and had the best time!! The only employee there, Matt, helped get us set up and suggested the $30 first - timer lesson, which my friend and I had planned on doing. After getting our gear on, Matt spent a good 30-40 min teaching us the basics. He taught us the proper names for everything and made us practice getting the gear set up multiple times before starting to climb.  Matt made sure we felt safe and comfortable before we got started. The shpeal was a little hokey but I dig that type of thing.I went with a date and we had a great time trying the different routes on the wall. There are plenty of different levels of difficulty, although I stuck with the 5.5 and 5.6 routes (the easiest ones). We ended up staying for 3 and a half hours!! I would definitely recommend Hangar 18 to anyone new to climbing because of the great staff and laid back, comfortable and safe atmosphere. I am going to try the Hangar 18 in Upland since its closer to me. Man, just prepare to be sore afterward. :)", "date": "2/22/2010"}
{"review_id": "Kfl8lSkL68JoEZMKBzW5tQ", "user_id": "zSY5uNG-w60eFqBmGvmEDw", "user_name": "Charles T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love hangar 18!Why I love hangar 18:OUTSTANDING customer service, they have the best employees working there. The employees are very friendly, outgoing, and knowledgeable. Reasonable dues/monthly fees.The climbs are fantastic: bouldering, top roping, auto belay and lead climbing; definitely many great ways to challenge yourself.Hangar 18 has a great social environment, members are humble and actually talk to each other--Yes, strangers talking to strangers, unlike LA fitness. Hangar 18 has the most friendliest members and employees. It is very common to see a lot of camaraderie; members helping each other out with climbs, or members helping out new climbers.The only bad thing I would say is that they do not have a drinking fountain but because I love the gym--I can easily overlook that flaw, and I will just bring my own water bottle(recommended)Also they do not have ac, which is fine because I go to the gym with the intentions of breaking a sweat.", "date": "8/1/2013"}
{"review_id": "PAVJTXCaAHN2NmEmnPNsbg", "user_id": "jhknWYVarKNG0DozAL_kzg", "user_name": "Bryana M.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great spot for beginners, the staff is super friendly and very thorough in teaching! Had such a great time. There is a challenge for everyone from beginners to experienced. Will definitely be going back.", "date": "6/10/2013"}
{"review_id": "pDqsx1tMcWZdqaS27jWgqA", "user_id": "Xi5WwR-8eazk1qk1EbZgtA", "user_name": "Lisa T.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "This was my first indoor rock climbing experience and how fun it was! The guys there are so funny and were very helpful for first timers like me. A day pass for 2 is $16 but since it was our first time and we were taught how to belay and such it cost us $30 each for the day pass plus $2 for the harness rental and $3 for the shoe rental. So, our grand total was $70. Pretty pricey yeah but after that day when you come back and know what to do you'll only have to pay the $16 for the day pass.Rock climbing reminded me of how out of shape I am especially when I tried to pull myself up a wall so remember to stay in good shape and prepare your entire body for a great workout! And also bring plenty of fluids, it gets very hot in there esp. with all the exercise you're going to get.", "date": "2/16/2010"}
{"review_id": "S-o6VhZkYY20MZpw1PrCDQ", "user_id": "ybtcQgiX5g3r6oNL4j2c9Q", "user_name": "Michael R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Not my scene.First of all me and my friend walk in and we were waiting to be instructed by someone on what to do next. When we are directed we are given equipment - the guy is not even helping us with it on. A good 5-10 mins we are waiting to be instructed after getting our equipment on. Whoever is working the desk is eating lunch while ignoring us. Once, we get his attention he gives us a brief step by step lesson on what to do. Now, I know we are new and we have to pay attention. But I felt like he was explaining everything fast and then coming back to see what we learned. I was also feeling like I was being put down in front of everyone at the gym. One guy was being a jerk and saying \"oh you got the rope the wrong way\"  We climbed but again not everything is going to be for us. The environment was alright but I think it was the way the staff conducted business was not genuine and self motivating. Sorry.", "date": "6/16/2012"}
{"review_id": "sSzEEiKq3RpHfaIfMb6jyg", "user_id": "Z3uWG4iP4nXKXVNLHbx2tA", "user_name": "Tom M.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time climbing and had a great time.  The staff was extremely friendly. Isaac helped myself and my girlfriend and was extremely patient.  I was ready to call it a day but he kept helping her and we ending up having a great time. Very encouraging and came back to see how we were doing after we went off on our own.  He made our day.", "date": "9/25/2013"}
{"review_id": "UhNLjDqRBCBfX_03DrV9zg", "user_id": "xV5TFfiqqXOn0LnlWYo73g", "user_name": "Scott N.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place, could not live without it. They have Auto Belays, makes it possible to climb the high walls solo.", "date": "4/5/2013"}
{"review_id": "UJk55vpJbk0HqCULV6l2cA", "user_id": "BBdz2MKGVQ9FHYh2jLd7gw", "user_name": "Ryan M.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Best indoor rock climbing in So-Cal hands down. Super friendly place, very inviting atmosphere, from the first-timers to the rock crushers. Just go, you won't regret it!", "date": "1/30/2012"}
{"review_id": "CBjPeXSf9uaWTMoaL8rgIQ", "user_id": "-24Lje2-UIpDhjUEqvkx9A", "user_name": "Debbie C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "Wow!!  What a state-of-the-art climbing gym!  I have been to quite a few climbing gyms and none so far compares to Hangar 18 in Riverside.  This gym seriously makes me want to move back to THE SIDE just so I can go here on a routine basis.  It has the highest free standing indoor bouldering area in Southern California.  Hangar 18 makes and manufactures their own holds (Climb It climbit.com).  So you can be assured that all their holds are always in brand new condition and unique.  I can't say enough good things about the staff.  I was greeted right away by the manager and was given an entire tour of the gym right off the bat without even asking for it.  I found out a few minutes later that the climbing instructor is a climbing buddy of mine and he is one of the top boulderers in California.  I have learned a lot from him in the past.  If you are a newbie, you will definitely be in good hands. They also provide yoga and martial arts classes which makes this gym a place for promoting health and well-being and not just being purely about climbing.  Since climbing encompasses skills acquired from many different sports and activities, it is wise to be well-trained in strength, flexibility, endurance, and power in order to be a well-rounded climber.  I think this gym helps facilitate that goal in a way I have never seen at any other climbing gyms.", "date": "6/17/2009"}
{"review_id": "TjTsClINxaNAGP-XJU57vg", "user_id": "DGszSnRNWoAOtD8WGf9wpg", "user_name": "Kevin C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "I have to say this place is great!!! I have been a climber for years now and my local gym, Arcadia Rock Climbing yelp.com/biz/the-arc---a… This gym, Hangar 18 Riverside location is a brand new facility. The holds are new the walls are new the ropes are new the pads are new.....everything is new except the management and instructors. They are professional and knowledgeable. I know Joe Morgan as he was a manager at my local gym for years and he is known in the climbing community as a very talented boulderer and an excellent instructor. The gym has many types of climbing, bouldering, top rope, and sport climbing available with very clear signs and well marked routes. The Boulder area is placed in the center of the building and has a large area where the climbers can practice mantling on a 20ft high boulder. The top rope routes are separated from the sport routes which naturally separates different skill level and age of climbers well so that 8 year old kids are not in the same place as the V12 or 5.13c climbers which makes for a good grouping atmosphere. The place is clean, new and well layered out. The signs say the rating, who rated it, when, the name of the route and any other info which is really great so there is no guessing and they seem to be very constant with their ratings or at least I from what I could tell. Also they offer yoga and Jiu Jitsu classes often plus many assorted climbing classes and professional emails to their mailing list too.  If I only lived closer I would make this a regular gym for me, maybe I will move back to the 'Side' one day. Great Job Matt and Joe !!!", "date": "4/15/2009"}
{"review_id": "Ymq90qrRCLNQ7tDhrszZ3w", "user_id": "wkly1j9hMR_-SvMJ_hH1zg", "user_name": "Kristen V.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Today was my first experience with rock climbing, although I felt intimidated by this new venture the staff was extremely helpful and very welcoming. The overall experience was exhilarating, challenging, and even a great workout. I look forward to going back, all I need is to convince a friend to be my belay partner!", "date": "9/15/2012"}
{"review_id": "sMnn_u0loj_9dQrPJ4smbg", "user_id": "iMZKemFeBsI7uFKKKEhJDQ", "user_name": "David N.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Went here for bouldering. Friendly staff all around. Nice and interesting problems. Will come again!", "date": "12/7/2011"}
{"review_id": "EkV23HUjDO-WrpW4iWNtYA", "user_id": "Qe4Lw0vqw0qA1wiZ9cw0LQ", "user_name": "Niki K.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Why 5 stars? 1.  The staff was really helpful and patient.2.  It's a great place to wear out the little ones or try something different.3.  The gym is spacious and clean.4.  The climbing walls are pretty high.5.  Most of the people that climb here are friendly.", "date": "5/9/2011"}
{"review_id": "Lktl2OUS0Od3dTnHo1-tag", "user_id": "F3LfiOx67lUITMrwPQJ_-w", "user_name": "Lexi O.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "It's so much fun!! The gym is really nice and big. They have levels for everyone. There's bouldering too, which is really challenging...but fun once you get good.Went for my first time the other day, and had a blast! It's a great workout. The staff is really helpful and nice. Took off one star only because I wish they had a system where you didn't  need someone to belay you...it would be nice to race your friends or climb with a girlfriend or boyfriend. Perfect first date! :)", "date": "5/27/2009"}
{"review_id": "BgEaCpDexPryWcLByv421w", "user_id": "HyTv5K1RbLeJ3JWmV_WUwg", "user_name": "Andy G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 2, "text": "Be warned! You'll get hooked asap.  I'm already buying gear and planning on making this place a regular!", "date": "12/27/2011"}
{"review_id": "gnkrt7yULM23-W-jCaxLLg", "user_id": "FzKnCNSzqhEQNV_bWAOKsw", "user_name": "Carlos R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Let's get something straight from the start:  I am not in shape, I am not young, and I am not flexible...I am not even good with knots. None of this really mattered as this was a lot more fun than I could have ever thought. They trained me and my partner in short order and in no time, we were on our own. I have never worked my body out in such a way. They had dozens of climbs at all skill levels. But the best part was all the people at this facility. Both the staff and the patrons made us feel like we were a part of this place. Everyone was helpful and just really wanted to share their passion for this sport, even with a \"family man\" such as myself. I ended up with a monthly membership and am looking forward to getting better in the future. Definitely worth giving a try with a friend or with your family.", "date": "9/21/2012"}
{"review_id": "VWv0Ko4R6nonW0TVQ5OwOw", "user_id": "X9FS1d9_bM4phQTMHP5m9A", "user_name": "Flying F.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "had a great time, this is fun place to climb...~", "date": "3/16/2014"}
{"review_id": "R89USrR5uS824JvzdlF-VQ", "user_id": "fVF6ZInrs2e7bqcem0t9Nw", "user_name": "M W.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Came here on my way back from Palm Springs to Los Angeles. Unfortunately there are very few rock climbing gyms in Los Angeles, and nothing in the San Fernando Valley. So it was such a treat to climb here.  The space is smaller then other rock gyms I have climbed at, in a warehouse space with high ceilings.  On the outside walls of the room there are top ropes and lead climbing set up and there is large \"boulder\" for bouldering in the center of the room.  There are so many routes with a nice assortment of different levels, I over heard a regular patron discuss how they change the routes pretty often. I had not climbed for awhile so needed a belaying refresher, I was relieved to hear that on Sundays they offer belay lesson every hour.  We were able to receive a belay lesson soon after we arrived and the instructor Victor was very helpful.  The place seems child friendly (we had my niece and nephew with us) and I saw many families climbing with their kids. On a Sunday the place had a chilled out atmosphere and was not over crowded. The only down side I found with my visit was the distinctive aroma of feet that pervades throughout the gym, and the place was rather dusty.  I am sure these faults can be remedied.  All in all I had a great day of climbing and wish they had a location closer to home in the San Fernando Valley, Van Nuys could really use a rock climbing gym...hint...hint.", "date": "11/5/2013"}
{"review_id": "0Br3xwyxqG5Eiy9p2Lg4pw", "user_id": "A7CAGcJQ74kzZCe2Pa7Zdw", "user_name": "Robert W.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My favorite rock climbing gym period. New routes every 2-3 months, friendly environment for beginners and professionals. Staff are some of the coolest nicest people you will ever meet.", "date": "12/2/2011"}
{"review_id": "Er9N_fjQP0-2z3qcl5redg", "user_id": "3UeyRcDKHTpAGvUtjn3Ckg", "user_name": "Stanley Y.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Cool place to climb big rocks. If you like to be around of climbing enthusiasts and to be challenged, its a great place to go.", "date": "2/26/2012"}
{"review_id": "1LqgEA5RStvMXEv-fAfzIg", "user_id": "SG878d0J_SJSgl08lOrvyg", "user_name": "Nat P.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to a lot of indoor rock climbing gyms and I have to say that this is my favorite. I've tried out some in Anaheim, Long Beach, and even the other Hangar 18 sites.This place has great bouldering and it's SO spacious that you don't have to deal with the cramped space when resting or waiting for a route to free up. There is also TONS of top roping for you to do too.I've never had to wait a super long time for help and everyone I've met has been really great.I've been a member for about a year now and I really can't complain. There are some hiccups here and there... it's uncommonly hot, but most indoor gyms don't have AC, besides, you know you're working out, so you're going to sweat. Some of the sites have leaks in the roof which is not great when it rains. I haven't been to this site while it was raining, but I'm guessing it's probably not too different.The prices for day passes are so-so. Hangar 18 falls in the middle range for day passes if you just want to try it for a day. I've definitely been to places that were more expensive. Rock City in Anaheim is cheaper for a day pass, but you don't have as much bouldering, top roping, or space.Some criticisms I've heard is that the Upland site is not to challenging when they set their routes. I think Riverside is definitely better in that area as well.They also have yoga a couple nights a week.", "date": "9/9/2011"}
{"review_id": "WeyDVz8-KKtUPI28DV30iw", "user_id": "N7cvuzrx6S2pQled7nwFoQ", "user_name": "Zara Y.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "I used to enjoy coming here until I spoke to their asshole of a manager. If it were possible to give this place negative stars, I would give -5 stars. Poor customer service coming from the MANAGER of all people. Don't know how this person was hired to begin with, but the \"manager\" at this place should not even be working. Also did the $5 membership promotion that they had at the beginning of the month and they said that I could call over the phone and cancel my membership because I live so far away. Come time to cancel my membership, they say that they will not honor it because it's not their policy, despite already telling me that it's ok for me to cancel via phone call. The manager said, \"I will let this go this one time, but will never do it again\". No problem! I will definitely NEVER come back and will definitely not refer or recommend to anyone I know. Was a lot better when it was Threshold Climbing.", "date": "9/29/2014"}
{"review_id": "Q9vR9XUlMjbsSIkdnwBgTg", "user_id": "Gi7NrdjrUgpqxj-l4CQoug", "user_name": "S H L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "First time rock climbing and this place is ALLSOME!  The package for 2 was really good IMO ($45 for 2 which included belay lessons+equipment rentals).  The instructor was informative-knows his stuff! and made sure we were settled in afterwards.  Also, the atmosphere was fantastic! with music playing in the background and people climbing.  You really don't feel intimidated by others who are much more advanced- you just climb at your own pace and level!  It's a great spot to get some good workout in, run or shine!", "date": "12/21/2010"}
{"review_id": "S7UJZGx7neTi3HyUDHYCew", "user_id": "z3LEdvclWxdu_O3YPp6-tw", "user_name": "Geoff G.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Pretty decent, I haven't been to so many climbing gyms, but this one was the least exciting.  No showers! Lots of overhangs for the bouldering, staff was ambivalent but attentive.  Very friendly customers.  Not super tall climbs either.  Good but not great.  I'd check out the other relatively close climbing gym before coming back here, but if it were the only game in town it would be acceptable.  Seriously though, no showers is a drag.", "date": "1/2/2014"}
{"review_id": "u1HA_nt1JJ7guB89esbynQ", "user_id": "d5nsOLyvJmAfHSlk5rdljw", "user_name": "Freddy S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best place to climb. They usually reset the routes every 2-3 months but they are always making little changes here or there. The environment is perfect, whether your a beginner or professional. If your having trouble with a climb, people are always nice and try to help. And if you get bored of one gym, you can try one of the other two that they have.", "date": "8/14/2011"}
{"review_id": "A1tGI3NaYgW3RJ_MmfvQOQ", "user_id": "Fwa9rZKDiuDLdPos4xsuHA", "user_name": "Sue K.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My first experience of indoor rock climbing was here and because of this place it was AMAZING!  The staff was really helpful, knowledgeable and patient and the gym was really spacious and clean.", "date": "6/20/2011"}
{"review_id": "NMDXc5RIRfDN0Lgi6NWzSw", "user_id": "cEp9MdIDveyhcGctFqSIPw", "user_name": "Tony L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm not much of a rock climber, but this is the best climbing gym I've been to in Southern California -- much better in my opinion than ARC in Arcadia. The size is fair -- not as large as Northern California gyms I've gone to -- and there is a good variety of problem sets.", "date": "7/8/2013"}
{"review_id": "usyOhJLQjLrRNCjEFfmCFA", "user_id": "wyPHQwOTf574qETvTXsL_w", "user_name": "Irene C.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "Alright, so I hate to be the debbie downer, but to each their own right? So I come here with my experienced rock-climbing buddy on a weekday afternoon. (I'm a newbie.) Nothing different or unusual with the rental equipment and waivers. There is an abundance of top-rope courses, both with friction and friction-free. Overall we had a great time and got a fantastic workout. However, here are a couple caveats:1. The staff: there was only one person on duty, who seemed to be really busy on the phone. Thus, I waited 20 minutes hoping he would get off and check my belaying skills so we could start climbing. When i finally decided to approach him, he walked out of the building, but came back in and said \"sorry i gtg dude, im at work\". great. so apparently he was chatting with a friend while people (including me) were waiting. Not cool.2. Safety: Most of the top-rope courses already have the first half of the knot tied in, so all you have to do is loop it through your harness and follow the pattern. No biggie right? However, I was a little worried when the couple next to us un-did the entire rope and asked us for help of how to tie the basic double figure-eight knot. Um, yeah, I was concerned because at Ironworks in Berkeley and at Threshold, they tested my basic knot tying before I was allowed to climb. 3. The Equipment: The gri-gri we rented had something wrong with it. All I know is that we had to pull the release lever all the way for us to barely inch down. We ended up practically climbing down on the courses that had friction. Secondly, when we asked to switch out our device, he said that we probably just weren't using it right, and to try again. However, when we tried the frictionless course, we had to open the lever full throttle and came down slo-mo. Then he had no choice but to let us switch.4. Lastly, if you like the smell of EtOH mixed with BO from the boys bouldering nearby, you would love this place!Ok, but overall, I would still go here again if you are confident or with an experienced person, and they actually have a good deal right now: $99 dollars for 3 months including free rentals each time and a guest pass every month.", "date": "3/1/2010"}
{"review_id": "cuupkLsBk9ZcADHhtGkciQ", "user_id": "USVcBnfCIu24Pv3wUiEUxA", "user_name": "Cheryl L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice gym with friendly staff working here- our home gym is Upland, but we wanted to try out the other locations and glad that we did!  This Riverside location is newer than the Upland one and has a nice back room for relaxing, as well as a microwave and nice clean bathrooms.  Had a good selection of varying routes to try as well as bouldering and freeclimbing (daughter isn't up to that speed yet!)", "date": "9/15/2010"}
{"review_id": "RPH_b6mZNJZM-Kh36Fv9Xg", "user_id": "5v0g8WgRtpa_5h7z9PLS1w", "user_name": "Lynn L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great climbing gym. We've been a few different ones in the region for competitions, and this one is among the top. Lots of different projects for bouldering and ropes.  Helpful staff and great coaches!!", "date": "11/4/2012"}
{"review_id": "R94uM16gQ0Ev84OaYOTI9Q", "user_id": "xbLSGhZluv96gEDrBgD1xA", "user_name": "Diana J L.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Great climbing gym! Lots of routes and levels. Although I did mostly rock climbing and a little bit of bouldering (or at least attempted to), everything seems to be in new and good condition. The staff is friendly as are the fellow climbers there. I received much needed tips and advice from both. I've been climbing before at Boulderdash in Thousand Oaks but considering it had been more than a year, I decided it was a good idea to take a refresher course on belaying. Luckily, it was only an additional $10 unlike the $50+ asked for by the nearby Climb Threshold gym. We vamoosed out of there and went to this one. Money saved, and I didn't drop my friend. Good day all in all.", "date": "2/15/2010"}
{"review_id": "UWt5LNxD1q0Dl9V7L_B3Ng", "user_id": "96-xiLwhILP0L_oZJKv0rA", "user_name": "Christina R.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "Worst experience ever. My sister and I were excited to try rock climbing for the first time in awhile. We decided to go to Hangar 18! We got here at 3:30pm and waited at the front desk for 10 minutes before we were helped. We then paid $30 each for an introduction package which included shoes, a harness and a class. She gave us our shoes and didn't say anything else. We then went over to one of the walls and asked a worker what we are supposed to do. He helped us (a little) but made a nasty remark to my sister that she was a little on the heavy side (which she is a 24year old...only 130lbs!). We learned that we were only able to go on 4 small sections without our introduction class. We waited 2 hours for a class but then they told us they are sold out today. AFTER WE HAD WAITED FOR 2 HOURS! They gave us a lousy refund of $10 together. Never coming here again. Worst experience when I was actually excited.", "date": "2/15/2014"}
{"review_id": "3mBZxgZBzhB5qnlVIrDLLA", "user_id": "FAMhn9mZvQ90CM-bGsEJvw", "user_name": "Saori H.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I'm partial to ClimbX in HB but Hangar 18 was really impressive. We were guests of a couple of members so we got the free deal which may have sweetened the experience. Not sure if that is an actual deal or not but the staff didn't seem to mind. Quite the opposite actually. He was very friendly and helpful. One of my friends was new to the sport and he gave her a quick lesson on belaying which I also had to participate in because they use Gri-gri's here. Most other gyms use an ATC device. The speed at which he went through the process was much appreciated since I wanted to get to climbing. Safety is important too, I guess..This facility is great for bouldering. The routes are rated accurately, I believe. ClimbX tends to rate their routes down. For top-roping the routes are fun but less dynamic than ClimbX.  I spent 5 hrs bouldering and climbing. I could've easily spent more time there as well but responsibilities and stuff. I probably won't be making the trek out to I.E. unless the price is right ($free.99) again but for those passing through this area I highly suggest it for training. Definitely a gem in Riverside. Did I just say that?", "date": "1/5/2011"}
{"review_id": "dotoX5Yzrf50Xiyc2gmQzA", "user_id": "dQV1ZGRklCBWhwNu9T9dXQ", "user_name": "Donald S.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "$23 UCR rate?fantastic deal and fantastic placethe belay lesson was the best that I have ever taken compared to other places. Good selection of walls to climb", "date": "1/17/2011"}
{"review_id": "FcLJJKDIijdr3HtLVcVLvA", "user_id": "31GaNI06UP9jhucaPiPFPw", "user_name": "Marden D.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "awesome staff, package deals for memberships, the list goes on.", "date": "8/21/2010"}
{"review_id": "XBVAuqjZsexuGkJZB6mjmw", "user_id": "UVfY84Rxw3EFTIAJT_Z5lQ", "user_name": "Jomamma H.", "business_id": "lDYE1Y3EboCudfFRL9dLhg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "What a great place for a casual climb, practice, or a party! I just had my sons 10 year old party there and it was super great. I had 8 kids and a few parents and even the parents wanted to climb! All the kids did it and had a fun time. The Hangar 18 people were so great, when we arrived they took charge of all the kids, got them outfitted in gear and got their attention for instruction. It was short and sweet and they got the kids climbing in no time. As a parent wanting to take photos and talk with other parents, I had to do almost nothing! The pros at Hangar 18 were so good with the kids I was very impressed. We even had a two year old and they were accommodating with her even though she opted out at the end. These guys ROCK! I'd even have an adult party here it was that fun. With a party reservation you get a big space on top of the center rock with tables and chairs and they already play great music. A great time was had by all and they provide all the gear needed.", "date": "4/15/2009"}
