{"review_id": "G_mIM-hx_Jjd2gFsH_18rw", "user_id": "iue7_9Cn_iXVD9hFOz64WQ", "user_name": "Leonard A.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 139, "funny": 94, "cool": 135, "text": "Do you wanna rock!? Or go beyond the exhausting thrill of bouldering? Besides the maze of different walls to challenge yourself. This facility offer belay lessons to take your experience to a whole new and exciting level.I was lucky enough to get Remo as my instructor. She was patient and took the time to go over all the proper safety steps with me until i was confident enough to belay with a partner. She was the best teacher I've probably has since the good ol school days. You can tell she loves her job as well as the love for the sport. The facility inside is tight but nicely outfitted with a variety of walls for every skill level. And it's also great for kids and offers an upstairs where one can plan out a climb party. They have different types of memberships for the ones that just can't get enough. The restrooms are kept and the staff members are helpful and informative. And that's my take on this hanger of pain,Peace out", "date": "2/20/2019"}
{"review_id": "SeVIvJ9Zade5Baww54UyMA", "user_id": "hlhK1k5H52aDh1ss9dDxQA", "user_name": "Jackie F.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I signed up for the special during the holidays to get a month of climbing for a low fee. I figured I could go once or twice with family while I was in the area. I come to find out they have been charging me $72 for the past 5 months without my knowledge. I was never told that this was a repeat charge that I'd be locked into paying. I am livid with myself for not realizing they were doing this faster but also terribly mad at the franchise for misleading customers like that. Shame on you Hanger 18. Get some morals and stop cheating your customers.", "date": "5/2/2019"}
{"review_id": "Sz_o1M2-dqK83OrNa8RKRA", "user_id": "bek6GmQ5rX_dLbBIqS-tbg", "user_name": "Laura O.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I used to come to this gym a lot, and actually really liked it. However, the last two times I went, they had a class that closed up the only two solo belays in the entire gym. I waited one time for more than an hour, as I was told it would end soon. Spoiler, it didn't. The second time I just left because I already knew better. I used to come here almost daily, but now I go to other locations, because I know that if I go alone, I can either boulder or go home. ‍ When I complained the second time, I was give a genuine, \"I'm really sorry for the inconvenience\", which is nice, but honestly, I pay for my membership just like everyone else. They have more than enough space to use in the gym for the class, which is why I really don't understand, and shutting down the only two auto belays so all the rest of us have no option isn't acceptable for paying customers. Guess I'll just keep going to the other locations ‍", "date": "4/29/2019"}
{"review_id": "VUXV_7miyIJjESYK_Mv50w", "user_id": "0j7MhgLbt4zCb-yxSN15iQ", "user_name": "Shaun V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Cheap and decent.I got a membership for two months after taking a break for a year. I figured it's cheaper than going back to Touchstone. I think I paid $30 or so a month for this Hanger membership which really doesn't bite compared to the $100 per month. The grading here is definitely harder, which I like. It's a cool place for the price, but I'm not too fond of the crash pad and the huge crowd. I only climbed one time there and was floored with how a lot of members neglected safety. I saw a relatively huge whipper with people underneath. Little kids climb and jump off the boulders without watching. It's a good place, but I saw things I won't go back for.", "date": "11/30/2018"}
{"review_id": "JADD8oJG8M-7GbxUIzPrKw", "user_id": "kMF2N1HAAOjNBUE3U8atow", "user_name": "Teagan T.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 9, "funny": 3, "cool": 2, "text": "This is an update NOT about the second or third time I've revisited this fine establishment.  It's an update about my first and last time climbing here.  A continuance of what I wrote as the first review.  I stand by every single letter and am not changing my mind about anything, regardless of all the other positive reviews.It's been five and a half years, going on six, and the case I have with Hanger 18 is finally over.  After 5 different lawyers, 120 phone calls (I'm rounding up on the phone calls), 4 appeals, I'm left with zero savings, one fractured spine, a pair of legs that will never ever know what's it like to be in the sleeves of a pair of pants and an impending doom of the defense coming after me, for the rest of my life, to pay for their attorney fees.  I'm leaving out a lot of other little details, but that's about the gist of it.  Nobody wants to hear or is interested in all the nitty gritty particulars, so I'm not going to bore anyone anymore on that, let along repeat myself for the 200th time (again, rounding up).This update is just to let anyone know, who is willing to take a second (or 30, it's long, but it's not that long) and read, the heeded fable of what happened here and I'm sure, will happen to someone else.  I'm not the first one to fall and be severely, permanently, damaged and I will not be the last.With all the gross negligence of this gym and their ridiculous brush with borderlining requirements, it's amazing that they haven't closed down.  I guess this is where it pays to have excellent insurance and big money to pay resourceful lawyers that can get them out of any jam with any judge.  I still haven't lost my interest and love for rock climbing, it's truly, truly, a great sport, but please, if you are going to participate in this great work out, find a place that does their research and know how to protect their members.  If I wasn't so financially crippled by this ...establishments, I'd be out there climbing rocks and jumping out of planes all day. Money can be earned but our bodies cannot.  (Not yet, at least.)  Once some things are damaged, they are always going to be damaged.  I'm not even 30 and I already know what it's like to live like an 80 year old.  Well, maybe not all the 80 year olds, some of them are still pretty painless.  Anywho, this isn't a ploy to get anyone to feel sorry for me or to tell me how great life is after 80, I know it can be great and I love my life the way it is.  This is a ploy to get people to know what a cut-corner-kind of place this gym is and the people who own it as well as the people who represent it.My case my be a SNAFU, but I'm a UFANS - Un-Fudgedly Awesome, Nameless Situation - A reverse acronym I just made up.  Shut up, I know it's not that good.  I just made it up!", "date": "10/15/2018"}
{"review_id": "37TQcKGxOk-QzB6Bfdg92w", "user_id": "dG3dguEIUNEGgelPm-B6bA", "user_name": "Noel L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Staff was very friendly and helpful. Climbs are good fun, they have a great mix of routes. They offer auto so you can do more than Boulder when you come alone. Only complaint is that there's no place to fill your water bottle besides the bathroom sinks! :( What kind of gym doesn't have a water fountain?! Climbers should be working together to try and take care of our planet not making people buy pointless single use plastic at the gym!", "date": "2/11/2019"}
{"review_id": "TavEi0ci--9NO29mCCkAaw", "user_id": "eoljQ_5xB7c4ZOo7188ndw", "user_name": "Emily S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Cool place. Crappy customer service and people skills though. If you're new to climbing be ready to be treated like a moron instead of feeling welcomed and helped.", "date": "3/15/2019"}
{"review_id": "w6rN9K2sKAGQ8DEVx1G3lw", "user_id": "22LY5-dYRqlhBR_cLn0OXQ", "user_name": "Aimee W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 8, "funny": 4, "cool": 10, "text": "I'll admit facing my fear of heights here was terrifying, but Hangar 18 does a fantastic job of making rock climbing accessible and easy to any level climber!Our dear friends invited us as a part of a Groupon deal so I mustered up all the courage I had to try something new. Upon arrival we were asked to fill out waivers and orientation checklists on personal iPads. It was my first time, but the staff does offer hour classes for anyone to become accustomed to the equipment. They also offer rental shoes and harnessess $3 per person!The actual rock climbing walls were maintained well and labeled for difficulty. They also offer powder to enhance your performance as your hands do get sweaty climbing up. There is also extremely nice restrooms with a small locker room (bring your own lock) to store any clothes or belongings.I had such a fun time challenging myself here and watching others do the same. Highly recommend this place to anyone looking to learn to rock climb!", "date": "3/5/2018"}
{"review_id": "OlCV7ft81ayeWS4ju7yxEA", "user_id": "v2MmWzLnOCdR0_UiT-SWMg", "user_name": "Alexandria G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 4, "funny": 2, "cool": 0, "text": "My kid and I recently started climbing, and we like the gym very much overall. My only complaint is regarding the blonde chick at the front desk. Like, by all means, please finish your conversation while I stand here awkwardly waiting to return the items that I paid to borrow. I'll wait for you. My kid thinks she's \"snappy\", too. So there's that. You work in a super dope ass place- have a better attitude.", "date": "7/30/2018"}
{"review_id": "U-erDUB8-U7P36JjWdj7nA", "user_id": "NjTUOCMvgitj1F92ZnHz2A", "user_name": "Katelynn M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "Great activity to do with friends!I have been wanting to go here for so long and I finally got a couple friends to go with me. I purchased a day pass for $21 (or $22) for myself. Upon entering, I had to fill out 2 lengthy digital forms at their ipad station. Checking in took longer than expected because the front desk was so busy. I would come in 15 mins early to get forms filled out and to beat the rush of people.After checking in, my more experienced friends and I chose to try bouldering the easier v0 and v1 options. I really enjoyed the wide range of climbs that that they offered. I found one called the \"squatty potty\" where you started in a squat position with your hands on two poop shaped grips. It was a great laugh and fun to try.We stayed for about 2 hours. I wish I could have stayed longer but I was just too tired and my hands already ripped. Overall, this place is large enough to come with a group and the atmosphere is very friendly. I found multiple times that strangers helped us find the right footing and holdings while climbing. Great workout and great fun. Check them out if you haven't already!", "date": "1/16/2018"}
{"review_id": "uz4Wc4v6eYCjwtbxzWop0g", "user_id": "AR4gohLUp0K6emGJ8lx1EA", "user_name": "Red R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Customer service is a definite 1 star here. They seem underpaid due to their angst on doing their job. The rental shoes definitely have fungus growth due to their overwhelming foot stench. The only sense of safety really comes from the orientation videos which were great but still confusing. The waivers we signed are extraordinarily ridiculous because the staff just gives you harnesses and push you along so they can get back to talking to their friends about gossip or whatever they did last weekend. But hey, i paid the cost plus the fees and i climbed so i guess this is another place i wouldn't recommend. Bring extra socks because the funus transfer from their equipment into your shoes is serious.", "date": "3/24/2019"}
{"review_id": "Iwmxj8o2CSrFRtksWLR7RQ", "user_id": "Z39kx8fc9uox67hP953cEw", "user_name": "Vi N.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Climbed here, and occasionally at other Hangars, for about a year. I've climbed elsewhere previously, so this review is flavored by comparisons to my other experiences in the Bay Area/central Oregon.Firstly, this pricing is legit. I don't think I can get a $35/mo membership, or a $300/year membership on Groupon, anywhere else I've ever been. For that price you can go to any of the Hangars, which are all a lil' different. But I'll focus here on Upland.There is a solid amount of bouldering and lead set-ups at this location. Two new auto-belays. Limited options for top-rope, but enough for new folks to shimmy on up. The routes can be really cool/brain teasey, even if the grading seems, to me, sporadic and stiff (but I'd probably take that last bit with a grain of salt, since I'm a pretty casual climber who has plateau'd at V3s. Sometimes I can climb V4s here. Sometimes I can't get up their V2s. It was frustrating at first, but after a while, it bothered me less, and I'll just try whatever). Staff have generally always been nice to me, but are maybe kinda hands off, so if you need 'em, holler. It's not my favorite gym in the world, and not the most aesthetic or clean gym. No bells and whistles. No AC either, for that matter, but there's fans... And lots of chalk (; Just skimming other reviews here and thought to say, for first timers - if you're worried about falling badly/don't yet trust yourself to fall well, I'd consider trying top-roping first instead of bouldering.", "date": "7/17/2018"}
{"review_id": "l_aTfIKLi2TEnHU_rfcn-A", "user_id": "9sZEKN1_R7u7KeS02xDyhA", "user_name": "L C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Good place to climb. Belay lesson was very clear. New membership is affordable. Though it's smaller then the one in Riverside, but it's closer for me.", "date": "12/18/2018"}
{"review_id": "sSpV-snp3SfQVQ7TsHoi5g", "user_id": "9kPKXcqHL2T0Y3IN_YpqXQ", "user_name": "Erica E.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "This was our second time here and it was not the same experience. Our kids felt the workers were a little rude and not very friendly. Friday is definately a place for the \"regulars\" and not for any newbies. One of the climbers yelled at my son.  And a worker yelled and humiliated a Spanish speaking parent who climbed for 5 seconds without paying and was scolded in front of everybody.  Probably will find another place to take the kiddos.", "date": "9/28/2018"}
{"review_id": "grVqM8mTJHyL0i4cO16Sgg", "user_id": "3SYnR-77-X45LstaEUhf6Q", "user_name": "Katelyn M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 6, "funny": 3, "cool": 0, "text": "Came here June 24 with my 3 other people. Terrible experience with using Groupons, their waiver system, and the workers there.We had 2 groupons for \"2 intro to rock climbing classes\". We came in 1.25 hours before closing but they said that they don't give out lessons after a certain time. NO WHERE DOES IS THAT MENTIONED ON THE GROUPON. I already drove 45 mins to get here so I don't want to come back another day, plus I was leaving for college the next day and won't be able to use the Groupons before they expire. The worker gave us the option of bouldering so we did that. I've done the rock climbing class at Riverside but my brother, cousin, and friend haven't. My brother and cousin have been to this Upland location before for bouldering so their waiver was already in the system. However it took the front desk 10 mins to pull up my waiver from Riverside, they had to call the Riverside location to finally confirm it. This was my friends first time at a Hangar 18 location so he had to fill out a new waiver. After submitting it, he had to wait for a confirmation email but it never came in so they had him fill out the waiver again. Waited more, still no confirmation email, so he had to fill out the waiver another time! Finally got this waiver confirmed AFTER THREE ATTEMPTS and 35 MINUTES OF WAITING.After confirming the waiver we only had around 40 mins left to do stuff. None of the workers even bothered to explain how bouldering works or safety precautions. My friend who has never done bouldering before was completely lost and I had to explain to him what to do.The Groupon states all gear is provided, but I guess that is only rock climbing gear. When I went to the front desk for chalk, they said it isn't included. You would think since we weren't rock climbing(so already not using any of their material) and with our time they wasted waiting for the waiver system, they could at least lend us some chalk, but nope. No compensation at all.I'm writing this review really late because I tried contacting them about my poor experience, to see if they could do anything about it. But one month later and I still have not received a response. Overall I was disappointed with this Hangar 18 location. Not worth the drive, my time, or the price I paid for the Groupon.", "date": "8/9/2017"}
{"review_id": "kRfP1l6zLFjzlwTIpY_lag", "user_id": "yL8JIaZmUtt2L_y-rlSszg", "user_name": "Vinla K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went for a birthday party of my daughter's friend. At first she was skeptical about this place because she never been to one. The staffs are super friendly and fun. They taught the beginners tricks and tips how to climb the walls. Of course my daughter got too excited and kept on challenging herself to try the harder and harder obstacles. There were different levels and they color coded them. We loved this place. She even think of doing her birthday there too. That was an awesome party for like 7years and up, up, up. Means adults will enjoy this place too.", "date": "6/15/2018"}
{"review_id": "AhkbWF09kNbMrUxPF01lrA", "user_id": "X0smwzdpSGrIInWyO5GrWA", "user_name": "Juvi G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Thrill seekers, rock climbing enthusiasts, and lovers of scraped hands and peeled skin rejoice! This is the perfect place to get all that, and a full-body workout without actually going to the gym. The place is spacious enough to accommodate large groups of people with room left over, and the climbs themselves are suited for people of all levels; though, beginners will have a tough time the first few tries. It won't take long for you to realize that as easy as it looks from the ground, you will need to train your body to move in ways it's not used to and use muscles that you didn't even knew you had to keep your hold/ balance on these walls. The cool part is that they have both free climbs, where you're not strapped into anything, as well as harness climbs that will take you all the way to the ceiling- in the safest way possible, of course. It's perfect for people who need a bit of a rush in their lives.The memberships start off pretty affordable, but get more and more expensive as the months go along. I guess they're confident enough in the addictive nature of rock climbing that they know you'll want to pay upwards of $30 a month just to keep a membership there. If you live nearby, however, and you happen to hate the gym or working out normally, you're in luck. When you're a member, you can go every day, and stay as long as your heart desires/ your hands and body hold out.For newbies, I highly recommend finding someone who has a membership and using one of their free monthly guest passes to scope the place out before you sign up yourself. I also recommend buying a cheap bag of chalk powder at your nearest sporting goods store as your hands will be feeling the burn after the first few climbs. If you decide this is your new home away from home, you may also want to invest in some rock climbing shoes of your own, as renting them here will cost you $3 a pop, and may or may not make your feet smell really badly. Hey, you never know who has used these things.Good luck up there. Safety first!", "date": "1/7/2017"}
{"review_id": "x1dtxGGsA5gPdTyQ2jXxyA", "user_id": "LmU8b6B7IZMQnMV-roaq5g", "user_name": "Callie L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So I read a ton of reviews before we went yesterday. A lot said it's hot and the staff are unfriendly yada yada. I personally was there for a tween birthday party. I was way too early, but the staff ,Chris & ?? , I can't remember the names, they all had big friendly smiles and were so kind and helpful. Yes, it's warm in there, but it's not a day spa or luxury movie theater, so get over it. Even the 2 girls that were in charge of our group were super sweet and informative with my many questions. I can't say what the experience would be had I just walked in the place on my own as a first timer. But my experience with everyone I came in contact with was customer service A+. My daughter had tons of fun and went up 11 times in the hour + we were there. She wants to go back.", "date": "6/3/2018"}
{"review_id": "_IH13IXYyMv_Kh8kbIDM1Q", "user_id": "EsHp0r9lq9_Why7gPrX3GA", "user_name": "Andre B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 5, "funny": 0, "cool": 0, "text": "I'll give this place two stars because it was a fun experience. But the employees are very condescending to first timers. They seemed annoyed at any questions. What really threw me off about this place is when I went to throw my water bottle away. As soon as it went in the bin I hear an angry \"NOOOOOO\" coming from the Caucasian blonde girl that works there. She pulled it out of the garbage shoved it at me and said \"dude fuckin recycle\" in those exact words. I wasn't aware there was a recycle bin back at the entrance. The asian guy was somewhat nice though. But ppl like that girl are just giving your place a bad name. I've never been talked to like that at any establishment and I won't be back.", "date": "6/22/2018"}
{"review_id": "0UcaFphIzvnXL6oNOs7PUw", "user_id": "dQxRYZ8Fdhhe4me5JSjpXA", "user_name": "Abe H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 4, "funny": 3, "cool": 0, "text": "I am a rock climbing gym rat. Yea, you heard me. I have done some cool climbs outdoors, but most of the last 9 years have been spent inside a comfortable gym with an average approach of 50 feet from car to wall. So just trust me when I say that I have been to a ton of different climbing gyms. Hangar 18 in Upland is... \"special\". Let's start with the facility. It's an old airplane hangar. Cute. That doesn't sound so bad right? I'm pretty sure if you left a small child alone in there, they would develop lead poisoning. Don't worry though. The lack of air conditioning or basic insulation will ensure they die of heat stroke first. Also, don't go with an open wound. The polished holds will most likely give you a staph infection after you're done flailing on that V2+. Did I say \"sandbagged\"? Sorry I meant \"cemented\". It took me 3 months to discover that they actually vacuum the floor. I just assumed that the clumps of hair on the ground paid rent, along with the dirt and loose chalk. Do you like to climb during the hours of 3pm to 9pm? You're in luck! There will only be 200 people there when you show up. Smelly elbow room and nowhere to put your stuff is cool right?In addition, this gym is on a long list of places that bans the use of the ATC. Have you ever belayed a lead climber with a Grigri before? Neither have I because I'm not an insane person who likes to make my life harder than it already is.Ughhhhhh. Ok, ok I'm done. And after all that... this place isn't so bad. You know why? $35 bucks a month. That's why. You get what you pay for. There are definitely some good qualities too. The setting is decent, the walls are moderately high, and the staff is pretty cool. Yea this place isn't the ritz, but at least they aren't ripping you off. And in the world of endless, picky Yelp reviews, isn't that what matters most?", "date": "11/7/2017"}
{"review_id": "zRHqqKi7x9GqNyOYufbAAA", "user_id": "O1z2iF2GHVoCrVP2earY2w", "user_name": "Dustin L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 4, "funny": 1, "cool": 0, "text": "I was hesitant to come here. My manager said it was a cool place but I read a lot of reviews stating poor customer service and the staff being rude. I'm also completely new to bouldering and know very little about it (sorry if I fudge up the terminology or am wrong about something)I don't know if other reviewers have their panties in a bunch or if I just lucked out on who helped me, but I had a pleasant experience, almost exactly how I would want to be treated. (Unless you ask questions or look like you're having issues, they leave you alone to fill out the forms [2 forms for adults], give succinct explanations of the rules and how it works there, and give you free rein after you pay)The cost for a day pass is $18 while monthly membership is $36, so membership is definitely something to consider. I'm still on the fence since this is close to work not home, which means I have to bring another set of clothes each time and would only come here after work. (They have multiple locations but none near my house, closest would be a 30min drive)Shoe rentals are $3. They were really helpful and nice about shoes. They explained that they will be very snug fits for usage purposes but if they were too uncomfortable, I could switch them at anytime. I did have to switch sizes after 2 climbs because they were too tight. I didn't experience anything rude, condescending, removed, or anything negative in general from my interactions, questions, and request.TL;DR customer service is good.The facility itself looks alright, a bit smaller than what I thought it would be. There are very bouncy floors for the bouldering areas which made me feel safe in case I fell. Place doesn't look dirty, it doesn't look pristine clean, but that's what I'm expecting when you have tons of sweaty people with their hands covered in chalk. A wide range in difficulty available and it's at most a small wait to climb the wall you want.So why not 5 stars?1 star is docked for a few nit picky details and what I felt was lacking.What was lacking: More beginner routes, maybe separate them as well so it's easier for new people to navigate. There's a limitation on space so not everyone can be catered to, but I think there should be one easy incline wall for newbies to start on. Lockers would be cool. There are cubbies under the benches for you to put your stuff. I don't think people will go through/swipe your stuff; but you just feel more secure with your stuff locked away. Nit picky: A/C would be nice. Didn't need it the evening I went since it was cool enough. I imagine it would be uncomfortable in a hot summer afternoon Fans they're using look nasty. I get they're hard to reach and maintain, but the dust build up on them is pretty significant. I don't particularly care other than for aesthetics since I have no health issues, but I imagine some people would find it concerning.Bottom line: Good place, especially if you opt for membership. This is a gritty place as the sport itself is tough, so don't go in expecting a luxurious comfy upscale setting and service. The employees are just regular people being themselves. I wouldn't recommend going on your own if you're not in the best of shape since you'll be on your own and even the beginner bouldering walls can be challenging. The rope climb/belay has that perk of whoever is helping you, could probably assist you in addition to keeping you safe. I haven't tried this, but my first time rock climbing, my partner would step back to help pull me up on parts I struggled on.", "date": "10/20/2017"}
{"review_id": "aq33Tvha9wsQ4W-9heq5BQ", "user_id": "pcSSOc-51VULx0pTIXHN6Q", "user_name": "Alex R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Screw this place my son and I waited hours between waiting, filling out their legal documents and watching their video. They over sold their memberships for the Thanksgiving weekend $10 sale. We paid $13 for the day pass plus rental for $19 total. We had a terrible experience and looking at first time experience and they would not refund our money. My son could not even hook up to climb or get a training session in just on big waste of time. I am very sad and my son was upset and was really looking forward to learning how to climb. Too bad I can't give 0 stars, hours wasted and $19 non refunded.", "date": "11/24/2018"}
{"review_id": "qlPe48KsZoTBzWbxIIulaw", "user_id": "UxR1qXpVp98bEqiFyjYcRA", "user_name": "P S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had an introductory lesson today (via groupon - GREAT deal!).  It was such an AMAZING experience that I simply HAD TO write a review!  We were a group of four and Ethan was our instructor .  Ethan  was AWESOME!  I know nothing about rock climbing  - a blank slate in the truest sense!  Ethan was SO Patient!  He made you feel like there was all the time in the world . This was after explaining the same thing to me FOUR times!!! There was never ANY sign of impatience or annoyance. Only encouragement and a Can DO attitude!  There was so much laughter!   I had a WONDERFUL experience!  The facility was clean and everyone was helpful and friendly - including the other climbers.  I will definitely be back!", "date": "12/30/2018"}
{"review_id": "BN9lkfS4_JgxYX6cCNopIQ", "user_id": "1PIhukPWnLi1RdVXlQ_BlA", "user_name": "Evelyn W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! I came here with 2 other friends (who have never climbed before) and they were pretty nervous. John was extremely helpful and very patient with us! We bought the intro package for $33 and since it was BOGO that day, we each paid $22! We learned how to belay and boulder. After rock climbing for about 3 hours, we decided to get the membership and paid the difference from the original package we got. Highly recommend for newbies and anyone interested in rock climbing:)", "date": "6/7/2018"}
{"review_id": "vCM50IC6aBgA8CFcZAMdaQ", "user_id": "tMfaOki8xdRrzZUlH6fzJQ", "user_name": "Arturo M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "First time visitor, called the Rancho spot and they recommended me to the upland spot instead since my kid was young. Stopped by this morning right as they opened, staff was very cool and helpful. Had to sign a lot of waivers and misc documents a it was our first time but after completion we were ready. Went through the class on how to belle (if that is how it's spelled) and my daughter and I were ready. As she just turned three this week it was more of a trial to see if she was down and would like it or nor. Harnessed up and belle ready a she went all the way up the wall the first time. Came down and said \"Papi, I try again please\". Great time, will be going back, thanks H18", "date": "7/7/2017"}
{"review_id": "fUU9EcGpxFKenYtj3RpfSA", "user_id": "OBE8lAABXar9CNuXR1MS7g", "user_name": "Andrew C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Fun place to check out. Definitely had doubts on how fun and tough bouldering could be but it's different when you're hanging about 7-8 feet from the air and you need to reach/propel yourself to the next grip. I was faced with a predicament... do I try and reach and risk falling and snapping something up or just jump off... I opted to jump off haha. FYI you really won't snap anything up... just a fear I had until I finally decided to go for it and fell. It's a great time and lots of cool and helpful people. Very busy at nights so recommend going during mornings or afternoons, if able.", "date": "10/25/2018"}
{"review_id": "aY8poKvj74WDME9KtOYryw", "user_id": "RvZX6-0cTYcaLvF6IMgCYw", "user_name": "Ritika K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place ! We had my daughter's birthday party here this past weekend. We all had such a great time. The staff made everything really easy and helped us in all kids of ways. Cleaning and setting up the tables , cleaning up after , making sure all the kids were being challenged and included in the climbing. Thank you for making our daughters celebration a success!", "date": "9/16/2018"}
{"review_id": "gaeZsIhhiUGond6tVOddOQ", "user_id": "Fi5K-mlDg6OvNRYM8My2kQ", "user_name": "K R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place. Good people. Need to get my own pair of climbing shoes, tired of paying rental fee...", "date": "9/14/2018"}
{"review_id": "3QFBKzncoE9qppjBligg_Q", "user_id": "TKcA1OCdQdl2HsOyB7MFsQ", "user_name": "Briana V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Very cool place! My bf and I were new so we did a one on one instruction for $30 each and afterwards we could do some bouldering or whatever for the rest of the day. But after 2 hours your hands, forearm etc will be so exhausted! They let us use the chalk for free which was super nice because I know they charge for it.", "date": "5/6/2017"}
{"review_id": "gaN8dPFgQvZ8dTkpfluLUQ", "user_id": "XYvMJtHBme19L7czDA31CA", "user_name": "Brandon A.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 6, "funny": 3, "cool": 2, "text": "This place is terrible! I have been to many rock climbing places but the some of the employees are so rude! And the customers are also rude! And hog everything! Also this place is very hard to find if your not local.I don't recommend this place to anyone. Sender one in Santa Ana is unbelievable and I recommend it to everyone! They are so friendly and not cocky! Everyone helps everyone. And Sender one is 10 times bigger then hanger 18.", "date": "1/1/2016"}
{"review_id": "YU91t18oAAKOsJ6Iu_3-bg", "user_id": "1Vt3c4Bq3pxs6Puwa_f2uw", "user_name": "Nancy T.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Wanted to rock climb so a friend brought me along with him to Hangar to give it a try. When I first walked in I was so confused as to what I needed to do. I had never rock climbed free hand before, I had always rock climbed using a rope. They have two laptops at the front desk and in the beginning I just stood there playing around with it to see what I needed to do. Then after a good 10 minutes or so, a staff member asked me if I needed help. I signed the waivers and then asked him how much it would be for rentals and such. My friend had the membership, and apparently with that you can bring a friend in once a month for free, so I wasn't charged for the day. I believed it was 20$ for the shoes though. According to other reviews, they don't provide the chalk and you have to pay for it, but I always see people bringing in their own, as my friend did as well. Walking around I imagined it to be a lot bigger, but i guess it's pretty spacious for an indoor rock wall. I barely made it through the level 0's and 1's and my hands were getting sore. I made the wrong choice in wearing both a black tshirt and a black leggings as the chalk just covered everything. Overall, it was a great experience, but it's way too far of a drive for me to come back just to rock climb.", "date": "4/20/2017"}
{"review_id": "1WEwQzeM6wltQITMB0_fDw", "user_id": "rmgntLQBvvbqx0_R0QMXww", "user_name": "Amanda W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So impressed with this place! Brought my unit of American Heritage Girls for a Climb On badge. Ethan taught the class and the girls had a blast. He was clear, friendly and very instructive without being at all boring. The other Ethan, I think he's the manager, was super accommodating. Our troop looks forward to having more events here. Nice energetic atmosphere!", "date": "5/22/2017"}
{"review_id": "s3bavEPgpyqUt8g1NmO2Ow", "user_id": "qTe0MmzkkqMlzmhrsg3bFA", "user_name": "Derek L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "First time here...first ever climbing experience. The staff here were friendly and helpful. My girlfriend and I took the intro course for top roping to learn how to properly use the gear and...how not to fall and die. There were 4 of us total during the intro course and the instructor gave us enough one-on-one attention to make sure we understood everything. I was pretty nervous about our first climb on our own without the instructor...but by the second climb, I felt more confident. It was fun, thrilling and tiring. If I remember correctly, I think there were 9 \"routes\" that were spaced pretty close together. I was glad that we came early enough (around noon) to beat the rush of people. The atmosphere there was pretty diverse. Even though we were beginners, we didn't feel out of place. There were other first timers and others who were much more experienced. The age ranged from very young kids to older adults.", "date": "2/15/2017"}
{"review_id": "iO3_SArk5WHVMErzdJpn4g", "user_id": "bvGJsKihM4hEGHbCwu03Uw", "user_name": "Emmanuelle L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Good place to climb and nice people, but mislead us about the cost/pricing for when we returned.", "date": "7/12/2017"}
{"review_id": "aLDRrMfvyfvpoNlCx0OqSg", "user_id": "P493LVWMVlF1XIEWjcMPWA", "user_name": "Ren C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "This is my 2nd climbing gym I've gone to. Fortunately, it is way better than my 1st one. How so? 1. The employees. They are knowledgeable (which you expect they'd be experts when it comes to climbing activities) and helpful with tips if you only ask. 2. The gym itself. They have free memberships for REI employees and possible discounted prices for other individuals ie. students. They also have classes you can and may want to attend such as belaying classes. 3. Customers/climbers. Environment is friendly due to the customers as well. If you're looking for help when it comes to any wall, if you can't find an employee, trust that another climber will give you some pointers. Overall, it's fun working out and having a positive vibes from other climbers/gym goers. They have multiple locations so don't hesitate to look around for the location near you.", "date": "6/25/2015"}
{"review_id": "a14YM0HD8dCuQmLLBrbupg", "user_id": "ESCcbvs_p55nukBzCSCFaQ", "user_name": "Sarlyn P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I've been going to this location for about a month now.I definitely like their rental shoes here better than other locations because its more comfy.They have a lot of challenging ones for bouldering here but they also have top roping which i haven't tried yet.their staff are friendly.they have a lot of fans at this location but i prefer air conditioning.only one complain though... that one room with no window or any air circulation is the worst because kinda stink!", "date": "8/4/2015"}
{"review_id": "Ad00VLloYAyOZM8qZii0wQ", "user_id": "AOsb45lNP7AzQwwWLUQxEg", "user_name": "Shanon Y.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Awesome indoor rock climbing gym!I've been coming here for about three years now and even though they are smaller than some other climbing gyms, the customer service and belaying lessons are great! They have a wall designated for rock climbing and another adjacent wall for bouldering with cushioned mats all around. The skill level of the climbs are clearly labeled and they change it up pretty often.This past weekend I came with my bf to use a Groupon for a full day of climbing which included the belaying lesson and rental equipment. Our belaying lesson was taught by Mason and he was patient and very thorough in explaining all the details of how to tie the figure 8 knot and going through all the safety procedures, even though he had already taught several lessons for the day and was getting ready to leave. There are also several other locations of Hangar 18 in Riverside, Long Beach, South Bay, and Mission Viejo. I've only been to the Riverside location which is a lot bigger than the Upland location. Tip* Look out for Groupons and special deals on their website! It saved me a lot of $$$.", "date": "8/5/2013"}
{"review_id": "G5a9OScVRBJ_ZqW8Phk5Cg", "user_id": "xFaKmqKiqeOiy6FjrkRpFA", "user_name": "Mel P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "My friend Brittany invited me to try this place out. Neither of us had ever rock climbed before but we are always up for a fun challenge. Our Instructor Mason was so sweet & super knowledgeable, we had a blast! We will definitely be back!! Thanks Mason!!", "date": "10/7/2016"}
{"review_id": "PdTO7kls0VoFZlM6Rd8skQ", "user_id": "J2P0D5ylAiiQnbG4nES7wg", "user_name": "Aaron K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The atmosphere and chill attitude of the employees is awesome.  Also tons of bouldering.", "date": "9/23/2017"}
{"review_id": "-YR00C2F3Zg9p89wDVMTkQ", "user_id": "MF2hyQHEu1Kzyb2IgcLuPg", "user_name": "Ivy W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 4, "funny": 3, "cool": 3, "text": "I'm going to start this off by saying that I'm an absolute beginner and that my best at this gym was accomplishing some V0s. Adding to that, I've also had the pleasure of visiting Rock City in Anaheim before coming here, and I can say that this Hangar 18 is the bigger of the two. There's the option of top-roping, bouldering, and lead climbing with plenty of routes and space for all 3. The employees here are friendly and although they had some issues checking me in the first two times, they were very apologetic about the situation. You'll see them walking around from time to time to give pointers (when asked) and to make sure people are being safe (i.e. not standing too close beneath friends while one is bouldering).While I make it a point to try and avoid Tuesdays because it seems to be more crowded, you'll notice people of all levels climbing on different days at night. If you want to save time, make sure you complete the waiver before arriving (climbhangar18.com/waiver…)!P.S. Check groupon for deals! I scored 2 one month membership for $53 (the price of 1 one month membership) that includes all rentals whereas a day pass is $16 per day.", "date": "2/25/2015"}
{"review_id": "UKNImZmdWbigpL5Swt--oA", "user_id": "1ZtJpUE9M6g4-u1TEXExUQ", "user_name": "Lawrence W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Upland, Upland, Upland.This is the first rock climbing gym I've ever been to and let's just say they sold me on rock climbing. My brother had been climbing for a few months before I started so I came in with his monthly guest pass (free for the day with rental shoes included). The staff was energetic, positive, helpful and really made me feel welcome. They have a promotion going on where the first month is just $5 and after my first day there, there was no hesitation signing up.The facility has belaying on one side and bouldering on the other. It can get crowded at times, but the climbing community is generally very respectful of each other's space. The routes are changed periodically, giving you plenty of time to work through certain problems if you get stumped. But it's often enough that you don't get bored doing the same problems over and over. It can get a bit hot inside with so many people climbing, but to be honest, it's never been a big issue for me. The padding on the bouldering side also seems fairly new so I definitely appreciate that. I've been to the Long Beach Hangar 18 and their mats are stiff and unpleasant (didn't realize how much I appreciated Upland until after I climbed in LB).So for those of you who have always wanted to give rock climbing a shot, I highly recommend  Hangar 18 in Upland. Take advantage of that promotion while it's still here!", "date": "8/2/2016"}
{"review_id": "dPbjchLxXltblNMLMTS_5g", "user_id": "axRCUZQrlT_bD1RZkFlNvg", "user_name": "Jerry W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 3, "funny": 1, "cool": 2, "text": "Been an off an on member of hangar 18 for a while now. I live far from any gym so I cant go very frequently. I would keep my membership when I could and cancel it when I couldn't go for a few months. I was told by an employee the last time I signed up I was able to cancel anytime over the phone, this was very convenient for me and allowed me to be a member much longer. When I finally needed to cancel it over the phone, Ethan (the manager) at Upland told me that is not allowed and has never been. He was extremely rude about it and even told me, \"no that is not what you were told.\" Insinuating that I am a liar, I know what I was told. Just due to how rude Ethan was Hangar 18 has lost my business forever. I hope the rest of your locations have better management and customer service in place.", "date": "10/30/2017"}
{"review_id": "JQeLlm_kBH3T1z9b_yK0iQ", "user_id": "rK7SGbL268sHrmz_Upldkw", "user_name": "Zoe O.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 6, "funny": 2, "cool": 2, "text": "Had to cancel my membership because I had wrist surgery. Received a call from an employee at the upland location that my card Info had changed so I needed to pay for the previous month and the current month (not a problem) I explained that I wanted to cancel and he said okay, I'll charge you for one month and then you'll have a free month if and when you want to return (so they would waive one months fee since I'm not able to climb)Looked at my bank account to find a charge for 81 dollars, which doesn't make sense even if I were to pay for the full 2 months since the membership is something like 32 a month. I called back requesting a return call so I can figure out why I was charged for 81 dollars....this was a few days ago and still no return call. Riverside location is way more customer friendly.", "date": "2/21/2016"}
{"review_id": "4V8E6fRTN_FhJa67KvlACg", "user_id": "EndbpS-MrxeCIdP4mMo14Q", "user_name": "Rebecca T.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 9, "funny": 5, "cool": 2, "text": "Meh.The two staff were overwhelmed with amount of people coming in. Doing too many things at once, ie: answering phones, signing in new people, teaching intro classes. I was irked by the fact that the desk boy was a snob when I mentioned the Two for Tuesday day clearly advertised on their website after he tried to charge me for both of our day passes. His almost verbatim comment, \"Oh we don't mention that and for good reason, but you know if you ask for it, we will give it to you.\" Um what exactly it that suppose to mean? You don't offer the same offers on your page unless someone asks for it? That would be like me going to a happy hour and ordering drinks but being charge regular price because I didn't mention it was their happy hour. But I digress.As others have mentioned, their holds are filthy and frankly the gym is just too crowded for it's own good. Having climbed at Threshold in Riverside (before it joined the Hangar 18 family) I am use to an open space, ample places to sit and actually missed the experience of being able to top out. As someone who has brought several friends with them to other gyms, it would have been nice to have seen one or two V-B climbs somewhere for true newbies. There's nothing super wrong with this gym it's simply not my cup of tea.I basically walked into Hangar 18 ready to sign up for monthly memberships for two people but decided to pass.", "date": "1/28/2016"}
{"review_id": "FLrRVCFWmQs1_zuBYAfuAg", "user_id": "mL8-lKeuD9J1QtCIFiMPsQ", "user_name": "Bryan K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 2, "funny": 5, "cool": 1, "text": "They charge you $21 for one day my wallet feels violated. Chalk isn't provided which is an abuse of the captive consumer as blisters form without it. Chalk is $4 and it is not the $4 that gets to me. It's the fact that they think $21 per day isn't enough to cover chalk. We are using THEIR equipment and it is their equipment that causes blisters. They don't have the courtesy to provide chalk powder which is dirt cheap. With that logic those who decide to save $4 deserve blisters?", "date": "3/17/2017"}
{"review_id": "q_GTyOwb5ZqLTR85whtHyQ", "user_id": "oGfnD7pKcU2VzxCl2wzdqw", "user_name": "Kyle L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 2, "cool": 1, "text": "This was my first time going to any Hangar 18, I usually go to Rock City in Anaheim (great place!), and it definitely didn't disappoint! The entire place is pretty spacious and has a wide variety of different climbing levels that can satisfy people at any skill level. Each climbing trail is clearly marked with the difficulty and also a unique name. The left side of the building is for climbing with the rope, and then the right side is for bouldering. They also have a little room in the back that's for bouldering as well. My group came at night and they were pretty understaffed at the time, but Isaac did a great job of trying to accommodate everybody who needed help. He was teaching people how to work the ropes, signing people in, and helping out the climbers; super nice and overall a great dude. I also watched him do a bouldering trail that was pretty high in difficulty while wearing jeans, just to demonstrate for another climber; he probably finished it within 10 seconds. How the fuck do you do that?!Overall I had an excellent experience at Hangar 18 Upland. Great place to get your climb on and the service there is awesome, everyone there is super friendly and willing to give you pointers. Definitely recommend going here with your friends.", "date": "3/28/2015"}
{"review_id": "qkLqQKJ8-1rs3k9nrOoltA", "user_id": "Y-vY46qEM8S8rn-oo3n3Fg", "user_name": "Niyati P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Overall: Had a Groupon so for $15/person, it was a great experience for the price. But perhaps a bit underwhelming for the general $33.Location/Ambience:Located within a warehouse-like building, it is pretty hard to find/may seem a little dead in the surrounding areas especially during weekdays. However, any skepticism of the place is negated once you step inside - it is actually v pretty with all the colored rocks. The place in itself is not meant to handle huge amounts of crowds, so avoid morning hours especially during breaks. Around 1pm, it started dying down and theres no wait time to climb any of the levels.Experience:With our package, they offered lessons which is definitely needed. Lessons happen at the hourly (11am, 12pm, etc) so be cautious of the time you arrive. 1. Come in, sign your life away with liability forms and orientation checklist. Receive harness + shoes. 2. Wait til hourly lesson. They teach you the four checks and basics of knotting and safety of coming down. Our instructor Isaac was super helpful and patient. Warning: This is a partnered activity and you will need a second person to pull the rope as you climb.3. After a bit practice with the instructor, you are free to climb anything you want for as long as you want. There's many different levels but unless you are a natural with much upper body strength, the kid ones are where its at. An hour or two of switching off between the climber & rope handling, we were pretty much done with it. Its a decent size, but as a beginner there's only so many you can climb.", "date": "3/25/2016"}
{"review_id": "kH2LVdYWTS8bTbYU5k8Xew", "user_id": "453PyrruXZCdueR_LpXwbg", "user_name": "Laurie P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Brought a group of 12 children and teenagers to Hangar 18 in Upland today and we had a great time! Everyone in our group was very happy with their lesson from Isaac and checkin with Brad. Those two guys are great! Friendly and patient with our entire group of newbies. They made the kids feel comfortable and welcome to be there. It was great to see even the most timid and shy kids in our group try something new and out of their \"comfort zone\"! Great job Hangar 18 Upland, Brad and Isaac! You were wonderful to our kids ranging in age from 7 to 20 years old! Many of the group intend to return!", "date": "7/27/2016"}
{"review_id": "3F1M8Zmeux4JX8la3HpZBg", "user_id": "QwhpEA9LY0GiORimaDxNDg", "user_name": "Deanna L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 1, "cool": 3, "text": "Quick background: I'm fairly new to climbing. A pretty solid 5.10a top rope climber and about a v1-v2 on bouldering. The boyfriend and I are frequent climbers at the Long Beach location (like at least 3x a week) but we were up in Rancho Cucamonga to do our taxes and our gear was in the gear, so hey, why not? The location is pretty well-hidden, tucked down a small street in a large warehouse. I really liked the atmosphere there on a Tuesday afternoon. No stinky smells, beautiful natural light coming in through the big windows. Just a nice peaceful vibe for a bouldering session.The bouldering is varied and extensive here, with a couple topout sections where you can climb onto the second floor and take the stairs down. I hope they're working on a gym section or something cool here because it's great space that's not utilized right now. The V1s don't seem to have as much of a learning curve as the Long Beach location, which I liked a lot.Top-rope seemed to be fairly varied, too, and they have a crack! I'm a little new at crack climbing but it seems so challenging and hard that I really wish Long Beach's top-rope section had a crack so I could practice. Overall, if I had a free day, I'd totally drive all the way out to check it out again. Great spot!", "date": "2/29/2016"}
{"review_id": "oh0bz42Nql5sTNycyOjDAw", "user_id": "wepFXQjZB35kMNj3BTYFlw", "user_name": "Will H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 2, "funny": 2, "cool": 3, "text": "\"At first I was afraid, I was petrified\"Sorry no Groupon sob story here. I showed up after my friend Kristi had told me about this place and had urged me to go. I don't normally do things like this but fortune favors the bold and it was the Year of Will. When I got here, it was a little intimidating. I was there on a day pass and there were quite a few veterans already there. There's huge walls with an alphabet soup of colors and shapes on them. Mason was there to get me all signed up, get me all set with the shoes, and the basics. Mason also taught us how to properly belay using the GriGri. I actually had a lot of fun that day and before leaving I decided to go all in and sign up for a membership. I probably would not have had done so if Mason was not as helpful or as accommodating as he was. The staff here is amazing. They aren't passive and you can tell that they are actively passionate and excited about getting people to climb and teaching people how to be become better climbers. I get it. You can climb a rock anywhere. For free (outside). But its the staff here and keep me coming back for more. Alyse, who works with Mason, is one of the sweetest girls you'll ever meet. She's got the brains, the beauty, and the brawns and she is truly passionate about helping you conquer that tough bouldering problem or about talking you through the crux on that tough top-rope route you've been stuck on. The people here are truly rock people; they aren't some high school kids looking to make some cheese on a part time job. They foster the development of the rock climbing community and they'll constantly push you and encourage you to be a better climber. Honestly, I owe Hangar 18--and by extension, Mason, Alyse, and the crew-- a huge thank you. They've turned a one-off field trip into a full on obsession.", "date": "9/18/2014"}
{"review_id": "zhqqhWmd1M1dReEt7jW71w", "user_id": "pGkdw461vhwNNYtNHntGhw", "user_name": "William M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 5, "funny": 5, "cool": 3, "text": "Fun gym.The climbing here is good, a little crowded due to a shared layout but still a fun place to climb.Unfortunately the staff are TERRIBLE! Unhelpful, snob-ish and condescending. I'd like this gym a lot more if they hired some better help.", "date": "11/30/2015"}
{"review_id": "OWxZwFn8noOqDJFcrHZUjg", "user_id": "hHCKcNVTTC2CbwedmUI6mQ", "user_name": "Larry D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "First time here with my son.  He has been in the past and loved it.  I learned how to belay the ropes for him to climb.  Ashley taught me the basics and away we went.  Would recommend for the teachers to watch more than once to make sure we don't drop anyone.  Other climber were cool and answered other questions I had.  Fun time to spend a few hours.  Next time will pay for myself to climb as well.  It was cool that they do not charge the parents to learn the belay class if the climber is your own kid.  Had a fun time,  good work out away from the ball field", "date": "7/29/2017"}
{"review_id": "I-wT0H34osxS7AiGg3DhMw", "user_id": "FfYyGz6GYA1gw--vW4jT1Q", "user_name": "Meg V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 2, "funny": 2, "cool": 0, "text": "Nice gym, HORRIBLE customer service. Emailed the manager, he offered me a pass to come try the gym again, then NVER RESPONDED. That customer service tactic only works if you actually come through with what you offer. Lame and unorganized.", "date": "1/27/2017"}
{"review_id": "p-j5-aSWSVvV8VpnqE9rCg", "user_id": "FDl2n7XpuVX1iiKoxV5nuw", "user_name": "Bill D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Came here for sons bday and was very impressed with the place. Party area is upstairs and kids have their own wall to climb well more like 6 walls. Staff help with kids climb the walls but they can also climb the big walls if they want. All were included for the 2 hours we had th le area. Great place to have fun and kids really liked it.", "date": "1/8/2017"}
{"review_id": "drhbA089UXO50M5-jaahJQ", "user_id": "smmIt9RzdaGGr2SuqVsdHA", "user_name": "Hannah R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have had nothing but awesome climbs at this place. Top rope and bouldering are challenging and interesting. No funky gym smell and excellent lighting. Staff are helpful, very informative and eager to impart any knowledge they have. They always welcome us with a smile, eye contact, and remember our names. I'm not sure why some reviews say the staff are snobbish. They are super chill, boys of summer, \"come on in the climbing is fine\" type. Their relaxed air may be what comes off as snobbish but then just ask them and they're happy to help. 1 star off only because I really like top rope but I'm running out of choices for my level. Please add more top rope.  Pretty please!They just had new lead rope climbs installed today. Come try them out! I can't wait to be strong enough to try lead rope soon.", "date": "7/6/2016"}
{"review_id": "d62JPa9ePBoxzw7dBGNkZQ", "user_id": "VjyUCuAbGUTgKOGQIdFFxg", "user_name": "Missy V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 2, "funny": 3, "cool": 1, "text": "This gym is just awful. The reason for this low rating is mostly due to the incredibly rude staff. They always seem as if you are bothering them. I just recently climbed there and need to use a GriGri, which to get you can give them your keys. Somehow I ended up with one device and two carabiners. When I returned them I put the items on the desk and went to the bathroom because the employee was busy, so when I returned and asked for my keys an employee who I believe was Isaac, pretty much accused me of stealing a device! He kept telling me I did not return the device when I did. He finally handed me my keys making sure to let me know I did not return the device but he'd give me my keys anyways. SERIOUSLY?! What a jerk, and this wasn't the only bad experience I've had here. Riverside location is WAY better.", "date": "12/4/2016"}
{"review_id": "WU1rbYCGcXalsu5xRN4AiQ", "user_id": "LtOAHuovwG8cSlZOcM1diQ", "user_name": "Hans T.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "Been a member for over 2 yrs. Staffs are super friendly. It's my favorite climbing gym among all hanger 18 gyms.", "date": "10/24/2015"}
{"review_id": "RM5WrPLhbOk-in6bjXFTvQ", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 2, "cool": 0, "text": "This was the third Hangar 18 i have been to. (I've been to 5 so far) and I love this place. Textured walls are great cause it's more like the outdoors and it does wonders for helping you smear. The staff is super friendly. Shout out to Ethan. Everyone there is there to climb so people are friendly and helpful (some are). It's strictly bouldering which im fine with. I do love bouldering and sport climbing equally but I do Boulder a lot more. It's a great place to climb at, not too far from riverside so I've already been a couple times. The gym is still fairly new so the crash pads surrounding the entire gym are still pretty stiff. But overall I always look forward to going!", "date": "12/2/2014"}
{"review_id": "yN0EG7JldEIrr3_3d5Iv5Q", "user_id": "KwAgVHRiPLjU6KRJz_viqw", "user_name": "Kate H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 9, "funny": 4, "cool": 3, "text": "So far, not impressed. The staff is a couple of barely out of hs guys who stare at your dumbfounded as to why you're there. They tell you one thing and do another. Their timing is THE WORST. Talk about bad service. They stand around talking to their friends more than anything. They expect everyone who walks in to be an expert looking to kill time. Seriously,  they offer a groupon for beginners lessons and treat you like crap for not knowing anything and make you wait around for eveeeer.Long story short: save yourself the disrespect, headache, and most of all time & don't come here. We won't be coming back here & don't have anything nice to say about this place or the people who \"work\" here.", "date": "8/7/2015"}
{"review_id": "6VM68dNuWEt8Jlua6PMfbQ", "user_id": "Obn21VXqJZroGeT-D7Zz9Q", "user_name": "Danica L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "The Upland Hangar 18 is okay...it's much more spacious than the other Hangar 18 locations I've been to. If it is nearby, it's an okay place to go if you want to climb but here are some things to keep in mind:1. Day passes are now $18 (up from $15). this likely has to do with the fact that Sender One just went up from $22 to $24, but honestly given the size and variety, if Upland is going to be $18, I'd recommend just going to Sender One (especially if you have to drive far to get to Upland).2. The staff are generally not that polite and not that helpful...we spent a fair bit of time at the beginning just trying to get everything done that needed to happen to be able to climb and mostly were ignored as the staff were chatting--about non-work topics--with each other. This also resulted one of the staff members being somewhat lax about safety checks...it was okay because everyone in our party was experienced, but wow. Especially when the excuse was that the person didn't have time...he might if he spent less time chilling with colleagues.3. The routes, as with most gyms in the area, are rated in a rather inflated way. That's not really an issue, but do keep in mind that both the top rope and boulder ratings were very inconsistent and seemed to depend more on who had set them, not some kind of consensus. Additionally, very poor use of the gym space...of the non-bouldering area, at least 2/3 of the wall space was lead climbing only...if there was a high demand for lead climbing that would make sense, but nobody was lead climbing while many people were wanting to top rope. There were a lot of great looking routes on the lead wall, too, that would be great top ropes.But hey, if the gym is close or you already have a hangar 18 membership, I guess it's alright. Next time I'm visiting a gym that I'm not a member of, it will be Sender One.", "date": "5/20/2017"}
{"review_id": "f4oU2PKP_eTpXfEoCM9zwg", "user_id": "Sguc1CtC-W6jWdo2EzblAQ", "user_name": "G B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Date night with wife.  First time time for us.  Signed the waiver online prior to arrival.  Sal (instructor was awesome) he recommended to use Groupon for better deal.  Paid $30 for both of us instead of anticipated $42.  About a 45 min safety instruction class (worth it!!).   Then we were set free to do our thing.  Shoes very narrow and small.  Regardless it was amazing.  Great workout and paid an extra $5 to have 30 day membership.   Lots of fun.", "date": "4/22/2017"}
{"review_id": "SeRS362pSeD4oufdDYm8xQ", "user_id": "vQ2CVbUPI8Nm82UjnUAvzA", "user_name": "Valerie J.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 4, "funny": 3, "cool": 3, "text": "Came here yesterday for their Tuesday BOGO deal. I've only ever gone climbing at LA Boulders and that place was awesome! Compared to LAB, this place was small and crowded (I assume most people also take advantage of the BOGO deal). There are no lockers to put your belongings, but plenty of cubby space. Though I appreciate that the worker told us that climbers are known to be very honest people...I also grew up in the real world. Glad to say our shoes weren't stolen (thanks honest climbers!), but I'd like the added security of a locker. I feel like Hangar 18 has the bare bones for bouldering. Perhaps if I wasn't a novice climber, this place would seem better. But I was very limited in my routes due to my comfort level remaining around the V0-V1s (not their fault of course). But I didn't get much climbing time in because there were so many other people who wanted to climb those routes too. I also didn't like that there's no topping out. There is a real sense of accomplishment when you top out, and all I could do was touch the top and then climb back down. Blehhhh.But whatevs. I had good company, so I still had a great time :D", "date": "5/20/2015"}
{"review_id": "fMeU5d83QdWOkP7JLwmymw", "user_id": "7Lu2UdGWiBTKAroOMG69-A", "user_name": "Richard L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 9, "funny": 3, "cool": 0, "text": "The good: The walls are pretty high with great grips/mounts if you try to overcome your fear of heights and practice indoor rock climbing. They have rental shoes and provide ropes for certain areas. This place is fairly big with room to keep your belongings in little storage areas in the center of the place. They also provide climber ' tape and powder to help you get through the climb. It made my rock climbing experience fun.The bad: There is a lack of climate control at this gym. If it's cold or hot outside, it's gonna be the same temperature inside. Another bad note is that the service is bad here. The only thing they're good for is getting rental shoes for you. From a guest perspective it only seems like two people are operating the gym. One is usually at the the desk and the other seems to just pass time climbing around the gym not really working.  The person at the desk seems to be also the one to teach the lessons with the ropes.  Every time I bring someone new, they always put me in for the later time. They teach it every 30 mins. While I was waiting I just saw the desk person chatting away with a friend and the other worker was walking around. So I wasted time just looking at them talk. The lesson only takes 15 mins. More about the bad service at this gym...i signed up at the gym in Rancho Cucamunga with three people under my name. I tried to cancel my membership at the upland location, but I couldn't cancel the membership because the worker (ELISA OR ALISA) could access it on her computer. She didn't want to help me out and told me to go to the gym in Rancho. I had to take it into my own effort to call the person in Rancho and deal with them because of the lack of service. The Rancho worker straightened everything out. When I tried to have the Upland worker talk to the Rancho worker on my cell's speaker phone she gave me a disgusted look and just called them on their work phone. I hate the service there so much I'm taking the time to write this review hoping this will be read.", "date": "1/1/2015"}
{"review_id": "J5L2WpuBJX1Lmv-_IRRnmw", "user_id": "Ez_IVkK94FK1392lcL6P2Q", "user_name": "Nicole D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "[ PROS ]-Varied degrees of climbing levels are welcome and they have different level holds-Climbing rocks are changed pretty frequently to mix things up-Friendly staff! (I've read some negative reviews but a lot of the time they might be understaffed or have a rush of people come in on a slow day)- Membership includes rental gear, day pass, belay lessons, yoga sessions, and even a awesome day pass (including gear and belay lesson) for a friend every month.- You can freeze your account for as long as you want in case you decide you want to take some time off or get busy. The only catch is you have to go to the location to do so, no calling it in.- Kids are totally welcome! My 8 year old cousin who is around the size of the average 4 year old had a blast climbing. They gave him the kid's helmet and a full harness for extra protection. Kids are only warned about how hard some of the climbs can be.[ CONS ]- For those of us who don't like the heat, there ain't no AC (but I'm sure hardcore climbers don't care) They do have a lot of fans though.- The place is a bit small but I don't complain about it much, there's usually enough room to climb unless it's a crowded day.- The price is a bit steep but I'm lucky enough to have gotten the cheap deal earlier on for $23 a month.- No chalk provided free (but I'm not sure many places do that anyway)***Parking? It's really not big of a deal to park on gravel, I'm not sure why people are complaining about it. There's not a huge lot but definitely enough parking.", "date": "10/13/2013"}
{"review_id": "a5DPzWXY20dCQTtf0qRwDg", "user_id": "YdPAK_YqwkziiDoYHkMXcA", "user_name": "Victor C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Haven't been here for a few years. First time I came I had a Groupon and had fun. Friend has a membership here and brought me on a guest pass. (They get one free guest a month) first time bouldering. Loved it! Drank my pre workout and flew up tge first easy walls before I hit the wall lol.", "date": "12/24/2016"}
{"review_id": "jIQvmz_vIs4jiGNvCKI8NQ", "user_id": "NfOF_b0P03nNI7thRTQC2Q", "user_name": "Agie L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Not gonna lie, rocking climbing indoors didn't really seem appealing to me cause it didn't seem like it could be that fun... I was wrong! After a month of membership, it really grew on me! LOCATION: I definitely am not in the upland area all that much, but surprisingly the location is pretty sweet. It's in a residential / warehouse area? Though a bit secluded/quiet, I didn't feel sketched out. Plenty of parking! There's an independent storage that sells random antique/second hand stuff literally next door as well to check out. Also conveniently within walking distance of downtown upland for more small random antique shops/ coffee/ food!STAFF / CROWD: Everyone was actually really nice, welcoming, and courteous. I've never climbed before and both the new and old members always offered help whether it was with putting a rope on a specific climbing route or with tips for better climbing. MEMBERSHIP: I believe it like costs $53 for a month of membership. It offers free fitness classes and you can go as many time as you like within the month as well as for a free belaying class (to teach you how to use the harnesses and ropes when with a partner). It costs  $5 to rent a harness and shoes each visit. They also offer membership discounts through renewal promos, Black Friday sales, and holiday sales! Personally, my friends and I snagged a groupon promo, which was like $53 for two people for one month- entailing 1 free belaying class, free fitness classes, and 1 free guest pass at any of their locations! Their promos are pretty affordable/awesome!ROCK CLIMBING: Apparently they change up the climbing paths on the wall every week which was pretty sweet! The facility is a huge warehouse so it's pretty spacious and bright from natural sunlight coming through the ceiling. I've only been a member throughout December, and it's been pretty chilly during each visit, but once you start climbing, it's not as bad! You need a partner to belay you and vice Versa if you want to climb with a harness and ropes. There's also a free climbing section where you just climbing without ropes/harnesses- if go by yourself. There's also an advanced section where you can rope yourself onto the wall as you climb (you learn to rope yourself to the wall through 3 classes for like $40- just ask the staff). All the different climbing routes are labeled differently depending on difficulty level. There's an upstairs section for kids. I'd say rock climbing is an upper body workout... So if you want to get your guns on point for the gunshow, you should probably consider rock climbing :) RECOMMEND TO A FRIEND?: Yes! I'd recommend everyone of all ages to try at least one month of membership for you to be hooked! Definitely more fun than I anticipated :D.", "date": "12/20/2015"}
{"review_id": "UgL-RSfbImHXnEmZJFCavg", "user_id": "68aIqnJ4IkAKUNKGtXdV7w", "user_name": "Mike J.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I wouldn't recommend this place. I payed and tipped before climbing, that was a mistake the staff ended up having some attitude. You pay $60 for staff + tips, then $16 per person climbing for two hours. They take their sweet time when you're paying. They give you a safety speech for about 30 minutes then 15 - 20 minutes getting knots out of a rope to hang up. That doesn't include the time they wonder around and talk. You're really only getting maybe a little over an hour of climbing then divide that by 9 climbers. I won't be back!", "date": "1/22/2017"}
{"review_id": "H1Y6k2bkmPKSmcTEx8gXqQ", "user_id": "wvXBbvEoLuvXeceOzdF2CA", "user_name": "Maria M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome staff Super friendly ! Classes were amazing  and educational ! Package deal pretty good deal ! Instructors are there 24/7 if you need help ! This place is huge ! Fun for the whole family ! My 8 year old loved climbing today !! Super fun !", "date": "7/7/2016"}
{"review_id": "r4o4t3_Wl9agajc_vjFUHw", "user_id": "lNQRXZpPiNRDxCU6Uv7mNg", "user_name": "Muy S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've only gone rock climbing once so I have nothing to compare this to... but I had an awesome time and would definitely recommend this place to anyone who wants to try it.My friend and I shared a groupon that was $30 total for both of us, and included a belay lesson and equipment/shoe rental, then you can climb anywhere in the gym to your heart's content.  The staff is very nice and helpful, and the climbs are labeled with the level of difficulty.For those who don't want to use ropes and harnesses, there are plenty of walls for bouldering.  I know there's mats and all, but it's still kind of scary.Yes, recommended and would definitely go again.", "date": "12/23/2013"}
{"review_id": "MfJzwSN--D7tLKE9aJnebA", "user_id": "BXvtJCqm8DNNCl3s2dSD0Q", "user_name": "Frances W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Came here for the first time yesterday and had a great time! Eric and Mason were both incredibly helpful and you can definitely tell that they value their work and their priority is safety. They made sure everyone understood how to safely and properly rock climb. We had a fantastic time and I would definitely come back!", "date": "8/17/2015"}
{"review_id": "DlTjhFeUdQeYpeCL5Qd3hQ", "user_id": "MEZZmu9DFokPYNFLIuFhDg", "user_name": "Kathleen S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "New to rock climbing and had a pretty good first experience at Hangar 18. We went in on a Sunday late morning and was able to squeeze in their belaying certification lesson right before they got way too crowded for my liking. As a first-timer, I wanted to stay in the top rope area but was pretty much kicked out when a group of 20-30 people showed up (for an event I think?). Employees were friendly and we were lucky enough to have gone when they were offering 50% off a 1-month membership! Definitely plan on coming back on a weekday instead.", "date": "8/28/2015"}
{"review_id": "iakdSgBbgd8xENBM6gPn1Q", "user_id": "uxh1zKaZVjcFNbgxV3Y5jQ", "user_name": "Alliebee H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 9, "funny": 1, "cool": 0, "text": "I bought the groupon for 2 and we called to see if we needed to make an appointment for lessons, and they told us we cannot use the groupon on the day you purchased it.I checked back on groupon and the fine print didn't say anything about not using it on day of purchase. So I called the Rancho location and they said sure we can use it but they do not have a beginner course.So I called back to Upland location and told them Rancho allows it but you do not??? They said the Rancho location should't being telling people that, and they are going to call them to ensure they tell no one else that.When I asked how come you don't just list it in the fine print,  that you cannot use it on the day of purchase, and they said they were aware that it was not listed on groupon fine print but are working on adding it.This is not my fault, but now I have to waste my time to deal with a groupon refund.Bad customer service!", "date": "8/14/2014"}
{"review_id": "OpCL8d2UeMiDhgkWIC92oA", "user_id": "xfXDFvJ8gVQaKtAIBfeQ1g", "user_name": "Joey N.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "This location is pretty cool. You can do a bunch of things here. 1) You can top rope. If you don't know how, the staff can teach you how to tie in and belay correctly. 2) You can Boulder. They have problems for beginners and advanced climbers, so you won't get bored. 3) There's lead climbing. With membership, you can take the lead climbing classes if you don't know how, 4 sessions total. 4) Yoga on Tuesday night, on the second level. 5) Throw a party there. Fun place to hold birthday parties for the little kids.", "date": "1/11/2015"}
{"review_id": "Edl7p6cxQtH0u4K1uQ6OBQ", "user_id": "1pYYqFjGje-kzUdMISqsVA", "user_name": "Danielle P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My husband bought us the groupon for this place. We'd never done this before and the staff was very cool and understanding. We did the belay with the harness and ropes first. Isaac instructed us and he was very thorough, patient, and cool! We both climbed the wall twice and took our turn being the belayer. It was fun! Afterwards, we tried the bouldering and that was fun but difficult! It seems most people go there for the bouldering as only we and another couple we on the belaying rock climb. I like the fact they have a lot of diversity for their climbs and Isaac told us they are always changing them out to keep it fresh and new. We could have paid a couple extra bucks more to get a month long membership, but opted not to at this time. The memberships are good at all of their locations, which is awesome. I would try it again!", "date": "10/8/2015"}
{"review_id": "h-cqBMKjKPNwMCImLUbcPg", "user_id": "82dCHyU-ANOgdhxUgZsUeg", "user_name": "Marlon T.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 2, "funny": 2, "cool": 0, "text": "I've been to many rock gyms and this one is probably the dirtiest I've seen. Aside from the poorly marked rocks in the bouldering area (from all the dirt accumulation), there was a nose-killing stench here that will take you back to your middle school PE locker days. In other words, they don't use tape to label a certain climb so when dirt overcomes the color of a rock, you can hardly see. To make matters worse, I still smelled like the onset of puberty after leaving the building. The bouldering was alright--not the best formats I've ever seen. If they worked on cleaning up this place, they definitely would deserve 4 stars. Go to the other locations for your hygiene's sake.On the bright side though, the staff was nice and I felt safe here on the bacteria ridden  floor/equipment.", "date": "12/8/2012"}
{"review_id": "kGVP63Qi5F6v814wwFXzUQ", "user_id": "qH2C2nckBQdlmc2mtdcCCQ", "user_name": "James C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Challenging routes that get rotated every few months.  Plenty of bouldering walls.HOWEVER, the layout of the place makes it super crowded in the middle since the seats are shared between boulderers and top ropers.  It also feels like a sauna during the summer season even with fans on.", "date": "8/8/2015"}
{"review_id": "hiXIDmfLSZQnRtBr-Pu--Q", "user_id": "O19i6l79YZkfBIxzhZatwA", "user_name": "Eric D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "I rounded up... It's a solid 3.5. I've been climbing at this Upland Hangar 18 for a few months now, and it's pretty great; I've also been to other climbing gyms around, and this one is the best. It has Top-roping, lead climbing, and bouldering. The crash pads consume 100% of the bouldering area, and a denser pad is over the top-rope/lead climbing area. It's a little but on the dirtier side, but once you realize that most of the dirt is actually chalk, it's not as bad. The bathrooms are pretty bad, but I don't spend much time in there anyway. Most of the staff is not out there to be your best friends... Or friends at all for that matter. When I was first getting my membership, I waited at the counter for a solid 10mins before being asked if I needed help. But after a few interactions, you get over it. I got a sweet deal because I am a college student, but it is a little pricey for the monthly fee... But it is worth it. The parking is occasionally atrocious. But if you go midday, it's not that bad. Overall, I recommend it. It's a good first date kind of place, if you're into that, and it's good time.", "date": "3/10/2015"}
{"review_id": "sOXcUbnbOpqXL7G_INlaWQ", "user_id": "pGn4-auecbtHbBusCRwIAg", "user_name": "Heren W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "I'm writing this review because I miss Hangar 18 so much T__TI recently moved to NYC, and going rock climbing is either too inconvenient, or too expensive, or both. Majority of the places in NYC have a $70+ monthly membership, some with activation fees, some with contracts. I go to NYU so I do have access to the NYU climbing gyms, but Hangar 18 makes the NYU gyms look tiny.If you do the student discount, it's $28 a month. I believe you can get a similar deal on Groupon. That's actually a really good price, considering you get gear, shoe rental, plus belay lessons. If you go twice a month, it's basically worth it. The place is huge. There are plenty of bouldering and top rope problems. They change the routes very frequently, which is good so people don't get bored, but if you come after skipping out on a few days, you might find the route you are working on to have disappeared. I think the place has a good mix of problems as well. I'm a beginner, and when I left for NY, I was climbing V1-V1+ and attempting V2's, so to me, there were infinite number of problems left to do. Like I mentioned earlier, they change the route very frequently so there's no way you will run out of problems to do unless you are REALLY good. The climbing environment is pretty friendly too. Besides a few guys here and there who grunt loudly if they can't finish a climb, everyone else is nice. Some of them will even go out of their way to give you tips. The staff is usually friendly, but some of them do appear kind of stuck up, but hey... they are literally climbing pros who are way better than most, if not all of the climbers there. If you end up getting a membership there and want to avoid crowds, weekday mornings are your best bet. Otherwise, the place gets quite crowded, even on weekday nights. In short, I really miss going to Hangar 18.", "date": "9/18/2014"}
{"review_id": "LWW9pWlRPGuH7B3Sl6Jkeg", "user_id": "SE7xGG5FuMZxAAdcIqYrbQ", "user_name": "Mina V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "the people at the front desk are friendly but...sometimes they seem like they just don't want to help...BUT, they do give good advice and even gave me advice on how to climb efficiently even for a beginner...the members are also pretty friendly and honestly, we are all there for a purpose and that is to become better.  I think H18 is a good place to learn...oh and the price is pretty much reasonable because arcadia rock climing (ARC).....53$ for monthly membership", "date": "7/2/2014"}
{"review_id": "CYpN-H0rXn4bL6U8Mnq0sg", "user_id": "O14Ff1HqbsdaDIfJhSJUiw", "user_name": "Vincent C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My son and I, along with another family came here for the first time. We paid for intro lessons and the staff were very accommodating, knowledgeable, and friendly. My son had fun and a great workout.", "date": "8/16/2016"}
{"review_id": "CQwy0fqUbpGbPT8xoFCcew", "user_id": "0Xc9ZX7bGPSSyhSIEMVTrw", "user_name": "Sadia M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "This an amazing fun filled place. The price was very reasonable. The staff very professional. The helped guided us all the way. We had kids with us. They explained the techniques and safety rules in a very simple langue. I felt very comfortable. I would 100% recommend this place specially if you have kids and going for the first time. You will have a blast.", "date": "6/20/2014"}
{"review_id": "Wj3cUYbaOpIxy48GhvipQA", "user_id": "YUuCicfFwQX9Ui_zCvd-cA", "user_name": "Lisa C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun for all ages and abilities. Professional, helpful, and great exercise. Thanks for the lessons and skills.  Everyone loved the experience", "date": "7/27/2016"}
{"review_id": "cvmemMdjO7UZVw2GTpT-TA", "user_id": "XJOC7zdIPECw7QgeUP2WSw", "user_name": "Christian Z.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 8, "cool": 0, "text": "This Gym Tightbouldering... tighttop ropin ... tight lead climbing .... tightnew routes every couple of weeks... tight The employees.. they tight Brad, he tightMason, he tightMaddy, she tight issac, he tight Aleece, she alright but she tight", "date": "7/22/2014"}
{"review_id": "7utpuD8ym9mRvMJdJU0QGA", "user_id": "b3Bcslo9_RArbukS8v3Rpw", "user_name": "Sabrina L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "Isaac and Mike were very knowledgable and helpful w/ both hangar18 policies/perks and climbing in general. I had previously only visited the Rancho Cucamonga site (once), which only had bouldering. My friend decided to join me yesterday at the Upland location where I was pleasantly surprised to see many many more routes for both climbing and bouldering. We both learned toproping (climbing) procedures and safety rules from Mike who was very patient (we had a few different groups of ppl taking the class at the same time). Though my friend and I both had a couple times where Isaac had to be more stern w/ us for our safety, we didn't end up on his 'bad' side, and he was very congenial in our talk at the end of our time there. Not only are the staff and facilities great, the people who go there are generally nice too. One of the women who participated in the belay lesson w/ her husband and son seemed to already have had climbing experience, and she kindly gave tips while we learned. Others in the bouldering section were generous w/ their tips, chalk, and space (e.g. made sure n00bs like my friend and I got a chance at the parts of the wall that were marked V0 [the easiest]). It was such an enjoyable experience for the both of us!N.B. it was a bit tricky to find since it seemed to be in an abandoned alley next to a strange warehouse that had a 'For Lease' sign, but I just trusted google maps, and it faithfully brought me to the right place. There aren't super clear marked spots for parking, but it seems like everything in that open area next to the Hangar18 building is free for parking.", "date": "3/4/2016"}
{"review_id": "BDqp2UqMh3ADYR6b2QXmKA", "user_id": "vrIkG2F1YZ1YXDhOPeoO9A", "user_name": "Alex R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "This is a decent place. Emphasis on decent.They don't mark their routes with tape and as a result you get less creative and more limited routes. Additionally, the holds are DIRTY making it close to impossible to see what holds you are actually supposed to be using at times.  Found myself and a fellow climber trying to decipher what holds were blue and what holds were green at one point. Made for a fun Sherlock Holmes type of situation -- but I just wanna climb.Everyone is nice so there is a plus.  Tape could make this place so much better. Basically, I'll come here when I have to not when I want to.  Want to give two stars but feel bad about that so three stars it is.", "date": "7/27/2014"}
{"review_id": "zYaobx2qKULNYg8lV4z_Eg", "user_id": "iAevEfcmtCr2cpd6IRqnTA", "user_name": "Holly C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 5, "funny": 2, "cool": 1, "text": "If you are not a climber, this place will do just fine.  There's a nice area upstairs for birthday parties and what not.  You can climb up a few simple routes and call it a day.  But if you are a climber, it's not the best gym.They don't use tape - all the routes are set by the using same colored holds.  It's very difficult to figure out what is on route, especially with the boulder problems.  The holds are dirty and a lot of the holds are similar in color.  They put purple, gray, and black holds all in the same area and it was very difficult to distinguish.  When I touched the footholds to try to figure out what color they were, my fingers turned black.  Tape is just better.I was told one of the owners of the gym owns Climb-It Holds.  So all the holds are that brand.  Which is fine, except many of the them were old, dirty and slick as hell.  Maybe they think if you are training for limestone you might appreciate some slick holds?  But it just seems like they are not washing the holds, especially the jugs, which don't really need to be slick and nasty for any purpose.  I found lots of spinners, too.  They are not really promoting the brand well when the holds are so old and dirty.In terms of bouldering, the only good problems set while we were there were open-handed compression problems.  Everything else was kind of boring.When I was there, a lot of younger kids were also bouldering.  Nice and enthusiastic, but they liked to spew unsolicited beta, which is poor etiquette.Some of the areas were closed off when we were there because they were cleaning the floor.  I'm used to gyms doing that at night after closing, not in the middle of the day so that was kind of weird.Interesting old outdoor climbing photos at the entrance.  Someone took the time to poke out almost everyone's eyes in the photos, which was kind of creepy.  But we could recognize a lot of the climbs, which was fun.No drinking fountain so bring your own water or be prepared to buy for $2 a pop.", "date": "1/29/2012"}
{"review_id": "KHflHPxKqbD-qc0tv7hzbg", "user_id": "YRpy4gqG1Jv5lMGtRCTw-Q", "user_name": "Destiny B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing experience today! It was my two daughters, and my friend and i's first time but the staff made sure that it won't be our last visit. Brad, a cool, friendly guy made sure we got checked in and had all of our equipment quickly and efficiently. Isaac was our instructor and let me tell you! The patience he had with us was great. I mean it took us forever just to learn to tie the knot correctly and he never showed frustration or impatience with us. He made sure we were safe in all of our safety checks and movements (once we finally got off he ground lol). My daughters loved it! A good physical and mental workout! Will definitely be back!", "date": "7/18/2016"}
{"review_id": "h_TdvavgSmab3orE8qWEow", "user_id": "d7kKSqBe2axMHNk4NBOSfA", "user_name": "Allison C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Some good clean fun! And by clean I mean you will get chalky powder all over yourself. Even if you're not chalking your hands its floating around in the air and gives your hair a nice beach texture. XDClimbing the rock walls was definitely my favorite- I'm a beginner so I completed a 5.6 and attempted a 5.7 but by then I was all tuckered out from the bouldering. This one is kinda scary cuz even if you make it up one rock path you're on your own getting down cuz there's no harness or anything. But fear not, they have cushy landing pads all over. $19 for a day pass? I was there for a couple hours and it came with shoe rental. I believe harnesses are extra but I borrowed from my friend. You have to sign a waiver and orientation form before you can go in. They have a couple lockers in the bathroom that you can use- just need to bring your combo lock if you're going straight from work like I was. Woo I'm gonna be sore tomorrow! Would probably come back again and hopefully take a belaying class.", "date": "6/5/2014"}
{"review_id": "ku79Qdpn5kpnj63WmlOE5A", "user_id": "KW83N-u_NGNwhSj8WQwApA", "user_name": "Adam P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Workers are really nice! Safty first but laid back atmosphere. It was a blast for my two boys and me ages 16yrs and 9yrs old. I recommend to anyone looking for something challenging and fun!!", "date": "7/19/2015"}
{"review_id": "iRprznl1ZUrkZ0rkO5a-mg", "user_id": "cNrcl3sOkPl1l9QXH2rn7g", "user_name": "Nina P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing place and a great deal for students. $28 (I believe) for a monthly student class gives you access to shoes, unlimited entries into the gym for an entire month, and access to their yoga and climbing classes. They routinely change up their walls so you never get bored, and the people are very friendly and always willing to help you. It's an awesome place, especially if you go with friends!", "date": "9/10/2014"}
{"review_id": "zn0rUv57h4y0pKymLTFKWw", "user_id": "nbrTC7-jmEJW-tAKAOAwuA", "user_name": "Chris H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I have been a member here for about 3 months and it has a good variety of top roping and bouldering routes. They change the rocks every couple of weeks which is a plus since the gym is quite small. It's only $28 for a membership if you're a student, which is well worth the money because you get access to all 5 Hangar 18 gyms scattered around the OC.  I would recommend coming early in the afternoon or after dinner as it can become quite packed from 4-7 on weekdays. I'm only giving 4 stars because the gym doesn't have that many top roping routes, maybe 10 at most unless you feel comfortable leading.", "date": "1/25/2014"}
{"review_id": "CvloLB6rCmUbSvMdOEVu8A", "user_id": "qdv2GRZvhWi4KFr58enkLQ", "user_name": "Paili S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fun time! Our instructor Matty was awesome. She was very detailed and helpful. The place was clean and body odor free!", "date": "12/14/2014"}
{"review_id": "YXbNzto77JWi7B80MsEyZw", "user_id": "ILvXe0EWKAH45eyUUxlv0g", "user_name": "Emily S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 6, "funny": 6, "cool": 8, "text": "Compared to the Hangar 18 in Hawthorne, the Hangar 18 is Upland is way better.The Hangar 18 in Upland is nice.  It seems bigger to me... but I'm probably wrong.  I think the one in Hawthorne is bigger.I just like the one in Upland more. What I like about the one in Upland is that if you go in the daytime, they leave all their doors open.  So there's a nice draft that blows through from the one end of the gym to the other.  There's always a fresh breeze blowing so there's no smell to it.The locker rooms are alright.  There are lockers you can put your stuff in.  And a good enough space to change clothes if you need to.Parking is alright.  There's not as much parking as the Hangar 18 in Hawthorne.", "date": "5/19/2011"}
{"review_id": "zneBA4-uUvhjEptjzoAGYg", "user_id": "wAo_skbKZ4zse_FmcguktA", "user_name": "Philip M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 2, "cool": 1, "text": "Free rentals and lessons with the month membership, so even if you're trying it for the first time, I recommend that you at least get a month membership.  It doesn't cost that much more and you get to go as many times as you want for a whole month!  When I went, there was a groupon for 2 1-month memberships, which I was able to split with a friend.The staff are all really friendly and knowledgeable.  They also do a pretty good job of staying attentive to make sure that beginners are doing everything correctly, for safety purposes.The place seems to get busier near the end of the month as well (I overheard that the reason is because everybody's trying to use up their free guest pass for the month, which is kind of confusing to me).", "date": "12/28/2013"}
{"review_id": "cjhGYPZkJQRRG65vRJfwOQ", "user_id": "-9upyCufa9JWnw8O4H_AMQ", "user_name": "bryant t.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Great value with Groupon or student pricingKnowledgeable staff, great environment with friendly and helpful climbers.Every few weeks they change the climbs so it never gets old and repetitiveIt's basically the opposite of the regular gym where everyone wears headphones and is antisocial. Here most everyone is friendly and almost no one wears headphones", "date": "2/26/2014"}
{"review_id": "R4m59F1S_HoIiJ3MsyHJFg", "user_id": "Hnm9Pl0Unk5QJzM7D_J58Q", "user_name": "Anthony B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 6, "funny": 1, "cool": 1, "text": "This place was a joke!I tried to go there today with my kids.  Not very kid friendly at all.  I spent about 10-15 minutes filling out paperwork then was told I needed to wait 15-20 minutes for the next class to sit through a 45 minute video or intro lesson for me, the adult to them have my kids do rock climbing.I had called and asked if they take reservations which I was told they don't.After waiting another 20 minutes without any other word, I left.What bugged me the most, the staff was not accommodating at all for me and my kids.Isaac was the guy in charge who I talked to and quite frankly could care less about helping us at all. Very poor customer service skills.I saw about 2-3 small groups there that was not happy either.  One guy who you can tell knew what he was doing asked \"am I going to get a rope as we have been waiting\", while another group that had just came in was frustrated with the start up or actual no start up of his lesson.I was coming in for a \"kids intro lesson\" which said I needed to accompany any kids under 14, which I did.  The business needless to read the definition of \"accompany\" which is to go somewhere with as a companion or escort.  So that does not say, I need to rockclimb and or buy a intro lesson as well.  It just means to be there with them.  I heard, \"are there any more helmets\" of which the answer was no.You can't have that many people at your business and not have enough staff to help.This place needs a management overhaul.", "date": "2/28/2015"}
{"review_id": "5ZIB68Hb188mqgXePo-gCw", "user_id": "wd07kEUS8_nfW5413-w0BQ", "user_name": "Stephanie B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "You daughter and I have been climbing for about 2 months now. We have never had a bad experience and have grown to really enjoy the sport. The staff at hanger 18 in upland is exceptionally great. Especially David, he takes extra time to make sure everyone is safe, and happy.", "date": "2/21/2017"}
{"review_id": "x9ohap0zHPlcrtS2u5JHzg", "user_id": "VmygpVTE4UeCPsm2oru88Q", "user_name": "Kristine N.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 3, "funny": 2, "cool": 0, "text": "This is the first indoor rock climbing place I have ever been too. I bought a Groupon, buy one get one free deal for $30 intro pass. First impression when walking in the building was \"WOW\" high walls, lots of variety. But when I got to the front desk I was quickly \"WOW'd\" at the way they didn't welcome us and said \"What do you guys need?\". Not a good first impression of the staff. He ended up being nicer as the day went on and in the belay lesson, but he did not give a professional welcome for my store greeting. I even told him I had a Groupon and he looked so confused and said \"Well I don't know which one you have.\" Why I only gave a 3? One because of the customer service and lack of professionalism by the staff. You don't know who works there because no one wears a uniform or badge, nothing. Two because it was dirty. Dust, chalk and filth was covering things. Some of the rocks were so covered in stuff that you couldn't tell what the colors were. If I was rating solely on fun...I would give Hanger 18 a 5 star. I quickly got myself over the dirtiness because I wanted to have fun. But I took a shower immediately when I got home....when I got back to my car I also sanitized my hands. Recommendations: rent chalk bags, have  more comfortable seating for people resting or watching climbers.", "date": "2/17/2013"}
{"review_id": "kXdOsVsM9CioBcIdKGPeAg", "user_id": "F6TTZKqMglTu0qIESygFkQ", "user_name": "Alex K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Nice climbing gym with a ton of walls to climb. Came here with a friend and got a belay lesson from Brad (who is freaking awesome btw). Rest of the day we tried a bunch of walls and boy was it fun.", "date": "6/10/2015"}
{"review_id": "BTaXqrjaQ40ioLIEFadiwg", "user_id": "JiqUeiXgugNrmvJEOx7NyA", "user_name": "Dorothy L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 4, "funny": 4, "cool": 3, "text": "Ever want to feel like a bad ass?? Just try out some indoor rock climbing at Hangar 24, and you'll be ready to take on the world. I was introduced through a groupon deal, and ended up taking my fiance with me to redeem it. We both enjoy exercising and are open to adventures, so this was a great daytime date for people like us.You need a partner for belaying, so pick a good one. You do have to trust them with your unbroken bones! Javier in Upland showed us the ropes (literally!) and was a fantastic instructor! He was very informative about belaying & thorough where we felt very comfortable being first-timers. He guided us through the whole process until we felt comfortable and didn't have any more questions, then we were out on our own. I'd return for some more bad ass daytime dates with my buff babe! I'd suggest you do the same, or at least just find your own buff babe, then think about Hangar 24. ;)", "date": "11/14/2012"}
{"review_id": "rwhtcqIyDuY6eZH8hwRsIw", "user_id": "4eoHMGM9STT1fPfACtu35g", "user_name": "James J.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 2, "funny": 3, "cool": 1, "text": "Isaac was a straight up turd went for the beginners class and definitely will not be going back here due to the staffs disrespect and unprofessionalism no matter how relaxed your job is there is no reason to be such a shitty group of staff in a what's supposed to be a fun placeExtremely dirty doesn't look like they ever wash or even try to rub anything down. Saw the guy putting shoes kids just used right back into the bins he gave them to me in without cleaning as I was leaving which was pretty disturbing", "date": "1/17/2015"}
{"review_id": "ttzSyo-Jm-JhEPnjGmA_5g", "user_id": "sYYZ9LyR68AVmEt1Tl-bYw", "user_name": "Erika M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Hangar 18 Upland was the place of my first introduction to climbing. I'm afraid of heights but got over it and just went for it with climbing. The Upland location is cool because it has top roping, bouldering, and a second floor where you can have corporate events or parties. To be able to top rope, you have to take a lesson with one of the Hangar 18 employees. You can just jump on the wall for bouldering. This place is great for kids and adults! My only issue with the Upland location is that the routes don't get changed often.", "date": "8/28/2015"}
{"review_id": "JkiZSbNTMQspuHb27YMFyA", "user_id": "vnpfnIsSFzInHaXgP4doLQ", "user_name": "Amy G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "We came on a Monday night and the gym was stuffy and hot due to the weather outside, so I guess they have no A/C. Bikram rock climbing, much? In the beginning, we bouldered while waiting for the next belaying lesson. On that day at least, Hangar seemed to have more bouldering than climbing options, with a lot of routes for the former at the back of the gym. The belaying instruction and safety lecture is more comprehensive than I'm used to, lasting at least 20 min. Our instructor was a very well-rehearsed though bored-sounding young employee. If you're not already certified or feel comfortable belaying, make sure you factor in the wait time for a lesson and get here early enough to enjoy a significant amount of time climbing.", "date": "7/12/2013"}
{"review_id": "3JJwJ1vedutNHBMPKVx37Q", "user_id": "GlXpe3KZ8NwYOZAqS2OCAQ", "user_name": "Deborah C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 5, "funny": 2, "cool": 0, "text": "Wow, the young guy with blonde hair (Mason I think) is a PRICK! I called at 7:30 and asked if I could still renew my membership for $5 and he said, \"Yea but you have to come in person and we close in 30 min\". Since today was last day I sped over there and made it by 7:55. Before I could even say anything but \"Hey..\" he cut me off and said \"Sorry I closed the register already and there's nothing I can do\". The other guy working there kept looking at the clock,  knowing they are not technically closed yet. I think he totally did it on purpose. Listen dude, don't work there if you are always gonna had a bad tude and sour face and look at everyone like they're annoying you! If you don't wanna hand out shoes to people who just wanna have fun, then go find some thing better to do. Be a yoga teacher, maybe some meditation will help you. Besides this unwelcoming and ungrateful guy who hates his job, the place is alright. I would CHECK OUT SENDER ONE CLIMBING IN SANTA ANA. It's way nicer, has a gym and lounge area.", "date": "9/7/2014"}
{"review_id": "6nAEbsbU35RwkDRRbnJWuA", "user_id": "qtC0nXsh58tWG3nIMHZZjw", "user_name": "Gabriel M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I just went with my kids. We had a blast the staff is so helpful and friendly. Before you can  climb you need to take a lesson on how to use the equipment ask for eric he does a great job and made us feel very comfortable with what we were doing, because of his personality and helpfulness we will definitely be back again. This place is awesome for the whole family", "date": "1/25/2015"}
{"review_id": "rOWCWK8sDS1tDeAGgGDV_A", "user_id": "QpXpMcjBtbAgvrANFGDaVA", "user_name": "Tina B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 3, "cool": 0, "text": "SMELLS LIKE FEET, but I'm still a fan! I don't think they'll ever be able to get rid of that smell unless they invent a great ventilation system for the place and our feet. BEWARE: This is probably not Hangar 18's fault, BUT be weary of those groupon deals or any online deals. I bought this deal online, \"For $30, you get two 60-minute rock climbing lessons, two full days of climbing after your lessons, and rental equipment (a $60 value).\", but when we arrived, they told us that groupon had worded it wrong and that we only get one full day of climbing, total! We actually only got one (less than 60-minute ) climbing lesson, too. Trickery! They sure know how to get you with those deals, but I'd say it was still worth it. Besides Boomers, this was my first true rock climbing experience. I tested my muscles and made it to the top of everything I set my mind to. I wish the groupon deal was true because I would've definitely wanted to go back to try a more difficult level or get to the top of those mad rocks (walls with no ropes or harnesses used). *Kisses biceps* Nice staff and some impressive looking regulars, inspiring! You'll definitely break a sweat, increase your heart rate, and at the end of the day, come out of this place smelling like feet. How hot are you!", "date": "12/21/2010"}
{"review_id": "5m4G_2m-nVOP123BX-4wtQ", "user_id": "eGx2zcWjK2NtJZYzhpwpJA", "user_name": "Rye S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I have been coming here on and off for years and I really do like it.Pros: - It's fun and takes my mind off the stress of the day- There is something to climb whether you're alone or in a group- There is a large variation if difficulty, so beginners will have a good time and so will veterans-  This is close to home and is much more entertaining than a traditional gym- The employees seem to be very knowledgable - A membership gives you access to multiple clubs in Southern California - There are yoga classes in the facilityCons- The neighborhood seems a little rundown, I wouldn't leave anything of value in my car or leave my car unlocked- it can get pretty stuffy especially in the heat and when it is busy- There is a smell, but you get used to it", "date": "3/16/2013"}
{"review_id": "xFJGqOPQFHxaZOuf9qKy_Q", "user_id": "WL86ma55c57uS2nML91d9w", "user_name": "G M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A review strictly for the Yoga classes since I haven't seen one posted yet.Yoga with Jenny on Tuesdays and Thursdays - great class and a great work out. She welcomes all levels of yogis. I've been attending the classes for about a month now and I really enjoy it. I'm a beginner to yoga and was a little skeptical at first but Jenny made the transition for easy and relaxing. I mentioned to her that I was new so she paid extra attention to me on my first day; making sure my postures were correct so I wasn't hurting myself. In fact, as the weeks went on, she did that with a lot of the newcomers. Just mention that it's your first class and she'll adjust your body if needed. The classes are not advanced (I would think you'd need to go to an actual yoga studio for those), but some of the poses can be challenging. It's 1 hr and 10 mins long (usually)...the last 5 mins are spent lying in corpse pose. I appreciate this since corpse pose only requires you to lie flat on your back and wind down from the workout so it doesn't eat into the hour doing more challenging poses.Yoga mats are provided for you but I would HIGHLY recommend bringing your own. The mats they have are very run down and very dirty. I can't imagine doing child's pose on one of those. Yuck. One more thing - if you're looking for a quiet yoga session, this is the wrong place for you. The yoga takes place upstairs, out in the open. So there's a lot of background noises from the climbers. I'm not looking for a serious yoga practice but as an addition to the climbing membership, it's definitely worth it.", "date": "10/25/2015"}
{"review_id": "jdls75bEX4jWg_PXGLiSwg", "user_id": "TmKW9WZyvRXv7v9e9GORPg", "user_name": "Chi T.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "I've gone here a few times and it's a good climbing gym, although nothing beats climbing outdoors. Anyway, the times I've been here, the place is fairly busy.  They have a good mix of bouldering and climbing routes.  The bouldering routes are on one side and the climbing on the other. There is also an upstairs for the younger bunch.  I don't boulder, so I've only tried the v0, which were fun.  They rent shoes and harnesses and will also give a belay lesson (at an extra charge) to those who are new to climbing. They use a grigri for belaying. The climbing routes vary from the low 5's to probably a 5.12 or so. I typically climb the 5.7- 5.9 range here. The climbs are definitely pumpy and require some dyno moves.  There are some climbs that have an overhang, which are always fun to try and problem solve. The good thing about indoor climbing is that I don't have to worry about injuring myself on a fall, provided that my belayer is paying attention, of course.  Also, if there is a route you want to try, but it's not set up, you can always ask the front desk person to set it up for you and they'll find someone who'll do that for you.I recommend this place to those of you who want to try climbing for the first time and need to learn the basics such as the commands and how to belay.  Although, I do have to admit that I don't belay the way they taught and I don't use a grigri either. Have fun and safe climbing to you!", "date": "1/1/2013"}
{"review_id": "mYtK6JSV_bOHVC7VSOL9lg", "user_id": "F-KA6dHxp2L_subuYam_kA", "user_name": "Sarina V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Love this place for rock climbing, they always have deals which is when I usually go! A lesson, shoes and all day of climbing. I've been here maybe about 3-4 times now and everyone is pretty nice !They always change the courses every so often because I haven't seen it the same twice! Too bad there isn't one closer, I have to drive about 1hr and 15min to get here :(  I do love coming here though, they sell chalk, have a nail cutter if you need it, stable mats for bouldering and all their equipment is great!", "date": "1/27/2013"}
{"review_id": "vE3pGX7kESoxxNNJ09UpDQ", "user_id": "3LNuOf45Wz_bPGUHZ7YjPw", "user_name": "Sheila E.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I am learning how to lead climb, and I think this place is great. The routes are clearly labeled and have fun names. The walls are higher than their Southbay location, and the staff and other members are really helpful.The lead climbing class series is free for members (I was on the wait list for three months, though). It lasts four weeks and covers a specific topic each week: Clipping techniques, lead belaying, falling, and setting up anchors / rappelling with an ATC. I found it extremely helpful to break it down this way because it gave me plenty of time to practice the concepts.Overall, a pretty good climbing gym.", "date": "5/12/2013"}
{"review_id": "8NP6wQFSe-0v7QdgVR1G8A", "user_id": "lR-DJfZb_rh--BzPeTFAPw", "user_name": "Chetana S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Great climbing fun, for beginners and those more experienced. If you live within 10 miles from here, you'll probably run into someone you know, which is always a fun surprise! The only thing is the people who work here.. Aren't always interested in helping you or answering your questions. They're often distracted or unwilling to give good customer service. However, keep that in mind and just come and climb on your own or with your friends and you'll enjoy it!", "date": "11/17/2014"}
{"review_id": "sScNFycY-AsHQv5Axs-F2Q", "user_id": "9-_mkHSFM5dsZ2nAR45Y7A", "user_name": "Melissa D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "This place was average compared to other rock wall gyms I've been to. Limited space, pretty short heights for the walls. Not sure if it was my allergies or if it was the equipment/building but I was sneezing a storm. I've been to other rock walls and did not have the same sneezing effects. I would say if this is your first time going, this place is fine to check out", "date": "2/15/2015"}
{"review_id": "CPZAdOpRZ9GSSq0RkEkj5g", "user_id": "-glJKxcLggwRe88as2sWMg", "user_name": "Robert G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Bought a groupon for a month membership for me and my gf hoping we would like it, and wow did we ever! Our instructor eric was a super laid back dude that guided us through the saftey part of everything, after we did ropes they have a boulder area which is freakin awesome i highly suggest people try this. super great environment people stare but everyone is friendly", "date": "6/28/2015"}
{"review_id": "lZdKoZQ-xLy7bY1BCXpD4A", "user_id": "Df0qniL155WV5W3n_5z-Aw", "user_name": "Karen C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had my daughters 7th birthday here.  It was fabulous. The kids had the best time!!!!  The staff was wonderful, kind and thoughtfull.  Could not ask for anything better.  Other parents are already saying they want to have their parties there.", "date": "8/18/2015"}
{"review_id": "QB97LNb0Uk5Z_ZEqPJFB2w", "user_id": "95oPxn_olg7QTTjI4L8W7w", "user_name": "Jessica O.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I took a friend here for her birthday, and I'm pretty much hooked. It was the first time for the both of us, and Javier was patient, totally awesome, and super helpful as he showed us how to belay properly.Bring some water or a few bucks for drinks because scaling these walls like a monkey sure does leave you thirsty. Watch out for shaky limb syndrome as you scale those heights because you go a lot higher than you think, and don't forget to try out the boulders. They're a ton of fun!", "date": "11/26/2012"}
{"review_id": "p_1pMU4YZvhKXGzqkJb5kg", "user_id": "w1hbEiqrlCI2F_566VcLuQ", "user_name": "Andrea L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Came here with my cousin and sister. It was packed and HOT. Lots of fans to circulate air. We had to wait about an hr to get a tutorial on now to belay correctly. Kinda annoying since we were told that it was every hour. BUT we got the last tutorial and it was just us.", "date": "9/17/2014"}
{"review_id": "q2DHjfAx9G_yFJ059mhctg", "user_id": "BiWYDNIf7gBBNRtP6YVwIA", "user_name": "Karen M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Likes: Fun! Not too crowded on a weekday afternoon but crowded during the weekend.  Rates seem decent. Friendly staff who will give you a free refresher course if you want.Dislikes: Slow service in the front sometimes.", "date": "2/7/2013"}
{"review_id": "Zu-jbvFpA-FpGXyKfddeGA", "user_id": "Zlb39rd1jo8MtBGbE3hYuA", "user_name": "Antonia G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "My daredevil friend Nikki was in town and asked if I wanted to go indoor rock climbing I said yes, not knowing what I getting into.  The place is in an old warehouse in downtown Upland (you would never know it is there) and has very high ceilings so the walls go up almost 90 feet or so.  They have all levels of climbing and offer a \"training\" course before you start.  The place is what you would expect for a rock climbing gym sure it smells but that is part of a gym, I mean hello people are changing their shoes in there.  You get a really good workout.I had a great time and will most likely bring my husband back.", "date": "7/7/2012"}
{"review_id": "YO2UlxRM4PZfnG5162Kujw", "user_id": "7uvfAKXezRXrLWNo1VZWbA", "user_name": "Dennis N.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 3, "funny": 1, "cool": 3, "text": "I don't think this place smells terrible at all.I went in under my friend's pass and everything was included!! That's an immediate plus to the beginning of my bouldering journey.I'm told that the problems are changed every month or so which is an awesome way to keep things fresh.  What makes the situation even better for me is the extreme friendliness of not just the staff but also the other patrons of the gym.  People cheer you on as you're working on a puzzle and give you advice as your sitting there wondering how your forearms can burn so much!The location isn't beautiful, but then again it's a rock climbing gym so you can't really fault the simplicity of the matter.  Only reason it's not a five star is the routes can be a bit difficult to determine, some of the holds colors are too similar to each other... this makes it difficult for a beginner like me to NOT cheat, haha ;)Come give Hangar 18 a shot!", "date": "1/29/2012"}
{"review_id": "ogGLhtOnAZBlIiuq_-0iKw", "user_id": "7U7MI0-KyE8QY4ov1lfsYw", "user_name": "Ji O.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 4, "funny": 0, "cool": 0, "text": "think depends on how many ppl are inside but it can stink..with all the sweat from ppl..but its a very nice indoor rock climbing place but the size can be little bigger", "date": "1/30/2012"}
{"review_id": "Y-eEdo-QEGFkT9rqFclxag", "user_id": "1_LR6HDtESV3zYuzlTnYGQ", "user_name": "Elizabeth Y.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Love it here!!! Everyone is super nice. I really enjoy bouldering here rather than using the belay. I just got into rock climbing so I'm pretty beginner but I would say they have a good range of sets for all levels!", "date": "2/8/2015"}
{"review_id": "7kgRe24nBaxxHW9OgkPfWw", "user_id": "kvcptFKrWOqZ10bwhIlLtQ", "user_name": "Cynde M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've never been a member, but the few times that I have come here as a guest have been great! The facility is always clean and very accommodating. If I was an avid climber I would definitely become a member", "date": "12/22/2014"}
{"review_id": "U-aM-YF-LmsfAQvRoNP8ZQ", "user_id": "USVcBnfCIu24Pv3wUiEUxA", "user_name": "Cheryl L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is the first climbing gym that we went to, after seeing it in the local classes forever.. My daughter decided that she wants to climb, so we took her. She is 7 and loved it! She is also very girly, so I was concerned that she would be 'scared off' by all the testosterone in the place, but find out that there is a nice mix of both guys and girls, and there were even some kids there.  The instructor (Javier) was awesome and friendly. She decided that she wanted to get a membership and here we are- figure 8 knots all set up!  The routes are a good mix for the beginners to experienced and it's a fun place to have a group.  Good work out- she is tired, sweaty and hungry after!There is a nice thing that they do offer different types of passes. It's not cost effective to have a membership for a kid ($40+/month) but they offer a punch card and allow her dad to belay her.  Nice sale in August for those that want to try it out without putting in too much $.  But you can get a day pass as well and the staff has a class to show you the ropes. So to speak.", "date": "9/15/2010"}
{"review_id": "IfJPa1cJAKcInDsOdkrOxQ", "user_id": "s5OCEAvJd4ukaXh9UkN65w", "user_name": "Larry B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Made reservations at Hanger 18 in Rancho Cucamonga, for my 6  rand Kids, when we got there for Rock Climbing, the place had no ropes, he suggested that we go to upland, there the guy said the kids were to young and was rude and didn't even know what their paper work said, but even there, their paperwork said if with adult they were fine, we called the Riverside Hanger 18 and explained what we wanted and he said come on down he was very helpful and the kids had a gread time. DO NOT WASTE YOU TIME AT THE UPLAND BRANCH. GO TO RIVERSIDE ONLY", "date": "3/7/2015"}
{"review_id": "SCiePP_PBjGJ-zWsQkJfbg", "user_id": "Sggd0_J48WofBGYalRcvWA", "user_name": "Hana B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I loved this place.. Place was awesome the staff were really friendly & helpful.. thought us how to use the rope & it was fun ^_^ time here went by sooo fast.. had an awesome time with my fiance  & my step daughter..", "date": "2/22/2015"}
{"review_id": "b44GQyaSF_U2kjXT6nVTvg", "user_id": "sBeoHKFzNj7LTYwcLG3IgA", "user_name": "Steve H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Exited right after I talked to the guy in front.  He cannot be any more rude.  He spoke as if he was so irritated by my askings about some pricings.  So yea, never coming back to this place.  Have a great business guys.", "date": "5/10/2014"}
{"review_id": "_9fQt6UeYAOgynugqp_zHQ", "user_id": "y4oahCRRa2WJnm-UCdWqzw", "user_name": "Idania M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "this place is awesome! they guy at the front desk was very friendly & gave my girlfriend & i helpful tips since we're first time climbers. he showed us where all the V0's are (which is the beginner level) & gave us pointers as we started climbing. it was really busy for a friday night but we were able to boulder everything we wanted to. really fun & i can't wait to go back. pretty cheap if you come for a date. can't wait to come back! everything was really clean & they have 'community' chalk so you don't have to buy any.", "date": "10/13/2014"}
{"review_id": "KuPbOHZapCU_CmdEhf47MQ", "user_id": "F1iqe4P-wgJ2zBHgZqtXUA", "user_name": "Lisa D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "with a groupon deal who can resist trying something different. so two of my friends, my bf, and myself went. with the groupon deal we got belay lesson and shoes for a low cost. the lessons were super helpful and the staff was very patient and nice.if you're like me who is quite girly and do not use your upper body strength then you will find it challenging. i was quite scared at first because i'm scared of heights. i remember trying to climb the easiest one first 5'5 then when i finally got to the top i was scared and didnt have a clue how to get down. it was scary! after the first two climbs i got better but my hand was definitely not getting any better. it was harder for me to grab onto the colored rock because it was in so much pain. it feels like rug burn on my hands. we purchased a $4 bag of chalk there more than enough to share and still have leftovers. however the chalk was not great quality. halfway up the chalk was no longer on your hands. if your hands doesn't normally sweat they will. chalk is needed!!!the shoes will freaking hurt! makes you feel like you have super long toe nails and its being squished in the shoe. you're supposed to climb the one color by grabbing/stepping on the same colors. if you're stepping on the other colors to get up its called cheating! so following the colors are pretty challenging! Tip: wear comfortable clothing. have short nails. bring a hair tie if your a girl. wear clothes you don't mind getting dirty because you'll have chalk all over the place. don't wear glasses and put your contacts on! wear socks!restrooms: there is a small locker. no paper towels only dryers.  they sell cold drinks i.e. gatorade for $2 each. there's a few big fans around. there's an upstairs and a downstairs. upstairs is a smaller area. i had fun. definitely a great new experience. i say try it! it won't be something i'll want to do all of the time but maybe once in a while!expect to be sore the next day and possibly a bruise or two because i have one on my knee. happy climbing folks!", "date": "10/16/2011"}
{"review_id": "ynEwZDxfHIqHQB0x3gkbiA", "user_id": "wUY3MHwOO2MY0C_uFxw6NQ", "user_name": "Ryan S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "staff was an asshole to another staff. accidentally bumped into him and the other guy went into rage mode. he doesn't give a shit. walls are fantastic tho hahahh", "date": "6/17/2014"}
{"review_id": "KFE2CMKV3y-CBkVGENjLMg", "user_id": "pZoIvz2XR7NKkpIwmx4puA", "user_name": "Chris W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "My brother (review below) and I went here yesterday. The facility is basic. Lots of good bouldering areas. But we felt (compared to some other places we went to) it wasn't geared for us, not complete beginners but not advanced. We got their at 10:30, and were signed in and harnessed by 10:40. It then took until 12:10 to actually start climbing!!!!! The guy at the desk made it seem like we could get through the class quick, but the class didn't start for 30 minutes and then it was 2 additional pairs of people to us. The instructor, nice guy and just trying to make sure people are safe, was taking fooooorrreeeevvver. And a couple of times made my bro and I wait for no reason. Like I would ask if we could climb and he would say wait, while he finished with some other people. Really the most frustrating moment was when we asked if we could keep climbing and he made us wait 3 minutes, just to point at us and another group and say we were good to go. Come'on man, 3 more wasted minutes. It was pretty frustrating. We were on a schedule and didn't have 1.6 hours to waste just on getting set up. Once through the climbs were okay. It might not be fair because we had just been to an awesome setup in Norcal.Hangar 18, I know you're a little smaller, but what really would boost the place would be some extra things to do like balance beams or roll boards, simple and don't take up room but really add an extra dimension.", "date": "12/27/2014"}
{"review_id": "vvzG7kNdrzqARbS1Sf_SNQ", "user_id": "RZYAOgfcLTkN-TgLMUnJRg", "user_name": "Jon W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I've been rock climbing quite a few times and for the size they do a decent job making as much use out of the area as possible. What really disappointed me was I couldn't just show the people on staff I knew what I was doing and they made me take an hour and half training course before my brother and I could climb. We had a very limited time there and to spend over half just to do the orientation was very upsetting. It felt like the gym is ment for more advanced climbers as the rope courses were jammed in one corner. All in all I probably wont go back", "date": "12/26/2014"}
{"review_id": "ZEWFXMWLd17GUXLUjb-OIQ", "user_id": "rshrpcsWyCb2IrVQ8_RtaQ", "user_name": "Daniel S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and I like to climb but haven't been in a few years so we got a lesson to be safe. Isaac booked us in and took the lesson. I think that it is safe to say that he works there because he likes to climb and not because likes people but he taught us what we needed to know, and I felt like he did a thorough job of that. Loved the levels of the walls and had a great time. We will be back.", "date": "3/25/2015"}
{"review_id": "gQsUQyJ90BN5UWGx9U60Zw", "user_id": "7u7MyN89FakNus-IGkfd2Q", "user_name": "Joanne W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 6, "funny": 0, "cool": 0, "text": "This was my first time doing indoor rock climbing & my experience here was great!lemme just clarify this first, the reason I decided to take off 1 star is because the first time we came in here with our groupon, the guy told us that he couldn't train us / do the 1 hour lesson because they had a birthday party gathering and that he was the only one working so he couldn't assist us. This was rathering upsetting considering I drove all the way to upland, hoping to use the deal since it was about to expire and that day was the best day to go. But hey, what can I do. We ended up finding time to come again before the expiration date.Tips:- I don't think they provide chalk for you to climb... I believe you have to purchase a bag & I'm not sure how much it costs for a bag- Not that much parking, it's sort of in those lot parking with a lot of gravel / unpaved roads (& it's right next to a residential area)- We got the groupon deal for $15 including the 1 hour lesson & shoe rental, etc. (yes, they give you shoes to wear to climb, you can't wear your own regular sneakers!)- The lesson was exactly an hour & he covered all the safety issues, tying ropes, climbing, helping the other person come down, etc. The instructor was very informative and knew everything there is to know about rock climbing. He was very trust worthy & nice!- There is a bouldering area as well where you just climb yourself up there but you don't need any ropes to assist.- They have big fans around the place so it doesn't get too stuffy / hot inside so that's always a plus- There's also an upstairs rock climbing area but it's small and I believe it's for beginners / kids since it doesn't go that high up lolAll in all, it was a great time!! I dont' think I will go back anytime soon just because I don't have upper body strength and it only takes a couple of steps for me to get tired lol fail.", "date": "6/18/2013"}
{"review_id": "ZCDlzzLRuRmAxiV-rFx4Bg", "user_id": "hFCUoOVs1rA4FX9Vps9fsg", "user_name": "Samantha L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "From looking at the website I thought this place would be bigger. I was excited to finally find a large indoor rock climbing facility in southern california! But my expectations and hopes were too high because although it was larger than many other ones i've been to in SoCal, it's still not as great as Mission Cliffs in SF. Mission Cliffs apparently has set the bar too high!It was $19 to climb and rent shoes for a day. I only came to do some bouldering. The employees were chill and helpful. I signed my waiver and paid the fee (but not without trying to find some sort of discount -there were no promotions going on though). It was crowded on this rainy saturday afternoon! There were people ranging from their tweens to early/late 20's.Unfortunately they had a lot of water leakage from their roofs. It was raining heavily and they had to put buckets to catch the dripping water around the place. It caused some of the mats to be wet and cold! I don't know if I'd come here again but I had a good time regardless!", "date": "12/13/2009"}
{"review_id": "_w2gtdJhOcGBUdSdeoLl9Q", "user_id": "PCs7gHQZwaAmO6CeDKsltw", "user_name": "J K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "They have a great climbing gym. Good equipment. Easy to extra hard routes. Overall, it is a good rock climbing gym.They do, however, have an absolutely terrible staff. Rude, ignorant, etc. Their policies around the membership are pretty wierd and get you locked into doing certain things. They dont have an air conditioner, so it gets hot! Many of the people who work here are just highschoolers who dont know how to use their database and can barely check you in. They really need better management.I know that the whole point of this place is a hip, edgy enviroment... but customer service is still key. Dont raise your voice at me, especially when i am being nice with you.", "date": "9/14/2013"}
{"review_id": "TUAEg2zcXJvmFB7yF5kRFw", "user_id": "fPlx-Y2vbp4XiK4PHkTeiw", "user_name": "Shenandoah S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "I have been here several times and it's great, but unless you're an expert, you NEED a SECOND PERSON otherwise you're waiting for someone to help you and you can be waiting a while.The staff is great, nice and patient and they'll have you climbing in no time.  The prices are very resonable.  I used to have a membership there, but I got really busy and ended up cancelling it.  I do hope to get back there sometime though.I highly recommend it. Good for most ages and all levels of experience.  Live life and go for it! :)", "date": "1/12/2012"}
{"review_id": "WDhIMWmOG6Iz0CG5WT-mhA", "user_id": "BB9UbkH2MJxzPxprMEws7A", "user_name": "Jimmy C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This wasn't my first time rock climbing but it's been awhile. Went with my friend and this place is located in a warehouse in a somewhat residential neighborhood. Not much of a looker on the outside but it's the inside that matters haha.I feel like all the gyms are pretty similar to me because I don't know much about the differences. But they had the usual caves and fun puzzles varying from different difficulties. The day I went they had a small kid's birthday event which was pretty fun, looked like all the kids enjoyed it.The staff were pretty nice and the entire place including the restroom was pretty clean. I would come back again for sure.", "date": "3/4/2012"}
{"review_id": "9kW0Teq4k4VVSQX1vHvaJQ", "user_id": "j5DyC5bQIUJXwMOwgqLYaQ", "user_name": "Abigail P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and I bought a groupon for an intro class and climbing for a day and it was well worth it! We came on a Saturday afternoon and it wasn't as crowded as I expected it to be, which was really nice. It was easy to find the location and parking wasn't an issue at all. After signing the waivers, we jumped right into our intro class on how to handle all the equipment and the safety guidelines. Our instructor was nice and funny, extremely helpful, and very patient. She made us feel at ease and made sure we felt comfortable before having us climb on our own.Overall, I had a great time and will definitely be coming back :) BTW, I read in a lot of past reviews that there was a nasty stench in the air and to my surprise, I didn't smell anything out of the ordinary. Thank goodness.", "date": "6/2/2014"}
{"review_id": "aaEFmoiNKMHRLxQ60Wv-Qw", "user_id": "vDezKfm9LDVDLIpSNg_9kQ", "user_name": "Sarah Y.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great indoor climbing gym. For $30 I got a belay lesson, shoes, use of the facilities. I came with 2 friends the day AFTER a groupon deal so it was swarming with people! Fortunately, most of them were just hanging out and watching. Didn't smell like feet and wasn't stuffy considering the amount of people sweating.They have a variety of levels to climb on and are well labeled, perfect for a beginner like me. I will definitely come back and will pay $21 since I've already taken the lesson. Dave is really nice and helpful. He actually teaches outdoor adventure classes at Pomona College, and he's a Claremont McKenna College alum. Cool!Random location, as Stowell was a bit hard to find, but it's worth the hunt =)", "date": "7/27/2011"}
{"review_id": "rwTI5EKfSl5YfjXsvCuWpw", "user_id": "4khxjU0_OwOQRUKeLiex3A", "user_name": "Britney H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love it there. The people are great and it is a fun workout.", "date": "10/1/2014"}
{"review_id": "vpAUXnSCDZkCytD4YtZ4Ug", "user_id": "BiBxFTB4PWQwa-ese3DoSg", "user_name": "James S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went there on a Sunday, Isacc is very friendly and knowledgable of everything related to the nature and rock climbing, will definitely come back to rock climb more. Highly recommend this place!", "date": "5/12/2014"}
{"review_id": "-LCaQLTCHaQqY5eYWhm1SA", "user_id": "E6oDGuz7RYwybAYkLNzUpA", "user_name": "Diane L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Monthly student membership for this gym is $28. A little steep if you're not serious about climbing, but if you do come at least twice a month, it's well worth it since it comes with free rentals too. Each month you get a free guest pass that includes rentals. The shoes are kinda nasty, like they haven't changed them in years, so you probably want to bring your own or at least bring socks. The only complaint is that there aren't that many top roping routes, but there's plenty of bouldering space. Week nights between 5 and 8 this place is packed.", "date": "1/25/2014"}
{"review_id": "Fr2WQ4rARFljoFVsweSnpQ", "user_id": "cx3iOnLULJ5qZeodieuwOw", "user_name": "Moriah R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great local indoor climbing spot!  My friend and I came here after buying a month of membership online.  The staff was extremely nice and helpful the entire time we were there.  The customer service was great and you can tell that safety is their number one priority here. We learned how to belay today and had enough time to try 4 different rock climbs each after our belay lesson. Looking forward to coming back especially to attend their yoga classes.", "date": "1/21/2014"}
{"review_id": "jV3xjg5vzjjCPc85D4XCFA", "user_id": "m14FasL8Ub0LLHUdWk10mA", "user_name": "Stephanie Y.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "As a beginning rock climber I found a lot of routes that were a perfect challenge for me.  There is no need to feel intimidated! Just make sure you bring a friend your first time so that you can take a 101 type lesson.  Everyone here is pretty independent, including the staff.  They aren't too helpful, unless you take the initiative to ask questions.  There are also a lot of young college students from the surrounding schools.  Everyone is pretty chill and polite.  If you are a student, be sure to ask for the monthly student discount! I believe it's $28.  Best price I've seen around.", "date": "3/9/2012"}
{"review_id": "AlZtqf1m_slwS3RY76eEag", "user_id": "2TXi4leSwlMY8rmSKol9Hg", "user_name": "Leena B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "INDOOR ROCK CLIMBING FROM THE BEGINNER'S PERSPECTIVE: This is a great first date place! It completely eliminates any awkwardness because then once you get there, you just strap yourself on a harness and climb on! However, when I first got there, there was a huge line. It was super crowded on a Wednesday night. It seemed to have a lot of college students. Their monthly membership is only $28/month if you are a teacher or student. Sa-weeeet! But I paid $21 including the rental fee for the harness and the shoes. (My vibrams wouldn't have worked here...) Then, they have these \"bouldering\" walls. Me personally, I couldn't get a good grip but I saw others that were just climbing like Spiderman. THEN, they have the giant walls where you strap yourself onto the harness. It helps to go with someone who is a well-informed climber because if it gets crowded, they may not be able to give you a good tutorial (and trust me, when you are that high up...you want to know what you are doing!) So then, I go to my wall, everything is marked 5.something and the second number varies in difficulty. I was definitely looking for 5.1 and the lowest I saw was 5.5. Deal! I'll take it. You then follow your respective colors and climb on! BUT if I were following \"yellow\", not gonna lie, I cheated and had to step on blue or purple a couple of times. Here's where it gets CRAAAZY! I was on top of the wall and feeling awesome that I conquered it (and while doing so, I had to have complete trust in my belayer-person) BUT THEN, I hear someone fall! I tried to calmly come down, and then once I got down, I freeeaaked out! Holy Mack! Someone FELL! But the staff reacted VERY well! They immediately called the ambulance and the person was going to be okay. There are a lot of mats that give the climber confidence. But for my first time rock climbing, the last thing I want to hear is someone falling while I am 50 feet high....(I'm not sure how high the walls are but it sure felt high!) As for the location, it is a bit seedy. But once you get inside, the facility is great with cubby holes for your gear and clean bathrooms! Gooood times overall! :)", "date": "2/28/2013"}
{"review_id": "_lPW46i8pRyIfAz5R9u7zw", "user_id": "vfiqNysgkG6aBYXdAbXi2g", "user_name": "Bill V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This was my first climbing gym experience. I had a group of 26 kids. For what it was the prices were good. There is a $60 group fee, and then there is an additional $14/climber for all-day use. That included a one-hour lesson for our group. The staff were super chill, friendly, and experienced. They were there to help us to have a safe and fun time and they had fun doing their jobs.They can handle all skill levels. Shoes and/or helmets are available for the asking. I saw very young kids as well as very experienced climbers. This was a fun place for everyone.", "date": "5/28/2011"}
{"review_id": "5NLbvTJvoQE-a_A2XEoV7w", "user_id": "09D0OnfAkQukYK6CL7CtMQ", "user_name": "Kyle L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I brought my girlfriend here for us to try something new together and we had a great time. The service was great and our instructor was clear without taking forever to get us started. We will be back soon!", "date": "4/4/2014"}
{"review_id": "tfrHogSXVaGRVjCk1CYNpQ", "user_id": "QaIrM6CxrWArGBxinbJmcw", "user_name": "Christine K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Awesome place to get a full body workout!!! Yea, my hands are torn up....Yea, I'm sore as hell.... And  YEA I'm hooked!  Hangar 18 is clean, spacious, and has many rocks to climb.  Everything is tagged and organized well.  Can't wait to go back and boulder!", "date": "12/7/2012"}
{"review_id": "KFntJnpUNDE1pTqAho9bSg", "user_id": "HFLkO0IW4KcUJsUjOiQ8Bg", "user_name": "Fabian M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love coming here, I've checked out the Rancho hangar 18 and it was great, but didn't compare to the upland location. My only gripe about this place is that I wish I opened an hour or two earlier, even if it were just the weekends.", "date": "4/5/2015"}
{"review_id": "opFodVRHQD1x84cQEcQW2w", "user_id": "kLs13t6RFARCxuy7Qc7Ycg", "user_name": "Dorian R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Took the wife there for her birthday, and we've been going 2x a week for over 2 months now. It's an excellent workout and a lot of fun. The wife enjoys it a lot, and I enjoy the strategy involved with climbing up the walls, its almost like an obstacle course at times. However, I must admit that at times, people fail to listen to the rules and take unnecessary risks. Just remember to always have fun and be safe.", "date": "3/2/2013"}
{"review_id": "CpMrXcqWNLuu84YNfiGCAg", "user_id": "eRZeQchWi3J9W3B_i5Wz9Q", "user_name": "Josie R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great Time! - Spent Mother's Day 2011 with family & friends who were in from Germany! None of us wanted to leave we could have spent the whole day there! Great staff - Thank You!", "date": "9/27/2011"}
{"review_id": "ZLjfiL3pYy2IXCIJzs6v9g", "user_id": "OaY6aOlw7DqLlgVz4BVExA", "user_name": "Chris Y.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 8, "funny": 1, "cool": 0, "text": "I had high hopes for this place but it was a complete letdown.I came with 4 friends, but we left within 20mins without climbing anything. One receptionist even tried to stop us from getting our refunds. His attempted guilt-trip, \"Did you guys touch the walls? If you did, we can't refund you.\" I lol'd.My friends and I all had climbing experience, but just not at Hangar 18. I don't understand why we had to pay another $50 for a simple lesson on using a belay device. I understand different gym use different devices, but the gym I go to teaches for free. At least Hangar 18  should provide this service for free. Chalk is additional $4. The gym I go to comes with a free chalk and a chalk bag. Day pass + rental is $20, cheaper than Hangar 18's $21. The routes at Hangar 18 are dirty, dusty and sometimes slimy. Moreover, there are no stickers, so good luck climbing that confusing mess! On that day, I wanted to start with bouldering but the rocks were very uncomfortable to hold and I didn't want to pay $4 for chalk. There were also lots of kids the day I went, and it was very smelly.. On top of that, poor ventilation, disgusting bathrooms with broken dryers, and oddly placed (dangerous) cubbyholes below the routes.. i recommend you stay away from this place. TDLR; Poorly managed gym, and the owners try to scam you with lessons, chalk, and refreshments.", "date": "4/6/2012"}
{"review_id": "7o3dzGPliz9cdesPuHoHXw", "user_id": "1ECiEtWCgiorfje2BUArMg", "user_name": "Emma W.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I was extremely impressed with the staff, there was one staff member was like Spiderman. He climbed all the way to the top and just hung there. The atmosphere isn't great because I feel like this rock climbing gym is for the more experienced. Some of the \"regulars\" there seemed to look down on the people who couldn't quite get the hang of it yet. The routes are more difficult than the ones at Rock City in Anaheim. I went here with a group, and in the beginning, there was an hour long lesson to teach you how to tie the knots and belay. It was a good experience, and I will most definitely be back to conquer these walls.", "date": "7/4/2011"}
{"review_id": "r27vqvp_f0xR2yABaHNZNA", "user_id": "bZi-r89gzkeJ-GbghaVP6w", "user_name": "Kyle M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "staff is chill, route setters are good, full pads everywhere for bouldering, and for the monthly price hangar 18 simply can't be beat. wish there was a bit more top roping and maybe a self belay area but all in all it's a great gym.", "date": "7/25/2015"}
{"review_id": "rvSrjIP6K4o4GMtlWR3wbw", "user_id": "PPQd20F20eIWBdnrf2iArg", "user_name": "Gary L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "I agree with Tina B. SMELLS LIKE FEET.Regardless, the people there are nice and Javier did a great job instructing a beginner like me on the basics of climbing and belaying. This was my first indoor rock climbing experience so I have nothing to compare it to, but I had a great time here.  Fun for all ages!", "date": "1/17/2011"}
{"review_id": "LSIj-K59jQk0VWf27uB8iA", "user_id": "2giBGrVOV6u6Wd1M5mlmCA", "user_name": "Paolo L.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 2, "cool": 2, "text": "I love this place.  This used to be my \"24 Hour Fitness\" for over a year, before other things happened.  The staff is almost always cordial, and the familiarity goes both ways.Let's start with the negatives though.  I thought that a lot of the boulder routes tend to be rated lower and lower than some of the difficulty suggests.  Things tend to be aimed either towards shorter or taller climbers, especially the climbs in my limited V0-V4 range.  There was the aforementioned odor...which I usually just think is from condensation and a hot warehouse.  Oh, and the price for membership--$46.  Well, it sounds all well and good that you get to go to the \"new\" Hawthorne gym and the Riverside gym (which is 2x bigger with a cooler bouldering...boulder?).  But, it's steep, especially since most people can't just go in between one and the other on most days.But, the positives are many.  Dave is a friendly guy, if a bit hard to get a hold of.  Javier is awesome.  Matt is great and funny.  Routes always look interesting and having those V4s cresting the V5 difficulty (or V6 depending on who set it and how tall they are) makes you improve.  They also change them on a semi-consistent basis (read: when the ringers get bored and start doing sick add-ons).But the best part is...well, competitions.  I will be the first to admit that I wasn't ready (fought the flu of pigs the week before, and couldn't even work out and stand for periods over 10 minutes) and that the intermediate class was actually quite skilled.  But, it was a blast.  The place was completely crowded...the adrenaline was high...EVERYONE was rooting for you...and even though my stomach felt more like it was going vertigo than my inner-ear was...it was a blast.  And, it's great for parties!", "date": "7/7/2010"}
{"review_id": "U62rD-qE_ooZlxioT5GCAw", "user_id": "Fwa9rZKDiuDLdPos4xsuHA", "user_name": "Sue K.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Compared to the Hangar 18 in Upland, the Hangar 18 in Riverside is way better in terms of cleanliness and routes.  I had visited the Riverside one earlier that month and I did not have to wait to climb, whereas the Upland gym had a limited number of ropes and routes we can climb on.  The overall experience is awesome, but if you want a bigger space, I would opt to to to the gym in Riverside.  Since it feels newer and bigger then this one.However, the staff here was very knowledgeable and friendly.", "date": "6/20/2011"}
{"review_id": "yM9jGtRl6uDiAhm06HhnNQ", "user_id": "o8KTsL7lA075jL0cOJ0Whw", "user_name": "Scott M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Indoor rock climbing is a great way to have a bit of fun and get some good exercise and Hanger 18 is an excellent place to do it. The prices are more than reasonable. There are quite a few routes of all different difficulties and the staff members change them reasonably often to keep the variety.I think the best thing about this climbing gym though is the staff, they are all very friendly and show a genuine interest in helping others learn and enjoy this sport.", "date": "7/21/2011"}
{"review_id": "qAZLFjyrJmyDzCOo1QKs_Q", "user_id": "wUlGW9UKvXNBT9c8j2u24A", "user_name": "Roger R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "The reviews stating dirty and confusing layouts of holds are sound. However, this is the only gym I have been to so can't compare it to anything better or worse. The staff on the other hand...not the most welcoming. At one point overheard an employee, or what seemed to be an employee (hard to tell around there), that \"anyone not able to climb a v4 should go home.\" Not cool man. Someone trying climbing for the first time doesn't want to hear that type of talk. Very unprofessional. Going to try out the Riverside location this weekend, lets see how it goes.", "date": "9/20/2012"}
{"review_id": "hfDgC9QeiIAtKowemP3sDg", "user_id": "L8VPiwSSnJe84vmS0CsNyQ", "user_name": "Andrea C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First Time Rock Climbing! Whoo!I bought a groupon so my boyfriend and I went on a Friday morning. It wasn't crowded at all. The front desk takes a little warming up to, but they are actually very nice. The guy who gave us the lesson was great, very friendly. I especially liked that he stayed with us for a good 45 minutes making sure both of us knew exactly what to do. The bathrooms are very sterile and kind of nasty and the shoes they give you look like they've never been washed. (-1), but if you can get over your mysophobia, you can have a lot of fun. Quite a workout too!!", "date": "2/24/2013"}
{"review_id": "3935_J7iwvPbielvofDiIQ", "user_id": "2Fn2ieA9nuu7Cs9Cf5dfdw", "user_name": "J D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We are so happy with our membership to Hangar 18. The staff is ALWAYS helpful, knowledgeable, professional and available. Safety is their number one priority. They create an environment that is encouraging, positive and fun. It doesn't feel like working out, it feels like playing with friends. The setters work hard to set a wide range of climbs for all skill levels. The facility and equipment is well cared for a clean. I can't say enough positive things about Hangar 18. It is absolutely a family friendly, fun place to be and because of the folks at Hangar, I'm hooked for life!", "date": "7/13/2015"}
{"review_id": "7NMprtV4QtTXQKVYXyr0og", "user_id": "gDKTzkU_FrnkOP7oBOIs_g", "user_name": "Alberto E.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "My wife surprised me on my birthday by taking me here.  The experience was awesome.  Staff is friendly with the straight forward and simple instructions.  They treat you well even if you are a beginner.  In no time my wife and I were climbing the wall like spider man.  When we left I was starving, great work out.  The price for membership is great, I almost signed up for it but it's to far away from work. Can't wait to go back again in the near future.", "date": "9/11/2010"}
{"review_id": "TS8sIIpj9n2INiVRh6n6EA", "user_id": "JPDmohXmidgUGeoz0wNX5A", "user_name": "Henry H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to have a good time and get a good workout. The staff was very friendly with the 24 Hour Fitness staff that went down this morning and we had a blast! Will definitely be referring the facility to other and getting my membership soon.", "date": "2/15/2013"}
{"review_id": "RVV5bfOpqFaTHXEokfyYKQ", "user_id": "GFj69ue3FPCp9YiwFxnDHw", "user_name": "Gretchen H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Went to the one in riverside...great place..super fun times....some upper body strength is needed for this", "date": "4/7/2012"}
{"review_id": "zhL5-0t11rEYE4DTz5ZK-g", "user_id": "okwMn905FfWen_f3uVKE0w", "user_name": "Ryan M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is fun for everyone, maybe you're just looking to try out rock climbing or maybe you're someone who has done this before and wants to test their limits... This is the place has walls for all levels.Well basically they separate it into two parts, the linear (climb up and down) walls or the free walls which could be going up, going down, hanging sideways, jumping wall to wallThe linear up and down walls you have to be strapped into a harness and held by a partner... They have lessons for this, which you have to pay for or you can just have an experienced friend to help you... It's fun and all but it's not as challenging as the free walls. The free walls are way more challenging, left me with lots of calluses and feeling more accomplished if I ever completed it.By the end of the day, I would have a few walls that I couldn't complete due to fatigue and injury. This place I wouldn't say is expensive, but I'd only go once in a blue moon...They have a membership deal if you seek to go a lot to work out or just have fun. Staff is friendly too ++", "date": "9/4/2010"}
{"review_id": "LynmEO6E6OIbzyJa36v-6w", "user_id": "bKDlUewFH8p2qaETiBuxWA", "user_name": "Kristy S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first time rock climbing, and I had a great time here! Our instructor, Dave, was super helpful and nice. The standard adult price including rental gear is $30 per person. Dave offered us the college student discount of $28 per month membership - first month is free with unlimited access to all their gym, it comes with rental gear, monthly guest pass, and you can cancel any time. Even if you don't continue with their membership, I would recommend trying it out for a month and bring a friend with you the next time you're back. It'll pay for itself!Our belay lesson took a while to get through, but once you get the fundamentals down, it'll be easy sailing! Despite not having any upper body strength, I found that some of the paths were quiet doable and were not as difficult as they appear. Do expect to get a work out whether you're climbing or belaying. When you're done, challenge yourself to the bouldering routes. I was able to latch onto a couple of holds before giving in. The facility was a little stuffy when we first arrived and by the time we were done, the place felt like a sauna. The restroom needs attention. The door on one of the stalls had no lock and the other one was out of toilet seat covers. The floors and counter was wet. An industrial air conditioning unit will be nice especially during the summer months, but sweating makes me feel like I've gone through an intense work out. You can pretty much spend a whole day here easily.", "date": "9/4/2012"}
{"review_id": "hqG6-3VbhzKNI5p6OIugOw", "user_id": "UIkY94q_QZyh1TXvFbOlaQ", "user_name": "Roger N.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had mt 10 year old daughter's Birthday Party here. Staff was great, helped carried in party stuff, they have a great area upstairs for the parents and others to hang out.  The guys & gal belaying were great with the kids, friendly/encouraging would definitely recommend this place for a party or just t go climb at. Day is inexpensive so go check it out.", "date": "5/2/2015"}
{"review_id": "mTALgstiCuvr9o0Ybrt4WQ", "user_id": "TSYU5urXgN8xa4rm6uoMzw", "user_name": "K.C J.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "Well first off the worst toilet I've ever seen! Second the staff looks at you like you owe them more then $53.00 membership. With the exception of Isaac who is vary kind and friendly. Third there is no way to tell between the guest or who works there. Four this place just may be the worst place, to go with the exception of Detroit. Fifth the staff will persuade you to do some thing, els so they do not have to belay you. Sixth so If you had made this place the last thing to do on your bucket list then have at!", "date": "7/13/2014"}
{"review_id": "UWIFbtxrO1l7RkDFt6p2Pg", "user_id": "7VQ8yyoPpZJ5eOcIRRmwMw", "user_name": "Vili M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My company (24 Hour Fitness) held a team event here...what a great time. We had three great instructors and plenty of walls to climb. Great experience all around.", "date": "2/17/2013"}
{"review_id": "Z7Pn2HL0sx_xt9EMpOTzZA", "user_id": "7JZcwiRlm_dYocaR3IkA4Q", "user_name": "Michelle N.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 3, "funny": 3, "cool": 2, "text": "Me? Rock climb?!? If you're surprised, then you definitely know me! But hey - adventure time right!! Hangar 18 is located in Upland on Stowell (off of Euclid) and is hidden behind a few other warehouse looking buildings.  It was our first time going and so my husband and I each paid $30 which included the climbing (you could stay all day), the gear rental (harness, shoes, etc), and the introductory lesson.  They open at 10am on Saturdays and we got there probably around 11 and were pleased to find that we were among the few people there.  They did tell us that on Saturdays there are usually a few birthday parties going on so it could get a tiny bit crowded.  So after signing our life away, we began the lesson.  The guy was SUPER friendly and well informed about climbing (duh) and made it seem easy as pie.  Since it's a pretty small place, you and your partner have to belay for each other.  With the top rope climbing, they have tons of different difficulty levels for you to try throughout the gym.  They also have the \"cave\"-type area which is just you climbing (no rope) on different angled walls (with some mats underneath to protect you).  It was great because everyone at the gym (employee or not) was super friendly.  Other people would belay for each other and you could hear people shouting words of encouragement for complete strangers.  By the time we left (close to 2pm) the place was definitely getting crowded.  Would I go again... yes - but probably not to climb... I think the fear of falling (no matter how safe it is) is just too strong! But hey, it was a great workout ... I definitely woke up with some sore arms!", "date": "2/8/2009"}
{"review_id": "2u8iVLtimBU3ReCenwbpIw", "user_id": "Uo_NLxYah4FsVyFV5x3iVQ", "user_name": "Jason D.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Starting off- I am biased towards this gym, It's where I learned to climb & got into the sport I love now.Regarding some other reviews:Yeah, there is a definite foot odor in almost ALL indoor climbing gyms- this one is no exception.  The ventilation does help, so does spraying all the rental shoes with Lysol after each use. Hangar 18 in Riverside (or \"Hangar-side\") IS bigger & better, because it was built by the owner of Upland Hangar 18 after 25+ years of the Upland gym.  The Hawthorne gym was bought out by hangar 18.  Pros:-Best gym in the area- next closest is Arcadia Rock Climbing- which has next to no roped climbing: it's a bouldering gym (low level climbing with no ropes & big pads to fall on) you need more muscle for bouldering.-Friendly & knowledgeable staff:  Their primary concern is safety, as long as you're not doing something that will injure you or someone else, they will let you do what you want (some gyms don't allow taking shirt off/ shoes off/ climbing without helmet)-low price/ membership price: if you get a day pass, go in the early morning, then again after lunch to get the most out of it.  comparable gyms charge $60-$75 a month- this one is $40/ a month if you sign up with a card & automatic billing (cancel anytime with no fee)-The holds used by the gym are manufactured by the owner, which means you get consistent, new holds to climb on. (\"Climb-it holds\")-all ages can do it (depending on general fitness)- the youngest I saw was 2 years old (got half-way up the wall) the oldest was probably in his 70's-this pro is more for the ladies: as a result of the no shirt required, and the nature of climbing, there are almost always a couple of topless dudes with super-cut muscles climbing around (regular climbers) that- and some not-so-cut, hairy dudes too- haha-They offer classes for introduction to climbing (how to climb) including belay, rappel, lead climbing, etc.  they also do guided outdoor tours (ask Dave)-color coded routes: some gyms use colored tape, I find it easier to follow the colored holds, than it is to look for tape that falls off sometimes.-theres more pros, but you'll find out when you go here! Cons:-There is NO air conditioning!  this is good if you're planning on sweating anyway, but not so great if you're just here to watch the kids/ take pictures.-The roof leaks when it rains (drips into buckets) gets onto pads & limits where you can climb (still possible to climb)-No early hours: they open @ 10 am daily, so don't plan on a early workout to start the day-", "date": "7/19/2011"}
{"review_id": "sFyzkgjsR3tuphk1lD41sA", "user_id": "-24Lje2-UIpDhjUEqvkx9A", "user_name": "Debbie C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 3, "funny": 0, "cool": 1, "text": "I have been to a good share of rock climbing gyms and have been climbing for several years now.  This gym has all the basics that one needs, but that is about it.  It has high walls and mediocre bouldering problems.  I am writing this review from the point of view of a boulderer since that is mostly what I do.  The holds are really old and worn despite the fact that Hangar 18 actually owns and makes all of their own holds.  I don't really understand why they still need to spray paint over their holds just  to make them a uniform color.  This pretty much ruins the texture of the holds and makes them less gripy.  In compared to the newly built Hangar 18 in Riverside, these two gyms are night and day.  The staff is pretty on top of things here and is very cautious of their patron's safety.  The gym in all is kind of dirty and run down.  Worth a visit if you're in the area for some training, but not a gym that is worth a membership.", "date": "6/18/2009"}
{"review_id": "-cqAsuLZTP1CQFFDhLJn0Q", "user_id": "utjABqzCGFzDVJlnRF0WFg", "user_name": "Fei C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came here because I had a groupon. This was my 1st time rock climbing. The instructor was really nice n helpful n it was definitely a workout lol :)", "date": "4/29/2012"}
{"review_id": "u2Bvmaykve87xumG0zxq8A", "user_id": "6n5KGsZXXBpqiAy7cCcqGw", "user_name": "Wei-Li S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I signed up for a month of membership and drove in from West LA just to take the lead climbing classes with Dave Hamilton. The classes were well structured and extremely useful for anyone ready to start lead sport climbing. The staff was generally helpful and although there was a mix-up with my membership cancellation, my complaints were handled promptly. Overall a great experience!", "date": "2/18/2012"}
{"review_id": "aviqoUKYPMzoXHRBc2vH7w", "user_id": "SG878d0J_SJSgl08lOrvyg", "user_name": "Nat P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is my home gym and I definitely love it.  I've been to plenty of other gyms and I think that overall the Hangar 18 chain is one of the better gyms I've been to.They opened up a new cave in the back and there's always plenty of routes for my level (v2-v4).Top ropers also have a lot to choose from and there's some great lead climbing routes.Negatives: when it rains, the roof leaks. Also, they've decided to start cleaning on Sunday mornings when the gym is open. That really bothers me because the close off the ENTIRE front portion and first cave leaving only the small back cave open for climbers. I just don't understand why they can't clean when they are closed like every other business.Positives: orderly (a lot of other gyms have kids running around and even parents being a nuisance.  They are very diligent here making sure that everyone is not only safe, but enjoying their time here, so when there is a party of kids, you can't even tell). The routes are changed up a lot so you don't get bored and they are well organized.Someone mentioned that they don't have tape and you can't figure out the routes, but unlike other gym, Hangar matches the color of the hold as well as the tape. So if there's no tape, it's the hold colors that you follow... I think it's much cleaner and easier to follow actually.", "date": "4/9/2012"}
{"review_id": "rMmEaUFgb0yjNwWffb2XfQ", "user_id": "qjv0DKpFHio804yuAoCM5w", "user_name": "Elle M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "YES! I have always wanted to rock climb! The day has finally come. My boyfriend bought us a membership to Hangar 18 as an anniversary present :). We went for the first time a few days ago and I am still sore. It was so much fun! I will say this, rock climbing is an excellent work out! I honestly can not tell you how excited I am to go all of the time. The place is great! It has various climbs with different levels of difficulty. Of course I am working on all of the \"easy\" ones, but even those can be difficult when your upper body strength is shot. I'm looking forward to improving. In the meantime I urge all of you to go and try it out!", "date": "2/12/2012"}
{"review_id": "2ZaO6mW1UAx6LOIHMEjivw", "user_id": "Apb7fwIBDl1OWWJUmf1wYQ", "user_name": "Ryan P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "The Inland Empire's best (only one I know of) climbing gym.$15 day pass to climb and boulder.  The facility is pretty large, so you'll be exhausted before you've grown bored of climbing all the different  runs.  Go with someone so you'll have an easier time getting a belayer.The staff is very helpful and \"hands off\" if you don't need it, but highly professional and knowledgable if you do!  Perfect for those lazy weekend afternoons where you want to get out and do something, but just don't know what to do.", "date": "12/24/2006"}
{"review_id": "2h66jmzJg-EKM6V4DyI_hw", "user_id": "FN0zpSfvhZWiwVmAcbkkpg", "user_name": "Maeve G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 0, "funny": 4, "cool": 0, "text": "This place might be OK if you don't have any experience, but if you are a climber I highly recommend NOT wasting your time. The routes were abysmal (setters don't know the difference between right and left hand holds, and have no concept of body position or movement). The staff was very unfriendly and one employee dropped a 15 ft. ladder on my boyfriend's foot within our first five minutes of being there!! His foot is insanely bruised and swollen now, and the guy who did it didn't even say sorry. I really can't think of anything good to say about this place and would never go back. It might be a good place for a kid's b-day, but otherwise, consider yourself warned...UPDATE: My boyfriend's foot is actually broken from the ladder incident!! Ug.", "date": "3/1/2008"}
{"review_id": "krDGkK4eKJW8gHRLcrGCgA", "user_id": "16fv403HPRlehKuryyb5Lg", "user_name": "Stephen R.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice small indoor climbing gym with bouldering, top rope, and lead climbing.  Excellent prices for students from the Claremont Colleges.  Membership includes access to the two other Hangar 18 gyms (Riverside & South Bay) which is nice for a change when you get tired of the same old problems.  Can get busy at certain times of the week.", "date": "1/29/2012"}
{"review_id": "q9DJp5Os7vARkQWS36UUFg", "user_id": "iwW15XTlYRJ6IyXEKjIDlg", "user_name": "Lindsay H.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "This is probably the best indoor climbing rock facility in all of Southern California- I'm just so sad I moved away! Hangar 18 is an enormous facility that offers harness climbing and bouldering. I've never gotten lessons here, but I know they offer lessons and classes for all ages. And what's hard to believe, is that Hangar 18's memberships are also cheaper than other rock places- a lot cheaper! I moved to LA and have yet to find a place as good and as affordable as Hangar 18. You definitely need to go for a day to check it out!! This place seems to be a good party idea for younger children as well. The staff is super friendly and knowledgeable too. (I really can't get over how sad I am that I no longer live close to Hangar 18!)Parking is free, restrooms and snacks for purchase on site. Climbing includes free shoe/harness rental. (yes, free!) And there are student discounts.", "date": "2/9/2009"}
{"review_id": "_2-wbvFWtZjuwONRoE96YQ", "user_id": "QXTmwA1_hYvfobKYeg7saA", "user_name": "DAVID B.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very kick back atmosphere.  Excellent bouldering paths with overhangs and such.  The walls to sport climb on are high and normally consist of 5 6s to 5 12s for the average climber to play with.  The staff is informative and always willing to lend a helping hand in setting up a top rope of suggesting grabbing methods.Probably the only negative is it can be quite busy during the weekend when parties are going on, can be hella cold in the winter and hella hot and sweaty during the summer.  The last gripe would be the rented shoes have holes that are so big, you can completely see your big toe.Last note is the price for a member in comparison to other gyms is very cheap!", "date": "2/7/2008"}
{"review_id": "ix1u8d16K-Ca7_NOn0wUAg", "user_id": "sdP0I1Tiwp6Sjlv2NRCqRw", "user_name": "Misty T.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Fun place to work out. Harder than it looks but a great workout for your body and mind.", "date": "1/9/2011"}
{"review_id": "TPx7zmXIgTE5KLofsjZ8ng", "user_id": "eFo9RcvwIyDaipeYGjlIww", "user_name": "Joe M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been a member for about 2 years now and this place is awsome there are climbs for beginners and for the pros! It is a completely different work out than a gym work out and will get you shredded real quick if you climb hard. Climbing indoor is a great way to get ready for outdoor climbs and really helps boost your confindence outdoors! If its your first time or don't have climbing shoes wear REALLY thin socks for the shoes.", "date": "10/29/2013"}
{"review_id": "5McXUgZf5mRIuYT1fg0ieg", "user_id": "EClVVMAUokDSvd8l7dvTDg", "user_name": "Courtney P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. I've climbed at both their Upland and Riverside locations. I'm not an avid climber but I enjoy a workout that is a little more challenging than a treadmill or free weights. The people that work here are super cool and are always willing to help out whether you need help with equipment or you need advice on technique. The crowd that climbs at these gyms range from really young to older and beginners to avid climbers. I have an 8 month old and my husband and I fully plan on introducing her to climbing through these gyms as soon as she's old enough. I would highly recommend visiting either location.", "date": "10/17/2010"}
{"review_id": "ySKKbjvAXHsGgPJlZWspuw", "user_id": "gD6KSFzpw4ZkRmxBU7MJ6A", "user_name": "Jerry Y.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "If you like checkin out the booooty this is the place for you!!! haha jk I really liked this place and i had a very fun experience.This was my first time at an actual indoor climbing facility so i dont have much to compare it too.I got there with a group of 14 around 10:30am on a sunday. It wasnt crowded at all. We signed the waivers and got our shoes and harness. It was funny because on the waiver it said basically if i hit the floor they werent responsible lol. but i guess i didnt think about bouldering. It was a pretty big facility though like i said i havent been to one before. There are some small walls to begin on if your a beginner upstairs, then theres quite a bit of walls on the main floor to climb all varying in difficulty. There is also a bouldering area. My belayer i had for the duration of my climbs was very informative, helpful, and easy to communicate with, some other belayers just spotted you and didnt say a word. So the belayer i had made it much more enjoyable and he also let me use his hand powder which helps a lot. Everyone that was there was very friendly and i met a lot of different people. Our time was up at 12:30pm but it started getting quite crowded. The total for the group of 14 was 270 dollars minus the 50 dollars we had to deposit. I feel like we got ripped off because my belayer said day passes were 16 dollars. Overall i had a good experience and will definitely consider going back. Especially since its a fun way to work out. I definitely recommend this place to others, cuz i was told it is better than the other areas around this region. Also enjoy the soreness in your forearms!", "date": "4/18/2010"}
{"review_id": "lRBh9-arG4sssyqmqzMOfw", "user_id": "i26yWzGbXaRnhCkoR-BEoQ", "user_name": "Stephanie G.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "WILL NEVER COME HERE AGAIN. I bought a Groupon for two intro classes. We had to wait 45 minutes for a group party to clear out - no problem. When it was our turn (there were two other couples in our class), the employee giving us the class kept running back and forth to the front desk to help other people coming into the gym. He would tell us to practice a knot and then he run over to the front desk and help someone and we would be standing there waiting for 15 or 20 minutes until he returned. This went on for about 45 minutes and at that point we untied our harnesses and left. We asked for our Groupon back and told him that we wanted a refund. He said that they were understaffed and the owner didn't care. He told us to call the owner, Dave, to complain. I saw other employees behind the desk not helping at all.  I don't know what is going on there but I will never return. Save your money and go elsewhere.", "date": "2/15/2014"}
{"review_id": "83k-SVfSvGyuVtSkkrhGzg", "user_id": "HmzrT9UTdJGI51aUStCxIA", "user_name": "Allynne V.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "It was my first time rock climbing and was nervous. Had  to wait for a while to start with a group class. The class instructor was quick and I felt like he was in a rush. There's one giant fan to cool the entire place. There was a kids birthday party there, so felt like it was a little crowded. The place smelled like sweat hog. Still had fun with my friend.", "date": "7/10/2010"}
{"review_id": "q5bSzqs3csLiGx1crhdNKg", "user_id": "5bgsQymr8HDT3tyC1N3Uhg", "user_name": "Sara C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 2, "funny": 2, "cool": 3, "text": "great fun place for a good workout. it looks easy......and yes, it CAN be easy, but if its your first time, you will be sore. so i've been here a couple times now and i really do enjoy getting my rock-climbing on. the price for a day visit isn't bad, $16...if you only come like once a month or once in a blue moon. but if you're hard core, then spring for the $40 per month membership. ya, pretty steep when you compare it to a regular gym membership. but its all a preference. it is a super fun place to hang out with friends and watch all the shirtless guys trying to out-climb each other lol", "date": "9/19/2008"}
{"review_id": "JgrR4F-EIsitcKuqr_otMw", "user_id": "NDVHVQYTrRCdUJlyFjyhNw", "user_name": "David Y.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "I write this review primarily to disagree with Maeve G.'s dispagraging assessment.Route/problem setting:Hangar 18 setters are fairly creative, but the routes and problems they set tend to be 1) right-handed biased and 2) power/dyno biased.  They're better at setting problems than routes, with special emphasis toward overhung problems.  This should come with little surprise to those who know the tight-knit staff and core members, all of which climb/train with indoor bouldering comps as some part of their consideration.  My opinion is that the setting style allows one to get strong very quickly at Hangar, but the particular strengths that are developed don't seem to translate very well to real/outdoors climbing.Staff/core members:As impartial as I can be about this issue... they're a very cool bunch of guys.  They will never hesitate to encourage you at a crux... loudly.  Always there with a spot.  However, they're all 20-somethings, some with a slightly skater-ish, self-assured air to them.  This means that even if they mean well, their mannerisms (esp. in reference to their particular sense of sarcasm and irony) can rub people the wrong way if one is not attuned to it.  That said, it is actually the friendliest climbing gym I've ever been a member of.Shirtless climbing:There's limited ventilation at this gym, and temps can hit into the 90s.  Going shirtless becomes habitual.  Whether that can be construed as arrogant is probably dependent on the insecurity of the construer.Parties:Hangar 18 can become almost unclimbable for members during times when the gym hosts parties for paying groups.  The unfortunate part is that this occurs pretty often on weekends.  On the upside, the belay slaves the gym rounds up to host these parties are \"trade members,\" that is, members who barter belay work for their membership fees.  While one might suspect that this results in less-than-stellar service, the opposite is true, as these \"trade members\" are people with more love for climbing then money, AKA \"dirtbaggers\".Overall:For better-or-for-worse, Hangar 18 exudes the aura of being a very UN-CORPORATE (read: \"dirtbagger\") climbing gym, esp. compared to a chain such as Rockreation (a climbing gym chain in Orange county and West LA.).  I think if your idea is to drop in after work and just climb with your iPod, isolated and focusing into your zone... there are less-crowded and more structured gyms to climb at.  However, if you want to become part of a climbing COMMUNITY, Hangar 18 is a great place to be.", "date": "10/1/2008"}
{"review_id": "nzkk-MoEQMlyXItOasmGDQ", "user_id": "KxrTQnzr83z0HZnrAkkeGQ", "user_name": "Michelle P.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "As Samantha L mentioned, Hangar 18 isn't on par with the Bay Area  (or Boulder) climbing gyms, but I've yet to find one in the LA Metro area that is.  That being said, the staff are friendly and are a large number of long steep routes plus a small bouldering area.  The gym is dated with old school biners that used to grace my circa 2000 rack.  The cracks could also stand to be textured.  Unfortunately, the location makes it inconvenient for me to go midweek and there's no way I'm pulling plastic when I can climb outside on the weekends.  Maybe they'll open a Pasadena/Arcadia location (hint).", "date": "3/13/2010"}
{"review_id": "zj-T0m6fGLrvQDTReEXEAw", "user_id": "Jt_E_uFPhJR2ctF-gc93Sg", "user_name": "Gina M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! There are tons of great climbs and helpful staff.  The rates here are much better than other indoor rock climbing places! $5 for an entire day if you go M-F before 12 noon.  Only $5 to rent shoes and a harness.  If it's your very first time, the lesson costs $10, which is just a one time thing.It's a great workout, and they also have yoga classes here", "date": "7/14/2010"}
{"review_id": "4HC6lmOp14Lw9Z9NrArGIg", "user_id": "vMcp9V_aUcAjCiShd4qyFg", "user_name": "Matthew Z.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "i have been to other gyms and hangar is by far the best one i have ever been staff were friendly, prices are ok good place for beginner climber to advanced they reset all the walls every so often so you don't get bored climbing the same old stuff and great monthly rates and personally i like climbing routes that are one color unlike threshold i hate taped routes all in all its good place to come with a family they do have upstairs climbs for the youngsters who are scared but i would definitely be back", "date": "6/28/2012"}
{"review_id": "EZ-LBmt4MDW_ZYHgAJl3nw", "user_id": "V28MqLYwagJz62YfyPi3qg", "user_name": "Jeremy S.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Hangar 18 is an awesome rock gym.  I've climbed casually indoors for several years, but not since moving to LA two years ago.  My university has a partnership with Hangar 18 to offer a PE class in rock climbing, so I signed up.  Dave, the manager of Hangar 18, teaches us personally for about an hour and then we get to climb for the rest of the night.  There is a huge variety to climb here, and everybody from beginners to experts will be happy.  It's a little expensive, and some of the regulars seems to have \"their territory\" reserved, but I was able to climb most of the routes I wanted.  I'm thinking about upgrading to a full time membership after my class is over.", "date": "4/26/2012"}
{"review_id": "MOfA1sef3p3IsjoImvQ15Q", "user_id": "jGNbi3TDTyUVRfBDdlZySw", "user_name": "Dj M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Fun place to try out climbing - definitely a good alternative to a regular work out gym.  My fiancee tried a one month membership in which they were having a deal since the Riverside branch was opening - I think it was around $15 for the first month.  With a membership, you can bring one guest per month and your rentals are included.  You get a lesson on how to operate the equipment but the down side is you have to have a partner, otherwise, you can only do the free climb wall which is pretty difficult and not as high.  The location is a little difficult to find so make sure you mapquest ahead of time.  Also, it gets very hot and stuffy during the summer months - this is an old building so there is no A/C!  Wear comfortable clothes and definitely bring socks if you have to use their rental shoes.", "date": "2/4/2009"}
{"review_id": "Kvv4ZRiuZXypuJeOHpdvwg", "user_id": "JusRednxi14pk5tAqLNylg", "user_name": "May M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Friends recommended to go to Hangar 18 to try rock climbing. We found this place closer to his home and my first impression here is too crowded, bathroom is so dirty, trash was all over the floor. I did had a great time with my friends. We carry all our belonging with us everywhere we go because there's no locker rental or place to put our stuff. And unfortunately, toward the end of our day before we leave, our camera bag (contain camera and lens) got stolen from either people who work there or the customers. Been trying to go there every single days, talk to them in person and even call and the owner or manager. The owner/manager said the employees and people here are so friendly and work as a team and they don't steal here. I guess my camera bag just grew legs and walk away from me when I turn around. I suggest you do not bring any camera or phone with you in this place because you will end up like me. I will definitely will try rock climbing again, but probably never ever go back to this place.", "date": "2/5/2014"}
{"review_id": "SbgITbF8KbC0LBVXMrBk2Q", "user_id": "-sp8NaebftfKOL614u4KXw", "user_name": "Ryan M.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have never done any type of rock climbing but I did not have any issues here. They made me feel welcome and I was able to move along to more difficult walls. I wish the prices were lower but the college discounts are still pretty good.", "date": "3/16/2012"}
{"review_id": "8sE-Bnv-cG1GRESEn_BEug", "user_id": "Pz3C09hjOBQpZDI5FdDV3A", "user_name": "Kim C.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "got free tix to this place as a bday gift. what i didnt like was how the dude at the front desk was on his phone playing video games and talking instead of helping us. we had to wait about 15 mins... overall the experience was wonderful and my friends and I really want to come back again", "date": "5/21/2011"}
{"review_id": "3nH45BgRb5rTt8YqE7qOLA", "user_id": "EJ93OWX7tjEE8isq-tF7QQ", "user_name": "Rachelle A.", "business_id": "Ui3hw1N8WKjnuHWAP4F2WQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "i've been here a couple of times, mostly just to hang out with friends, once to actually try climbing myself. the staff is super knowledgeable and friendly, as are the regulars. it's nice that they let non-climbers hang out; i know it took me a long time to even muster the courage to step into a harness, but watching everyone else totally made me feel more comfortable with the idea. i agree with grace y about the shirtless dudes. that comment really made me chuckle. i think it's better to go during the day when it's less crowded (and humid), just watch out for those large parties. it's really hard to concentrate with small children running around, high off cake and soda pop.", "date": "1/8/2008"}
