{"review_id": "yKPKZ7oI7xdwNzD7PBSF9w", "user_id": "8vNho_9a6crhyVvg4V7lDw", "user_name": "Krista S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love Hollywood Boulders!Went here on a Friday afternoon, and there weren't too many people. They have their own little private lot behind the gym, but its a small lot. If you don't get parking here, there's street parking across the street. This is an all bouldering gym and they also have a small gym with weights and cardio machines. Very clean and spacious. I'm a strict boulderer so this was heaven for me. Their routes are super fun, their grading is on point and their walls are tall! I must say that I like this gym better than L.A.B, only because of the spacing and you don't feel so cramped in there. They have a little area where you can purchase some drinks and clothes. Their bathrooms and lockers are so nice and clean as well. Definitely can't wait to come back and climb here!", "date": "3/8/2019"}
{"review_id": "scNMr5Nrv1M4ae4Yzd9kHw", "user_id": "FLMRT4tDE4VlM1wyDK5QGg", "user_name": "Hannah E.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 8, "funny": 5, "cool": 6, "text": "I usually don't review non-food-related places, but I spend at least 5 days per week here.Pre-Hollywood Boulders, I was a longtime Hangar 18 member, and only switched because I moved from Long Beach to Hollywood. But after only a couple of visits, I was a convert - despite the more-than-double price of a Touchstone membership compared to a Hangar 18 membership. Here's why:- Variety of holds. Touchstone uses tons of differently shaped holds rather than just one of each 'type' (jugs, crimps, slopers, pockets, etc), and they clean and replace them frequently so they don't get dirty or slippery.- Setting routes equally along the spectrum of grades. Hangar often has an intermediate gap - lots of 0's and 1's, lots of 5+. Not many 2-4. Stronghold, which I've visited once, seemed to start HARD and go up from there. The Touchstone gyms have an even range and plenty of routes for all skill levels.- Creativity in setting. More than other gyms I've tried, Touchstone sets to force you to practice many different techniques. You can't just muscle your way up the wall skipping things.- Tons of classes and community-building activities. Women's nights, queer nights, student nights. Monthly challenges. Yoga, boxing, Thai massage, pilates, weightlifting. Intro classes. Technique classes.Now the cons:PARKING. The lot holds maybe 20 cars and the gym regularly holds 50-100+ people. You see the issue. I am lucky enough to mostly come in the mornings before work, and even then I sometimes can't get a spot. In the evening it's so obnoxious that I usually don't even bother, even though I do enjoy climbing with a crowd.Price. It's $84 a month, up from $81 when I joined, with a $100 initiation fee. The day pass is $25. Yes, it's a fancy gym and they offer a lot, but that's a bit ridiculous. Can we at least get a better parking lot and be open past 6 on the weekends?Overall, I'm glad to live near this location and happy to spend most mornings there. If I worked a more traditional schedule and had only the evenings available, I might feel differently. But I feel stronger and more well-rounded as a climber after my 5 months here than I did after years elsewhere.", "date": "2/5/2019"}
{"review_id": "c1r-ukmiNn4seks1yWS-mw", "user_id": "5WNpVilRzHWPky9uZNsQtw", "user_name": "Coleen J.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "PROS: - unique Walltopia walls- benches up on 2nd floor to work or watch over friends/family - outdoor workout area with free waits and a training wall- sauna in the restrooms!- free towel service- \"healthy\" workout snacks and drinks available for purchase - FREE STICKERS - never really gets too cold or too hot - large enough space so that even if it's crowded, you don't feel like you're suffocating - really great assortment of classes available ranging from yoga to boxing - classes take place in a private room tucked away from the rest of the gym so you aren't distracted by other people - they sell climbing shoes and other climbing related items if you need them CONS:- parking lot to the right of the facility, but very small and tight spaces- street parking can be difficult- as with all Touchstone gyms, the membership fee is quite expensive", "date": "12/27/2018"}
{"review_id": "uJPy0W3Ca5ATdIuwKXIFNQ", "user_id": "d-hEvvy_hYPPkjkpudfEpw", "user_name": "Eimanne Z.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "I mean... this place ROCKS. Pun intended? It really is an awesome gym for climbing. You can have a blast whether you're a newbie or a seasoned pro. The facility is huge, there are a lot of different types of walls with great problems on them. Also not to miss is the gym equipment, yoga and workout classes, and the SAUNA! Nothing better after a solid boulder session that hitting that sauna. The staff are all knowledgeable and friendly, as are the people that climb here. It can definitely get crowded in the afternoons, but mornings you practically have the whole place to yourself! And even when it is crowded, it never feels like you don't have the space to climb.", "date": "4/10/2019"}
{"review_id": "d641RrLJ1SDla9BPwBziPA", "user_id": "2NtXgFOulhGf-NScmUeOBQ", "user_name": "Stephanie W.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Went there for my surprise birthday! It was so much fun! The instructor, Steven is so helpful explaining how to do rock climbing and good at gestures since my groups of friends are Deaf. Very comfortable to look around and try all the different level of rock climbing! Love it!", "date": "4/28/2019"}
{"review_id": "0Jya79w1sD1qTWxtJRmXug", "user_id": "iue7_9Cn_iXVD9hFOz64WQ", "user_name": "Leonard A.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 77, "funny": 54, "cool": 74, "text": "So you think rock climbing is just for kids huh? Well come in and try out your skill level.Strap on a pouchof chalk and climb your way to the top. Stretch out those leg muscles and pump up those biceps and forearms.After the first thirty minutes I'm sure you'll be thrashed.There's different skill levels throughoutthe building from beginner to expert and they are color coded do you know where to start. Besides a full body workout one also expands the mindset in your critical thinking skills. The atmosphere friendly and competitive. And the eclectic sounds that are playing throughout the gym are perfect to motivate your body and mind. Need a little pump up before your climb? They have an assortment of machines to get that blood flowing. There is no time limit andthey have a variety of pre and post workout drinks.And that's my take on Hollywood Boulders,Peace.", "date": "9/30/2018"}
{"review_id": "tWFVEPpnlcGOCS5jlsKRZg", "user_id": "wpGU-tOy4Uya2bxp8m9yMw", "user_name": "Brittany K.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Came in with the two young boys that I nanny and bought day passes for all of us. We had such a great time climbing (or attempting to anyway). For starters, the facility is very clean and well kept. The locker room was equipped with towels and an assortment of hygiene products. The gym floor and cubby area was also well maintained. No free weights or anything laying around.  Furthermore, the staff was extremely kind and accommodating. When the woman working the front desk found out that it was our first time visiting, she graciously decided to waive the shoe rental fee. The day pass rate seemed really reasonable. It was $60.00 total for all three of us. The nice part is that you have unlimited time and access on a day pass. They offer plenty of rocks walls, a small weight lifting area, and some group fitness classes. We only used the rock walls this time but it's nice to know that there are other options to try.I probably wouldn't come back solo because rock climbing isn't my choice exercise but I'll definitely bring the kids back. They played for about 90 minutes and loved every minute of it. Also free parking next door but it was looking very full while we were there. I imagine it might fill during peak hours.", "date": "12/21/2018"}
{"review_id": "9D-Jq2s64A_7NkwQVFG7SA", "user_id": "Ms00QwLnMXHp9Swz2V1QHQ", "user_name": "Kym S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 13, "funny": 7, "cool": 11, "text": "This place will work every muscle that you have. The great part is that your workout is up to you. You can choose whatever route you want to go up the side, across the roof area horizontally. Or straight up vertically.They offer free parking, their hours of operation offers flexible options. The staff is very friendly, helpful and professional. The first time I went it was a little daunting. But after the first 15 minutes you get the hang of it literally... And off you go.", "date": "9/29/2018"}
{"review_id": "ztu5KVUeJWOwK6cQjpDBRg", "user_id": "5nZwMPAW7YxOJafrRqBklA", "user_name": "Jessica C.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hollywood Boulders has a FREE parking lot right next to the gym.The staff is super friendly and accommodating. I needed to buy another month, but the staff was pulled away to help another climber with first aid. She said that I can pay as I leave rather than wait for her to come back. The gym is HUGE and very spread out. I never had to wait for a wall when I went 5-6PM on a Friday night.", "date": "12/3/2018"}
{"review_id": "XDYm_bHfynaWZ3iP19zxYg", "user_id": "mlnSOJBxe-BI5KGOSS4jgQ", "user_name": "Melinda T.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I finally came here with a friend who had been asking me to go as her guest pass (PS: she gets one guest pass a month - not sure if there are different tiers of memberships that offers more). It was easy to get registered (via iPad) and shoe rentals are $4. This was my first time bouldering, and thank goodness there were plenty of V0 options. The atmosphere was chill and not intimidating even though there were people who were really good!! The lights were also off for the majority of the time we were there, and I enjoyed it actually. There was enough natural light coming in from the windows that you could see what you are doing. Also as a first timer, I suggest coming with a friend that knows what to do. It's very on-your-own sort of deal, and she was great at walking me through the basics. I'm not sure if there's more support for single first timers - I'd hope/assume so?? I'd be lost if I didn't follow her lead. Oh, and she brought her own chalk bag - again, I'm not sure if that's provided otherwise. What's also great about this gym (again, I haven't gone to others) is that there are weights and treadmills. There's also wifi and a long table with outlets that makes for a great workspace.", "date": "11/20/2017"}
{"review_id": "FPobqA3jBG4D9p8-zxh4oQ", "user_id": "1wgdfrsfieIl5OiZd1eHJw", "user_name": "Iva I.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Why spend hours trying to navigate the confusing trails leading to the Hollywood sign when you can climb in eyesight of the Hollywood sign at Hollywood Boulders? This is a spacious gym with lots to do: bouldering, weights, cardio, fitness classes, and more. I've enjoyed climbing here so far, and I'm looking forward to trying one of their early morning yoga classes in the near future too!", "date": "5/27/2018"}
{"review_id": "iNuAFPoVAK0yT1pZK3MFsw", "user_id": "oyXIV-9GRBBZrFydPCaR2w", "user_name": "Candace L.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 9, "funny": 3, "cool": 8, "text": "I hosted a corporate event at Hollywood Boulders and it was the easiest thing in the world! Not the Bouldering (not even close) but the staff and making of arrangements was so smooth and organized. I'd highly recommend hosting group events here.We arrived at 545p for their 6p Intro to Boudlering class and I think everyone had an amazing time. It was a really fun and challenging activity. Something I could see myself doing more of since I love a good challenge. My body was working in ways it never has, using muscles I didn't know existed. They provided chalk which was much needed, my palms were sweaty just watching some of these athletes climb these walls and work these problems. I left saying \"I've got 99 problems but a V0 ain't one!\"There's also a small gym upstairs with some pieces of equipment and weights. I really like the idea of a day pass, you can come and go as you please. I can see myself getting my short runs and lift done in the gym area of the club and then using the main climbing walls for additional workout. My hands and forearms were super sore after, it took really until the next afternoon to feel a bit recovered but it was a really nice experience.The parking however, was a hellish nightmare - we parked blocks away and walked over (a little walkin' never killed anyone, so you'll be ok).Super fun place for an adult party or corporate event. I look forward to returning.", "date": "7/13/2017"}
{"review_id": "boLkdULahEZPzMPPbB0BDQ", "user_id": "opdbggrufvUGH8gP9wHL8w", "user_name": "Brian S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 4, "funny": 3, "cool": 0, "text": "I've been attempting to try all of the \"Touchstone\" gyms in California before I have to give up my membership, so I decided to visit Hollywood Boulders on a whim one day wanting to see how cool of a gym it is. I did not climb, nor do I usually climb, so I will only say that there is a ton of bouldering but not really any top-rope. Aside from the climbing aspect, here's what I thought:1) Cardio equipment: about the same amount as other Touchstone gyms, but in a separate area upstairs, away from the weights, where there is much more space. 2) Weights: Slightly larger space and amount of equipment than Cliffs of Id, including a GHD (glute-ham developer), quite a few bumper plates and bars, and two separate spaces for squatting/deadlifting/oly. There are also a couple plyo boxes. All in all, a better space than Cliffs of Id, but not as good as Ironworks or Great Western.3) Stretching: LOTS of space to stretch upstairs without having a ton of people stepping around/over you. Quite a bit of stretching equipment.4) Chill-out area: Not much of one. Unlike other Touchstone gyms that have lots of tables and chairs, there is very little of that sort of thing here. Not a huge deal though: this is a gym, not a coffee shop.5) Cleanliness: Very clean all-around, including large, spotless bathrooms and showers.6) Parking: Small private lot. Be warned: it gets crowded later in the day.", "date": "6/10/2017"}
{"review_id": "3Nd9rliC5mfsfLUaFYpbTQ", "user_id": "i9kwFH_qOWkueSt-hoEzkw", "user_name": "Yena S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "A great experience!If you're ever looking to become more active or try a new activity, considering bouldering! Different from regular indoor rock-climbing, you don't have any harnesses or ropes tied to you so you're free climbing the whole time and potentially falling. But don't worry, it's only as high as about two stories. But this location has a variety of different styles and difficulties, making it exciting for the soft handed beginners to the rough, calloused experts.Hollywood Boulders is a great place to exercise. The time will fly by as you slowly realize the strength in your arms give out over time. The only downside is that the parking is so limited in their small parking lot next to the location. This requires you to wait a while for a spot or try finding a separate spot. Main point is - parking is not guaranteed.", "date": "5/30/2018"}
{"review_id": "4dd187x4oUuHFOy_cUb4gg", "user_id": "_9Q37qk1hcO7LMC9Zl0oAA", "user_name": "Lauren N.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Really like this gym - lots of different walls to climb and I feel like the assortment/variety of paths is a good range. As a beginner/n00b, there were plenty of V1/V0s to try since it's an all-bouldering gym, aka not rock climbing.We had a large group come in after work since it was a company outing and we were assigned an employee who would help provide an introduction to bouldering. Unfortunately, I didn't get his name, but he was awesome!The range of skill level varied in our group, so I appreciate that he was patient and accommodating for everyone. He stayed with our entire group for a good while, watching everyone and giving us pointers on climbing best practices. He was also very closely watching us to figure out what we were doing wrong or inefficiently; he was never condescending and very encouraging.Overall, I felt like everyone walked away more confident and less sore than we would have been if we hadn't received pointers on how to climb better using parts of our bodies. If you're ever looking for a place to hold a team bonding event, this would be a great place!", "date": "11/9/2017"}
{"review_id": "tTgAyulVcMiJBGFKrPGtTw", "user_id": "OZ0swpflv2ApbTDnNZJFSQ", "user_name": "Emily L.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "I love Hollywood Boulders! I am really glad I was introduced to bouldering via this gym because everyone is super friendly and helpful. I have been coming here for 5 months now so here's some things I love:- sauna and lockers and shower- yoga classes (Thursday's with Marco is the best!)- laptop bar with outlets- stump town coffee and strong WiFi throughout gym- great routes that always keep me stumped - outdoor gym because LA has great weather - more cubbies The only thing I wish they had was food nearby because I often get hungry during my climb but sometimes they have a food truck outside and I know a lot of climbers who use Uber eats or postmates. Weeknights can get really packed and I'm fortunate I can come during the day when almost no one is around. I love being able to bring a friend once a month and the last Friday of the month. All in all, it's not the most inexpensive sport (~$80 month) but I do appreciate they have a small gym and daily classes to provide more than just the climbing. If you're looking for nicer equipment area you'll love cliffs and lab which the membership gets you access to. Oh and let's not forget about Parking. Parking is pretty much a crap shoot in the evenings but there is ample street parking ... you just gotta get lucky.", "date": "3/17/2018"}
{"review_id": "3ut76gJixPaEIofZdKo7_Q", "user_id": "oRPnDJamKtoCSxPaNCgy5w", "user_name": "pjncj R.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This was an excellent studio- took the partner Thai massage class and bouldered for a bit afterwards. Today was my first day ever climbing and at this studio so I called before hand to ask what I needed/cost/what the studio provided and the guy on the phone was definitely not helpful. The same guy and a girl checked me in when I showed up and they were cumulatively awful. Like had I not been meeting a friend who knew the drill, I would have reconsidered continuing on by myself. Stupid front desk people aside, this is an awesome community building activity, the bathrooms are spotless, they offer amazing classes, and the bouldering is phenomenal.", "date": "6/6/2018"}
{"review_id": "7HmeXKXGvolSJluZ-kigPg", "user_id": "uF4IOKp_I2TIN5kwmFTbew", "user_name": "Ethan H.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 1, "useful": 1, "funny": 1, "cool": 1, "text": "Why would you order a set of Tension holds but throw them up randomly on your half ass set training wall. What's the point of having nice things if you don't allow people to actually utilize them? It also only took them a month to actually put set screw in the holds on the training wall. One 2 hour session back there and 20+ spinners resulted in the front desk just giving me the allen key to tighten my own holds. Please fix it all, just take the plastic holds off that wall, buy a full set of tension holds and put them up properly(symmetrical hold placements so your customers can actually train)Hi Monica, I'm not sure how to respond to this on here so I'm adding it to my actual review. 8\"vs 5\" the holds should still be set to mirror each other, as they are intended. As you begin to climb v10+ it's important to train mirroring moves to maximize your strength, again as the gold set Hollywood purchased are designed for. Placing them in mirroring sets would not deter from the rest of the wall and the random plastic holds thrown up on the wall, as the tension board hold set only needs to cover 11 t nuts wide. Feel free to email me to discuss further.", "date": "3/27/2018"}
{"review_id": "pHyZqpguYNTHwjMFsG3-Bw", "user_id": "NplEVcB7S4qElE7eMresfQ", "user_name": "Puzant C.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "We came by to Hollywood Boulders for a first time climbers class and it was super fun! Our instructer Amelia (?) was so helpful and nice. She explained everything thoroughly and had our intimate group off the ground within 10min. Overall, the gym is spacious and clean. There were lots of people there on a weeknight, but it wasn't crowded at all. I really enjoyed the atmosphere...there were beginners, solo climbers, people that looked advanced, etc. And we could lay around and hang out between climbs. This was my first time climbing so I was in a little bit of pain (lol) but it was a really fun experience.", "date": "12/11/2017"}
{"review_id": "h3uWG-xDlxbVDsRsBiGOEQ", "user_id": "fSjHzo7A9bN9ClXCRBLJww", "user_name": "Sofia S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Really like coming here. The staff are very helpful and the classes (Darian's barbell training class, lots of different yoga classes, etc) really make the monthly membership worthwhile (especially if you get tired easily from just straight up bouldering). Initiation fee can be kind of steep but they give you a discount if you have a student ID. I also like that you can use the membership in the Culver City & DTLA gyms. Showers have shampoo/body wash etc. Haven't used the sauna yet but it seems clean lol. Parking lot is usually doable and there is street parking, but best to come before 7pm (or after 9pm).", "date": "1/17/2018"}
{"review_id": "CRwpzYTXFVRHacYNb3jPSA", "user_id": "_kQnJrNHPL0TyhNsEE90ag", "user_name": "Joanne C.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 39, "funny": 16, "cool": 28, "text": "What an awesome place to get a great workout.As far as the walls go, this place is enormous, with plenty of space no matter how crowded it may get. I came during the day on a weekday as well as the weekend where there were 10x as many people and still had no problem doing all the climbs I wanted to. Plenty of levels and many of them at that for everyone from beginners like me to V29348294 levelers who are basically like bats hanging upside down from one stubby hold. Also, their mats are SUPER cushiony and even falling from the highest point is no problem.They also have all your weights, kettlebells, bicycles, treadmills, rowing machines etc you could ask for to warm up or to get the full workout. Lots of lockers, showers and even a sauna. They seem to also have yoga classes which is a huge plus.Day pass is 20 bucks (you can go in and out), shoes are 4 and chalk bag w/ chalk is 1. And they have a parking lot which is great (albeit on weekends it gets really packed it seems).If you are a beginner or a seasoned climber, this place will have everything you are looking for.", "date": "3/4/2017"}
{"review_id": "6sp7P96_Hucz4xg673IPvw", "user_id": "nuB76iJdtkOsNsa1mZO0KQ", "user_name": "Michelle V.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 3, "funny": 3, "cool": 5, "text": "This is such a beautiful gym and it's nice that it doesn't smelly like stinky feet!This place is crazy big; there's so many walls to climb and there's some weights/machines on the side. There's enough space for many people without getting in the way of others! Another plus is that they're family-oriented (there's many kids climbing with their parents). I'll probably come back when I'm visiting friends in LA- I wish I lived around this area just to climb here!", "date": "3/16/2017"}
{"review_id": "BioAWPh_BMVvX4TFCceVgg", "user_id": "HsMTaVnsb-GtgGfgYr7K0Q", "user_name": "Isaac S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "People at the front came off as pretentious.Gym is rated pretty easy, but clean facility.", "date": "8/9/2018"}
{"review_id": "WvMuELzZpfnjcHANhndspQ", "user_id": "inM6OR9aGccMCAm6TDfMWA", "user_name": "Walter M.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Hands down the best place to spend your day if you live in LA and want to escape the hustle.  I climb about 3-4 days a week if Im not injured.  Ill even get it in after a long day of work.  The route setters are challenging, Ive enjoyed different styles but these guys keep me working for sure.  I think there should be a tip jar at the top of every route so you can tip the guy who just gave you an hour of entertainment.  I think they get paid like min wage (could be wrong).  My main reason for the 3 stars is the front desk.  I rotate between all four gyms and Hollywood Boulders def has the least friendly staff.  Theres prob two that Id consider nice and helpful.  This one dude in particular, not sure his name, pissed me off one day when I wanted sign my friend up to use my guest pass.  It was my first time getting a guest in and didnt know the process.  After asking what to do and introducing my guest he dismissively glanced at the ipads at the front, where you sign the waiver when you first sign up.  His shitty communication didnt land.  I said \"Do I have him sign a waiver?\"  He blankly acknowledged my question and nodded at the ipads again.  Not saying anything  \"Oh.  Have him sign the waiver on the ipad.  Got it.  Thanks man\".   Was so fuckin rude.  He has since had a shitty dismissive attitude so I stopped dealing with him.  Maybe he hates his pay and is taking it out on guests.  Not sure.  Most of them arent into casual conversation unless youre a select few people.  Its weird. Most climbing gyms Ive been to are super cool with everyone.  I guess they want to give you the Hollywood experience. Also the bathroom floor is always muddy and gross.", "date": "11/16/2018"}
{"review_id": "qJuAUuWkC7XDlMY3PB4Xrg", "user_id": "q5O8gvpKpEle3U1ZFK2EMw", "user_name": "Kelly C.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This isn't my primary gym, but I just love coming here! (Touchstone lets you use all of their gyms if you have a membership.) There are some really great routes that utilize a bunch of different techniques, so I always feel like I'm learning or improving on something! They seem to change them up pretty regularly too, so I never feel bored. I love the layout - it's bouldering only, but there are a bunch of different corners, curves and overhangs that keeps it interesting. The people at the gym (both who work here and other climbers) have always been super friendly. I haven't taken any classes here, but I love the sauna and the locker room always appears to be super clean. The only gripe I have is with parking - it's a very small lot, but I've had pretty good luck with street parking so far!", "date": "4/30/2018"}
{"review_id": "BCyQT5sRTnofj-7IN9SYkQ", "user_id": "cbeTr8E3wYiAgl3J1zB2gQ", "user_name": "Domenic P.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 9, "funny": 2, "cool": 1, "text": "I appreciate this place, I really do.First off, this is one of the three Touchstone Climbing Gyms in the LA area; the other two are LA.B (Downtown) & Cliffs of ID (Culver City).Membership gets you entry in at any of the three gyms (as well as the other 7+ that are located in Norcal area); it also gets you free access to most of the classes at the gyms.HB has new, clean locker rooms, saunas, weight & cardio equipment, as well as a multitude of other perks with membership.I have a casual climbing background (the occasional trip out to the rocks or a climbing gym), but I have never been a member to a climbing gym. I don't know how I'll ever re-subscribe to a regular gym at this point - the climbing gym has totally spoiled me.HB has a good vibe. It doesn't ooze the pretentious climber attitude that can permeate some climbing gyms/groups.There are all types of folks on any given day - friendly folks, less chatty folks, high-skill climbers, beginners, small groups, solo artists, etc. etc.The routes are decently creative at Hollywood Boulders. I would place Cliffs at the height of the variety pool (in all fairness, it has a good deal more square feet of bouldering), Hollywood Boulders at 2nd, and La.b closely vying for second but coming in third. Purely my opinion though.Each of the gyms has their own unique wall setups with something different to offer, so between the periods where you may be waiting for a few more new routes to be setup at your home gym, check out one of the other locations.If you haven't ever rock climbed (indoors or outdoors), give Hollywood Boulders a shot! While there's nothing wrong with just jumping onto a wall and going for it on your first time, I highly recommend getting a crash course or taking one of their beginner bouldering classes, ESPECIALLY to learn falling and impact mitigation techniques (it's easy not to injure yourself, but also easy to injure yourself if you don't have the correct technique)!Like Sender One Climbing Gym, I would looove it if Hollywood Boulders would set in a punching bag or two - that would be the cherry on top.", "date": "11/30/2016"}
{"review_id": "gA_Akni0-86d0zkuNOlNKw", "user_id": "arbp8jWpgRoncZyZlp2dNA", "user_name": "Adriana I.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time experience without the rope it is harder but a great experience for kids and adults First time you get someone to show you how to climb for a very reasonable price.  We had a great time. Everyone was cool and happy. I recommend this place", "date": "11/30/2017"}
{"review_id": "fSgEPDrdXpRJDA6PAFVpcg", "user_id": "HfjwqWc0WM_wAh4GB4FnMw", "user_name": "Stephen P.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 2, "useful": 13, "funny": 8, "cool": 2, "text": "This place seems great. I totally get it. I think a membership here would be nice. I like it. HOWEVER, I've never done any rock climbing so I figured I'd sign up for the $30 Intro to Bouldering Class that started at 6 pm. I showed up early as requested. Waited around for a little. The class started late, and I was the only student. That's probably a plus. The instruction I got included, \"Look at this sign on how to fall,\" and \"Go ahead and climb up this wall.\" After my instructor told me to climb up two walls, she left me on my own. The 45 minute intro to bouldering class was effectively over at 6:10 pm. I felt kinda screwed. She went off and climbed around a bit.So, I climbed around on my own for an hour and a half or so, to some difficulty, cause you know, I don't know what I'm doing like an idiot. And, I did get a little better. So I walked out with the thought, maybe you just get better at bouldering by doing it a lot and getting stronger.Then I got an email encouraging me to to sign up for a $35 Basic Technique class in which they cover balance, route reading, footwork, and more. So, I went back to feeling totally screwed. What was the intro to bouldering? Was it literally just telling me that bouldering is climbing up the wall? If there are things like route reading, balance, footwork, and more, why couldn't my instructor show me at least a little of that in my intro class? I mean, my instructor didn't even make a pitch for the gym. I discovered the weight machines and treadmills on my own. Whatever, I may be being overly sensitive to this, but I'm really feeling screwed on this intro class.Parking lot, but it was full when I got there. Pretty crowded as the day goes on. There were kids running around, jumping around under me as I was climbing walls, which stressed me out I'd fall on them. I should have fallen on one of them...Ultimately I think this place would be cool, but if you're coming in as an outsider, it may not be as fun.", "date": "8/3/2017"}
{"review_id": "u4MOqEhOU5n3oUvVfm2OBQ", "user_id": "VRqpAwdeNpSV7TBMmBiqbQ", "user_name": "Mona H.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a lot of fun here!!! They have all the climbing levels spread out all over the place and they make sure to make it as safe and fun as possible. The floor pads are comfortable to fall on too, just make sure not to use your arms to break your fall- you'll probably break them.", "date": "4/22/2018"}
{"review_id": "Up9GYlslPrpVDf6QgL5eOA", "user_id": "85ppIpu_smSepF5cjWaFtQ", "user_name": "Kev S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My girl and I work out here an climb as much as our lives let us.... we also have two kids that are members for FREE!!  So yeah it works out for us... plus all the members and the staff are super chill.  Workout, climb, rest, repeat.", "date": "3/12/2018"}
{"review_id": "pt5bJTTMbYXVC9SmAG7HvA", "user_id": "wTGFI5Mz0hb68Xr22nDWxQ", "user_name": "Miguel G.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "Much more challenging than LA Boulders. The rating curve is tougher, which isn't that important, but almost all of the walls are inclined. It's a great way to build strength, but something to keep in mind when planning your bouldering session. A manageable number of routes at LA.B can be completely exhausting at this location. Some of the holds are still a bit new at the moment, so they might hurt your hands a little. That being said, there are some very interesting routes here. The staff is very friendly (especially Kevin!), and the sauna is great.Minus one star for so few parking spots. Probably the worst of the LA Touchstone locations. I know it's LA, and Hollywood at that, but not everyone can bike!", "date": "7/27/2016"}
{"review_id": "Ety-FoaK4e1-1EEi-k54TA", "user_id": "Q3ptO9w0ax5dJgUdxoHosQ", "user_name": "Crystal F.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! Only downside is I think the outside lifting area has some sort of bug infestation in the black mat aka lots of bug bites after every lifting class", "date": "9/26/2018"}
{"review_id": "grQmdN0WVXGZtBRFUHM03w", "user_id": "Bc6tVPI7LgFvmBpGtQeEnA", "user_name": "Christopher B.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 2, "cool": 1, "text": "Awesome gym! I want one in Noho :( Great staff, great climbs, you'll feel fore arm mucles you didn't know you had and if you arch your back while you climb you can get IG pictures that make you look like Jennifer Lopez. I'll tell you this - buy your own shoes! The rentals freaking hurt. Although even with the rentals I climbed several of the courses.They'll tell you to stick to the colors... ha! Try, but I noticed some of the more experienced climbers going for what they know. Going back for class!", "date": "9/9/2016"}
{"review_id": "MB9B_Ux7zxxKQCPAfVqX1Q", "user_id": "3Z5ksD1H17Sla3F271cltw", "user_name": "Tim B.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My 8 year old daughter loves this place.It's a little pricey  but if you are regular, the membership would make it worth while, we just don't come here that often.", "date": "9/6/2017"}
{"review_id": "by8tWlYEQR1SN_OLdbW4CA", "user_id": "5J4Y9tLZ-HLxC3uSPXUeyA", "user_name": "Koi F.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "stole my money for a membership i cancelled for TWO months ($160) and refused to refund money even though i did not attend the gym. Very unprofessional.", "date": "8/5/2018"}
{"review_id": "j2789P7bo9BIZTZC6j8Y9Q", "user_id": "sLyDr8aSaLeB52BQuZxU1Q", "user_name": "Kelly R.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "Came here for the Intro to Climbing class and had a great time. The guy who checked us in was also our instructor and was very encouraging and knowledgeable, I didn't feel embarrassed to fall or make mistakes. The gym was nice and large with boulder paths for all skill levels. When we climbed on our own after class the other patrons all seemed respectful, everyone pretty much stayed out of everyone's way, although our instructor did mention that sometimes there are a lot of kids there and I can easily see that getting out of hand or unsafe. This was a great random Saturday afternoon activity for us, and it would make a good first date too! If I lived closer I would definitely consider joining as a member.", "date": "5/31/2017"}
{"review_id": "ea5BIwY--fL6PfB7pa0qBw", "user_id": "ZLQrmzB_bJmMDkdyFx9a6Q", "user_name": "Doug P.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is by far the best climbing gym I've ever been too. It has a great open layout, clean locker rooms with towel service and a sauna, and a wide selection of classes. Overall great vibes from the staff and fellow climbers!", "date": "3/20/2018"}
{"review_id": "_ZyAQYX9UkF-cndhEfLA2A", "user_id": "f0uwLEHPIuNWgFuUNd473Q", "user_name": "Jacelyn K.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I came here for the first time today with a few friends ($25 day pass for weekends). It's not my home gym; I'm based at ARC. But damn, the gym is beautiful and if you have membership here, it's a privilege!! The whole floor is one large mat-- very very soft, it never hurt to fall. Restrooms are kept very clean, stalls are huge, women's restroom has sanitary pads/tampons for free. Free towels, shampoo and body wash for the showers. Now, to the actual climbing. Ratings are soft. Meaning, a first timers could probably climbing V0-V2, maybe V3. It's very encouraging if you've never climbed before. If you have, it's great for your ego. I'm climbing V3-4 at my home gym, and I'm doing V5-6 (maybe 7) here. Routes, from what I've heard, are changed very frequently. And they have a great variety. Anything from cave to slab is there. It's just so nice to go and find so many different types of climbs. Everything is so thoughtfully set and color coded. There was so many people, but I never had to wait for a route. There's treadmills and cycles upstairs, weights downstairs. A top out section with hangboards on top. The membership is $79 per month. If I could afford it, I'd be a member. Great AC, nice routes, I have nothing bad to say about the gym. If anything, it's just the parking lot in the back is kinda small. Note: If you bring your kid, make sure he/she isn't running under people. Everybody is going to fall at some point, and if your kid runs under someone, they'll squash him flat.", "date": "4/22/2017"}
{"review_id": "noscL0T3QhPtRanw8d5YjQ", "user_id": "xpQpECbeuFmJtjgCECKAtg", "user_name": "Dean K.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 2, "funny": 2, "cool": 4, "text": "OK First I wish they had more parking. Second I wish the space was a bit bigger. But those two things aside this place rocks. It is so clean, the staff is incredibly helpful. The members are really cool. This place looks service and goes out of their way to provide training for climbing, they hold many classes that are part of your membership, they have a gym for training and they are constantly updating all the climbing routes. When you join you also have access to all the other gyms under their corporate umbrella which is awesome. Got can head over to cliffs of I'd and climb there. They have a bigger space and rope climbing as well. Plus there is a place downtown and a new one coming to Burbank!!For me this is a great workout, because it is active, lifting weights gets so boring, so having this option as a workout is amazing!!  I love this place! So glad I joined.", "date": "2/17/2017"}
{"review_id": "gYqw2WSP5rGv7yHQjF8USg", "user_id": "K-8DlxPzkXwpWi7fT4J7WQ", "user_name": "Tess A.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great bouldering. I don't think it's as good as lab or cliffs of id. It's much smaller but the staff who work there are very professional. My friend went climbing and sprained her ankle climbing one of the routes and the lady behind the counter rushed to us with an ice pack and did everything she was supposed to do very professionally and swiftly. She heard me say \"ice pack\" and ran over before I even got to her with the goods. Amazing service. The music can change a little bit though. Someone was on a bit of a sleater kinney fix all day and it was a bit overwhelming.", "date": "5/31/2018"}
{"review_id": "1qcCiuChWVAANbthILvaxA", "user_id": "GkzJfxH27j6glfOqBr-Rlg", "user_name": "Tessa L.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Have to give hollywood five stars because it's my home gym! Really I would give them a 4.5.. so here's the break down Strengths: I have been climbing here for three months now.I really love Hollywood boulders... it's accessible for all skill levels, with plenty of routes available. The color coated hand holds are much easier then tape marked routes. The work out area is amazing with lots of machines, there is a sauna, and good classes including Thai massage and acro yoga, all included in the membership. Long routes here, nice variety of setting. The routes are changed pretty often. Not to difficult to find street parking. Weaknesses/Things that could be improved: 1) More classes please!! Lab has mobility clinic, cliffs has partner stretch class. Would like to see more besides workout classes, yoga, kickboxing, and acro. It's a great selection, it's just a lot of yoga and workout.  2) offer adult training.. adult climbing team.. how ever you would like to word it. people will pay more for a bouldering/training program. Other gyms do it. 3) staff SOMETIMES has a \"don't talk to me attitude\" and sometimes they are nice. But friendliness in a space like this is essential. I know this is \"Hollywood\" but part of your role is making people feel welcome and a part of the community.Also, the intro to bouldering here is pathetic. When I first came In August it was \"you've climbed before, right?\" \"Yeah... one time\" \"okay, so you're fine then.\" UM but I want to be safe! Please help! I had to insist on getting more details... hopefully they've focused more on supporting new climbers since then. Overall great gym! Great value for the membership, pretty good street parking, really great community, and overall good staff.", "date": "2/4/2018"}
{"review_id": "tSeteODwwsX9Eay2TswztQ", "user_id": "hDH_9mlCUmbKDJ9ZIgDALg", "user_name": "Anna C.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "Facilities are nice, parking is atrocious, can take up to 30 minutes to find a spot on a weekday. You are better off avoiding this place completely if they are having an event at the Hollywood cemetery, there will be no spots to park at within a mile radius.", "date": "3/28/2017"}
{"review_id": "92Hc1j07xk_1FGn1mQHgTQ", "user_id": "IAmM8WqRks17bCfw8qPr_g", "user_name": "Alex V.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I came here to climb for the first time with a friend. We took the intro class and it was pretty helpful since we've never been to a rock climbing gym. The instructor was down to earth and quick to up the difficulty of the climbs as we got the hang of things.Despite there being a decent amount of people, we didn't have to wait for any of the climbs. I'd definitely come back if I feel up for rock climbing again.", "date": "3/19/2017"}
{"review_id": "oaokx1a-q-FFOadJAE8r3Q", "user_id": "FlGHFt7odQV3I5LBRS9qPQ", "user_name": "Ansley G.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Such a rad place and a killer workout.We went on a friend's guest pass but a day passes and memberships are available.Special shoes are required and are $4 for rental if you don't have your own.There are lot of different walls with different challenges (we didn't do anything harder than V2 but it was still super challenging). Each climb is marked where to start and where to finish as well as the difficulty.The floor is really padded so falling is no biggie.Great for groups because you can work on challenges together.There are saunas in both the men and women's locker rooms - highly recommend. Towels are provided by the facility.There is a parking lot and while some of the spaces are tandem they call over the loud speaker when someone needs to move their carStaff is super friendly and helpful and the facility is super clean.Will definitely be going back!", "date": "2/21/2017"}
{"review_id": "bHGPmtixdY1huA3rW0cyqw", "user_id": "LqyEAVXWuqNu1rAsHRX_ew", "user_name": "Laura L.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. Everyone who works here is super kind. The routes are fun and challenging. I prefer coming here during the day or first thing in the morning on weekends to avoid the crowds. You can rent shoes and a chalk bag if you don't have your own. I have a membership and can bring a friend for free once a month and on the 4th friday.", "date": "11/19/2017"}
{"review_id": "5PWXdwpocSPBxj9urzjxYA", "user_id": "TcpCGnpcE3KImjIifMgqLQ", "user_name": "Lita B.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I looooved this place! Very accessible for climbers of all skill levels since there's a great distribution of V levels and SO many routes. The big Hollywood sign also makes for a pretty instagram. Convenient location, not too crowded, pretty affordable as far as day passes go.", "date": "12/1/2017"}
{"review_id": "Sx1lDCvGB0XdfBPl_IGhbA", "user_id": "lauqLKqmtCa_dYhqMJbC4A", "user_name": "Frank C.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "in my day all you had to do was go outside and find a rock if you wanted to climb a rock i guess global warming thanks obama. wife said it's not a good idea for me to join this gym. i trust her but i wonder if she said that because of all the attractive ladies who are there (we poked our head in to see what the inside was like)", "date": "5/1/2018"}
{"review_id": "CTDBXlQtUZIpcPfts283fg", "user_id": "YwIsFlv2A_Qs37SlPODUoA", "user_name": "Alicia S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 1, "cool": 2, "text": "This place is a blast. It's a very clean, well kept rock climbing gym. Reasonable prices. Quality rental gear. Friendly staff. Not over crowded.", "date": "8/8/2016"}
{"review_id": "n2zG0LO1DQPY78tOwlv95w", "user_id": "bq8zw-JVoNtOy_rzxaE3PA", "user_name": "Jack H.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love this place. They have an awesome variety of routes at every grade -- so it's perfect for everyone from beginners to enthusiasts. I think they found the perfect formula for changing up the routes at the right times. I get to come back and complete routes that I wasn't able to complete the time before as well as try new routes that have been added since (I climb here 2-3 times per week on average).By far the greatest thing about Hollywood Boulders is the friendly staff and people who climbed there. Everyone is so encouraging and supportive. I have yet to meet someone who was trying to show off or outdo someone else. You're around people who genuinely want you to do well, whether you're climbing your first V0 or are trying to complete your first V9.Also, A++ 10/10 for cleanliness.", "date": "12/8/2016"}
{"review_id": "YqvSthAeIqph9W_tqkoP5w", "user_id": "k7CjbmFAz43uKKheVMeskQ", "user_name": "Naoko S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 4, "funny": 4, "cool": 4, "text": "Hollywood is by far my favorite climbing before Cliffs of Id. It is much bigger but not taller sadly then Cliffs but it has so many unique climbs that I absolute LOVE. I really enjoy the underhangs there cause it focuses on your core strength. Kevin, one of the staff, really inspired one of my friends and I really appreciate that. This gym is awesome and I would recommend anyone to go here cause it starts them out with harder climbs so they can do better in any other gym.", "date": "11/13/2016"}
{"review_id": "PCw2swBNAzD1W0z4d3zG2Q", "user_id": "42_BrCrXYZq4myoz46ymMw", "user_name": "Scott E.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm no climber but I went in here with zero experience and asked a few questions, the staff really helped me out. Now I'm in there 3 times a week and starting to become a climber.   Great that they have their  own parking lot and all kinds of seminars and classes . Also ignore the Yelp  complaints about the parking unless you go to a rock climbing gym for its Parking lot .", "date": "5/29/2017"}
{"review_id": "2e9nK21Pk5ZkT33umdg-bw", "user_id": "JWjZkHw4njbC8y_9CHbkOQ", "user_name": "Himanshu B.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Awesome gym. Dudes and dudettes at the front desk are always friendly and ask me about my day/week. Add new routes seemingly every week. Good weights and cardio areas as well as the huge rock walls. Also great to be able to go to other rock climbing gyms across the US when I travel.", "date": "2/18/2017"}
{"review_id": "WUnDkeKR9ZbxDxBFLaK8Iw", "user_id": "Lx0DSCzkZ3sM04WM9wzFlQ", "user_name": "L. D.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Got into town and they had a $0 initiation fee with their membership for the month of January - so bought a membership and I am sooo glad I did. This gym is awesome! So many options! Even came on a busy Saturday but there's so many options there wasn't a moment that I felt like I couldn't get on the wall and work on something. The crash pads are better than other gyms I've been to. The people are of all skill levels. Love they have yoga classes - wish the times worked with my schedule though! They have a nice locker room with a STEAM room.", "date": "2/7/2017"}
{"review_id": "ByRpk4wdpGyCxZUvxZRfzw", "user_id": "WhgPwdWA6eL2_QaiZQEbbA", "user_name": "Roman K.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was great. I am so happy to come here at first time. I met so many wonderfull people. Everyone try to help you. I am pretty happy about it", "date": "3/30/2017"}
{"review_id": "_wfPJQ8i7Wp2U9fcaZ0LoQ", "user_id": "OckOOBf9DJSHa4FsKw2CPQ", "user_name": "Mary Y.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "LOVED this place! We go to Berkeley Ironworks, but were in SoCal for the holidays. Hollywood Boulders has really friendly staff, amazing locker rooms (so clean, great showers, nice saunas) and really wonderful routes! Will definitely be back when we're back in SoCal. Parking was easy as well.", "date": "12/26/2016"}
{"review_id": "kuB0wBllTG2WhIQzVOVY2A", "user_id": "WN4qSRyb9Y-KuQ5jldOXuA", "user_name": "Ricky H.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "This would probably get 5 stars if it was anywhere but Hollywood. The parking situation is horrible, so it's hard not to arrive already frustrated. The gym itself is great. I like the setup of the walls and the routes are pretty challenging. They're also scored harder than LAB or Cliffs, which I appreciate.", "date": "7/24/2016"}
{"review_id": "AKmPsNFbpIxbS1G0EqA7dg", "user_id": "438uozi2bxVTBE37Ip3WUw", "user_name": "Emmie S.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a total beginner, starting from the ground up- v0/v1 and all. I usually go to LA Boulders, which is the Touchstone gym closest to me. Comparing the two, I'm not exactly sure which I like best. While Hollywood Boulders has lower ceilings (which doesn't look as cool and feels a bit more claustrophobic), the pro is that there's a lot more wall space. This means that the wait time is less and everyone seems more evenly spread out. I also think that this is a better gym for beginners like me, because there looks to be a lot more lower grade problems that I can work on, and variety of easy and hard v1's. And it's nice to be able to have space to work out a problem without having people waiting for you all the time... But that's probably because LA Boulders can get crowded at peak hours; HW Boulders just doesnt get that same traffic. I was lucky to get parking in their small lot, but I'd imagine I'd run into problems in the future. Overall though, its a great gym, and I love the variety of problems. When I went, I noticed a lot more beginners like me, which made me feel less insecure about starting out. Great music here as well, definitely makes me want to dance out while I'm on the wall!!", "date": "6/16/2017"}
{"review_id": "TBA88lagm_gN7K8fBDygBw", "user_id": "YfI7Id9l7QE5nTywSYpFPw", "user_name": "Jordan P.", "business_id": "HnmbtjXsjFHlAbQ18Od9wA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here on a Sunday afternoon during their open house preview weeks leading up to their grand opening and it was awesome. If you've been to other Touchstone gyms in the area (LA Boulders & Cliffs of Id), I'd say that it probably has the most bouldering routes and walls available of the 3 gyms. The bathrooms, fitness class room, and pro-shop area were all still under construction while I went there, but the place is pretty spacious- not cramped like LA Boulders. They have a very small parking lot in the back, but it seemed like there was enough metered and unmetered street parking available too. Hopefully I'll be back soon enough. Cliffs of Id is my home gym and within 4 miles of my house, so Hollywood is a bit for me to trek to.", "date": "6/29/2016"}
