{"review_id": "_TERa_chdiz17o1Vr6ZPWA", "user_id": "SmZZD8wu9I2zcbAe7PS6sw", "user_name": "Shawn C.", "business_id": "PrDF2ycpOHJq1pot0RY1zA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This is a safe haven for UCSD students who love to climb. Not sure if you like climbing? Try this place out free for the first week of every quarter. Bring a few dollar bills for climbing shoe and chalk bag rentals because they really help!This climbing gym is close to the heart of campus and all the staff are friendly and often avid climbers themselves. The gym itself is not very large but there are enough variety of routes to keep you busy, entertained, and challenged. They'll change up the routes every quarter or so too.The inside of the gym can get a bit muggy and smelly sometimes but really, what did you expect to smell - roses and lavender? They put a big fan on blast to help air circulation and once you're in the gym for a few minutes you won't notice much.Overall, it's a really fun experience in this gym. Beginners should come the first week of every quarter to get their free experience. It can be busy but it's worth. If you're up for it, buy the $50 quarterly pass and the gym will be pretty empty when you go the rest of the quarter. Really nice! Go climb!", "date": "7/29/2016"}
{"review_id": "FaIiyHoPPJyi-MqtE3D6-g", "user_id": "FgG4Ob_AY2GGuh7F7tpTvQ", "user_name": "jennifer t.", "business_id": "PrDF2ycpOHJq1pot0RY1zA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "this place was fun! how can rock climbing not be fun and entertaining? notice how i said 'fun' and not GREAT AND FANTASTIC! haha.well, the sport itself is just very enjoyable. but the reasons why i gave this a 3-star are:1. the walls are shorter. i believe they're somewhere from 20 feet. that is very short. you basically feel as though you took 4-5 steps and BAM! you've reached the top.2. this place is run by volunteers. so it's not always a guarantee that the climbing center will open, or that it will be open on time.the pluses? WELL....1. so cheap!!! only $9.00 for all the gear and climbing for the day (but really you'll probably only stay 1-hour before your grip gives out). this is regular price i believe. not just a student price. 2. they teach you to how belay! so bring a friend! it's pretty easy, man.3. the walls are short, but they're not that easy.  most of them do that forward slant/tilt thing so you really need to muster up all your strength just to hold on.if you're just beginning rock climbing its not a bad place, because it's still challenging enough. and being that its 50% cheaper then other places in san diego, big plus!i think i'll be back soon. yep.", "date": "7/30/2010"}
