{"review_id": "722PUCMsX8e5xVDDGJ3DXw", "user_id": "Dctc6oUElYrbIFPgOH-K_A", "user_name": "Judy S.", "business_id": "uEKDNhQTkxclbhJjR-a7xA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great little bouldering gym with really nice staff and good pricing. I'll be coming here every time I'm in Chico.", "date": "12/28/2018"}
{"review_id": "pVAkEmuOk4n58R5C5oPNsg", "user_id": "T6xbC30FJBaGvDOTwGsM3g", "user_name": "Taylor S.", "business_id": "uEKDNhQTkxclbhJjR-a7xA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is precisely what Chico needed. The owners/staff are all very welcoming and encouraging, especially to first time climbers! Every time we come here, the owners are super friendly and also try to be available for help. Kevin noticed how awful my technique was and very politely showed me the correct approach (super helpful). Mitch and Paul are both very personable and encouraging as well. I also regularly see the guys making sure everyone at the gym is happy and having fun--especially when there are kids around, very neat to watch the little ones have no fear on the wall. Honestly, It's nothing but good vibes whenever we're here! With such a diverse set of bouldering problems for people of all levels to challenge themselves, it's about impossible to become bored! My wife and I have found our happy place at TPCC", "date": "7/26/2018"}
{"review_id": "-s-zlXw-YBpLalcQbS63Zw", "user_id": "06rdBwfDRylEOzNhqsYFDQ", "user_name": "Jordan O.", "business_id": "uEKDNhQTkxclbhJjR-a7xA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Terrain Park is a an epic new climbing spot that just opened in town. The owners and staff are extremely friendly and helpful and have a passion for the climbing community here in Chico. The Center features everything from fresh boulders walls with brand new holds and a variety of routes ranging in levels of difficulty from beginner to expert. It also features a full gym room and upstairs lounge area making it an awesome place to just hang out or get a work out in, and is close to Chico state campus making it great for going between classes. Overall an awesome experience and i'm looking forward to going frequently in the future!", "date": "4/18/2018"}
{"review_id": "ppEZAGz473jo-s7tV7Szhg", "user_id": "VboYCh9QuTP2g5lwyugKHA", "user_name": "Lance H.", "business_id": "uEKDNhQTkxclbhJjR-a7xA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This place was absolutely needed in Chico. It's the perfect place to exercise while having fun. There are many climbing routes to chose from ranging through all experience levels. There's even a ping pong table, Nintendo Wii, free WiFi, and a gym that has all the equipment and weights you'll need. The staff changes a few climbing routes every two weeks, and the routes are all color coded (can't say how important this is). The only issue I have with this gym is that occasionally there will be two different routes right next to each other that are the same color. This can make a route more confusing then it needs to be, BUT the staff is aware of this and they plan to eliminate this issue. Highly recommend! Only $10 for a day pass.", "date": "6/12/2018"}
{"review_id": "5CnZ74_kHvdEiI5rVO0I-Q", "user_id": "p64SM62xL75WkKCitNuhjQ", "user_name": "Bryan B.", "business_id": "uEKDNhQTkxclbhJjR-a7xA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Really rad bouldering gym with a great staff and community of members. It's a perfect place to learn and improve climbing skills. The weight room, the lounge, and the slackline section combined with the bouldering walls make TPCC a unique and awesome spot!", "date": "6/8/2018"}
{"review_id": "fcbh_Xs-5q8mjQ6YsGhxuw", "user_id": "FgA6bQtqiolA0ICHDspwLw", "user_name": "raymond r.", "business_id": "uEKDNhQTkxclbhJjR-a7xA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The crew at TPCC is super friendly, welcoming, and helpful. The brand new walls are something special, and the +/- 70 routes, varying from beginners to expert, are awesome. Even new climbers, like myself, can get down on some projects and make friends in the mean time. Even beyond the walls, they have a rad slackline setup, so don't forget about that!Excited to see this place grow and become a part of the Chico community. If you see her, give Lucy a pat on the head.", "date": "4/20/2018"}
{"review_id": "EJwO5GTuUEgz_7qOEl5o6g", "user_id": "uIo34FOX45fDPsDweO3NUQ", "user_name": "Ryan A.", "business_id": "uEKDNhQTkxclbhJjR-a7xA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Gotta say this place is about 500% over priced. Old dingy bathrooms/locker rooms. Gotta say whoever the plumber was spruced it up as good as they could, but the showers had old demolition debris on the floor. The owner will act nice to your face and be all smiles. The second your back is turned he got nothing but bad things to say about people. The gym inside is impractical and not fit to get an actual workout in. If I could give negative stars I would.", "date": "6/13/2018"}
