{"review_id": "gXT2cOJYxn8wsOIMz-iOzw", "user_id": "ejpax-XXErAlfxG1msS8NA", "user_name": "Aileen A.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "This was my first time coming to this facility to climb, but I'd have to say that I'm impressed!First off, the day pass here was affordable and the employees were very welcoming. The facility itself had a spacious layout and the climbs were spread out well enough to where it never felt crowded on a wall. There were SO MANY climbs, it was easy to spend the day here!Probably the biggest selling point to me though were the weights section, the clean bathrooms, and the ping pong table. Yes, that's right. They have a ping pong table in the middle of their gym. What more could you want?", "date": "12/8/2018"}
{"review_id": "Bw6J4sTb4QInodSuVDWOgA", "user_id": "REWjbYaUkmGw04lNZraeQA", "user_name": "Austin W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The Factory Bouldering is conveniently located 10 minutes away from Downtown Disney. If you're staying at a hotel in the area, you'll be able to drive over pretty easily without needing to go on the highway. I stopped by this afternoon after lunch and found the place to be extremely empty. Though Factory Bouldering is not as big as some of the Touchstone Climbing gyms up in northern California (where I have my normal climbing membership), Factory Bouldering has enough problems for one to climb for hours on end. Since the gym isn't super tall, there aren't any problems that you get to top-out on. Not a pro or a con in my mind - just something to note.I met a few people while I was climbing today and everyone here seemed extremely friendly. Nobody was pretentious or lost in their own world with earbuds in, and I even met somebody who shared some beta on a problem I was stuck on. I would definitely come back again if I'm in Anaheim.", "date": "11/30/2018"}
{"review_id": "yGgg6Und0NZkUusWyCE7Zg", "user_id": "dMs9FNS7LxzS9s_1gVM82A", "user_name": "Sarina L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I've heard so much good things about Factory before and decided to check it out as a possible new home gym... and it is now! This gym is so welcoming, clean, and just overall great. If you like having new things to work on, they change their routes often usually by sections on a weekly basis. And they have a section for weekly comp problems which is awesome. The staff is super welcoming and nice and everyone who comes are always super friendly and will hype you up while you climb! I also love how they put a huge effort in building a community within the gym. They do student discount days, monthly potlucks, climbing lessons/clinics, and competitions! Membership may seem a little pricey but I think it is worth it for the size, amenities, community, and the AC. Really worth if you're going to commit to improving yourself and coming often!", "date": "11/2/2018"}
{"review_id": "npE0bFDapP25ufZv3-D2lw", "user_id": "WT4Y6Ji7LdY8TfjvmzU-EA", "user_name": "Rae A.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "You know how suddenly everyone's rock climbing so you kinda want to get into it but at the same time, you have no idea what you're doing and you're nervous about the community you're blindly entering? Well, this is the place to go if you're got a little bit anxious of going into the unknown. The staff here is great, very friendly and all smiles. Everyone here knows each other but they're not snotty about it. The Factory also has the levels marked clearly with tags to show you how hard the climb is going to be. It's a huge place with lots to offer. As other stated, theres a couple of machines in the back, everything is bouldering, student discount ($16), and $4 dollars for rentals. You can stay however long though, so it's definitely worth it. Bring some friends or make some new ones.", "date": "7/5/2018"}
{"review_id": "B6sxq4_HfUchfdx0JgekuQ", "user_id": "hS16x_3_1sOhccx4lzBtcQ", "user_name": "Tyler V.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I am very proud to call this place my home gym. I have been climbing here for about a year now and this gym tops any other gym in terms of atmosphere. Everyone here is incredibly down to earth and friendly. The routes are really fun and technical and get updated frequently. The gym is clean and has all the workout equipment you would need to train for climbing. Again, extremely happy that I am able to climb here.", "date": "3/4/2019"}
{"review_id": "fx7Tsw-nbfQ_D-CfExfcqA", "user_id": "jLf6YjXtYWb08iLnkvmXWA", "user_name": "Haena Y.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've seen and heard so much of bouldering recently, so I thought I'd give it a try myself! First off, the gym is larger than it seems from the outside, and it is fully air conditioned! (Whoo!)Honestly I didn't know where to even start as a beginner, so I was scared and bit intimidated at first.I went with my boyfriend, who had been bouldering for a while and wanted to get back into it, so he helped me a lot. BUT! Fear not beginners!The rocks on the wall are color coordinated and labeled by levels of difficulty. And check the wall post! It'll indicate the levels of difficulty of each color, so you don't have to worry about where to start as a beginner. Heads Up: There aren't any harness to catch you, but the whole area is padded with large crash pads for when you do fall. (And after falling a lot, it's safe to say the pad works GREAT)I like that the staff made you feel welcomed and that you can take your time climbing your section. It also seems like everyone there were all open minded and were supporting and rooting for each other as well. So you can watch and learn from others. Honestly, the more I climbed, I wanted to get better. Needless to say, we'll be back for more blisters! $18/ All day & $4 for shoe rental. It's bit on the pricy side but for all day it's not so bad. Even if you get here after work, they are open till 11pm. Make sure to bring lots of chalk & bandages as well! You will get blisters!", "date": "7/25/2018"}
{"review_id": "K1uAbH3HUa5kl2KF58iXfA", "user_id": "LkHwLw5HpSau1_QCreS1lQ", "user_name": "Brian R.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Excellent bouldering gym with problems in varying difficulty and is appropriate for beginners and intermediates. I've been going to this gym for 6 months and have been challenged and kept interested by the new problems phased intermittently. Good crowd too.", "date": "2/26/2019"}
{"review_id": "jXoQpAwenHhfU3QREJYd1g", "user_id": "F0gIIhFbHKEhpE-2UP6NNQ", "user_name": "Grace E.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 3, "useful": 2, "funny": 1, "cool": 2, "text": "If only this place was closer. I live in San Gabriel so it takes about 40 minutes to get there. My friend recommended this place to us and brought us in for free with his membership. It was my first time climbing and I definitely had a blast. My arms were so sore for the next 3 days but it was well worth it. I like how the boulders are separated by level so even if you were a beginner (like myself) you can go at your own pace with the easy steps.Everyone was super friendly and took turns climbing. There was a good amount of people but you were able to get your turn in so there were no problems. I got tired after a few climbs and could not feel my arms anymore. I enjoy the cushioned flooring they have cuz I had to fall so many times since my arms gave out at the top. It was a little adrenaline rush whenever you let go.This is one of the cheapest places I found in the area. Prices range from $14-16 per visit (discount with student ID). A monthly membership ranges from $49-$55.", "date": "9/12/2017"}
{"review_id": "eAmAihEakgzd1IkLuQLC_g", "user_id": "GR5zk5ur7YvMWb2HH9YYCg", "user_name": "Jessica N.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Very bright and spacious gym to go bouldering although they do have a treadmill and a few weights. Facilities were also very clean. Plenty of parking outside.Staff was very nice and it was labeled very neatly what level the obstacles were. Prices are listed on their website. A regular non-student day pass is a bit pricey though at $22 including shoe rentals. But it looks like they have weekly deals.It was not crowded at all on a Sunday afternoon. Plenty of cubby holes for your shoes too.", "date": "2/20/2018"}
{"review_id": "CbS8CDqDYXWGLZdlaQWUfQ", "user_id": "YVbVSd1sMUm7tiChJ-xv8g", "user_name": "Sean A.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Best climbing gym in the area. Love it Make sure to bring lots of chalk and tape for your weak little hands", "date": "3/18/2018"}
{"review_id": "qIYHEdZP44ZzfOZ5M7LfAw", "user_id": "We7ihwopQe61KZ3GPlTFJA", "user_name": "Jessica Y.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you're ever in the area (especially around Disneyland), I'd recommend this gym!This gym is amazing! They have so many amazing problems for beginners and crushers alike! The best part is the variety of climbs that you can get from each section - including World Cup problems!", "date": "10/17/2018"}
{"review_id": "DtFnQz6HsDixLk2RLtbKmg", "user_id": "nuB76iJdtkOsNsa1mZO0KQ", "user_name": "Michelle V.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 5, "funny": 2, "cool": 2, "text": "Ok, so I'm gonna be real with you; I'm a weak climber, but I do love going! The whole place is welcoming and warm! It doesn't feel like people are judging you, especially if you're just a beginner. The Factory Bouldering isn't upscale, but has a warm community with great routes! Everyone is cheering for you one way or another! Also, they have monthly bbqs that they throw where people can bring food and beverages to share. For some of you that are unfamiliar with The Factory's grading system, please refer to the color codes that may be posted on some pillars as their grading scale may be a tad different from other gyms.Additionally, there are times during the week that they offer student discount for a day pass so please bring your student ID. If you are interested in joining The Factory, they do have some sales that occur in the year (I believe there's a new years sale and one other one I can't remember). They offer monthly, semi-annual, and annual passes! If you're a broke joke like me, you may even consider cleaning their holds to get a free pass to climb and you should definitely inquire. Hope to see more climbers!", "date": "11/15/2017"}
{"review_id": "Ppgj-mYtkpxyBrlzizVaFw", "user_id": "UwnDzkmn1P4b8YjhqI7pgw", "user_name": "Ben L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "This place is fantaz-great! If you like to climb on walls and fall alot then look no further than your outdoor park near the kindergarten jungle gym. If you like to do it indoors in any kind of weather and you happen to be in Orange then look no further than Factory Bouldering. I climb both indoors and outdoors and let'me tell ya finding a place that has good creative problems makes a world of difference in your enjoyment.The problems here are higher in difficulty than most other bouldering gyms in SoCal when comparing route difficulty. They adopted a color system that encompasses a band of v-ratings since different problems may be easier or harder for different individuals depending on your style, height, and power level.  The frequency of changing out problems is pretty good running about every few weeks for a certain section of the gym. The walls are pretty short so the routes are often completed in 6-10 moves. There are lots of crimps and over hang problems. Less slab problems and some balance  problems here and there.Dues or day pass are one of the cheapest in SoCal.The overall vibe is pretty friendly but slants more toward the college/young professional demographic. The Factory is a climber's gym and mostly full of regulars and locals.I would also recommend Cliffs of Id since it's more fun, but a much further drive unless you're in Los Angeles.", "date": "12/7/2017"}
{"review_id": "xmvGjQbPBTxQCbI5YFPO7Q", "user_id": "HWzx73JpyMPjL5nyTSB6qg", "user_name": "Alex B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Its been quite awhile since I've gone bouldering. I had the itch to tear apart my hands and be insanely sore the following days and decided to check this place out.As you walk in and you get started as always you gotta fill out a wavier. You pay your fee and if you decide to get shoes ( HIGHLY recommended). Then you're off to anything you want! They have weights in the corner, ping pong table, pool table couch to do work.  It is quite a chill place.I've been to a few bouldering spots and this one is up there in my opinion.  Tons of different climbs with different difficulty. They have little charts posted in spots to show you what type of level difficulty you are attempting.  Definitely look explore all the walls before you start climbing and see which one you would like to try before you lose all your strength! I like that this place is quite cheap sub 20 with shoes I believe. Plenty of room to explore. There is a restroom in the back!", "date": "11/12/2017"}
{"review_id": "XfOKPJ-I3aM2Jwq8vWoz8Q", "user_id": "_Az5OH4GOglEfvNh7FRDqg", "user_name": "Sam H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This is my favorite bouldering gym anywhere. Ive been coming here periodically for years and am never disappointed by the sets. Its a great ratio of slab, face, and cave and the holds are kept in great shape/replaced regularly. The setting is more well thought out than most gyms. I end up getting a full body workout more akin to outdoor bouldering and even the slab climbs are wonderful.", "date": "1/5/2019"}
{"review_id": "YwdjrllByovtCyW0QT0a5w", "user_id": "_Ea9z6dnfRaHPuKoW4fXrg", "user_name": "Geoffrey H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Best place to boulder for the price in the OC area, lots of routes and great environment for both beginners and more advanced climbers", "date": "8/9/2018"}
{"review_id": "mBnmeWtP-TpxR5PE34zKgA", "user_id": "6nmpeUnHQD5XFXl13qFKvw", "user_name": "Christine L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first climbing gym and I'm so glad that it was! I started climbing a year ago and just recently let my membership go, since my job relocated to the South Bay. Everyone is always really friendly and supportive, and it's easy to get advice on climbs if you're stuck.I like the layout and variety of walls (different levels of climbing on all the walls and different types of climbs like overhangs, roofs, etc.) and they change a wall each week! The only thing is that the new walls get really crowded in the evenings so watch out for that.They do cool events like Ping Pong tournaments and BBQ with the challenge of the week.Since the other buildings seem to be cracking down on parking, it is sometimes difficult to find parking during busy times in the evening or during events. But if there's no parking next to Factory, you can go down the street and do street parking (watch for the signs) and walk a few minutes.If I come back to the area, I would definitely renew my pass!", "date": "9/18/2017"}
{"review_id": "mNNXwuMfBPd10PHukYkDRQ", "user_id": "BTvqgT5z43E3GaJaW8GS-g", "user_name": "Karla A.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The sets are top notch, World Cup weekly is awesome, community is the friendliest Ive seen, and I absolutely love that they have that climbing etiquette sign", "date": "8/27/2018"}
{"review_id": "LxIxboCMEofxkXsu4ex0vw", "user_id": "tXs5k1i8-H4MVLJoLDbBMA", "user_name": "Julia T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The music has been exceptionally better lately! Thanks!                                                                    Yelp is saying this review is too short to post.....thats dumb", "date": "8/3/2018"}
{"review_id": "gJS65-eyqqOoKparip0Nkg", "user_id": "IPsKAiMjFj39dN_ckOsMMg", "user_name": "Jamie N.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 3, "useful": 7, "funny": 3, "cool": 3, "text": "I've only been here once, but the facility is clean and very friendly. If you're new, you have to fill out a waiver form, so give yourself some time to get that started. Once you're entered in, you pay the fee. Shoe rentals are also available and I suggest wearing thin socks to get a nice fit for the climb. The walls range from beginner to difficult levels. For a first timer, I stuck with v0 routes and they were difficult as hell! The paths closest to the entrance are much easier than the ones located in the back. As you get used to how to scale the wall with a friend to guide your hand and foot placements, it's a bit easier to get to the top. Gosh, this sounds like a metaphor to life. Anyway, I suggest climbing with a friend and having some chalk powder handy to help with the calluses that will build upon your fragile hands. After a few attempts at climbing (maybe 4-5 v0 routes), my hands were red, sore and tired. You'll definitely need breaks in between :)I feel like the difficulty levels were pretty challenging even for a beginner status at v0 or v1. The sport/activity itself requires a lot of strength so be prepared to work out muscles you didn't know you had. I definitely felt the pain the next day.", "date": "12/3/2015"}
{"review_id": "5NC6Q-QG-U3rqBzYl7qdkA", "user_id": "kuNfjObjRErlz-ltBWnr6w", "user_name": "esther p.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Lovely routes. My home gym is Brooklyn Boulders in NYC, where there are some great route setters. I come here when I'm in town visiting my parents and the routes here are stellar! There are tons of great, thoughtful routes and interesting challenges. Could spend a whole dayhere and not run out of things to climb. Super happy this opened up. Highly recommend! I thought some of the grade ranges within each color were a bit wide, but maybe they do this to encourage more people try new things?", "date": "4/29/2018"}
{"review_id": "aGqY4H2PsDmXzn9HhIUNuQ", "user_id": "ZBg3n7ynd-lVnxTwL5vywA", "user_name": "Wali K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Super chill bouldering gym with a variety of problems for a lot of different skill levels. If you plan on coming more than 3 times in month it's worth getting a membership. A student membership is $49 a month, which is pretty much as frugal as your gonna get in the area.Downsides: It gets crowded in the evenings, and it's hard to find parking. It's never too crowded inside the gym for the most part, but Literally every possible spot can get taken in the lot so you have to park on main street, which is a few minutes of a walk away.", "date": "8/25/2017"}
{"review_id": "bjXdLwnAh3xd_0zNDeWvmA", "user_id": "NutixPJx_nTEIzXeS-YGDg", "user_name": "Mariel M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I just started going to this spot last Saturday, but ever since then I fell in love with it. I decided to make a commitment and become a member here. Everyone here is super nice and encouraging. The staff was friendly and always assured me if i ever needed help with a climb or if I'm stuck with how to complete it, to just ask for advice or suggestion.It seems dog friendly, which is awesome.  The Factory has ping pong tables and pool tables to hang out and lounge around. They also have a small gym to the side to help train. There is free wifi too. They have student days where you only pay $9 all day, but those days you need to check before visiting. It's on selected dates. This is my first bouldering gym, so I don't have another gym size to compare it too, but I love that they reroute it every so often so it's a new climb almost every visit. I already experience a new route I didn't see last Saturday. I love how clean the gym is and it's very open and welcoming. I'm excited to keep climbing here and learn from the staff and community there.", "date": "12/17/2016"}
{"review_id": "I5BFPJM-310GcmwXg2Iyag", "user_id": "ug-aYr4NkwAiH5wZhd49cQ", "user_name": "My V.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The very first time I came here was a handful of years ago when I still had a membership at an older gym called ClimbX when I first started climbing. Over the years I've tried many of the local gyms and had memberships to hangar and also rockreation and through them all factory is easily my favorite. Granted I am a little biased as I am solely into bouldering (I do know how to sport climb, but don't enjoy it as much) so factory caters to me perfectly.The main reason that I really enjoy factory is the facility promotes a strong sense of community and family with the old and new members. Which will eventually lead to you finding friends who will drag you out of the gym to climb some real rocks and you will love it.Pros:Host a lot of eventsCheap PricesHave discounts for even cheaper pricesWeekly resetsFriendly/responsive staffFriendly membersGender neutral restroomsConsParking lot gets full, but there is always parking, just further walkNo moonboard", "date": "10/9/2017"}
{"review_id": "_mVCLYN9B5Yh9pHCqXKFNA", "user_id": "7SUy3RgZiTq31mKOgjD6fw", "user_name": "Diana B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 6, "funny": 0, "cool": 0, "text": "I ABSOLUTELY LOVE THIS PLACE!!First off, the workers are all super nice no matter who's working. Whenever you come in, they always say hi or hello to you and when you leave, they always greet you goodbye. There is a great community here at this specific gym. Everyone knows everyone and you're bound to talk to someone when you're climbing at the gym. There is such a great friendship here. When you're climbing, there's always people rooting you on or asking you how you did a certain move. It's awesome.A day pass, before 2:30pm is $8, and after 2:30, it's $12. Shoe rentals are $3, which isn't bad considering local shoe rentals are $5 and up, and other day passes are$15+. The motto at the gym is \"building better climbers\" and they really stick to it. The routes are a little more difficult than other gyms, but it's great when you climb somewhere else and you're actually a higher grade than at this gym. Confidence booster!The workers are constantly changing the routes here and it's great because you'll never get bored of a wall too quickly. There's always red dots going up (routes are going to be removed) and green dots as well (new routes). This isn't a sticker gym, so you just follow the color of the rock to head to the top.One thing i really like about the gym is that even though you're one level, you could probably try higher grades without feeling disappointed. I've completed some routes that were above my grade level plenty of times. It's just because the rocks are different and the routes are set differently. The different walls make a difference as well. I like that there's a straight wall, a slab wall, but also some caves to work on upper body strength.I'm really glad that they added the extension to the gym. There's more workout machines and equipment for you to get stronger for climbing, hence the motto \"building better climbers\".The Factory always has BBQ nights where you can come, bring some food, and enjoy climbing with a bunch of people. There's also student nights where it's $8 all night long as long as you show a student ID. The music that they play is also always on point. If you're not into a playlist, they'll be more than happy to change it so you can find your groove and climb.Another plus at the Factory is their water fountain. Surprisingly, some climbing gyms don't have one and they force you to buy drinks that are overpriced. not cool.They even have free wifi if your friend are done climbing early or just don't want to climb at all. This gym is really accommodating to their members and the community.", "date": "2/14/2015"}
{"review_id": "bAN9WSyUfQzVZmAzkWqSmQ", "user_id": "zFlzwsY2z8P373e0uhVpng", "user_name": "David W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place. Best gym in the area for rock climbing.  Challenging new creative routes.  It's reasonably priced.  The events and competitions make it stand out for sure.  If you are in the area, check it out!", "date": "3/12/2018"}
{"review_id": "_TTUR6yG21-kici50QXpMg", "user_id": "6otuTd7wnvkkyLxr043Gkw", "user_name": "Lulu C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I came in with my friend not knowing what to expect and honestly we both had never been bouldering. The guy at the frontdesk, I belive his name was Zack, he was super cool and explained the different levels in difficulty and the basics in bouldering. He basically just told us that we would be fine and the most important thing to remember is not to try to catch yourself, but learn \"how to fall\" ... I asked if we needed to get chalk powder to help or tape. He let me and my friend use some of his since he had already rang us up and the minimum charge was $5 on a credit card. (Neither one of us had cash)... Also the fee for the day is $17 and $14 if you're a student. Shoe rental is $3.So back to the actual bouldering, we tried at first and we were very clumsy, watching more skilled people definately helped and the more we tried the better we got. Other times we asked people for tips and they were happy to show us their tricks. When we got tired and believe me my upper body was killing me... my friend and I went to the ping pong tables and took a break before going back to bouldering. I'm definately going back. If only it was closer to me I would go more often. We probably spent about three hours there on Saturday and it was a great time. I'm going to try and go the weekends unless I find a place I like that's closer to me.", "date": "4/5/2017"}
{"review_id": "50S-psh0R26OWBJH80YwKA", "user_id": "8M9Gu99FNXQdHUWiUXOPDg", "user_name": "Edward K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 4, "funny": 1, "cool": 1, "text": "Hello Yelpers!Here's an updated review that won't leave you... hanging. Eh eh get it? OK OK here we go!Pros:1) Conveniently located near the 57 freeway and in between cities of Orange, Anaheim, and Santa Ana.2) Large and spacious building.3) Large crash pads along the walls and wide enough to keep both the climbers and spectators safe.4) Luxurious and fun lounge area with plenty of benches, bean bags, sofas, ping pong tables, and billiards table. On top of that there are enough tables to study on.5) The members on average are very friendly and helpful. Come with a friendly attitude, because I'm sure you'll make some friends here!6) Weight training area with all equipment needed to build bouldering muscles for your epic climbs. 7) Training walls for specific holds.8) Routes are changed regularly to keep things challenging and to keep you interested.9) Affordable memberships that range between $40-$50 a month or better during specials. 10) Staff are super friendly and helpful.11) Free wifi.12) It beats a regular gym. You'll build a skill and get fit than just learning how to carry heavy stuff and run in place.Cons:1) I have nothing. This is the best gym at the best price around the OC.", "date": "2/11/2017"}
{"review_id": "HLPhKvFbIAfCE5emTWt0-A", "user_id": "3_lpzP_RuaAcJCUUcA6fhQ", "user_name": "Andrew D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Although this center is 45 mins away from my house, I still try to make it out here once a week.  I am a beginner (started about 2 months ago) and I find this place to be perfect for beginners to learn how to boulder.  The staff members and climbers here are really friendly.  Many times as I struggle to reach the top, climbers would come to give me advice and show me how they would approach the challenge.  A day pass here is $14 with a student ID and $3 for shoe rentals.", "date": "8/12/2016"}
{"review_id": "kJTPDrNMHRBQPxNgIWNCKA", "user_id": "K97-9tvaEUhbqpJj8PKtlA", "user_name": "Johnny C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came as my friend's monthly guest and this was my first time at a bouldering gym, so I didn't know what to expect. The staff was really helpful with getting me my shoe rental and they seemed to keep the place pretty neat as far as I can tell.I like this place because the people were all really supportive and really friendly. There's plenty to do besides just climbing, like weight lifting and strength training, cardio, and even ping pong. It felt like a really casual environment where people come to just hang out and do something fun with their friends or with people they just met.Each route is labeled according to a difficulty level and they're all spread apart throughout the gym, meaning that not all the beginners are in one spot and not all the advanced climbers are in one spot. It promotes people mixing and meeting other people with differing skill levels and I really like that! You may even find someone who can help you figure a route out if you're not too sure on how to complete it.", "date": "6/29/2017"}
{"review_id": "gDAz3awXlRhhI6Asd_prgA", "user_id": "g1qRZ9LQ2hOkE4he98ZFSA", "user_name": "Elena L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym so much. Small, local and always an amazing experience. You're not only receiving a killer workout or fitness experience, you gain a really nice community. If you are local enough, give this establishment your time and money. You won't regret it.", "date": "2/26/2018"}
{"review_id": "6VnP_qObT6CxNBUrmqeTWw", "user_id": "_iSpVgRi0gQzhIXlN68Z2Q", "user_name": "T T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome bouldering gym! Great addition to Orange.Factory bouldering makes excellent use of their space as a bouldering only gym.  Their problems have a wide range of difficulties and styles for you to practice and project and some thought definitely goes into to the route setting. The interior is very chill. The main floor has a pool table and some sofas/benches for you to relax in between problems.  A problem I've found with small to medium sized climbing gyms is the utilization of space and factory bouldering definitely finds that balance.", "date": "1/15/2018"}
{"review_id": "Z_VLAgogcw5PeDpybQ4mLg", "user_id": "eNF6dti8i4oqYqbGxrcVxw", "user_name": "Melissa D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've begun to boulder recently, and this place is absolutely great for beginners! The interior is extremely clean, well-maintained, and has indoor air conditioning. The actual problems never stay the same for too long, so nothing gets tedious. I also found the gym equipment to be relevent in improving bouldering skills such as the rowing machine since it has a total body dynamic. 10/10 would recommend!", "date": "8/8/2018"}
{"review_id": "1mRrF1t-OxVA-BxWLxx1LA", "user_id": "GefVadMH_iWaLJMTGEDMvg", "user_name": "Jessica W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place. I had so much fun. The staff is extremely welcoming and supportive. Great supportive atmosphere. They change it up once a week so there always new climbs. This is my new hang out spot for the weekends. Go check it out!", "date": "7/21/2017"}
{"review_id": "gaw0oykGa8wHKZ65rpdNiQ", "user_id": "RzjEJQrq8FCy_9nHrmMB9g", "user_name": "Diana Y.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "For my first time bouldering, this place really exceeded my expectations. The workers are really helpful too, they gave my friends and I some tips on climbing and descending. Student prices: $12 day pass with $3 shoe rentals. They even have special \"student\" days where it's $8 for a day pass, not including shoes. A pretty sweet deal, considering other places can easily average up to $20 or more for a day pass. I would come again and recommend to others!", "date": "1/8/2016"}
{"review_id": "xq0xga2xZRkslWwBePQ7UA", "user_id": "r0EQqSTgw7K_r9hixgco4Q", "user_name": "Jeremy F.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "The staff is friendly here. The climbers that go there are friendly and not at all pretentious. I am only one year into bouldering so I'm still somewhat new. I feel comfortable here. I also climb at Cliffs of Id in Santa Monica and Hollywood Bouldering in,, uh,,,Hollywood. So it may be unfair to compare The Factory with those other two \"high end\" bouldering locations. How to improve Factory:1) Change up the problems and courses a bit. They do not change the wall settings very frequently so if you go once a week, chances are you will be climbing the same problems for a little while. 2) The price is actually pretty good compared to Cliffs of ID and other gyms. Lately other gyms have increased their prices but Factory remained the same. So it is a good deal. 3) The holds are a little more rough on the hands then Cliffs of Id or Hollywood Bouldering (I know I know don't be such a priss, develop those climbing hands, ya ya I've heard it).4) Have a changing room. One mens bathroom which is used for changing and pooping seems a bit ghetto and I often have to wait awhile to changing. I love the Factory for it's convenience, location, good vibe and people. I want to see it get better and become a premier climbing place.", "date": "2/14/2017"}
{"review_id": "42eoIFaOPsPoPIF94YC-9Q", "user_id": "cdtM-osQj246Dd43JBci8A", "user_name": "Jenna H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I absolutely love this place. Fell in love the first time I went and got a pass for Christmas. They have very well designed courses that will definitely help you grow as a climber. The community is super helpful and friendly there. Wouldn't want to spend my free time anywhere else", "date": "12/31/2017"}
{"review_id": "qvNKjxMsHLpcshTc9pucXA", "user_id": "gOLtVZTUQj9jUSsRUUi71w", "user_name": "Maggie M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place honestly feels like home when you walk in. The people are friendly and non pretentious. It's by no means a glitzy and glamorous place (like Sender One, Touch stone gyms), but it's pretty wonderful. There is a strong sense of community and that alone has fostered my climbing skills.  Regular climbers and visitors are friendly and always willing to offer up tips and encouragement.  The routes are updated regularly and there is a wonderful range of difficulties that are perfect for beginners to those who are looking for a good challenge.  There are 3 restrooms (gender friendly), 2 ping pong tables, a pool table, tiny gym area, campus boards, a drinking fountain (resuable bottle friendly).  Due to it's increasing popularity (climbing as an activity) weekday evenings can be quite crowded.  Parking can be tight during high traffic times.  During business hours be mindful and respectful of the businesses around (I've seen tow trucks).  Daytimes and weekends are generally better.  We bring our 15 month son with us when we climb and everybody is so welcoming to him.  Tip to new climbers.. please refrain from clapping your chalk laden hands like you're a pre-90's kid clapping chalkboard erasers. Climbing.. not gymnastics.", "date": "10/16/2017"}
{"review_id": "dsgYKz1pK9MdThdNcJuYxw", "user_id": "IxrkMwtW1emHp7cifyq40A", "user_name": "Diana T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "I have never done any sort of bouldering/rock climbing and coming here was such a great experience as a first timer!  If you are new, they make you sign a waiver form and take your picture so if you do come back (which you will), they already have your information on file.  This place is very clean and it has such a very chill vibe.  There are different color coded rocks/steps (whatever they are called) and they are labeled.  Sometimes I feel that they are somewhat labeled wrong because it says easy but I find it hard.  I guess it all depends on your flexibility and the length of yourself (me being short is super hard to stretch and step on a colored peg).  All in all super place to be if you want to try something new.  What is great is that they have padding so if you fall, you won't get hurt.  NOTE:-General Day Pass- $14-Student/Youth Day Pass- $12-Shoe Rental- $3-SPECIALS::::: Monday-Friday 11-2:30pm (Climb before 2:30 and your day pass is just $8 but shoe rental not included)-FOR THE GIRLS: bathroom with a basket of tampons available just in case! ;)", "date": "10/16/2014"}
{"review_id": "D3hG1VQGLSaywaCO5qenGQ", "user_id": "dCRZLAFC91oLRTzvqHCAow", "user_name": "Snow W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 19, "funny": 18, "cool": 23, "text": "Found this place on Yelp and decided to give it a go...Located in the City of Orange.First visual impression was how spacious and airy the gym was!  First contact with staff was so welcoming; she walked us through the layouts of the place...*11,000 sq.ft of climbing terrain, with various levels of difficulties to conquer. *Small fitness area; ping pong / pool table. *Snacks / free wifi. *Free parking on private lot. Memberships available. On this day, $16/pp - unlimited play time!Give it a try!  No insane upper body strength needed; it's not that high; and no one's watching / judging. Climbers of all ages and experience levels here. We climbed, we fell; our hands bled. Good times...", "date": "9/30/2016"}
{"review_id": "ZmUux_Z7MmKSEXtcebIwbw", "user_id": "VfOjerIjl765YIkydkMWOg", "user_name": "Ron T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 13, "funny": 8, "cool": 9, "text": "If you are a boulderer and live nearby this should be your climbing gym.  The Factory has everything you need to become a better climber. Everyone here is really nice.  The staff is knowledgeable, polite and helpful.  The customers are generally polite and mindful of others. They try really hard to keep the gym really clean.  The staff is always cleaning stuff. The bathrooms are usually spotless. There is a good selection of fitness equipment. Cardio (treadmill, elliptical, bike), Weights, Cable Machines, Kettle Bells, Bands.... Are available.  There is also a bunch of climbing related equipmentThey change routes regularly. They have a lots of fun routes at varying levels. The walls have a large variety of angles from vertical to roofs, so you can work on becoming a rock master.", "date": "9/17/2016"}
{"review_id": "ON5KEwMJ0rRTWMxyc71tlQ", "user_id": "8vNho_9a6crhyVvg4V7lDw", "user_name": "Krista S.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 3, "cool": 3, "text": "A friend finally got me into going rock climbing with her as I had been too scared to go before (and felt embarassed cuz i'm not in the best shape) and we went to The Factory.Went on a Monday, and there weren't many people there which was great. We got all the walls to ourselves pretty much and my friend started me off on the VB problems. This is a pure bouldering gym so the walls aren't that tall (maybe 20ft?) .. let's just say it's safe enough that if you do fall, you won't hurt yourself since there are some very soft and sturdy built into the floor mats waiting for you. My friend who's been climbing here a lot has said that they change out their problems often and also put new ones up as well. I had a lot of fun as a beginner since there were a lot of VB's for me to try (enough to tire me out and stump me too) so if you're just starting this is a good place to come.The staff was friendly and welcoming and it was kinda cool watching them climb too. (gets you motivated to get to their level!) Definitely coming back here again consider if you come early (before 2:30pm the fee is only $8 and rental for shoes is $3) and you can climb all day! I think regular is like... $14 and possible $12 if you have a student ID.Getting here was super easy too... just take the 57 and exit Katella. And parking is decent.", "date": "1/22/2014"}
{"review_id": "UvPHpcky-5TS8sky58ecTg", "user_id": "OVRyNE_g1ED8kqXgdUHczA", "user_name": "Daisy M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great gym. I wasn't going to come because I live in LA and it's in Orange (and you know in LA traffic that is like you might as well clear your whole night type of thing). My buddy insisted we go since he had a crappy day... I am a major sucker for helping out a friend in need, so I said, why not!I am so glad I did. The place is pretty big, it wasn't crowded, and the bathroom was clean. They even have lotion in the ladies room. Which is important seeing as how that chalk makes your fingers look like wrinkly sausages. I know it's nasty, but it dries my hands out so bad. I felt like my palm was the stage, and my fingers were the California Raisins. (You 80's babies will know who the hell I am talking about, that band will give any kid nightmares)The staff was friendly, and the people or members were very helpful. The environment felt good and supportive rather than competitive. The climbs or whatever they are called are all marked well, which is very helpful. They have ping pong tables and a small area to work out. The price wasn't bad for a one time visit ($12.00) (Free for me, because my friend treated!!).All in all I say this is a great gym and I will definitely be coming back and inviting additional friends to come out with me.", "date": "1/29/2016"}
{"review_id": "pxBjV03b838fB88f0MF9Hg", "user_id": "3jceczWOZIWBbJxeu1kibA", "user_name": "Kiet L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This is my home gym. The workers are all super helpful, the gym is very well maintained. Routes are changed out very very often so you will never get bored. WOO!!! Can't wait to get back in to climb & pong.", "date": "7/19/2016"}
{"review_id": "5IfcHX1Ce7fkoT4OicwAXw", "user_id": "0lOSuh3xSDrYNcxxfG7bAw", "user_name": "Ali Y.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time.  Never bouldered before.  Staff was very helpful and they took the time to show me around and give me the bouldering run down.  They even gave some beginners advice.  Its pretty cheap to get in and climb (I paid $14 for an all day pass and shoe rental).  The place is clean.  I went when it wasn't busy which was great since all the easy/moderate trails were not busy at all.  Overall would come back again and might even get a membership.", "date": "9/26/2017"}
{"review_id": "vrH3rrSRitL8jcsZ8T4C7w", "user_id": "-U58qR7ZAMgkoQ23g5nDLA", "user_name": "Nan L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Well, this gym has a 5-Star Yelp rating already so I'm not sure there's all that much I can add to the conversation, but I'll try --Personal Experience: This is the gym I joined when I first started climbing about a year ago. Everyone that comes here is friendly and the staff is super helpful; the music they put on is great too, which contributes to the overall vibe of the place -- it's just so easy to come hereThanks for everything guys :)", "date": "8/14/2016"}
{"review_id": "SBNZvTYP8G2J0tFjixFNFw", "user_id": "DTyxp4Dw4FrDPe_6HYEYcA", "user_name": "Nathalie D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 3, "useful": 2, "funny": 1, "cool": 0, "text": "Stopped by here bc it was convenient to my schedule, and don't know most of the local places anyway, so gotta start somewhere. I don't know how crowded this place actually gets as I visited this establishment on a weekday at around noon.This place wasn't the best - but it was the cheapest. There are sometimes where you get what you pay for and in this case that is true. Personally I have been accustomed to bouldering at places that allow you to \"top-off\" or climb over and to the top. This place is in a fairly low ceiling establishment so I can see how that was not an option here. The residual workout equipment (i.e. treadmill, weights, etc.) was also dated and could be a better maintained area overall. PROS: The bathroom was immaculately clean. Rental gear was clean. Parking wasn't an issue.Probably be back if I'm in the area and need a quick workout, but not a place I'd get a monthly pass.", "date": "4/13/2016"}
{"review_id": "uu27qlmcV-zT7BYadsWY2g", "user_id": "EMaKlqBU3R04Licmj5YJYA", "user_name": "Paige H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "I came here with my boyfriend on a rainy Saturday afternoon. We are both completely new to bouldering so I was pretty nervous. The person who greeted/helped us at the front was so chill and awesome! We paid $12 for a day pass with a student ID. (It is $15 for regular day passes). We also got some rental shoes for $3 each. If you don't have chalk, you can rent it from them for $2. They do not accept cards for purchases under $5! We made the mistake of purchasing our passes and shoes and realizing we needed the chalk later...They also explain the difference of levels and how to identify them which was extremely helpful for us newbies. It was def not easy, especially for beginners. You are using parts of your body you don't usually use when doing a regular workout. It requires quite a bit of strength so you will be feeling sore and achy after. I was able to do all V0 levels and a few V1's. I heard this gym has a difficult set compared to others but I think that's great! They also have two ping pong tables, a small weight area, a pool table, clean restrooms, a drinking fountain, plenty of places to lounge around, and free wifi! The atmosphere is very laid-back and we both felt very comfortable. We stayed there close to 3 hours and it is definitely a place we will be re-visiting. Excellent customer service, chill atmosphere, and at a reasonably good price!", "date": "1/30/2016"}
{"review_id": "PUgdJ9XP5suFwmy1BEbsYA", "user_id": "jwH76aErfaqiRKs56aqLDA", "user_name": "Sohail T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I figured that it would be only fitting that for my first review on Yelp I'd write about of one of my most treasured places in all the land. The Factory Bouldering is hands down one of the best climbing gyms in Southern California, and it may very well be the best pure bouldering gym around. I try to get out to the Factory 3 - 4 times per week (whether for climbing or whether for working out in the Swole Corner) and have been a member here for the past three years; I've seen the gym change quite bit over that time and it has only gotten better with every change. Pros: -Incredibly friendly and helpful staff that play great music-Routes of all difficulty levels that are changed often and mimic routes that can be found outdoors-New colored grading system (see one of the photos I posted)-Walls of all different angles, caves, and a new roof section-Clean (as clean as a climbing gym can get)-Two ping pong tables and a pool table-Free Wifi-Membership benefits (Free monthly guest pass, two free guest passes on your birthday month, discounts on climbing shoes, etc.) -System wall, campus board/wall, several hang boards, and a balance board-Swole Corner (weights, two olympic racks, bicycle, treadmill, rowing machine, dip bar)-Drinking fountain-Drinks/snacks available for purchase at front desk along with chalk, climbing shoes, crash pads, and Factory swag #repthef-$15 all day pass, $12 day pass for students, $3 shoe rental-Only $8 for a day pass if you go before 2:30 PM (don't know if this is all the time, but it seems it has been the case more often than not when I go)-New student days where students can get in at anytime during the day for $8-BBQ and Bouldering every month-In house recycling-Awesome, chill environment/atmosphereCon:-Not open 24 hours a dayFOR NEW CLIMBERS: Bouldering, and climbing in general, is a difficult sport, so do not expect to come here and breeze through the routes, especially with how stiff the grading of the routes is at the Factory. Expect to come and have a great time, but to also get an intense workout and push yourself to your physical limits. Bring plenty of water, wear thin socks (shoes rentals are available for $3), bring climbing chalk if you have some (can purchase some at the front desk), make sure to stretch (before and after climbing) and most importantly, bring some friends. Hope to see you some new faces at the gym; if you see me there feel free to say hi and climb with me! Overall, I have nothing, but good things to say about The Factory Bouldering; I have been very fortunate to call this place my home gym. TL;DR: Whether you are someone who is new to climbing and is looking to get into the sport, a more experienced climbing and wanting to advance your bouldering, or someone just looking for a great workout and to have an even better time, The Factory Bouldering is the perfect place to go. Do yourself a favor, get some friends together and head over to one of the best climbing gyms in Southern California.", "date": "2/2/2016"}
{"review_id": "jIkfv4sTRE1pGPsf1KQwGw", "user_id": "9yb771zcm50k_8w8rQU70g", "user_name": "Renee B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "My son is almost 8 years old and is obsessed with American Ninja Warrior.  I found this gym on yelp and decided to give it a try.  I am SO glad we did!  First off, they have a great morning special, only $8 before 2:30 and we were the first to arrive at 11 when they opened.  I wish I got the guy's name that was working because he was awesome with my son!  He helped him out and showed him what to do, let him use his chalk and encouraged him the whole time.  And he didn't even seem to get annoyed when my son kept talking to him haha.  I had my 5 month old daughter with me and there was able seating for me to spread out with her while the older boy climbed.There's so much variety here, obviously my son stayed on the beginner wall for the most part but its obvious that there is a ton for more advanced climbers.  There's also a gym and other training devices here.  Such a cool place, I can't wait to get a sitter so I can go back and join in the fun!", "date": "7/17/2014"}
{"review_id": "uUVwKoalyAiF8TDRbkPGmQ", "user_id": "MypXEACE_vbUnoZx-codJg", "user_name": "Kevin C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "If you're a bouldering fan, this place is one of the best in the OC. It's pure bouldering bliss and they have tons of routes to keep you entertained for hours on end. I showed up at 11am on Friday morning and I was the first climber in the gym. They have a matinee special going - $8 for a day pass before 2:30pm. What a steal! This gym rarely gets crowded so you can climb at your leisure without anyone breathing down your back.If/when I move back to SoCal, I expect that I would definitely frequent this place. It's a really fun bouldering gym which is clean, fun and accessible. They supposedly change out routes every two weeks or so - so there will always be new problems to solve.", "date": "7/21/2014"}
{"review_id": "1UhxHqQSTpQP7eZG9afDcw", "user_id": "kZDCyFt8DFMztiBLJ0qL5w", "user_name": "Jessie V.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "It was my first time rock climbing and I absolutely loved it. It was very challenging and really helped keep my mind off things. I went with a friend and it was a lot of fun. The facility is super clean and open and their staff is really nice. I really appreciated that they didn't hover over you to make sure you were doing it right, but just really let you explore the place. It's a definitely a workout and I am totally feeling it the day after. Would definitely come again and would recommend to my friends!", "date": "2/10/2016"}
{"review_id": "8qEWOynyYWJ8Wn4WjUDScQ", "user_id": "7rPtCLStY0EXZQuPl0AfHA", "user_name": "Michelle N.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here two times now, and both times were pretty amazing. The price that you get for a day pass including shoes is sooooo affordable, especially when comparing the price to other rock climbing / bouldering places, which can go up to $25-30. The people there are extremely friendly, and great to talk to. There's more than just bouldering, there's ping pong, billiards, and more games to play, so it's an awesome hang out spot. Really awesome place!", "date": "4/9/2016"}
{"review_id": "0ExwjbHI1YDeB_iJ9-WqSg", "user_id": "nXAsI0cvTeUxPRXXBtS6xw", "user_name": "Joseph C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Came here with my girlfriend expecting it to be a place full of just rock climbing walls, but it is way more than just that! It's a place where you can climb, lift some weights relax and play billiards or ping pong. I've never been rock climbing before so I wasn't sure what to expect. What I enjoyed most here was the atmosphere of the place. It's not the typical kind of atmosphere like a gym but more of a relaxed place where people come to have fun and do things they enjoy like climbing. I can definitely see why getting a membership here would be so common. It's a great place to come whether you're a more advanced climber or new to it like me and my girlfriend were. I'd definitely come here to climb again. It was A LOT of fun!", "date": "1/5/2016"}
{"review_id": "8qCuGoBhgttxD04PQAd89A", "user_id": "7gJ2PRrydKVtOexRC-0vbw", "user_name": "Jon G.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. Tons of boulder problems for various skill levels. Aside from the walls, they have exercise equipment for strength training and cardio. They also have a common area with a pool table, two ping pong tables, and couches to relax on in between training sessions.The route setting is top notch. The boulder problems here flow well and range from powerful to technical styles of climbing. Speaking of range, the boulder problems are arranged according to a \"circuit system\", which means that the climbs aren't given a specific difficulty level. Instead, they are given a difficulty range (usually 2-3 V-grades). The purpose of this is so that climbers who follow a colored circuit will have the chance to climb boulder problems that are a little more challenging than they are used to, but without psychologically defeating themselves before trying it (i.e. \"I can't do that boulder problem...it's rated \"blah\", and I don't climb that hard.\").", "date": "5/3/2016"}
{"review_id": "poOkEeRiZoabObG4eD8nuw", "user_id": "S4cr9Q8-1mgSMrK6kHTfWA", "user_name": "Katrina M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 3, "text": "First time here, second time bouldering. At first, I was a little intimidated because everyone here seemed to know what they were doing, but that almost immediately went away. The staff was so friendly and helpful in showing us around, and other climbers just do their thing/encourage others. It was really challenging, but really really fun. Good physical and mental challenge. I'm pretty sure chalk is a game changer so I will probably get that next time. Awesome facility, lots of space, lots of routes, and very clean. I'd definitely come back more often if I lived closer.", "date": "2/7/2017"}
{"review_id": "9M4d7_83seufLE7QgexWSw", "user_id": "WNNKTk1IduTkAVlwVWUNFQ", "user_name": "Mindofaman M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 6, "funny": 0, "cool": 1, "text": "$8 weekdays before 2:30pm$14 or $12 (if you're a student) weekends or after 2:30pm on weekdays$3 shoe rentals*They also have memberships*Great place to hang out, climb, workout, everything. Aside from all the great bouldering problems they have, this place includes a pool table, ping pong tables in the center of the room and in their workout area they have a pull up bar, a workout bench, a squat rack, Dumbbells, a water fountain they also have clean restrooms, and a friendly staff. Oh and they also sell things like chalk and chalk bags some drinks at the front desk.", "date": "8/12/2015"}
{"review_id": "mZ-3WLerKv1qrVMVXAJUBw", "user_id": "MUwPT6c_4bh6aMmyo_JTog", "user_name": "Nick M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I absolutely (freakin') love this place! I'm a relative noob when it comes to climbing, but I feel more than welcome here. This is definitely my favorite place to climb when I'm here in Orange County! The staff is friendlier than most, they all knew my name by the second time I came here, and it truly feels like you're part of a family. They even gave me a great deal on membership since I'm only in Orange County every once in a while. This place is absolutely legit and it's definitely made me a better climber!", "date": "6/13/2014"}
{"review_id": "x85XPPBvHZWmTBl7NjhF4g", "user_id": "jBbPy-y4idLvYuSbdhqrIA", "user_name": "Marissa R.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Took my boyfriend here on a last minute activity.  Stepping into the facility, it is more than just a rock climbing place.  There's ping pong tables, billiards, and even a small weight lifting area.  I can definitely see how many like getting memberships as it is a great place to hang out and have fun.  We have never rock climbed before and now I definitely have more respect for those that do it often.  A lot harder than you think if you have never done it before.  Will definitely be sore tomorrow but the experience was fun and worth it!", "date": "1/3/2016"}
{"review_id": "9vY3fOrkWDUMmlIRD6Wf8w", "user_id": "QPQxBr8-_gvLLPdK4AHnmQ", "user_name": "Diana T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came here for my first time bouldering, and I had a blast. The place offers a wide variety of climbs and routes, and is clean. Their motto is \"Building Better Climbers,\" so they have a little gym area where you can lift weights/do cardio to strengthen muscles for climbing (very nice touch). If you don't want to climb, there's ping pong tables and chairs to just chill and hangout. The people here are very casual and polite, so that's always a plus. If you're a student, a day pass is $12, and shoe rentals are $3. Not bad at all!.  I would definitely come back.", "date": "1/11/2016"}
{"review_id": "P64b8j5DwG9zX4O-KyGNNA", "user_id": "w1hbEiqrlCI2F_566VcLuQ", "user_name": "Andrea L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Initially came here with a couple of friends to try bouldering. I instantly fell in love! Probably cause it is something different to do other than going to the gym. The facility is one of the cleanest I've been to. They also have a ton of problems to tackle for every ability level.", "date": "12/1/2014"}
{"review_id": "V7uYAD7lvutH9yLOrmsatg", "user_id": "yLW8OrR8Ns4X1oXJmkKYgg", "user_name": "Kimquyen L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 25, "funny": 14, "cool": 22, "text": "Came here for their Expansion Opening!! =) Aug 4thThere was free yoga sessions all day long, meeting the instructors, and discounted day passes. Just $5, shoes not included!!!All of the Yoga instructors were all nice & helpful; they had just built this new room for yoga classes so they were trying to see which side of the room works better for each Yoga instructor. Very clean & well maintained place.Great place to come & try out if you're into bouldering, climbing/ yoga =)I even see little kids here; so cool to see little ones climbing fearless they are. Their Yoga classes are very affordable & they even have a punch card discount deal:One Class Member - $5One Class Non-Member - $8Punch Card Member - $35 ($3.50 a class)Punch Card Non-Member - $70 ($7 a class)Here's their events page for all the different Yoga instructors' schedules:facebook.com/TheFactoryB…", "date": "8/11/2013"}
{"review_id": "xZ-R-MCCNjH9GAYwSolZVg", "user_id": "4r7qYLCS_PH-JC6ahmxIWQ", "user_name": "Ted S.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "[Revised 12/2013 to reflect the expanded facility]I've been climbing for many years giving me a chance to check out most of the local gyms [although don't confuse length with skill in my case] and The Factory is where my membership lies these days... so the quick version: this is a very impressive bouldering gym.For those\"new to climbing\" (since I always overhear people asking):It's important you understand what a bouldering gym means... You're not on a rope, won't find 40' walls to get \"scared\" at the top of; instead it's short climbs that focus on technique and/ or power to navigate. That's not to say you have to be a regular climber to enjoy the place... plenty of first timers, even dates show up, but  its not something you see a lot of kids birthday parties doing either.For regular climbers:What I really like about this place is the attitude both of the climbers at it (never had so many people willing to provide beta or work through a route) and how the staff approaches the place. Problems are pretty tough compared to other gyms but there's a huge variety of them in the wall design (straight to major cave), the holds (they've got some crazy customs) and the style (crimp to dyno). Given how big it is, they can re-set without removing your favorites pretty often too.Evenings get the typical post-work rush but I find the place flows pretty well even during events and is pretty much all yours during working hours or with just a few others on weekends.Recent changes (as of late 2013): Since my initial visits & review in 2012, The Factory has grown rather significantly nearly doubling the wall space, adding another restroom, and a small set of traditional gym gear (treadmill, rowing machine, bench / multifunction weight machine). There's also a system board [nothing I understand but impressive to see people use] and a number of hangboards / balancing rigs around... making it much more viable as a primary gym.And oh, they have A/C which may not sound like a major deal, but Anaheim in the summer... exactly.", "date": "12/5/2013"}
{"review_id": "ROoUAntErfWbZTjBoR7prw", "user_id": "Mz-lEyBwq6pFMOOb0A1iKA", "user_name": "Eddie J.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is place is insane! I've never been rock climbing or anywhere near climbing anything, but I went earlier today with a co worker and all I can say is wow! My hands definitely are tired and sore, great workout, and tons of fun! You feel like a monkey just climbing and finding ways to complete the climbs. I highly suggest checking this place out if you're looking for an exciting new workout or place to be entertained for hours! It's very clean and big. Just make sure to bring chalk for your hands and you can also rent shoes there for $3. The all day pass is $14 but if you go before 2pm it cost $8.", "date": "12/10/2015"}
{"review_id": "qyHl64xHwSfXVRwteazH6Q", "user_id": "d7DCa-j4lHGei1eIl0d3kQ", "user_name": "Kari E.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great people, great place to climb. A lot more fun to come here with a friend than a regular rock climbing gym. Bouldering is a great way to work on your skills, and they have a good mix of routes for different skill levels. I'm sad I don't live close enough to be a member anymore. :(", "date": "11/5/2015"}
{"review_id": "6udlYAd_FaezuHjgX34XyA", "user_id": "xM4Virn37DX4H5HbWJU83Q", "user_name": "Ashley C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Never had been climbing before, came to factory to try it out and my boyfriend and I enjoyed it a lot so we both got memberships! Dope place, cool staff, chill environment. I loved that they switch the trails up every week so you're always coming in and look forward to new challenges! Newbie or expert climbers should definitely come here", "date": "9/14/2017"}
{"review_id": "YWbcEdOHNWz8jBJfcnrmHQ", "user_id": "70p4X7vJmXZ9FeHV9oy8sg", "user_name": "Jennifer C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This deserves it's 5 star rating! It's one of the closest climbing gyms and I'm so glad I gave it a try; hooked from day one! I had no experience so it was daunting at first but starting the first day the people there were really welcoming and helpful, and not just the staff! Offering me tips and tricks, they've really started me on a great path. The Factory has color-coded courses that help you identify what climbs would be suited to your aptitude and help you get better. Couldn't ask for a better location!Definitely a must try!", "date": "1/29/2016"}
{"review_id": "e3G4S9n2avinwJLMzUIX7g", "user_id": "RA0pYQqg9dmG1YR_uO8JWQ", "user_name": "Sara K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I came for their Expansion Opening! Free Yoga classes all day, day pass was $5! Parking is good, it is a big lot. My girlfriend and I came in the morning and started with yoga. The classes were only 30 minutes long which was pretty short. I felt like we cooled down right after warming up! The instructors were super nice and friendly though. The room is pretty small, can fit up to 6 people or so. They had yoga mats for people who forgot to bring one!Next we got our shoe rental and started climbing away! For my second time climbing, I did really well! I was able to climb the beginner and zero level climbs. It was also super fun but challenging at the same time! I love how clean this place is and all of the staff were super friendly and helpful. I can't wait to come back to climb level 1! :)", "date": "8/14/2013"}
{"review_id": "N-Y9_4_9Sw071vp5W2X7rA", "user_id": "296mH1MM7vF58EbQtYHN4Q", "user_name": "Jen H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 1, "cool": 0, "text": "I LOVE The Factory!I've been a member for only about 6 months or so but in that time I've gained so much love for bouldering and climbing in general, thanks to this amazing gym.  It's always clean, the staff and other members are always super friendly, sometimes there are puppies around (hello?!?!?! who doesn't love puppies), and they have great activities besides climbing such as pool, yoga mats, and a small general workout area.The prices are super reasonable and since I come at least 5 times a month, the monthly membership price is very much worth it.  I've brought countless guests (oh, you get a free guest pass each month as a member) and they've all loved the experience.  Got my boyfriend hooked and he's purchasing a membership as soon as his punch card is used up.The problems range from beginner to very difficult and everywhere in between.  When I started I couldn't even do the most basic of routes.  They label their problems slightly more...harshly? than other places I've been to (a v2 here might be a v3 or v4- at a different bouldering gym), but I personally love it because it pushes me to work harder to send to the top !!!!  They're always changing up their problems every few weeks too, truly inviting opportunity for growth and improvement.The facility itself is HUGE with endless options: flat walls, upside down, slightly slanted, skinny, fat, you name it.  Mats are super clean and very comfy (good for someone who's always falling. :D).  Just good vibes all around here.  Come for a good time.Oh they host BBQs/potlucks every month !  Yea!!", "date": "4/8/2015"}
{"review_id": "hDzXi-KK07PbatR41DujAA", "user_id": "XtkFN0EozDHSRkSN5mBRSQ", "user_name": "Kris R.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great. Walls with tons of diversity, loads of difficulties. Even a little workout area. Recommended!", "date": "12/16/2015"}
{"review_id": "XwKEAMqb6RwR6IiAxiuUwA", "user_id": "nZ30Pzkc6DUHe9y-YZknWA", "user_name": "Trang L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This was my first experience bouldering, but I can tell that this company accommodates for their customers really well! Staff was very helpful and friendly. The prices here are great: $8 for a day pass before 2PM ($12 after) with $3 shoe rentals. You can also rent/buy chalk + chalk bags and tape here. I was able to climb for around an hour and half before my fingers became too injured. I recommend that you bring some athletic tape or buy some! There is no AC here, but they completely open their doors and have fans near the walls. If you want to take a break, there is a pool table and some weights off on the side that you can lift. There's free wifi here too!There are climbs ranging from beginner level to advanced. I found the beginner ones difficult still, which I loved! I was scared of falling, but the crash pads below have good cushioning, so I felt safe. There is a pass that you can buy for $100 that gives you 10 visits ($10 a visit), which I recommend getting if you intend to come by this location more often. The Factory Bouldering is a welcoming location for climbers of all levels!", "date": "3/29/2015"}
{"review_id": "StUrQxV1fVTHeEJThgdMSg", "user_id": "Ojw14tJRhshfgnLpyvgwWA", "user_name": "Allie N.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Took a bunch of my tutoring students for a day of fun bouldering, and they absolutely loved the thrill of it. It was pretty challenging following one colour routes. Going up, and down was pretty scary as well. But, overall, the staff were super friendly since my kids were all over the place running and playing with the big bouncy balls. I will definitely be back Nov. 16th for their grand expansion of the new walls.", "date": "10/25/2013"}
{"review_id": "06dDk204Qc6PpQx6T_QS1w", "user_id": "zs60wMMpB5LHOal5Sn0sJQ", "user_name": "Donald K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Awesome vibes & awesome people! Matt greeted me like I was a friend on my first trip. Loved the music selection and hang out area. Good place to be if youre looking to climb, work out or hang out! ~Climb Strong~", "date": "7/17/2015"}
{"review_id": "IDP657JAdeBDLXmwmzpdxA", "user_id": "vS6tcOULFUQH3mQ6MYFJiQ", "user_name": "Melody C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "They are absolutely great here.I've been interested in climbing, but was too lazy to learn the ropes, so bouldering sounded fun. I saw that they offered classes and called to ask them about it, but was told that I really should just come in and one of the guys or gals working there will teach me the basics and it's easy to pick up and just start climbing.Then found out a friend has an annual pass here so we went. And it's fun!For anyone considering about getting into it: Bouldering itself is fun, it's like taping in to your trouble-making childhood where you climbed things all the time. But you won't get in trouble this time! Plus working your way up to the top is also a nice challenge/puzzle for your brain, as well as a work out for your body.The review specifically for Factory Bouldering. I can't compare it to anything else as I haven't been to another gym yet, but I've been told how great it is that FB is a bouldering-only gym, not a climbing, with bouldering on the side. I can see how that can be frustrating. It's an absolutely great huge space where you can lounge around in the middle if you need a break (my friend said he's stopped by before to take naps on the couch). The padded mats surrounding the bouldering walls are over a foot thick...maybe even two? That you feel okay about falling. And I've seen pictures where other places use colored tape to mark trails and that shit looks confusing as hell. They used colored holds here, so it's easy to see the trail you need to follow on your way up before and during your climb.Plenty trails for beginners to learn on and enjoy, and everyone I met at the gym has been courteous about sharing the climbing space (but it's big enough where it doesn't ever feel crowded).Have fun!", "date": "12/5/2012"}
{"review_id": "oMP-8j4dtqdgGQMZtldsDw", "user_id": "Te5egcY5i0vNNbQug-KyYg", "user_name": "Diana B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "The Factory Bouldering is a good place for beginners such as myself and for more advanced people as well.  The walls are only 20 feet tall, so there is minimal probability that you'll break a limb should you slip and fall.  There is plenty of cushion awaiting in the bottom and to be completely honest with you all- I appreciated that A LOT.  The guy who checked me in was friendly and talkative.  I asked him if there was a military discount and he said yes! I only paid $15 with the shoes included! Score!  There is a pool table in the middle of the room, and some ropes (don't know what you call them) for when you need to take a break from all that climbing.  Oh, and there's also plenty of seating too! We brought drinks and snacks with us and they were totally cool with it.  Good experience.", "date": "11/6/2012"}
{"review_id": "Be5jHUARHpjYC2TJECJfPA", "user_id": "Juu147vhIYJJnfBKdhEktA", "user_name": "Diana W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "I like this place because there is a mat around all the rocks that is very cushiony and it makes me feel very safe. There are many routes, and I feel like this place is great for a beginner or casual boulderer! I come about once every month or two and there is no way I will ever be able to finish all the routes available here .. Also there are BBQ days once a month and someone makes really good horchata ......12 dolla + 3 dolla for shoe rental.", "date": "8/22/2014"}
{"review_id": "WILMh9FwhrGjaUL9L-A7BQ", "user_id": "joGQN89au72Ihr6Bi2DIxA", "user_name": "Daniel L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "First off, $8 matinee deal during the weekday? Yes, please!Then, you got wifi with bunch of lounging charis/bean bags plus a huge square table to even study around. Such a convenient place to be bouldering at. Oh, did I mention how much climbing wall they have? It's really hard to say which gym is better than another, since they're all great(IMO), but Factory has a huge selection/variety of climbing walls, and they're in the process of adding some more. Well maintained gym. I always enjoy going there.", "date": "11/24/2014"}
{"review_id": "6NfWx8OQ_Hbd9nwUmjFJ4A", "user_id": "1Fvig6byJPcevYA3XvNzUA", "user_name": "Cool D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing more than 2 years at climb X and hangar 18. I have heard of Factory Bouldering and had some research. I think it was expensive compared to ther places. Though I tried one day- pass and really enjoy it. The climbing house is very clean, I mean VERY compared to other climbing places. There is no lead climbing but all the boulders are really various. Even the V0,V1 are also challenged. There are also tabble tennis and billards and a gym. After the day pass, I cancelled hangar 18 and applied for monthy membership here. I really like it here. The atmosphere is really refreshing which gives me lots of motivation to train.", "date": "10/16/2016"}
{"review_id": "Ctn3JkeZEw1d6ywGtiMoVw", "user_id": "AAcsHzm5g9QeV-efEPXbVQ", "user_name": "Dan C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great atmosphere, great regularly updated routes for all ages and abilities.Climbers and people at front desk are friendly and helpful.", "date": "9/28/2016"}
{"review_id": "Z3YQdIHo-7JxlaDhZSG0sw", "user_id": "Rynim8Q4f9cK5nORXQAoBg", "user_name": "Joey J.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went here for the first time and it was a great experience! Everyone seemed friendly and even as a first time visited to a bouldering gym I felt right at home. Highly recommend The Factory.", "date": "6/28/2017"}
{"review_id": "ZI2vgGyT8YM6J8-dqSkaUg", "user_id": "Ui0dQ6uHNuY-OY7KSr6DGQ", "user_name": "Jenny T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 0, "cool": 3, "text": "Great place to make friends and boulder. The staff here are friendly, and the people who climb here are willing to help you out. It's usually not crowded, so you can take your time on problems without having other people watch you (if you are self conscious about being a beginner).The community here is very welcoming. They have little BBQ parties (first Thursday of every month in the evening) and events frequently. I love this place! (:", "date": "4/17/2014"}
{"review_id": "sIj6lNYhfrV4-Io5fZ1f1g", "user_id": "Q-BUI65oTDX8Ow4BGiKkpg", "user_name": "Paul K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "This was my first time bouldering. I love rock climbing, so I was up for the problem (shoutouts to solving problems).I came at the anniversary day last weekend and so the price tag was reduced. I paid 8 dollars, but I think normally its about 15 dollars. The staff are all really laidback and chill. The actual facility is clean and spacious. You totally don't feel like cramped. I highly suggest anyone and everyone to check this place out. Solving problems from beginning levels to LS aka shenanigans. The mats are super safe so even if you feel weak and can't hold yourself, you have nothing to worry about since the mats are pretty protective. If you are a beginner like myself, I suggest you bring some friends along with yourself so it'll be more fun and more worth your money. PS. This would be an awesome place for dates or group dates. For the family, the kids would have to be big enough or strong enough to hold themselves, but nonetheless I think kids can enjoy themselves if they are well behaved and ready to solve some problems...and not be a problem. : )", "date": "4/21/2014"}
{"review_id": "Iat1Lf6gsBDqrLkbF44_7g", "user_id": "FXgJTjdVotlVSIJQmmhhHg", "user_name": "Rico T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "The bouldering is great . Pretty hard for the grade. There are many routes I like too. My only gripe (and a major one ) is that they have the chalkest, dirtiest , slippery-est holds of any gym I've seen. Many footholds are so covered with chalk you can not even figure out the color of the holds while you're climbing. And handholds and footholds get really slippery because of the amount of chalk and rubber on them. You can brush all the holds but it's gonna take you so much effort that you won't have energy to climb after. Just need to clean the holds more often and would have 4.5 stars IMHO", "date": "1/21/2016"}
{"review_id": "pM2Yw3zdpYmVbT19ZzeGww", "user_id": "5--L2LErDLIom_BzIsOIDQ", "user_name": "Fame M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place. This is not only a rock climbing place but also a gym and they have pooool tables along with ping pong. Good music blasting through out. They switch up their rocks routes. Deep work out.", "date": "6/21/2016"}
{"review_id": "pM_-Mb6X_eQK3W99y-p9gQ", "user_id": "xnlJgTOAXQRmEoZs9401kw", "user_name": "Crystal Grace G.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you love bouldering you'll love this place! This is going to be my shortest review but I came here today with a friend, met up with a couple mutual friends and enjoyed my time here! Everyone is super nice and friendly and I can't wait to come back again!", "date": "11/20/2014"}
{"review_id": "ediYtN9UvRmzwKAP85-qDg", "user_id": "3b9bC53Vz2FZEO2zssBSOQ", "user_name": "Stephen K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place!! I literally tell all my friends about it! All I do is talk about climbing now! The people and the community at the factory are so friendly and are always willing to help each other!!! I bought a year pass and it has been a month and a half now! Best investment of my life!", "date": "6/15/2016"}
{"review_id": "A_z3GGR9ylf13APiKM5s3w", "user_id": "TOESAGbdX7K1kD658zcWZQ", "user_name": "Jimi H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. The staff is friendly and very informative. I came in here cause I was looking to do upper body workout without feeling like I'm stuck in a routine of bench presses and other boring repetition.I've come here a handful of times as they have matinee pricing Monday-Friday before 2:30pm. It's only $8 for a day pass and $3 for shoe rental. Regularly its $14 for a day pass and it's always $3 for shoe rental.I bought tape, chalk and a chalk bag here and it was priced about the same as REI. If anyone is ever looking for a great introductory place to bouldering or climbing come here! It's worth it and a very cheap solution to being curious about climbing and not wanting to pay a whole lot or be overwhelmed.They have crash pads below all walls and they make falling or jumping off the walls super easy and you can feel confident when you epic fail on a wall or dominate it and feel like letting go!", "date": "11/26/2014"}
{"review_id": "iAAzIp1jU7il4S8_1G0gew", "user_id": "uSzjwY_a6-i5O2jq2_c2-g", "user_name": "Martin K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My girlfriend and i drove down from sf to la and sampled a couple of the climbing gyms down here. The Factory is by far the best bouldering gym that socal has to offer. I work at a gym up in the north and i would be lying if i said that i wouldnt want this as my home gym. The staff is amazing.Setting is on point.Training facility is all you ever ask for.Ping pong is the plus!", "date": "7/2/2015"}
{"review_id": "xgKtaRFCj2Yb9fI5TSttDg", "user_id": "YpusyMjXViejupq1TLPPNQ", "user_name": "Eric U.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I don't normally use the term, \"best climbing gym ever\", but when I do I'm talking about the factory.I've been a member here for almost two years and I've never had 1 complaint. The staff is friendly, they members are some of the nicest and strongest climbers you'll meet and the walls and routes are vastly diverse, which leaves something for every style of climber.I have been setting routes at the factory for the last few months with a couple other factory members that are new to the setting team, so you get a consistency from is each round of setting. There is also at least 1 to 3 guest setters from other gyms that will come in and set each round as well which adds a nice mix to the routes you already know and love. Also, Louie Anderson ( gym owner and the man who literally wrote the book on routesetting ) sets with us and leads a great setting effort at this gym.The gym also offers a great training area which features a system wall, peg board, campus board and mixed fitness equipment as well as some hang boards and rings.Building better climbers indeed. The factory turns out some of the top competitors at the local competitions and they and other members are always willing to help out new climbers and veterans alike.Ready to be a part of something amazing? Come send with us!", "date": "7/13/2014"}
{"review_id": "99kJKaa7kQF4ZP3H-q0PKQ", "user_id": "7nh9619zrJPO2fMds0OUfQ", "user_name": "Milly R.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "so cool! staff is friendly and so are the other people who go there. very chill environment! and they have pool, ping pong. very clean bathrooms. and they have a weight section so you can do squats and stretch and work out. i think it costs $15 for a one time visit plus $3 for shoe rentalor if you go weekdays before 3 pm, it's $8sooo cool.they have color tags to determine the level of difficulty for each path and it's SO COOLgood for all ages, i saw some kids yesterday", "date": "1/30/2016"}
{"review_id": "lR7ODqRFgSNB0uUNqTShWw", "user_id": "GLUaPvM79A85gq7t0tAS8Q", "user_name": "Bobb W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Completely new to climbing, so came here with a friend for our first time.It's everything I expected it would be from a place meant for practicing your rock climbing skills.  If you aren't that fit, or have delicate hands you'll find yourself burnt out fairly quickly, but they have a pool-table and other little things that you can do in-between climbs which is great.Everyone there was very welcoming, even for complete novices like myself.", "date": "1/16/2014"}
{"review_id": "7k97NRZzH1idR5xczwMk4g", "user_id": "Nqpfrwyl-SOAdNZ_5Y1ekA", "user_name": "Kenneth B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Excellent place to go climb if you are interested or are experienced.The environment is clean and the people are really nice and helpful.I came on a good day because they were having their monthly potluck so I got to meet alot of of experienced climbers and beginners as well.Highly recommend for anybody whos down too give it a try.My first day after climbing was torture but it was so much fun!", "date": "11/22/2013"}
{"review_id": "CQ-GzokNVvF5izJSLKks8Q", "user_id": "YeZMPOg7c91aIi_rVKX0wQ", "user_name": "Tiffany D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 4, "cool": 1, "text": "Previous review, I just liked the sport but now....I grew to love this sport, and it's simply because of the people and the location here that helped me built my sturdy foundation for bouldering. I recommend this location to any of my friends and family. They have monthly fun events for both non-members and members to make the climbers feel more welcomed such as their awesome potluck BBQ. The routes periodically change (for a whole rennovation, it's roughly estimating every 2-3 months, and for small route changes such as 6-10 routes, it's roughly every 2-3 weeks) so there will always be new challenging routes. They have deals for non- members such as $3 before 3pm on Wednesdays and $5 off before 5 pm on Fridays. They also have ladies' night which is $7 and this deal usually lands on a Monday of each month. They used to have guests' night where a member can bring in one guest for free, but now they offer one free pass for members to bring in their one guest anytime of the month. Give the place a try if you're interested in bouldering. The couple that owns this establishment are outdoors sport climbers and boulders (Louie Anderson and Valerie Tes Heredia), so the routes are similar to outdoor routes (in my opinion), and they made sure their chosen route setters have a background of climbing outdoors. So if you're interested in climbing outdoors, this is the place to start and train for it :). Here's the link to the biographies of the owners and current workers there: thefactorybouldering.com…", "date": "3/5/2013"}
{"review_id": "c6BbdlVDvWxx3dxghg_sqw", "user_id": "KbuZvgACRftcLSUut71IzA", "user_name": "Emilee S.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Matt was super friendly at the desk. Creative fresh routes and a good vibe. Really liked the atmosphere and would definitely come back or bring family members! Transition to the color grading system might need some help but I thought the grades were spot on.", "date": "12/25/2015"}
{"review_id": "T8zABlEGx_lBXRrmanqMWw", "user_id": "JKUQjt282oLCCRDlp6fyOg", "user_name": "Johnny T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Some good friends introduced me to this place as my first rock climbing gym experience and while I wasn't into the sport... The friendliness of the staff and patrons swayed me other wise. Feels more like a family of climbers than a business. I myself, personally love the way the routes are color coded... Makes memorization of the route a lot easier... And while some people might say not prefer that and say it makes it easier to climb... I say: routes here are constantly challenging and I feel they are usually higher rated than that of other gyms. Love the facility and how well kept it is. Bathrooms are always clean and everything is \"spotless\". I can keep going on the things I like about this establishment, but I personally believe it's the staff and the patrons that come here that makes the place... People are friendly and makes you feel welcomed. Would recommend to all my friends.", "date": "8/22/2013"}
{"review_id": "onEkBH0YJ0UwxQtdOWr-oQ", "user_id": "ARqXNbe5kQL28Cap2Aofeg", "user_name": "Felisha D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Decided to try out rock climbing so I found this place on yelp. We were greeted at the door by Matt and told him it was our first time rock climbing so he ran us through everything, got us shoes, and showed us where to start. The place is very spacious and there's ping pong and pool tables and even a mini weights area. It's definitely a challenge but it's a great experience and I'm glad we chose this place to try the sport out! Great service and we had lots of fun. We'll definitely be back!", "date": "9/17/2015"}
{"review_id": "mlj8E9WaOEE68FOegA2LyA", "user_id": "b2an2TMKw10_aGU7H2wFjg", "user_name": "Hosam G.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the greatest places to climb in Orange County. It's all bouldering! Gym is huge and they just added roof climbing. Highly recommend for all levels of climbers.", "date": "9/27/2015"}
{"review_id": "uSZieBG7tJOXItxzIG95rQ", "user_id": "pwJKXU4bNewzACfFEDz0Gg", "user_name": "Andy P.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is solely dedicated to bouldering and I appreciate how the gym is very clean and organized. The arrangement of the gym was carefully thought out. I climb at a v5 level at most gyms but caught myself stuck on v3s here. Maybe I was hungover? Maybe I was being a pansy? I don't know but this climbs are challenging and fun here.", "date": "9/26/2015"}
{"review_id": "rCGz-n4gunZ6SfgZa5LwhA", "user_id": "ChhUaaE9U47G6EbT6lVGgg", "user_name": "Alexander L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great in all aspects bouldering, they're expanding again to add water fountains and a ridiculous super cave which is something most gyms lack.New holds, no tape, diverse routes, and plenty of training equipment, what more you can really ask for in a gym?Climbing grades are still fairly stiff so it's great preparation for any outdoor trip.I would definitely recommend this place to anyone interested in trying the sport.", "date": "10/11/2013"}
{"review_id": "6Y_rjBh4_R9wuWKB0UsIdw", "user_id": "0oZAUV0sy_RO0u8mVDzyNQ", "user_name": "Kent N.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Been a very long time! The staff is friendly and the place is kept top shape.  Love it here.", "date": "1/1/2015"}
{"review_id": "67o6Ds_tDm3CDfNzxybe6Q", "user_id": "wWQYZWaDq6-1UR0O1VQMUA", "user_name": "Jessy H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great first time experience!!They have a special for college students, $15 for all day admission with shoe rental.My bestfriend and I wanted to try it out and we ended up falling in love within a few minutes. Julie was super helpful and really nice. I loved the fact that the walls were color coordinated, making it easier to figure out where to go but challenging you not to use the other colors!I was intimidated at first because there were no harnesses, but after conquering my first path, it was a great feeling. **The crash pads are safe and don't hurt... I fell/jumped from the top a million times.Definitely coming back!!", "date": "3/29/2013"}
{"review_id": "goY-BwDDLq4QwnIuuV5GLA", "user_id": "J2A5xGSDgln4_v9xiC-Qwg", "user_name": "Matan S.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 6, "funny": 1, "cool": 2, "text": "My favorite thing about this gym is their motto: \"Building better climbers\". They really stay true to this idea.On first impression, walking in, the place looks really nice. Three long walls with varying features for bouldering. All sorts of shapes: roofs, caves, dihedrals, aretes and even slabs. Instead of tape they use holds of the same color, which makes the gym look that much cleaner. I also have no problem following the routes as other reviewers have suggested.Prices are pretty good and they offer many discounts: students, ladies' nights, greek nights.The climbing is STRONG! But unlike most other gyms it isn't frustrating. The climbing is such that you really want to work hard to finish the route. Which makes you a stronger climber. Just one of the ways they stay true to their motto.The owners are lovely people and are there often climbing with the members and making sure everyone is having a good time. They are both really strong climbers too and when i need any beta they are always happy to help. The Factory is big on creating a good hangout for climbers. Also, free pool-table?!?!?!? heck yeah.  SO what i thought of the Factory: Good walls, good climbing, and really friendly vibe.I will be climbing there often.", "date": "5/22/2012"}
{"review_id": "qXwPqSmDSbrDxt-hWnEGRw", "user_id": "MBvC-NkoMUbN5Kh9BWr8NA", "user_name": "nancy r.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "First time I've attempted bouldering and am hooked! Not only the super friendly and helpful staff but even the members themselves have made me feel super comfortable in joining this community.Bathrooms are incredibly big and clean. Cool lounging area with sofa/couches and a pool table and some other things to work on the core.The wall itself seems a bit intimidating but their wall is color coordinated, rather than tagged to make it easy to navigate through the different routes.As for the staff, Mercedes was super helpful and friendly. Even gave me a few pointers as a VB newbie like me and made me feel at ease. This is what customer service is about!Been to once previous bouldering/gym and felt so out of place and lost. I walked out because no one helped me. However, with The Factory, it is completely different. It is like being with family/friends. Btw, if anyone wants to try out their yoga classes at 8:45am before the gym opens, its super fun and great way to stretch out before you send.Bought a Groupon deal because I loved my experience so much. Definitely a place to try out, plus they have Facebook announcements/deals on their Business FB page.", "date": "1/29/2013"}
{"review_id": "Ob9Ys1cutgyjuovJEx_law", "user_id": "mWZliCh86j-PdgiMB7vkKw", "user_name": "Andy C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 11, "funny": 2, "cool": 1, "text": "I've been rock climbing for about 6 months and am a V3 climber.  The majority of my time has been spent at Rock City; sometimes at Rockreation.The Factory Bouldering is now my new home for rock climbing.  The prices are competitive with the other gyms; however, the friendly staff and upscale feeling of the gym outshines the others.  Prices: monthly membership is $50, individual yearly membership is $500, day pass is $14.  Discounts off these prices are available for students, youths, and families.Once you step in, you will notice and feel that this is a top notch and top quality gym.  Climbing walls are at the perimeter of the gym.  Walls are at different incline angles.  One of the corners has a \"cave\" where some routes require horizontal climbing--awesome feeling.  The center of the gym is carpeted and is the rest and watch area.  This includes amazing handcrafted benches, leather sofas, etc.--all awesome touches. The mats/padding are seamless and all built into the floor under the walls at the perimeter of the gym.  It is essentially one giant mat/pad.  None of those individual crash pads stuck together or find a crash pad laying around and drag it under the route you're about to climb.  Once you stand on the matting here, you can tell it is top grade and quality.  No fear from falling from even the top, as the matting is more than forgiving.  Safety for climbers was at the forefront for the owners and the money invested in the matting shows it.  Beginners no longer need to fear falling and injuring themselves like they do at other gyms.The entire space is open and inviting.  Very clean and organized.   Free wifi and a plugin area for laptops as well.  Restrooms are fantastic and clean as well; automatic soap dispensers and hands free dryer.  There are so many details and thoughts that you can see that went into the gym.The bouldering problems here are mentally, physically, and technically challenging.  There are routes for everyone, from beginners to the the advanced.  Routes are not taped; each route uses holds that are one color, which gives a cleaner, easier, and visually appetizing route.  There are a few routes designated as VS, with the S standing for shenanigans.  These are super fun and nuts; one requires you to run at the wall, jump on a few blocks, leap to a giant hold, and then maneuver to the top ledge.Access to the gym is convenient--right off the 57 and Katella.You can tell that the owners, Louie and Valarie, put tons of hardwork, hours, and thoughts into this gym.  And it is certainly worth it.Louie and Valarie are warm, welcoming, friendly, and personable.  Them as well as the staff will walk around the gym and engage customers in friendly conservation and advice.Louie has built and helped build other popular rock climbing gyms in the area (Hangar 18, Tru Hold Climbing, etc.) and has been a lifetime sport and indoor climber since a kid.  So you can be sure that he knows what a great rock climbing gym is and should be.Without hesitation, The Factory Bouldering is worth the visit and membership.", "date": "4/28/2012"}
{"review_id": "f-lTX3MSxIc0EWzH2BVPQg", "user_id": "goURfo13WjUIFku8SrcybA", "user_name": "Margaux B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 4, "funny": 1, "cool": 0, "text": "The Factory Bouldering Gym is an awesome addition to the local climbing gyms that exist in Orange County. Something that sets them apart from competitors like Rock City, Hangar 18 and Threshold is that they are a bouldering only gym. That means no top ropes or lead climbing. For some this might be a drag but this also means no endless amounts of children running around for birthday parties. Atmosphere + Staff:The atmosphere is one of fun and dedication and hold their motto \"Building Better Climbers\" close to their hearts. The staff is friendly and engaging and are always helping members with their technique. The owner and his fiance are some of the most amazing people ever, super fun, and are always climbing with the members. Walls + Routes. There are walls of varying degrees of overhang and a rumored boulder with a severe overhang to be installed in the middle of the gym within a year or so. The routes are masterly crafted by setters who have vast experience climbing indoors and outdoors, they know what will get you stronger. The routes range from vB to v12 in all styles and there are over 200 of them, 20% of which are switched out for new routes every 10 days. There is always something new to climb which is extremely important. They also have vS routes (S stands for shenanigans), this routes are super fun and include things like run and jumps, drop downs, campus routes and any other quirky moves the setters can come up with. Amenities:I love the dyson air blades in the bathroom, it's kind of a ridiculous statement but they dry your hands in like 10 seconds. Also the pool table and lounge area is really nice and the charging stations are super convenient. They sell everything you need to climb- shoes, chalk, brushes, chalk bags, food and drink, as well as crash pads for outdoor climbing. Theme Nights:I love that The Factory has special climbing nights every once in awhile. For instance, once a month they do \"Cookies & Climbing\" and everyone brings sweets and climbs together, it's delicious and productive! Also they have a bring a friend for free night for members. A few weeks ago they had Yama Climbing come in and create custom chalk bags and chalk buckets for super affordable prices. I got a chalk bucket and LOVE it. The theme nights are great and I'm sure there will be more to come!Personal Experience:I climbed at Rock City on and off for 5 years and though that gym got me interested in climbing, I wasn't getting stronger at a fast enough rate. Since The Factory's opening I have gone up from a v2 to a solid v4 and even accomplishing some v5s. I've also started climbing competitively and have podiumed (1st & 2nd place) at  every competition I've competed at. The membership rates are higher but you get what you pay for and their rates are on par with every gym except for Rock City who probably has the lowest rates in the country. But again, The Factory is new and fresh and has a dedicated membership base, no screaming kids there for birthday parties or overcrowding. It really is a great place to train and I intend to climb there for many years to come. But stop reading reviews and just come check it out for yourself, you will LOVE IT!", "date": "6/25/2012"}
{"review_id": "0HjCfvVqSgAcXj4HjwIDNg", "user_id": "yZUDCWJExQAFbZt-KthGnA", "user_name": "Rosie B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been lagging on my reviews and after my trip to The Factory last night, I knew I had to step it up. I walked into The Factory back in January, without a clue in my mind as to what I was doing. None. Nada. Nothing. When I say beginner I mean beginner. I just knew that I wanted to try something new and fun and when I yelped rock climbing, The Factory came up. So in I go with the Sidekick and the place is empty as they had just opened. Alex, one of the employees, greeted us and quickly set us up. Again, not knowing what to do, he took the time to explain the different walls to us, what the tags meant and the fundamentals of getting up the wall and coming back down. I had no chalk with me so he brought out his own bag for us to use. Nice! Fast forward 5 months later and I'm a full fledge member. I love The Factory so much that I decided to try a groupon for a different climbing gym (which will rename nameless) and it just blew chunks! If you are new to the sport and want to just give it a try, I really recommend stopping in. Everyone is friendly and helpful, including the other members. It gets crowded in the evenings but on the weekends in the mornings it's pretty quiet. I believe they will be expanding in the future so definitely, new challenges to come. Cheers!", "date": "5/30/2013"}
{"review_id": "ENl04hE4sZCuQu2o-NK92A", "user_id": "yY4pM4lnZ5qpo8tu4CGCXg", "user_name": "Kim T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 5, "funny": 0, "cool": 1, "text": "Finally, a bouldering gym nearby. Yes, there are other rock climbing gyms, but they mainly cater to top roping so I was delighted to hear that there was a bouldering only gym opening here in nearby Orange and that for their grand opening, it was FREE all day! Can't beat free.I came here yesterday to check out the place with my boyfriend and a friend. Overall we were impressed. There were plenty of problems for all climbing levels. I think in all there were about 180 climbing routes, ranging from VB to V12. There were even VS routes for climbing shenanigans?  I didn't try those though. They looked a little too crazy. The gym has a very clean layout, something I also liked. The climbing walls were at the perimeter of the squared location, with rest spots and carpeting in the center. The mats all along the side were built in and also comfortable to land on.Downsides: I didn't find the staff particularly friendly. Being a frequent climber at Rock City, I guess I have a higher standard when it comes to service at a rock climbing gym. Also, prices here are a little higher than that at competing gyms.", "date": "4/22/2012"}
{"review_id": "1scgitieM9Z5Pz6Vzbld0w", "user_id": "lELtKiYQmEsPhE2tnDfBig", "user_name": "Johnny B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Bouldering, balance boards, pingpong tables and sometimes there's even a dog to hang out with What more could you ask for?", "date": "6/24/2015"}
{"review_id": "3__bR-xAeloDS4kibfWHIw", "user_id": "eZR5l03SEv_u2MTBTDGlSA", "user_name": "Bruce W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I didn't feel it was right writing a review until I had a good understanding of this gym and competing gyms so time was needed. Now that I've been to roughly 15 different gyms across the county and been a member here for the last 5 months I feel now is the time that a fair assessment may be made.Awesome. Simple as that. Yes the gym is always clean and the price is down right cheap. That's not what makes this gym awesome. It's the people, staff, and understanding of what's being taught at the gym. Building better climbers. I find it funny how I can only climb at a V3 level which is comparable to outdoor levels here but at other gym flash V5's. The setters aren't trying to make people feel good about so called levels and rather give the perception of what real climbs outdoors might be like. As other reviewers have noted regarding the constant route changes, clean gym, nice people, etc. I do agree. Who am I to make you decide to check this place out? Go find out for yourself. You'll see why  everyone who comes here ends up signing up as members for a long time.", "date": "5/28/2013"}
{"review_id": "FFFeRpMEY3cIXSwAEypikw", "user_id": "iOZLLj6tAV4BxY1nm6Xr3w", "user_name": "Mike T.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 2, "cool": 0, "text": "This is a brand new gym and it looks it.  New walls, new holds - very clean and inviting.  It's bouldering only, but they have a ton of problems.  What really makes this gym for me is the layout which is one of the best I've seen.  It's very open and you never feel like you're climbing with somebody at your back.  Even when there are a ton of people in the gym, it doesn't really feel crowded.  There's also over a foot thick of continuous padding so you never have to worry about your landing zone being uneven or not thick enough.  Problems are really fun and there's lots of variety at every grade.  They have every angle from slab to steep overhanging with a good variety of difficulties on each angle. They just added a pool table!  Yes, a pool table!  Free wi-fi and comfy seating make this a great hang out.  Attention to detail really sets this gym apart.  The staff are friendly and rates are comparable to other gyms.", "date": "4/29/2012"}
{"review_id": "EIK_TZ9_aAeolCHrZdU9lQ", "user_id": "dfg7AqmePWsBQbqmtyCxdw", "user_name": "Kathrine W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The factory is at all times of the day an all around comfortable environment, whether it be a workout, climb training, or even just escaping from reality. Employees are very helpful, respectful  and out going. Even if you are just looking to learn about the sport of rock climbing, this is a great place to do it all! The entire gym is made to be extremely safe and enjoyable no matter what the mood is. Check it out for your self, super close to the Ducks pond( Honda Center) and very inexpensive.", "date": "7/23/2015"}
{"review_id": "NoBtyFKMgDLhX-9ykhCsBg", "user_id": "4bprmCY5gFvFYVJ1zLCK4Q", "user_name": "Deborah C.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This incredible bouldering gym is the reason I first started climbing regularly, and returning made me appreciate it even more.The Factory's employees are all in love with climbing, and are always ready to lend a helping hand. I learned so much the last time I went because one of them spent time showing me different moves and stayed to watch me do them and give me feedback.The place is also impeccably designed and maintained. There is a culture of excellence, from the friendly reminders to turn off lights when not in use to the comfortable couches that let people chill and work before taking a climbing break.I know that every time I make it back to Southern California, I'll be returning to the Factory. It's that good.", "date": "9/25/2012"}
{"review_id": "N-2mbSsCz2ivr9z05h1GLQ", "user_id": "RNAD1WYvG35tZYrqSx8Rhw", "user_name": "Karla M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE THIS PLACE!!  I came here the first time I ever went bouldering and fell in love. The staff is so friendly, it's clean, the lounge area is sweet! Even better the different walls are awesome, I never get tired of this place. Plus they offer other activities and such :) the price range is great too, definitely recommend this place.", "date": "4/8/2015"}
{"review_id": "FoRue8hiXYe5eoEjUziQqg", "user_id": "ZH-D7nx6Isx2nozW-W58wg", "user_name": "Ben F.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. After starting to rock climb at the rock gym at my school, I decided to find a place back home to get some problems done. This place blew me away with all the rock walls it has. As soon as I stepped in and saw how deep the room actually was, I couldn't help but have a big grin on my face.  For only $8 a day if you have your own shoes, I was already making plans to buy a monthly pass when winter break and summer break rolled around because this place is just that amazing. Loved climbing here and will definitely come back!", "date": "11/28/2014"}
{"review_id": "M0AV78A8FaLM5CY6QRYpQQ", "user_id": "mrLe3SsuGioeSxxeZiAgIw", "user_name": "Jackie M.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Spacious, clean, and most important....inviting! My friend and I enjoyed a day pass at the rock factory and it was so fun! All the obstacles are challenging. Your staff is sweet, Kathy or Cathy, was super informative. She even offered for me to borrow her chalk. That was sweet, but I bought my own, because the price was reasonable and I plan on returning often. Thank you for everything. This is the best rock gym I've ever been to.", "date": "4/7/2015"}
{"review_id": "had8IbyUJC3eiJdGZFB0mA", "user_id": "S9vScnVh3FzOoVTShhKiiA", "user_name": "Brandon D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "After visiting several other gyms, I feel like Factory Bouldering is the best one out there.The staff is awesome, super friendly. The people that are climbing are the same, awesome people. They will talk to anyone, give you tips even invite you out to climbs. As for the actual gym itself, its great. Unlike some gyms that use tape to mark the route, Factory Bouldering uses holds which are the same color. So it's pretty hard to get lost or to figure out where to start. It may not sound like a big deal, but after visiting some gyms such as Rock City, a gym where few routes are labeled, it's just a nice feature. It helps out tremendously.  They also have a variety of routes for everyone. Unlike some gyms that are geared more towards advanced climbers with a majority of routes rated at V6 or something or other, Factory provides routes for climbers of all skill. Another nice thing about this place is the different types of climbs. While it's all bouldering, there are walls which are almost completely vertical and then there are walls which are angled very steeply. The gym is also very clean. You'd think everything in there is new. The holds have very little chalk on them, the crash pads look brand new. The benches and couches are mostly free of chalk and the bathroom is also pretty clean. If you love bouldering, you definitely need to check this place out.", "date": "1/9/2013"}
{"review_id": "R4tvi4TWfrWuMeugslfGaA", "user_id": "T9DASJtzgg5RNYe4djphqQ", "user_name": "Jocelyn P.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Today was my time ever bouldering & I had a blast! Matt who checked us in and told us all we needed to know about their facility and what it has to offer. At first I was a little skeptical at how much of a workout or the fun involved would be, but then I had a blast. My boyfriend Chris kept raving at how much he loved it & wished it was closer to us so we could be here more frequently! Nevertheless, my boyfriend Chris and I will most definitely be back!", "date": "3/5/2015"}
{"review_id": "QB-BvsTl380DkiRq6zYRaQ", "user_id": "_RYsuRlQDWw0lv4hxaHZuA", "user_name": "Colin S.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What can I say about this place? It's the best. It's not a big fancy facility like a lot of gyms try to be. It's a small one story facility in a little industrial complex next to boring business offices. But it's the inside that matters. Inside is, what I can only describe as a \"lounge\" surrounded by 10-12 foot boulder problems ranging from V0/VB - V10 and maybe a V11. So whether you're a noob (like me) or Daniel Woods himself, you'll find a route that will challenge you. The prices are fair to say the least. A one day pass runs you $11 but if you arrive before 2pm the price is $8. Shoe rentals and chalk are reasonably priced and a one day trip to the Factory should only run you about 20 bucks tops! Not bad. If you love climbing, I'd suggest getting a membership. They run you $50/month, but the amount of perks you get makes it worth it. Once a month you get to bring a friend for free and if you're a member you get access to all the events they put on like BBQs and whatnot. The only moderate downside is that the weightlifting area is very small and very rudimentary. If you're looking to workout at a formal gym, the Factory is not it. But it's an OUTSTANDING climbing gym. The boulder problems are changed frequently enough to where you won't get bored, but they remain up long enough for you to really put some time and effort into completing the more challenging ones. The grades are slightly more difficult than listed in my opinion. At the Factory, I can barely do a V2. At SenderOne, I send V3-V4 no sweat. So as the Factory Bouldering's motto goes, \"Building Better Climbers\" is 100% true. Whether you're looking to build better climbing strength, or if you just want to try indoor rock climbing for the first time, the Factory Bouldering has it all in a clean, spacious, and fairly uncrowded format that will suit climbers of all ability.", "date": "1/19/2015"}
{"review_id": "iEMa9rguoiehBZL1fcY2mw", "user_id": "RfFnDBun5VofzkOpOPpvCA", "user_name": "Rachel K.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place!! So much fun such a good workout and the girl at the front desk is so sweet", "date": "8/3/2014"}
{"review_id": "vKN960m6RIUd5WrggFDnYg", "user_id": "IVNCg2IPXUc3OJLvlk2OkQ", "user_name": "Siu-Ling S.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going here on a weekly basis since my first review here. All I can say is that the people at this gym really care about what they do. They change up about 20-25% of the routes every 2 weeks or so, and about once a month they do a big ~50% route change. I have yet to come in here bored of all the routes in the gym. In over a year of coming just about once a week, I am comfortably climbing V2-V3 routes here. I really feel a lot more comfortable climbing in general, and I know I wouldn't have been if I didn't go to Factory. I've also been bringing many friends here, who have all had great times here. They have plenty of easy routes from VB-V1 for beginners. I've even brought kids 6-12 here and they've enjoyed themselves. I know that a lot of gyms either have bouldering areas that are really tall or have crashpads you have to move. I personally feel that the variety, the height, and the manner the pads are laid out in the gym caters very well to visitors and beginners. I would highly recommend this place to anyone curious about the world of Bouldering. Note that the ratings here are typically more difficult that most gyms. I just recently visited a gym in Seattle, and was able to do V2 and V3 with relative ease.", "date": "7/30/2014"}
{"review_id": "qyB1XHWCNTGuX1OzhcfN2A", "user_id": "yqYcG0_SvCBI7aR-bgqZtQ", "user_name": "David L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first time rock climbing. The staff member was super helpful to explain the facilities and the different difficulties of each set. She was also very helpful on explaining the proper methods. We took two kids and they enjoyed climbing and feeling challenged. It wasn't very crowded when we went which was a Friday night. I thought it would have been super packed and that the two kids would have been bothering the other climbers, but that was not the case. The kids were laughing and were running around the place and the other climbers didn't seem hostile and annoyed. The bathrooms were also very clean as well as spacious and that is always a plus.", "date": "12/27/2014"}
{"review_id": "fDmMdmzbHAAQIGppNfO29g", "user_id": "sCmqBQBizjMGZ_6PQM7G4g", "user_name": "Nicole W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great atmosphere. Well priced, love the rice buckets. The Factory's run by people devoted to bouldering and the bouldering community. It's by far my favorite gym, out if the four or so others I frequent in the LA area.", "date": "2/28/2016"}
{"review_id": "o3LbJFHeHzW-Lfyl5dEVJw", "user_id": "x8-dXT--C10TgXMgV96clw", "user_name": "John H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym and the owners Louie and Valarie reminded me how much I love climbing.  the facility is clean and well planed out.  The routs are fun and constantly changed so there is always something new to climb.  There are a huge number of climbs of every difficulty, so this is a great place for you to come climb for the first time, get addicted when you find out how much fun it is and how great of exercise it is and keep going to get stronger!", "date": "6/25/2012"}
{"review_id": "rMj9t9ZY-etM-MhVM9bZew", "user_id": "xY0JTA1sRIVTnAnEOx27aw", "user_name": "Sophia N.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "What makes this gym better than all the others in the area is the setting. All of the problems are so thoughtfully set, and climbing them is such a pleasure. They also reset more often than any gym I know. So even if there is a problem you don't like, it won't be there for long. Another reason I love this gym is for the angles of the walls. So many gyms these days try to get so creative with their walls and they have so many inconsistent angle changes. Think of all the classic problems outside. They're just good holds at one angle. The Factory has slab, a little steep, steeper, and even more steep, and they don't overlap. It's fantastic! Their motto is, \"Building Better Climbers,\" and that truly is what they are doing with the wonderful problems and all the training tools they have. There is a campus board, several hang boards, and rings, so you can get stronger even when you aren't in the mood to work on problems. And it seems as though they are always getting new holds. They never paint them, so they are always gritty and friction-y. I believe the owner, Louie, shapes a lot of the holds for several companies, so they get some really cool shapes for the holds as well. If you are a beginner, don't be intimidated. The staff here is very helpful. Just tell them it's your first time, and they will walk you through the entire gym, and tell you all you need to know about climbing in a gym. And if you have any questions, you can just ask them and they are always more than willing to help. The cleanliness of this gym is also a huge plus. It is very well maintained, and they have those cool Dyson hand dryers in the bathroom. So fancy! The only thing I would change is about this gym is the campus board. I would love to see the Metolius rungs instead of what is there, and I would put up a sign telling climbers not to use the rungs as footholds because it gets all rubbery and hard to hold onto. It's hard to convince my boyfriend to come here if he can't get a good campus session in.", "date": "4/16/2013"}
{"review_id": "xtHEBHgruXhACYjktu2ujQ", "user_id": "vj40nsstbwTQ-rF538YiaA", "user_name": "Cynthia J.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is cool. Relaxed and an awesome place to climb. I like the problems on the walls and the design. The wall aren't tall but the problems are challenging and fun.", "date": "6/12/2013"}
{"review_id": "7SgNlXLzU4i8i0kNYKh-kw", "user_id": "o3lYWkiAOc9Rrh5Rim_5KQ", "user_name": "Anonymous S.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Solid bouldering joint when visiting family in Orange.  Glad to hear it's owned by one of the old-school OC glue-ups guys.  Now, if only I could find a traverse wall that competes with the old 57 freeway crag (circa 1992).  LOL.", "date": "12/29/2015"}
{"review_id": "NX66I7yW5SIhXF5iPykT1A", "user_id": "stPVJ0vH-nIDmw84L2v71Q", "user_name": "Phil J.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Definitely worth checking out if you're into bouldering. Their setting is stiff WHICH IS A REALLY GOOD thing. Because it is staying true to outdoor grades. After all this place is called: The Factory... where their motto is to \"build better climbers\" Climbing community approved =]", "date": "7/29/2014"}
{"review_id": "c2809Rhbup64IgT66HMngw", "user_id": "v7wY9NTLkgFRioc8gas9ww", "user_name": "Haley H.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love the factory. The Staff is nice and friendly. Some of the problems here seem a little more difficult for there rating than at other gyms. The membership is very affordable at $42 per month.", "date": "1/20/2014"}
{"review_id": "u8Lv_2j6rUxjkb1mbp3DaQ", "user_id": "EqQepaEf86zU-BhGlIVxkw", "user_name": "Rachel E.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "While I was in the area, I found this bouldering gym nearby. There is a pretty nice set-up inside and the staff was very friendly. They have a thick padding surrounding the climbing area, so no need to haul any bulky crash pads around. There is a large carpeted area with benches. There wasn't a water fountain, but the bathrooms were well kept. The facility has a lot of potential and from what I understand they are expanding. The routes, however, were somewhat of a let down. I found there wasn't a lot of diversity in the route styles. It may have been an off day for me, but I felt like the routes would not help me improve my technique. They color code the routes. I noticed that many of the routes had very similar holds, if not the exact same holds all the way through. I guess that is the disadvantage of forgoing tape. I also noticed some holds were pretty blackened from the climbing shoes. Overall, it was a decent facility with a friendly staff. The members/staff seemed very friendly with each other. It had a very good vibe. The routes were just lacking for me.", "date": "5/25/2014"}
{"review_id": "MpIMXrYAUCSsZPjwUCoIzw", "user_id": "-Lc_I6a-XjTbgMjW8lo_2g", "user_name": "Brian J.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "After climbing for the first time at the Sender One opening, I scouted local climbing gyms and after visiting a few in my area, I chose The Factory for its inviting set up and friendly staff. Although Sender One does have the high walls, I feel the wall texture is a deal breaker. A slight graze will bleed you and being a larger establishment, you don't get the family vibe as you do here. Everyone from the staff to the local climbers are very friendly and help each other by giving climbing tips and words of encouragement.From what I hear and personal experience, the route grades are pretty stern and you might be climbing a grade or two lower than you would at other gyms but the upside is it really motivates you to climb harder as you need to put in more work to move up. Overall a great place to climb and the new super cave being constructed looks very cool!", "date": "10/11/2013"}
{"review_id": "mjGEJtXHPPQY3o-xpl00Sw", "user_id": "zqFBgJplx73fg1UFREpTYg", "user_name": "Phillip P.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "An awesome atmosphere, really welcoming staff, and even other patrons. Definitely coming back.", "date": "8/24/2013"}
{"review_id": "JI23yWlfyeQzfJpFtFuD-Q", "user_id": "Fhb0q5Qvrz3r3Zn1rLJxJw", "user_name": "Emily B.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I recently had a chance to see quite a few climbing gyms throughout California, and I must say, it made me appreciate The Factory even more! I love that everyone is willing to help out and they all have been instrumental in me becoming a better climber. The Factory recently had a climbing competition and one of the owners, Valerie, gave me the nudge to climb things I normally wouldn't have even tried!I'm not in the same shape I was (just had a baby 4 mos ago) and sometimes I feel self conscience about my abilities. I love coming to The Factory because it's a great place to take risks because everyone is soooo nice!Truly a home away from home!", "date": "10/5/2013"}
{"review_id": "VVPiTQHfe9aQSmnqlahOEw", "user_id": "veDTUXEKRAU5HKnG-4eykw", "user_name": "Hilali W.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Kids and I have not bouldered before. Matt was great giving us basic explanation and being available if we had questions. There were lots of sets to climb with our lack of experience, and quite a few people there climbing difficult sets. I loved that there was enough room we didn't feel like we were in their way- and plenty of room for us to get better. I don't know what the standard for climbing gyms is, but the pads impressed me. I have some lasting damage in my knee from a sports injury, but the support/give ratio of the pads made my jumps no problem. Great way to work out with the kids and learn something new.", "date": "5/19/2015"}
{"review_id": "Ncc4xEfOn_0CNMek8MMycQ", "user_id": "-39ErsGupbPDgwfF_fDOTQ", "user_name": "Bets D.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "So My review may be slightly bias because I am good friends with the owners. But because of this I know how hard Louie and Val, and the whole community, worked on this gym. Like home cooked food its made with love. I could definitely see myself spending alot of time at the gym which is significant because Im really not that into boulder and prefer climbing outside. The problems are fun, technical, and challenging without driving me nuts. If opening day is any indication the community in the OC is very welcoming I meet lots of very nice and supportive climbers. I would definitely recommended this gym!", "date": "4/24/2012"}
{"review_id": "Nda9phhNo6YCQJGAJNxsQg", "user_id": "fpg6BpvlgvYP-qRKapSbGw", "user_name": "Teena L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've never rock climbed before so I was a little nervous, but I have my two girlfriends it with and it was so much fun.  The owners are super super nice, Valerie gave us a lot of pointers that made it  a little easier.  Many different levels to try the a atmosphere is friendly and comfortable.I highly recommend you give this place a try!", "date": "7/8/2012"}
{"review_id": "J2hFhakYhwLE2RGfDbYNGw", "user_id": "hqkc9Oaf747gPdjLMFAFbw", "user_name": "Crystal L.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "i've never rock climbed before so i was very excited to try it out since my boyfriend and his friend have been here a few times already and have memberships ($50 a month)i wasn't sure if i was going to like it so i just got the day pass $14. if you have a student ID it's cheaper.my boyfriends friend said this place is for more advanced rock climbers so i shouldn't get discouraged if i don't make it to the top. they have levels VB-V12(?) i forgot what was the highest level here. VB - Hella easy. i made it to the top quickly. V0 and V1 - VERY challenging. bf's friend even said some V2's were challenging for him and he's been rock climbing for awhile.quick notes:- this place isn't for kids. unless they are very advanced. - the rocks here are still fairly new so they are a bit rough around the edges.- i don't think they have harnesses. - they have sticker's on some levels indicating that the level will be removed and another challenging level will takes it's spot. that's a plus if you go rock climbing often. new levels to tackle all the time.- this place is very open and huge. since it's new, there aren't a lot of people so you don't have to worry about someone breathing down your back.- there's padding below you so if you loose your footing and fall you won't break any bones.the staff is very friendly and the people who come here are very friendly too. if you get stuck with a level someone will always be willing to help you out.", "date": "6/21/2012"}
{"review_id": "UE12wdzWSSzUwrQ_NQG3wg", "user_id": "SMZ_-88-om2NT7HEaSUoVg", "user_name": "Chris N.", "business_id": "5tkpswspV1_ibBDpNAqXtw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I have been climbing for about 2 years and plan on doing so for many more years.  I was at the grand opening and I was blown away by the number of routes they had.  The owners and staff were very friendly and eager to help me send my problems.  The grades here are steeper than I am accustomed to, but I think they are just more accurately graded to help climbers get accustomed to what they will see outdoors.  Overall it was a great experience and I have went again and paid full price, it was well worth it.", "date": "4/26/2012"}
