{"review_id": "k1I85OE1Vp0rvlsz3nyAOg", "user_id": "Z6w37mXPPxvzslhZy8gFOg", "user_name": "Jessica S.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "This place is amazing! We are so happy we found out about this treasure in our small city. They have so much to offer from beginning level to more advanced rock climbing.  They have a small weight area that allows use of free weights, squat rack, yoga mats, and so much more. I am so excited to be a member of this facility. My kids love it here too. At first they were scared because there are no harnesses, but they warmed up quickly. They also have thick padding under all the rock wall sections in case you do fall... and people do! The restrooms are super clean. The staff is very friendly and knowledgeable about any questions you may have. I love that the kids get a great workout and don't even realize that they are breaking a sweat because of the fun they are having. There is also a smaller wall with huge building blocks for the smaller kiddos.", "date": "8/4/2018"}
{"review_id": "ONP6H6ZnNVlD56ZTh6z-dg", "user_id": "uIjj7EIVBU4kGNgmKPO02A", "user_name": "Israel G.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 10, "funny": 4, "cool": 6, "text": "The Pad is very unique in that it is a co-op which means it is run differently than a tradition for-profit business. You need to be a member to use the facilities 24/7 and they have limited hours for those who want to check it out and sign up.There is not staff always at the desk so you need to check the schedule so you don't waste a trip.  They rely on their members to make sure rules are being followed and things are taken care of.Rock climbing is very challenging and I can see why so many find it exhilarating and even addictive.  You build strength, dexterity, and stamina.  The climbing routes are rated and color coated.The Pad is  much needed option for our community, and I'm glad it's here.  It's a very good size (5,000 sq. ft.) and it's much larger than its older sister in SLO.  There is a party room for birthdays and it's regularly used for Yoga from what I gather (free for members).  If you're new at this, they offer free rental shoes so don't hesitate to swing by.", "date": "9/26/2016"}
{"review_id": "-EsJ-tG4zOk7q7fjd5BgrQ", "user_id": "xoS1AAFLaKXT1XJ9BRCpCA", "user_name": "Jay R.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best place to meet new friends . Staff is friendly and helpful.A lot of things to do you will never get bored.", "date": "2/24/2018"}
{"review_id": "gjWe8wlHrA7wkfFh7zfTyA", "user_id": "d-2ISzzmUQR94EQEamcHVA", "user_name": "Karen R.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "If you're looking for a unique workout in a great atmosphere swing by The Pad ! :) This place is great for kids and adults alike .. great facility and awesome staff!", "date": "5/29/2017"}
{"review_id": "eImAflMTNBKtfZDV4rzrug", "user_id": "0rWbGyVkWeWEKH_Uo-hH7w", "user_name": "Cameron C.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I came to Santa Maria for work and was upset I wouldn't be able to boulder for 2 weeks.  Behold, I found this gem. Absolutely a great value and has amazing bouldering to challenge any climber. Everyone is friendly and it has an amazing atmosphere.", "date": "6/27/2017"}
{"review_id": "AF8YZ7AaWFFWYxpYEk4p0g", "user_id": "ipLRHe3KG7nSazFiT4YGFQ", "user_name": "Christian H.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "As some others, we're regulars at SLO-OP, but this is a worthwhile spot to drive to, even better if you live in the SM area. Huge walls, so much space that you'd be hard pressed to climb more than 1/4 of the routes on a given day, plus easy to get to, tons of parking, nice restrooms, plenty of floor space, great beanbags to relax between routes, and best of all it's super close to Zoe's Hawaiian BBQ (perfect spot for post climb hangout).Don't forget that, with a membership, you also get access to yoga classes at no extra charge, as well as full access to the SLO location....tough to beat a deal like that, IMO!", "date": "8/16/2015"}
{"review_id": "VjrBT-6zqoRtwy0oBcFHkg", "user_id": "Qq0T96SomN-mEk7IqgJiJQ", "user_name": "Dustin W.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This bouldering gym is so much more than a gym.  It's a club, it's a community, it's just an all around epic time.  When is the last time you laughed while working out?  The Pad is a place to meet friends, workout, try yoga, and scale some walls.  It's a truly unique place to try something different.  Being a member keeps you active as an athlete and in the community.  Highlights are:A giant cave that you can climb upside downSlackline Yoga An after school program and campsFun eventsJust a great atmosphere", "date": "8/3/2015"}
{"review_id": "g5U3KYoNigKMcfKSqj2uhQ", "user_id": "udQBObCnSKrJajA04wzT_g", "user_name": "C Y.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "As a regular at SLO OP in San Luis Obispo, I am so thrilled to see this non-profit business expand into Santa Maria. This organization is run by an awesome group of people with a lot of integrity. It's where I met most of my friends when I moved to the Central coast. Besides the community, The Pad is a huge upgrade from SLO OP-- 3 times larger, new exercise equipment, free yoga classes, etc, but still with the same high quality and creative route setters. I can't say enough about how fantastic these bouldering gyms are. The location is tucked away in a low traffic area in Santa Maria, but that's why the gym is so expansive and parking is readily available.", "date": "7/31/2015"}
{"review_id": "Q1xncwJjv7eFmZmQExHrNA", "user_id": "9yCNCjUgNXEt83v3J_adBA", "user_name": "Maren M.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The Pad is an amazing new climbing gym with exciting walls and routes for experienced climbers and a welcoming attitude that's perfect for anyone who wants to give the sport a try. There's nothing like it in Santa Maria!", "date": "8/4/2015"}
{"review_id": "ggkMNNUpK3_VG5jB1OiYvg", "user_id": "8HWcV9BptD_Ix6MyIFBrwA", "user_name": "Lyle K.", "business_id": "0LjITGZYRPuBDGZokQd72A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "New to the gym and so far everyone has been very welcoming. Great place to come relax and get a good climb in.", "date": "6/28/2016"}
