{"review_id": "_5q4hZTABOb2-x-k6XDwCQ", "user_id": "Jr6waYGmbUYBZ646bGfvyg", "user_name": "Dan G.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place! An alternative to a typical gym with so much more to offer...endless problems, cool folks, alternative workouts and drinks while watching ski/ rock porn.The best was finishing with the sauna.I will be back!", "date": "1/4/2019"}
{"review_id": "dMJFkdYDHqzMHDD-vNgedg", "user_id": "gdgfqmMc3nnpNvB_pMLUFg", "user_name": "Apollo K.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The Boulder Field and Pipeworks are the two places I'll go rock climbing in Sac. Space-huge bc of the warehouse, spacious with the open layout and clean. During the day, plenty of lighting, good AC and tables + cubbies in all the right places. Safety-thicc padding. Layout-one of the few areas in Sac that is dedicated to bouldering and the routes don't feel too crowded, easy to distinguish or have a million pieces of old tape going in every direction. Other than bouldering-their gym section is small, but unlike other spaces, TBF makes its own dedicated gym space, not just a bunch of old equipment thrown in a corner or forced into the business so if you wanted to mess with free weights, pull-ups or a dedicated gym floor then you'll have just enough space to do so. Crowds-Maybe I'm going at the right times, but what crowds? Otherwise, they have cool weekly events. Price-Student rate with no rentals or extras-paid 15$. They have a coffee bar area where you can grab a drink-never checked the prices so can't say muchKids-eh, truly dedicated kids section isn't much, but I'm sure your kids would have a blast, more than I've seen elsewhere Parking-big lot, clean and not surrounded by homeless This place is a no brainer-if not here, then go to Pipeworks", "date": "12/16/2018"}
{"review_id": "1xzS_TV3Z27Jmxsv2gteXQ", "user_id": "JTCtZoj8AjijcQptWAFxwQ", "user_name": "Saran W.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "When my boyfriend and I heard that The Boulder Field was opening and has since opened, we were excited to try it out.  We finally got around to climbing at TBF yesterday afternoon!TBF is located in an industrial, warehouse-y area.  We were grateful for the foldout sign placed near the parking lot entrance, which made it easy to spot the building as we were getting nearer.  There were plenty of parking spots available when we arrived.Upon walking into the building, my first impression was that the inside was huuge.  It's all so open and clean, with walls for days, and in peak August heat, wonderfully air-conditioned.  There were three tablets set up to the left of the entrance, so we started filling out the standard waiver.  Shortly after, we were greeted by the staff at the front desk, who told us they'd be starting the orientation video on the TV above us.Despite being someone who has climbed before and is familiar with the risks involved with bouldering, I appreciated watching the orientation video.  It was about five minutes long, and covered the basics of how bouldering involves more risks (than top roping), how to fall safely to minimize injury, and how to distinguish their color grading system.  I can definitely see how this video would be helpful to first time climbers and those who are new to TBF.The day pass was $20 for each of us, and we didn't need any rental shoes since we brought our own, but for reference, rentals are $5.  There are soo many different routes, with a wide range of skills and technique that challenge all levels of climbers.  The color system makes it so that you can try out more routes without the label of the traditional V0-V10+ labels.  Each route does top out, which was a little intimidating to me at first, but as the orientation video emphasizes, only climb as high as you are comfortable.The facility is amazing.  There are so many walls to climb, plenty of cushioned benches to sit on, lots tables and chairs to take a break or enjoy a drink from the bar, an adorable kids area (with a slide!!), and super clean restroom/locker/shower areas.I'm so excited to see the climbing community in Sacramento continue to grow.  The Boulder Field is definitely a place I will be visiting again, and a place that I recommend to anyone who already loves or is interested in trying bouldering.  It's an awesome, chill gym!", "date": "8/6/2018"}
{"review_id": "HpJFAmaavRSSyJ1pRiGi4Q", "user_id": "eyI8Kgb5b4_RZC14P3QS1g", "user_name": "Paula C.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "First time here yeasterday. We had so much fun. My first impression is wow this place is huge.. great for beginners like us.. it's not too high it's 14ft high. Would love to do it and again and we will be back here for more for sure.. great for practice. They have a little gym where u can do cardio or lift weights which is pretty cool and they have a sauna also. I had some latte coffee with almond milk at the bar it was not bad. It's ok taste.. don't think worth the money for me. Kambutcha was good we get to tried those..All in all my ratings is 5 solid. We had fun and will do it again we need to practice our upper strength body which is this place is great for it..great for beginners and intermediate level. There's one side I felt like it's for pro rock climbing.. thanks and the guys that showed us around and showed us the climbing techniques.", "date": "9/10/2018"}
{"review_id": "myrwXrw5RNFrKyIqeNhsmw", "user_id": "QtdHz38b_XkTA9YW4hv11g", "user_name": "Zach L.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Carlo's new gym is epic! They had opening day on Saturday. They serve temple coffee with a good lamarzocco machine, nice beer on tap and kombucha also!The sets were amazing. Very high quality. The grading system reminds me a little bit like the spot. Colors represent a grade range with some overlap. Big moves to sticky holds!", "date": "3/25/2018"}
{"review_id": "GGOJG-mh7EIJ-sOCkEKhjw", "user_id": "C9GIIidP7B-WwjvmaD3eBg", "user_name": "Katherine L.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "I almost don't want to write a review about this relatively new bouldering gym because of how amazing this gym is. Routes: Nice range of difficulty for everyone and everything is spaced out ensuring climbers of all levels different problems to work on, and pretty much no wait time. The walls are pretty tall but there is a gigantic padding to break your fall. By far the softest ones I've had the pleasure of falling on. They also change the routes every 6 weeks or so, allowing time to finish a problem and also give regulars more routes to work with. Space: IT IS HUGE. They also have a separate gym area with weights, treadmills, squat racks, and also a mini climbing gym. It's cool because apparently there's an app where you can put in which holds you want to work on and the wall of rocks light up a path that helps you get stronger! They also have nice clean restrooms, a SAUNA, and also a shower! Also they also have a coffee shop, and nice beer on tap! While you're climbing you can put your belongings in the cubbies provided or the lockers in the restroom! Staff: they have an amazing staff. We've met Sara the many times we've stopped by who's super nice and welcoming. The other employees are also really helpful and help you with the routes as well. Makes it less intimidating to come in. My boyfriend met Clyde? Who's really helpful and super nice! Membership: we got a membership for 180 (for about 3 months) which is an amazing deal considering there was no initiation fee and it's part of their summer deal. I think the daily pass isn't bad either and the shoe rental is only 5 dollars a day!All in all super cool gym! You get to meet amazingClimbers from all over, some professional ones as well. Super dope, everyone's so nice and it's a great place to grow as a climber!", "date": "7/2/2018"}
{"review_id": "KGgSrgZHMzbNpzQxArd_2w", "user_id": "ThXhCAadsHdm-6a1ulAuuQ", "user_name": "Somali P.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time coming here with my hubby & cousins. We all got the Groupon deal for all-day climbing. This place is awesome! But no rope, just bouldering, still super fun. Staff is friendly, place is clean. And the walls vary in levels and very challenging. Def would go back again", "date": "2/2/2019"}
{"review_id": "nKRTl74XK7aQxqDVwibN3g", "user_id": "rYNCmvi3ET_4I77JFKlLBg", "user_name": "Brooke S.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is huge and pretty awesome. They don't allow dogs is the only downfall. Very awesome to have another option besides Pipeworks.", "date": "1/16/2019"}
{"review_id": "gXCY_cHAwM4VGpVzS9xbtQ", "user_id": "Sp8RiRLxnyzlbUiLZ7anNA", "user_name": "Dre C.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I love the setting at this gym- engaging and fun! So refreshing. The setting Reminds me of my home gym Tennessee Bouldering Authority. The only issue is the down climbing rungs stop high up. Unfortunately previous injuries makes it so I have to down climb not jump down. I can down climb my warm ups but if I want to push myself I cannot down climb harder problems. I am trying to learn how to deal with this issue so my body doesn't hurt after a session because I love this gym. However I wish that TBF would experiment with 2 more down climbing holds especially on steeper walls. Episode 101 of the power company seems to agree as they discuss providing down climbing rungs is very important for athletes health and longevity- link below- \"top 5 ways your gym holds you back\" - powercompanyclimbing.com…If I am lucky... maybe Carlo will be able to post a response with tips/solutions etc!", "date": "12/18/2018"}
{"review_id": "oUGHrRC5tTgnCb1xKM8_iw", "user_id": "PsfSniaaoxPWnH6U-D6rZw", "user_name": "JayLynn L.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What can I say I love this place. Bouldering for days, a sweet cafe. Nice bathrooms with a sauna. Nice gym area to stretch. Tables to study, a beautiful sunset on the patio . I just did the adult league and it was a really fun competitive option for adults. Kyle and Dan were awesome. Matter of fact one thing I really enjoy is the customer service. Everyone is so friendly. I went to Pipeworks for years and although I love the gym- time and time again the staff was not warm. I really appreciate this part of the gym. Really reasonably priced for what you get! Thanks guys :)", "date": "3/16/2019"}
{"review_id": "5CtGOzppkIVBDgv4GE1miA", "user_id": "w22maXdglMNw-m3uH6rpEA", "user_name": "Aram C.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Gotta say, this is an amazing boulder gym for all type of levels. The price for membership is really fair comparing to other gyms. I am always getting good workouts, and also friendly staffs. The location is like 5 minutes away from Sac State campus so its really a convenient. They also have Temple Coffee, and beers, and not to forget they have a sauna room.", "date": "5/17/2018"}
{"review_id": "SS1MvPoXr9odKp4a8XKXNg", "user_id": "CMkB-xUuYxx0cB4zeIwz4w", "user_name": "Clover F.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 1, "useful": 1, "funny": 3, "cool": 0, "text": "Really bad place to take the kids or family.  Did not like the way management talked to my children or my family.  I really wish I could give them a 0 star because it is totally in appropriate behavior by management and employees.  Have been to lots of other rock climbing places in Sacramento and this place has to be the worst for prices equipment food and atmosphere. Sacramento pipe works,Granite Arch climbing center, Rocknasium and West Sacramento Recreation center are all awesome and great places for prices attitude and just great places to climb.   SORRY BOULDER FIELD..You failed.", "date": "9/20/2018"}
{"review_id": "IDApHII6vReylXSGC3TpqA", "user_id": "ofjpA-_YMmICBPctu6Mw2g", "user_name": "Caitlyn O.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Excellent climbing gym!! Beautiful Walltopia walls, great use of volumes , varied climbing styles, and quite a few quality problems. As a shorter woman who relies more on technique than on brute force, I found that these climbs had lovely flow and a great aesthetic feeling to them. There is of course very powerful climbing, but unlike other gyms it is not *only* very powerful climbing. Furthermore, they set with all height ranges in mind which is a rarity in gyms and so appreciated. And last, they use the color system for grading, which really allows people to push themselves, as well as not feel limited by the type of folks who feel the need to tell you that they climbed V7. Staff, setters, and owner were all very friendly! Can't wait to go back.", "date": "6/21/2018"}
{"review_id": "YDXzv2CJAYBXiXMhTkbADQ", "user_id": "XBvjJQ5acc1LNk2iIEWcWA", "user_name": "Lily P.", "business_id": "hFgexyILpWZAS7cqZJqlCg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "This is the climbing gym (bouldering only) come true. This will be the best climbing gym you've ever been to. This is comparable to Dogpatch boulders in SF but better and prettier. The setting is amazing and they have amazing coffee (my favorite local coffee, Temple coffee latte). They have a coffee bar in the gym.", "date": "7/21/2018"}
