{"review_id": "lotq-opHMxt4anCpp5u-KQ", "user_id": "xo0zxwE8yeR54JbBMZbtpQ", "user_name": "Brendan H.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "The Studio is my home climbing gym.  While the gym is pretty small to most other gyms that we have been to, I think the most friendly people are at this one. Parking is validated at the nearby parking garages and street parking is free after 6pm. The Studio has a good amount of top rope but the bouldering area is a little smaller; however, unlike planet granite in Sunnyvale, the people who climb at the studio, know how to take turns. Thumbs up for good climbing etiquette.", "date": "5/8/2019"}
{"review_id": "A6YH9Gs-p0zdvcLwDx-eyA", "user_id": "OASskOvuFHIRLky1WI9tiQ", "user_name": "Jazmin L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "My first experience with this place was great! I walked in with zero knowledge, Pete was super welcoming and gave me a quick tour of the facility, and Kris helped me with my membership.Today the experience was not so pleasant. I walked in with my friend who also has no experience, the guy at the front desk didn't even greet us, or smiled, he actually seemed like he was bothered we were there. He had my friend sign a waiver and directed him to the rental shoes. Again, not a thank you, nothing. His face expression only made me assume he hates his job or existence entirely.Shortly after, a girl walked in who he happened to know, and his demeanor changed completely. Apparently you have to know the guy personally in order to get a welcoming greeting.My friend was thinking of getting a membership before we walked in the door but based on the treatment he received from the staff, he decided not to. That was definitely not the way you should treat new potential members, especially if they are new to this and might already be intimidated about trying something they haven't done before.Before we left, my friend asked him if he had seen his water bottle, he had left it on the counter as he was signing the waiver before we walked in and all this star employee said was \"I don't know, everyone has those around here\".Amazing.", "date": "5/7/2019"}
{"review_id": "kLYd9YcAFCpzIVWUdI1AIg", "user_id": "r77nLa1fT9pGJreGnMZOOw", "user_name": "Russell N.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very interesting gym in an old theater. Came here to top rope and found a really cool belay partner. The route setting is pretty good with a nice diversity of routes with different styles. Really nice and high walls with a nice roof section on one side. The route rating seemed pretty accurate and stuck to 11- for the session and had plenty of routes to climb. I really like climbing here and will return any time I'm in the area. Only took off a star for the bouldering area which is pretty small and basic. Also, there aren't any auto belays so if you can't find a belay partner you're stuck with the small bouldering area, otherwise a great gym and nice staff.", "date": "1/8/2019"}
{"review_id": "TuzhYEDV67oaeIuTrXd-4g", "user_id": "RM7mx7jp-id8OfN6bFkebg", "user_name": "Yasmin K.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Great gym. Great staff. Clean. They have everything you'd want in a climbing gym. Classes. Bouldering. A separate gym area for weights and cardio. Small bathrooms but I've never seen it packed. There is street parking and a block away there is a parking garage. The gym validates the parking. I come here to climb and i love it so far. I brought a 10 pack and after I use it up I'll probably do a monthly membership.", "date": "5/18/2019"}
{"review_id": "-YT06mnspZgnemxjVvqHLw", "user_id": "3rPVCO27TQw73rjTTPE4iw", "user_name": "Jon K.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Outside looking in, you are entering a theatre of your choosing? You are the movie star in a style of climbing of your choice. I typically boulder and don't let the compact second floor fool you. So much awesome climbing of every skill level. Pads are soft so if you have good wipe out like I do quite frequently-you'll be ok. Fitness area is great and if you want to watch top rope and lead-great vantage point. Staff are awesome and so happy to make great climbing experience. I moved up here from So Cal Touchstone gyms and team of setters, staff and everything are there to help you have fun.", "date": "4/11/2019"}
{"review_id": "s0OFWPnjiNnO95usn80nGQ", "user_id": "I54k7ul3_j3dNTHgv7lxvg", "user_name": "Humuhumunukunukuapua'a F.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Had a lot of fun. The guy at the desk was a quiet talker and seemed annoyed when we couldn't hear him and asked to repeat what he said. He seemed really put out. We didn't know where to go or how we were supposed to get our stuff and sort of stood there waiting for the instructor until he told us several minutes later where we should wait. That was out first impression. Then the instructor Andrew came and was a delight. He was kind and patient so we were back to be excited about climbing. The routes have varying levels of difficulty but not sure the ranking numbers really helped. It was fun nonetheless and will probably do it again. We made it to the top of a few but I'm short and some of the pegs were too high for me to even start.", "date": "5/5/2019"}
{"review_id": "w5j0t5HxBk0iuo5EuepyRQ", "user_id": "YigzUdfTiUH-6awkx7CTPg", "user_name": "Roman R.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "Cool space. Staff is pretty pretentious but you can get by with minimal engagement.Staff has an impatient demeanor and act like you should already know the answers to your questions.", "date": "2/21/2019"}
{"review_id": "n9uSWaSklnpl2pvLCDYJeA", "user_id": "YxvKcSBI9GHZpDExPGfT3w", "user_name": "Jay L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 3, "funny": 4, "cool": 2, "text": "Bouldering review.  No opinion on ropes or the fitness area.Thought I'd give this place a try on my days off.  The convention center parking isn't too far and you get a 2 hours validation with it.  I turned out to be just the right about of time for me BUT 1) the bouldering area was empty 2) I wasn't in full try hard mode.  I can see it not being enough time for a real good session, but to each their own.The first thing I noticed was the space.  In terms of climbing wall area, its comparable to PG Belmont (eyeball estimation).  In practical terms, however, it is much less.  They tried to maximize the area by having an 'island' wall that gets really close to the outer wall, meaning (if you want to be safe) you have to be aware/wait for someone on the opposing wall to finish before you can get on.  A bonus is that it makes you a more cautious and static climber: if you were to do more dynamic movements, you could blow off into the other wall/railing.  Yay?The floor/padding also made me more cautious.  The floor is pretty stiff, with a little give, but something you don't want to fall on.  Around the walls are wide mats, but lacking in cushion.  You'll have to drag a pad to your project, and be aware that you weren't taking it from someone else who needed it.  I haven't had to consider this in years, but to each their own.Summary:  I came during off hours and had the whole bouldering area to myself.  Within two hours, I was able to do all of the V5s and a few 6s.  The most challenging problem was an 8 (or 9) so advanced climbers may finish the set within a few days, if not one.  Not sure about peak hours, but it doesn't seem set up for a lot of traffic. The grades are comparable to other gyms, but seem to focus on dynamic moves, rather than technical/balance-y problems as the grade goes up.", "date": "1/5/2018"}
{"review_id": "E4PhAmqw4n4K8pbZO_dDDw", "user_id": "YcOyOhpM3Qih6z1Hu0KeWw", "user_name": "Jessica T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 7, "funny": 3, "cool": 2, "text": "Love love love this place. As a relatively new climber, I always love the friendly and fun atmosphere that the Touchstone gyms have. The Studio's bouldering area is definitely smaller than Pipeworks in Sacramento but so far the times that I have come haven't been too busy (except for Friday evenings; Sunday morning-afternoons have been the emptiest). Everyone is very friendly and encouraging and during a climb you'll gain about two new people cheering you on and giving you tips if you get stuck. There are a bunch of crash pads on already squishy floors to help with any falls or jumps down. So far, I have seen routes vary from VB/V0-V10 in the bouldering area with the routes marked by certain colored holds rather than tape which is nice and easier when climbing. I haven't tried top roping yet but it looks like they have a good amount of really high top roping available. I plan to try it sometime I the near future. In the very back behind the top ropes, is a nice area with hangboards that you can practice and have fun on. There are also 1-2 slack lines around the gym. I have yet to try their classes but that is also sometime I plan to do in the near future. Parking isn't too bad since they validate the  convention parking garage AND the 2nd and San Carlos garage. On the weekends, the 2nd and San Carlos garage has a flat rate of $5 BUT if you get it validated by The Studio, it ends up being completely free for however long you are parked there. And it's really not too far of a walk. The only downside is that IT'S SO EXPENSIVE! They recently raised the daily prices by $5 so now weekends and after (3pm?) are $25 plus extra for shoes and harnesses. If you come early enough during the weekdays, it's $20 plus extra for shoes and harnesses. The memberships are just as pricey. As a college student (if you go to SJSU you get a discounted membership), the memberships and even daily passes are  very expensive. :( As a side note, the memberships are more expensive to get at The Studio compared to some other Touchstone gyms (with Fresno being the cheapest).", "date": "4/9/2017"}
{"review_id": "b8S8MAAJU4wWMbelE0DRcA", "user_id": "bqXNKJ_31fx2c5LIAzGCVg", "user_name": "Nishi S.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "This place is seriously awesome! My friend has a membership here, and he wanted to show me and another friend how the facility was. Only one guest pass is allowed, but the people at the front desk were really nice. My friend took the guest pass to try climbing. I was not allowed to climb, but they let me watch and explore the facilities. The vibe was super friendly with people helping each other. I would love to go back for a day pass, and climb for one day. I know my friend pays $50 a month for membership, and I do think it is a bit pricey for me, but if you are a loyal climber, I think it's worth it.", "date": "6/22/2017"}
{"review_id": "AFJoYnkTaHgAfJVlVHBoNQ", "user_id": "xiBGreimmO1XYqznZIwv1w", "user_name": "Brandon Y.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "As the premiere Touchstone climbing gym in the South Bay, I typically frequent The Studio because it has a good balance of top-roping and bouldering, and is not super crowded either.From the outside, it looks like a run-down theater, but when you step inside, there are tall walls, a couple workout areas, and bouldering on the second floor. This gym also has a sauna, which is pretty neat.Check the calendar for different events like headlamp climbing, climbing video game night, and competitions - there are a few events each month as well as classes you can partake in including yoga, conditioning, and more.Beginning in 2017, prices were raised to $25/day during certain peak hours, so there is value in becoming a Touchstone member - not the cheapest of hobbies, but exciting nevertheless.Parking can be difficult around downtown San Jose, but they do provide validation for 2 hours in certain garages, which is very helpful.Overall, a nice community of climbers, and glad to have a gym like this in South Bay!", "date": "6/10/2017"}
{"review_id": "Ga9gV7QWmKXCcWvjjg_nlw", "user_id": "_v2cl1-XnPBEKN5qg4K65Q", "user_name": "Gabe G.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I haven't been indoor climbing in a long time and signed up for the Intro to Climbing Class. The class is $35 and includes harness and shoe rental and one hour of instruction. After, you are free to climb or boulder as much as you want. This location is cool because it's in an old movie theater. I learned a lot and really enjoyed the class. The instruction was very good. This gym is missing 2 things: a friendly person who works at the reception desk (all the other staff are very nice and friendly) and a clear explanation of all the classes/memberships/rental fees at the gym. A posted list or handout at the front desk would be helpful. The best place to park is in the convention center parking lot and the gym offers parking validation but you have to ask for it.", "date": "12/28/2017"}
{"review_id": "CgtU3PG6s_YHDWGzYqeC6w", "user_id": "j8vLWCPlDKm1C8jgAhefhA", "user_name": "Sheena T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 3, "funny": 3, "cool": 1, "text": "There's validated parking at the SJ Convention Center for two hours! Make sure to inquire the front desk about the validated tickets.I came here on a free pass, which I got from a friend who is a member. You can rent shoes here for $4. Rock climbing shoes hurt pretty badly surprisingly! I felt like a struggling concubine with binded feet trying to painfully navigate my way around...There's bouldering and rock climbing with harnesses, but I'm a weenie and just opted for beginning bouldering. It's sort of like a gym in here, and surely it smells like feet! Wish they had better ventilation, but I had a pretty decent time here.", "date": "3/13/2017"}
{"review_id": "AAkOBze_TlXGT949LCd1Nw", "user_id": "J4QAtRW5YPPq7xo_f7HSOg", "user_name": "David L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Fantastic place for a older kids birthday party.  The staff was very friendly and did a great job organizing the kids to keep them busy.  There was a nice room to use for the birthday cake celebration.  Be aware if you book the 10am-12pm Saturday time, you can't use the room until 11am because of a yoga class.  They do validate parking, but only for 2 hours, so if you go for a 2 hour party, be prepared to pay a bit over that time period. Also, one thing I didn't think of is that not all kids are comfortable or confident to do the rock climbing. We had a party of 15 kids and 2 of them were too afraid to try it.", "date": "6/14/2018"}
{"review_id": "RfZZt2S5fpyf-DbI4F4qOQ", "user_id": "_EC8RrL8SiASFcexgU-Jwg", "user_name": "Kevin L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Minus a star because the staff is very inconsistent with expectations on belay testing - management needs to standardize and not allow staff to deviate. Otherwise a great gym to climb at - routes are well created and have a good diversity based on skill. It gets busy but that's typical of any gym - everyone here is very kind.", "date": "11/19/2018"}
{"review_id": "sjq6GvgAGtkDjl6UJQfuEA", "user_id": "sSofn7FYSvYDd_l1U0VL6w", "user_name": "Megan O.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 2, "useful": 9, "funny": 2, "cool": 1, "text": "We chose to come here instead of Planet Granite, because it's a bit cheaper. We're just in town for a couple of weeks, so we're not going to get memberships. I immediately brushed off the fact that the gym is smaller (especially the bouldering) and doesn't have free parking, because I wanted to be positive. The gym validates your parking for up to two hours, and you pay the difference. No big deal!I feel extremely insulted by my experience at the gym. We passed the top rope test easily and were told we could take the lead test in an hour when more staff arrived. We thought that was fine and went to the top rope area. After an hour, a different staff person handled our request, and he seemed skeptical of us right off the bat. \"Do you even have a rope?\" \"Do you know how to lead climb?\" \"Have you lead climbed before?\" \"Do you need to practice more?\" We politely answered his questions without bothering to mention that we've been leading for years, have passed several lead tests elsewhere, and just ended a 6 month outdoor climbing trip. He explained that the test is very rigorous, and he's seeking perfection. We do the test, and while neither of us z-clipped, back-clipped, put our leg behind the rope, struggled, lost control while catching the person, short-roped, announced our fall, or skipped a clip, he still failed us. WTF. He criticized my partner for high clipping at the end, and he criticized me for not standing far enough to the side when my partner was going to the first clip. But my partner was high clipping on easy terrain and was in complete control, and I did stand to the side, but it wasn't super exaggerated. I later looked up their criteria online, and it states:Belayer must belay immediately underneath the first clip until climber has clipped at least the 4th quickdraw.Lead climbers must clip between their waist and head level, or higher if safe and in control.So you DON'T want us to stand to the side? And high clipping IS acceptable if in control? Basically, the staff person ignored the fact that we were clearly competent and climbing safely. He decided to make us compete for Olympic Lead Test Gold and fail us for subjective style points. This was extremely insulting and a waste of money. We later watched other people lead climbing, and one girl was clearly uncomfortable and skipped a clip. Was she passed on the same standards? He explained we could take the test again in a few days. Forget that, we're going to Planet Granite next time.", "date": "2/17/2018"}
{"review_id": "bBd7ScN6Ay4_wHU3R8HHuA", "user_id": "hBKfUJ8Zee4rAkQx9biyig", "user_name": "Vincent H.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came here as a guest; its a pretty nice climbing gym. There's also some weights and treadmills.", "date": "7/17/2018"}
{"review_id": "LJO85lU-JmQ54Gdj5HyzWA", "user_id": "_D25AL2bbVQNOJLOrdk0uQ", "user_name": "Bobby L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Validated parking for 2 hours, lockers/showers, a gym with machines, running, etc, bouldering, and a ever changing wall!I went with a friend, whose a member, for the second time and love that this place changes it up, have theme events, etc to make things interesting!hint: you can also park at the under freeway parking lot not too far if you plan to stay longer than 2 hours.", "date": "2/25/2017"}
{"review_id": "71ausNwzR-u_gSvVidktFQ", "user_id": "sS7UeAjv2E1pb5Z9ty0XEg", "user_name": "Tam N.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "As a novice, I love rock climbing here! I am not a member but have 2 friends who are. Members are allowed 1 guest pass every 30 days so we utilize their guest passes! Which free is a lot cheaper than having to pay $20-25 for a day pass, plus another $5 for equipment fee. The bouldering section is really spacious as well as their top rop space. No matter how crowded it is, there's always a spot for you.Amenities include showers, bathrooms, sauna room, yoga classes, and some cardio machines.I'd suggest finding a friend/random stranger and making use of their guest pass if you're not wanting to commit to a monthly membership.", "date": "2/23/2017"}
{"review_id": "bWT-M23d2uc_fsQxjYay9Q", "user_id": "OIZkIV3wKzYUt3qCZiedyw", "user_name": "Kristina L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Small but has great routes, awesome staff and a kickass layout. I'll be back here and will definitely recommend", "date": "3/24/2018"}
{"review_id": "jrndYrr_lflED2Ll_ECEkg", "user_id": "Ra4E2tPCCvWLrV8y6S6UKA", "user_name": "Adriel M.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Stellar bouldering and outstandingly helpful employees! Super clean facilities. Sweet tunes playing. They have a fish tank and it's a cute corner of San José.", "date": "8/27/2018"}
{"review_id": "3SYHk-3sOw8Z-1SvRGAcaA", "user_id": "tSdz6ZkR0psn41cCaaTlYw", "user_name": "Alyx F.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 3, "funny": 1, "cool": 4, "text": "A really neat rock climbing studio that used to be an old movie theatre!  I stumbled upon it when walking around this part of San Jose (it's really close to SoFA Market) and decided to check it out.  I love that it wasn't super crowded on the weekend.  $20 for a day pass.  They have a wide variety of climbs for all skill levels and a great bouldering section in the upstairs part of their gym.", "date": "3/31/2016"}
{"review_id": "R97DQtM6LutY7tJO0HZRMg", "user_id": "mUiP6GZC25g93XDhXIyJjQ", "user_name": "Bao-Bao H.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "The manager Diane at this gym is fucking terrible. Useless. Garbage. I will say the staff here is great! But Diane is a terrible, don't even bring up any problems with her, she isn't worth your time. Her attitude and tone are terrible. Hope she gets fired. Owner if you are reading this please get rid of this manager.", "date": "3/23/2018"}
{"review_id": "7hxI2vzib1pMeku4Pq6QLA", "user_id": "xzmo4fTFundFCZVUxzxRKQ", "user_name": "Henry C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "The people really do make a difference here. People at this gym are always friendly and helpful. Whether you are bouldering, top roping, lifting weights or taking yoga classes there will always be a friendly face around... Except when the gym is empty, and that happens quite a bit but it's not a bad thing...unless you like crowded problems and waiting for gym equipment. I used to take Jack's class for strength and conditioning. It was tough at first but he really pushed the tight knit group that we had there. He challenged us, and didn't let us quit. I started out a novice in all the main heavy lifts(squat,deadlift,bench) but now I am more in the intermediate range. I put on a solid 15 lbs from taking Jack's class and learned proper form for a lot of lifts. I really appreciated all the time and effort he put in to making us stronger mentally and physically. But he doesn't teach the class now and Victor is the new trainer teaching the class. He's comes off nicer than Jack so the class is less intimidating. But his work outs look just as tough. I tend to just work out on my own now but, yes the people do make this gym worth while.", "date": "9/14/2015"}
{"review_id": "GPs-UsgY6nqdIjlxL8IBkg", "user_id": "3tmJi1o-upSeb0Q2O5sh6Q", "user_name": "Benson M.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "This is a really cool place to go with a group of friends, your ride or die partner, or just going there by yourself. Not only is it a cool place to go workout and have fun but it use to be an old movie theater, which makes it feel like a hidden gem in Downtown SJ. When I was a wee' little boy, I remember passing this location various times but often disregarded it because I had always assumed it to be a theater. This plays out really well because it just shows that only a selected few know the place meaning less people to cause traffic for your climb. Another thing that makes this place really good is the fact that they color code the climbs. Not only do they use bright and colorful tape but the tapes they use match the rocks as well, making it easier to view and spot. This is great because unlike other places that I have been to,  they tend to just use the color tapes rather than using the same color rocks which often causes a lot of confusion. I remember very vaguely that I was climbing a V3 and wandered onto a V6 that was nearby, due to the color of rocks. Overall, I really like this place a lot just because I know I can get a good deal if I do the early bird special. But I am not a professional rock climber so I can't say \"This is the best place to go to!\" because I don't quite have the criteria but nonetheless check this place out!", "date": "6/5/2016"}
{"review_id": "d7XAHPmlOLtm67jqoMR0Qg", "user_id": "qyaIOqxYhN_Vd_Vb40J8pQ", "user_name": "Liron M.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great venue, lots of climbing routes up for all levels.  We had our kid's birthday party and the guides were super-friendly.  Fantastic experience, highly recommended.", "date": "10/28/2017"}
{"review_id": "sR1emTf51RWDaTjPE_6KAw", "user_id": "ZN5AUa_7YfqQblzXbM6QgQ", "user_name": "Elaine C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 3, "funny": 0, "cool": 2, "text": "I recently joined an introduction to climbing class here with my fiancee and I had a great time!  Both of us did.  The class costed $30 per person but it included the intro basics, rentals, plus a day pass so you can keep climbing afterwards.As far as the website says, it appears this place is not only a climbing studio but also a gym with classes.  I had originally considered coming here as a member with that variety in mind, but unfortunately I don't think I will anymore.  The climbing is great, don't get me wrong on that.  But in my opinion I don't think the gym is really as fully functional as I would like, nor are there many classes available to partake in.  Back to the climbing though, the climbing is great.  The climbing walls are aplenty with all different levels of difficulty available and clearly marked.  Upstairs they also have an area for bouldering.In terms of the introductory class we took, I really enjoyed that.  The instructor was very thorough and gave clear instructions and he was very patient.  The class only had 6 students but each of us learned at a different pace and he was kind to go back and make sure everyone was on the same page.  One negative I can think of though is the parking situation.  You just have to find parking along the street and hope you get lucky.  A private lot would have been nice, but I suppose in this area that would be hard to come by as well.  I may not be back for a membership, but for sure I will return for more rock climbing!", "date": "5/5/2016"}
{"review_id": "r9RJQW4ha7KINLWEE5q-6g", "user_id": "jzqLpVkB1rg9AssLKm7lvw", "user_name": "Wendy H.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I'm definitely a fan of the touchstone gyms. This one will really kick your butt too. The bouldering area has plenty of interesting features that'll make you sweat. I feel like I improved just by trying to figure out how to hang on the steep overhangs and the hemispherical protrusions in the wall. Nice locker rooms. And there's also a sauna! Win!", "date": "6/1/2013"}
{"review_id": "mPO8Vke_WhhyE9w2tMSIZw", "user_id": "pLuFbdho4ZGfgeRZey4KlA", "user_name": "Breanna T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 4, "funny": 0, "cool": 0, "text": "Overall I had a good time but I'm giving 3 stars for service. After filling out the waivers, I mentioned to the guy up front that this was my first time. Looking somewhat disinterested, he asked \"First time at Touchstone?\" I clarified that I have never bouldered before. He proceeded to just give us the shoes and told us to go down the hallway and up the stairs. I wish we got at least some sort of brief explanation or introduction. It could have even been just at the desk. Luckily, I asked a fellow climber and he helped us out a bit. Basically the levels aren't color coded but labeled \"V0, V1, V2, etc\". After a few minutes, we got the hang of it and a good workout in!", "date": "1/19/2017"}
{"review_id": "DAHeqmhjmQQ6GkFG2TqSGw", "user_id": "tRB3kzP9B402a1hSfGsXEQ", "user_name": "Cassie C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 8, "funny": 4, "cool": 6, "text": "BRO did you skip arm day??? Nothing makes you wonder this like pulling your body weight on tiny rocks. I'm a rock climbing n00b. I've bouldered once before...only once. Anyway I wanted to try it out again and out of all the rock climbing gyms that were relatively close by, this seemed to stick out (their website FAQ is pretty hilarious). The gym itself is awesome. I've actually (and you too probably, if you've walked around DTSJ) walked past it without realizing it/realizing what it was. The staff is super friendly and informative. You go in, sign a waiver, and you get the run down. I just went to boulder, they have rock-climbing classes if you want to use their HUGE ARSE walls (2 stories), which are in the afternoon. The facilities are nice and clean too. There's locker rooms and bathrooms for men and women near the front of the gym.The bouldering space is upstairs, and there's plenty of crash pads and routes. It can get a little crowded because the similar leveled routes (in my case, beginner) are pretty close to each other. It's not a big deal though, since waiting gives your hands a break. They also have a small free weights area with a squat rack (and some cardio machines), which is always a plus, got my gym workout in and climbed in one stop!It's $12 for the day pass before 3pm, and $4 to rent shoes + chalk. I parked around Safeway and walked over (it's a little past the building that smells strongly of piss). I'm not sure if there's street parking nearby, but I feel like it's not too terrible (harder than Fremont but easier than DTLA/SF...everything is relative)! :)Planning on coming back soon!", "date": "3/31/2014"}
{"review_id": "C7OmI4hdA2aM96pK9ZSbTA", "user_id": "_YTGFn00K2ix4snvZvgNZw", "user_name": "Curtis P.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Validated parking$20 For bouldering with shoes$30 For highrope with classes at 4pm and 6pmFrom what I remember, those were the prices.They change the climbing paths pretty often so it's always different. Your forearms will be tired, but it's all good fun", "date": "3/8/2016"}
{"review_id": "dFOa1TY7Arwo68cvAtGZag", "user_id": "adKonsQWY64vJYglPotH5Q", "user_name": "Stefanie C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I drove down to San Jose with my climbing partner to check out The Studio, and I totally fell in love with it... dare I say, more than Mission Cliffs? I didn't get to check out the spacious bouldering area upstairs but instead stayed in the main top roping area, where a few challenging bouldering routes are interspersed. The best part about this gym is that it's SO empty. I was here on a Sunday, and there was hardly anyone around except for large hoards of kids doing a climbing crash course. There are plenty of routes, so I never really had to wait (long) for any one I wanted to tackle. The walls are shorter than those at Mission Cliffs but they're still pretty high!The staff members are super San Jose chill. Less crowded gym also means less crowded locker rooms. I'm glad that other climbing gyms are stealing the masses because I'm totally coming here whenever I venture down to South Bay.", "date": "3/9/2015"}
{"review_id": "EfHs3hSUenfedsi-smIDLQ", "user_id": "tvNtD5odRr8RTL1vr6PjkA", "user_name": "C P.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Nice boulder area and yoga room but I don't see the point to have 3 fishes getting fcking mad 24/7 making loops in the aquarium with loud music from the gym and asking in the shower to behave eco and save water.", "date": "10/7/2017"}
{"review_id": "ALdgEJB62TI_qJ5txov5Jw", "user_id": "FBYczrpAz61RD4K2qL_kKg", "user_name": "Joshua M.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have searched many gyms and have not found a gym that makes me feel more welcome. The staff is friendly and helpful. I have never felt like i was just a number. The facilities are kept clean. If there is anything out of place it isn't for long. They are on top of things. The Yoga, and TRX classes are great!! I am happy to have found this place. It truly is the best climbing gym in the South Bay!", "date": "6/25/2017"}
{"review_id": "ZniAH3WgWlule-UfPq0NNA", "user_id": "3Zvu47t-PMlYdbB3ubD14Q", "user_name": "jason t.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place, perfect spot to enjoy a day or night with friends, price is affordable and day pass is the best when you come in before 3 pmGreat different levels great environment even has a gym upstairs and boulders you can climbIt's 15 dollars before 3pm for the whole day so worth it and it's like 5 dollars to rent gear,Challenge yourself!", "date": "12/5/2014"}
{"review_id": "4yU2PbC0vKTMRdGScyo9Xw", "user_id": "J_NAm_iukt0Ic2_Xr3_Hqg", "user_name": "Philip U.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "I joined the Studio after graduating from college and have enjoyed coming here for the last two years.  This gym has an extremely supportive member base and community feel.  Though that community is relatively small, it's nice to climb at a gym where pretty much everyone knows everyone else, and where new faces are so openly welcomed into the group.  However, there will be weeknights where you can count your fellow gym climbers on one hand.  So it can get a little lonely.  Average wait time for climbing a route is pretty much how long it takes for you to walk to it and start climbing.It's definitely not the largest gym.  The bouldering area is small and depending on your level can leave a lot to be desired.  Setting is skewed toward lower grades.  Most of the time, there will only be a handful of routes graded v7 or higher.  When I started coming here, that wasn't much of a problem.  Unfortunately, I now find myself quickly burning through new sets and am left choosing between two or three routes that I'm stuck on.  On the one hand, it definitely forces you to work on your projects.  On the other hand, it would be nice to not have to wait so long for new stuff to work on.  This isn't to diminish the quality of the gym's route setting, which is usually quite good.The rope walls  vary in height, but the tallest is nowhere close to the walls in PG Sunnyvale.  There's actually a pretty large/quality collection of top rope routes, a few very difficult cracks if you're into that sort of climbing, and a dedicated lead wall.  Very few members at the gym currently lead, so that wall sadly doesn't get a lot of love.  I know the gym is trying to remedy this, but the lead classes are too expensive and few and far between for most members to take an interest.The facilities are fairly well kept up.  The only issue is that the upstairs carpet around the bouldering walls is falling apart.  There are areas where you can easily sink around 6 inches into the foam padding where the carpet has split.  The foam is starting to get torn up, and it's becoming a bit of a mess.  Apparently management didn't have any immediate plans to fix it until a few members started to complain.  There is definitely a legitimate safety concern, and the problem should have been addressed before it was allowed to get so bad.All in all, the Studio is a great climbing gym.  I just wish there were more bouldering options.", "date": "8/31/2015"}
{"review_id": "zNF_FXetpsdNnu1x-FNkbQ", "user_id": "4cBtrr-oJ0E6BP_jJY4fqQ", "user_name": "Solid Lucko S.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Put some more weights in the back room for heavy lifting and dropping, maybe a another squat rack instead of those two things no one uses.", "date": "4/18/2017"}
{"review_id": "-SQWOwVd8Bc2DTBGQRu9eg", "user_id": "lItvkUCDHjkZPa4Mqn1BgQ", "user_name": "Eina Z.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "The staff is so amazing and understanding. Love this place too much! They have a lot of discount days if you're tight on money also. They have a calendar at the front desk of all the events going on that month. If you've never been there before they will gladly give you a tour. People are really open to helping you out if you're stuck on something. Sometimes it's really packed but everyone is friendly! There are pros that do some pretty crazy stuff and there are a lot of beginners too so you won't feel like a total noob. You can climb, take a class, or work out at the gym! Everyone should try this place out at least once!", "date": "10/1/2013"}
{"review_id": "wIwf3uv39DbQqjYy5XUvFQ", "user_id": "ZQl_Og7b0u7HFHmnA-BZJQ", "user_name": "Olivia C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 4, "funny": 0, "cool": 2, "text": "Thank you, Touchstone for giving me my first-ever rock-climbing experience. If you are first-timer, book a 1-hour Intro Class to learn the basics of climbing...in no time, you'll be dangling 40 feet above the floor. For a rock climbing studio, Touchstone is relatively clean and non-crowded (so you're not waiting around all day, yay!). They have lots of different options for both bouldering and belaying, and they always have new routes. They do have more difficult options than easy ones (I recall only one 5.6 and two 5.7s).The staff here definitely know their stuff and are super friendly & helpful. They sell rock climbing gear here (shoes, chalk, etc) and their own branded swag. This definitely is not a cheap hobby by any means - a day pass is $20 and gear rental (shoe, harness, belay device) is $5. HOWEVER, if you come before 3 pm, you will only pay $15 for a day pass on weekdays.But you pay the fee to enter Touchstone, you will also have access to their gym ad classes if you're looking for a little variety in your workout. To get the most bang out of your buck, I would recommend coming here early in the day and planning to spend a few hours climbing; go out for some lunch and come back to the Studio to log some more hours. Happy Climbing!PRO TIP #1: every Friday is Student Night which means $15 all-day passes for anyone with a student IDPRO TIP #2: this place is within walking distance to a LaVic's and sometimes has food trucks outside (so you can eat back all the calories you burned)PRO TIP #3: if this is your first time rock-climbing, know that your upper body (back, shoulders, arms) will definitely hurt due to improper form; try to use your lower body more when climbing!", "date": "6/17/2015"}
{"review_id": "GIkMcKbM6tL292LDuF1YAA", "user_id": "o9Y_Wq3HyOqCu-InOqjajg", "user_name": "Phil B.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Very friendly staff!  Super helpful and willing to help. Plenty of variety on the walls and plenty of boulder tracks. Great added feature having the weights/TRX/treadmills as well. Highly recommend. They also have a lot of kiddie birthdays on the weekends. Which is great for the kids!", "date": "3/20/2014"}
{"review_id": "b8_SSAFvHifA3FJH8zdyjg", "user_id": "7edHxOKYn5UwGXafHGRlAw", "user_name": "Robert R.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 1, "cool": 4, "text": "Great  place for lil climbers and climbers to be. Located in the Sofa district in San Jose, it was not easy to find. Once we found it, we were greeted by a friendly staff member. We were excited to see all the different levels of difficulties and various types of courses. The lil ones 5 & 11 were excited to get started. For a fee $20 per child, the trainer/ belayer takes your lil for an hour of climbing. We had to fill out a waiver and they were ready to go once they put on a harness. The place had a friendly staff and a really cool vibe. I wish I had something like this when I was in College because they had all types of clubs, group nights and Student specials.", "date": "8/19/2013"}
{"review_id": "1LtWlZmBy59LhoeDTTUdbQ", "user_id": "xlCmM0MUrGqLJObfJ-ry1g", "user_name": "Andrea V.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Great place. My kiddo had a week long summer camp here. He had a blast and came home happy and tired every day. David was great with the kids and did a great job teaching! Thank you soo much! Can't wait to come back again soon.", "date": "7/15/2016"}
{"review_id": "gIcWn7cRXADbgdU_S58PIQ", "user_id": "hDH_9mlCUmbKDJ9ZIgDALg", "user_name": "Anna C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is pretty awesome, the front desk staff is very friendly and welcoming! It took less than 15 minutes to check in, get my friend a guest pass, and get belay certified. The studio is part of touchstone climbings many gyms in the Bay Area, and I happened to be a member of the new la boulders so I figured why not check out these gyms!The walls were pretty tall I'd estimate something around 40 feet, there is about 50-60 ropes, plenty of routes for everyone to climb. The ratings for the routes are a bit soft, a 10b seemed more like  9 but hey that's all subjective! There was plenty of variety of routes from overhanging, balancy, lead etc... Plenty to do in a day! Parking is a bit scarce, they validate 2 hours in the city lots but any more you will have to pay- expect to pay about 2-3 dollars per climbing session, I usually climb about 2-3 hours.Compared to planet granite, this gym is quite a bit smaller, and a little less nice. The bathrooms were small, and the changing area was somewhat non existent. The workout area for is about 1/5 the size of planet granite. Pricing for planet granite gyms is similar to touchstone, but their facilities are a lot nicer! That's not a knock on the studio, just stating facts.", "date": "12/26/2013"}
{"review_id": "SJnK6vlAOO0fSL65LiHtQA", "user_id": "rNCsZ2kwBfUjTXOfOWwwsg", "user_name": "Ann K.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I don't know almost anything about climbing but the two guys at the front are pretty cool. This is based 95% on them. We showed up and went for bouldering then the rope-pull-not-clipping wall and began doing that. Soon the 5'8ish worker who wears the 5 panel hat came by and asked if we had cards that allowed us to climb these walls. Nope. So he took us back up front and put us through a safety test and turned us lose again. He was helpful, professional, and not too much of a stickler to ruin a good time. The other tallish redhead guy is just chill. Not as much joking as the shorter one, but both of them made me comfortable. Hazzah.", "date": "11/3/2015"}
{"review_id": "3TG7YXGTJ-DyTdJgBhP6xA", "user_id": "lZLiOYLd0sG9H3yNVL8T2A", "user_name": "Cody C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "Make sure if you don't know how to rope a knot, that you attend the class and get there as early as possible in the day. They don't do later classes on knot tying.We did the smaller wall instead, it was alright. I'm way out of shape.  I probably would have done better though on the large walls.I will likely try again once I can find time to go early enough and maybe after I lose some weight (lol).", "date": "5/11/2015"}
{"review_id": "soq0gZu0DKdPiP8Cjcj_Zg", "user_id": "V778JmCddpNBuFCSdv-XcQ", "user_name": "Richard N.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "Really Cool Gym.  Wish they had some auto-belays for visitors who don't have belay partners.  The front desk person at the time (went during noon) was really un-attentive and I had to ask to get helped.  Overall, the gym has 50 feet TR climbs and good lead routes.", "date": "7/19/2016"}
{"review_id": "iY5GaNyn2zjtet2XLpTD1Q", "user_id": "_SVfoi3YUFNHswsfZUO9mg", "user_name": "Mikey U.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 22, "funny": 23, "cool": 19, "text": "In the quest to regain a modicum of youthful prowess (just kidding, look at me; I've never even known what svelte or spry means) and - actually, mostly this - overcome some pestering, panicky, post-injury anxieties, Studio and the people of have become a safe-place away from egoist and elitist.Nearby Planet Granite Sunnyvale is easily 3-4 times larger and offers at least that much more in rope and bouldering options, as well as being better-outfitted with weight/fitness equipment, but Studio's small downtown locale and reclusive-chic [read: mostly hipsters, granolas, & co-eds] make for a less hurried scene; not as much queuing up for climbs/problems, fewer (scrutinizing) eyes on your climbing, less imperative on topping out, more on nurturing ability.Some might contend that the smaller facility equates to a lack of options - that one will have climbed/send'd everything they can in relatively short order and that the routes aren't refreshed with enough frequency. Probably not untrue, but if you've climbed everything you *can, why not press yourself on the problems that are rated harder or just above your comfort zone? (...see what I did there? \"above\"? Because climbing? I know. I'm the worst.) Get after those moves you couldn't do yesterday, pass that crux you couldn't read last week, top that route you wouldn't have even tried last month. In that regard, there is almost always something to climb.True, Studio (as well as most indoor-climbing gyms to some extent) rate their climbs subjectively and those ratings can vary from chain to chain, setter to setter, climber to climber. To that I say don't be so fixated on grade. Read routes, look for cruxes, make attempts, push your limits, climb safe regardless. Just try things; you're your own/only competitor here.Namaste.Proximity to Japantown/downtown make Studio [personally] accessible by bike (agreed, street parking can be a pain) and lends itself to easily seek out food or a post-session drink [priorities, am I right?]. A trek to PG is always looked-forward to, but necessitates some planning. A jaunt to Studio can happen on impulse, and I like that. (Do I maybe have commitment issues? Don't answer that.)Plus, Studio being frequented by downtown dwellers, there's a whimsical camaraderie borne of running into and socializing with business owners, bartenders, & restaurateurs outside of [their] work.PG might be the big glimmering mecca, but there's something nice about neighborhood-y Studio.________________________________________________________Workout, then nosh on a burger! Hi, I'm mikey and I do fitness wrong.", "date": "9/4/2014"}
{"review_id": "K0yGXP5GiiO5RgIo0uYLHw", "user_id": "m-5di8oh4Pwda_LIsXBlgQ", "user_name": "Gitte A.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym! They often change the climbing routes. The staff is very nice and I loooooove to take the Monday night yoga class.", "date": "10/25/2015"}
{"review_id": "Gye68ah_-aI_0MzCPvUarg", "user_id": "adJkAJ6XVJ-pfhM_BAb3vw", "user_name": "Mee C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "The Studio has clean walls and the holds aren't overused so you don't end up having to brush them at all/too often. It's pretty small, but cozy, and there's a lot of breathing space. There are plenty of crash pads to pull around in the bouldering section. There are water bottle cages attached to the railing in the bouldering section to hold your bottles too. I thought that was neat!What I like about The Studio (particularly the bouldering walls) is that the routes aren't packed too densely. It's also very easy to find the pieces for the routes because the tape colors used to mark a route don't usually clash with the nearby ones (like dark blue/dark purple/black at Planet Granite :\\). I would come here more often, but it's a bit too far away for me. If I didn't have to worry about distance, I think I would choose The Studio over PG because it's not as busy and because it feels fresher.", "date": "2/10/2013"}
{"review_id": "wG6yLsdhjeMnOYZYCLTYZg", "user_id": "YSHwCx0Id-xDhpEmfs-KYg", "user_name": "Kevin T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great variety of routes, big bouldering area, lots of top roping, and lead areas too. Also a gym with weights and machines, and a yoga studio. The routes are marked very well, with BOTH colored holds and colored tape. (It's always frustrating going to other gyms with poorly marked routes) Cons:Just a little pricy, and there are no auto-belays", "date": "6/7/2016"}
{"review_id": "kIbClgONzs7qE-cFGCYVuw", "user_id": "QTk07U-MX9cQwb1oVllZxg", "user_name": "Johan J.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Had the 10-years birthday party for my son at The Studio today. It was a total success. The kids were a mix of the sporty and the non-sporty kind and everyone enjoyed it. The coaches where easy going but still made the kids focus on the challenges.", "date": "3/23/2017"}
{"review_id": "qn22aiTWyJA7EdBLZ-RbFg", "user_id": "oO6VCmISYMtSbuKZpS2UmA", "user_name": "Mel P.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 11, "funny": 11, "cool": 12, "text": "OMG my poor hands got F'ed up! I don't care if it's cheating, I'm bringing gloves next time!  My friends and I showed up for the Drop-In Intro class on Saturday morning at 11:30 AM.  It was about $30 for the whole thing - gear rental, an hour of instruction and we got to use the facility for the entire day.  Henry taught us how to tie in as a climber and how to belay for our partner.  It was a lot of fun and such a great workout! I was sore for days.  There is parking on the street or you can park in the Convention Center garage around the corner.  The Studio will validate your parking for 2 hours, so if you're in/out pretty quick, parking is free.  It was my first time climbing, so I was a bit nervous at first, but I totally got the hang of it over the course of 4 hours.  The walls are 40 feet high and range in difficulty to 5.2 to 5.13. Thankfully there weren't any other people using the climbing walls in the morning and early afternoon, so we had the whole place to ourselves. My suggestion is to get there early since it can get busy later in the day and all the \"Easy\" walls are taken. The staff was super cool and helpful, the restrooms were clean, there's a yummy cafe across the street for snacks, I had a great workout and it was a lot of fun!Class times: M-F 4:30pm, 6pm, 7:30pm Sat/Sun 11:30am, 1pm, 3pm", "date": "5/29/2012"}
{"review_id": "eIgvMJm0zAh-_z7LQcb1_w", "user_id": "d1iz-5Zjp6-H3JbxJk3XkA", "user_name": "D K.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Good coaching. My friends and I had a great time. It was our first time. The instructor was very helpful and patient. Wonderful climbing experience", "date": "9/30/2015"}
{"review_id": "ze-hwXnBZikLa8ZQb3C_5g", "user_id": "M_ZUMI9w6ONoZaa0EntZQQ", "user_name": "Chuck B.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 2, "useful": 4, "funny": 3, "cool": 1, "text": "So, the quality of this place truly depends on your ability to have practical choices.  If you live in Down Town, then this is truly you're best option for Rock Climbing.  If you can go out of your way, then Planet Granite is a no brainer. I can give you a long laundry list of how/why PG is superior, but I'll stick to the macro level points:- Planet Granite has lower monthly membership fees- Planet Granite has a much larger climbing facility (triple the amount of Lead Climbing, Top Rope & Boldering routes)- Planet Granite has a much larger gym (fixed & free weights)- Planet Granite has more studios with more fitness classes (yoga, core, etc)- Planet Granite membership includes onsite Cross-fit - Planet Granite has a real locker room (not some converted bathroom)- Planet Granite has a parking lot.  - Planet Granite membership gets you a 10 or 15% discount at Sports Basement- Planet Granite has less member's taking selfies for InstagramStudio Climbing provides indoor rock climbing solutions for those who live in DTSJ, which is valued and understandable, some people will settle due to convenience.  But if you truly are a fan of Rock Climbing + Fitness,  you owe it to yourself to check out PG in Sunnyvale.", "date": "6/26/2014"}
{"review_id": "j4qpgVMXKLe6aaaYEDhqaw", "user_id": "lNxRaIO2wNqMkCcQ8hhtyQ", "user_name": "Kathleen W.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "The Studio is home to a more tight knit group of climbers in the South Bay.  While most are enjoying the mammoth of a climbing gym that is Planet Granite Sunnyvale, a handful of dedicated individuals are crushin' it at The Studio.My quick summary -- Pros:- Tall walls, but not the tallest!  Mission Cliffs and PG Sunnyvale do it better.- Not crowded!  I go here to get my rope fix in.  While most gyms are crowded during the weekday evening hours, The Studio boasts many vacant routes for your climbing desires. No waiting to \"switch off\" with another group.  Just climb!- They have a cute nook you can rest in during your top rope climb!- TRX classes are pretty slick- Fun events (like headlamp climbing)!Cons:- Routes are updated infrequently.  If you go consistently, a route refresher is to be desired.- The water fountain is all the way at the bottom!  So if you're bouldering upstairs, be sure to bring your own water bottle.", "date": "8/4/2014"}
{"review_id": "ufVAGO7sr_uwQ1GYRAtEzA", "user_id": "bxpYqw63IRgfFkg9dTNh5Q", "user_name": "Elias R.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 4, "funny": 3, "cool": 3, "text": "Lot's of fun! Kind of pricey, but seems like for an avid climber, it'd be worth it. I took the beginner plus class, the guy was a great teacher, got me trained and up a few walls and bouldering in no time! Left me feeling confident, even though I wasn't as strong a climber as I would have liked. Did a couple 5.9's on my first visit though... Not bad I think lol, Definitely worth a try if you want to get into climbing or think you might like too. They also have other workout equipment and tons of other classes and stuff too!", "date": "10/25/2015"}
{"review_id": "66yYRE-QBXdI6rAkjNojfg", "user_id": "ciQ4WnJ1UZeo1EJPU6wU0g", "user_name": "Leo R.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A really fun place to go.  The staffs are friendly and helpful.  They also have a small gym on the second floor.  You can really get exercised.", "date": "8/24/2016"}
{"review_id": "tOppCmte1YoVRUZSGiQWZg", "user_id": "KBCR6u-dZxXhK0EMD1XCCw", "user_name": "K P.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "I must have been spoiled by Planet Granite in Sunnyvale because this studio is ALOT smaller and the velcro shoes are not as secured (I have narrow feet).Other reviews said friendly staff, but I must have been on the wrong day, because the staff seemed tired and annoyed around 10am on a Saturday.The bouldering area is quite small and not friendly towards beginners...there's no wall chart to teach beginners/newcomers about different holds (unlike PG).People get to leave their bags/personals anywhere, making it time consuming/dangerous to walk around and move them out of the way.", "date": "4/28/2014"}
{"review_id": "7kNMJGFpUm0RI0OKEEGwQg", "user_id": "lw9cMPI1rfttkQF5mPABIQ", "user_name": "Kevin C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 1, "cool": 3, "text": "Awesome gym if you are looking for a place to better yourself with cool people and make some friends while you get sweaty! They have a good set of the usual weight training type stuff (+treadmills and bikes). They have a variety of classes for you to take. So if you want to climb or lift weights I'd say it's great for climbing and pretty good for weights (they lack just some of the more neglected usuals). If you have a buddy to come with it makes everything better, if not it's easy to make friends! Bathrooms are great and their shampoo/body was smells amazing. If you're a student at SJSU I highly suggest getting the 40$ membership.", "date": "6/25/2014"}
{"review_id": "p5vTyKkyLlM2NP3ZYHEl6A", "user_id": "fUOP40_AcpXoTj_IfLzzgA", "user_name": "Dan B.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The bouldering here was pretty bad. I can only evaluate v0-v5 and I can say that the routes felt very confused. Missing foot holds, etc. It's  worth paying a little extra and going to a place like planet granite in Sunnyvale.", "date": "6/7/2016"}
{"review_id": "udfX2gR5XeQ6O1lfiCVscQ", "user_id": "OduqSeGbg8StiXTyqZnFBQ", "user_name": "Colin C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Most supercalifragilistic place to break a sweat in San Jose, or anywhere in the bay area in my humble opinion. I loved this place from Day#1, with a cordial, knowledgeable staff, open atmosphere, and great memebership percs, there has never been even a glimmer of dissappointment in all my time here. The bouldering area is able to accomodate alot of people, and it will get busy diuring the eveneing (open until 11 pm WOW) there is ample top roping routes, and even a HIDDEN SECRET CAVE!!!  (spooky) TRX, Yoga, Weight racks, punching bag, and finger boards all have their own rooms/areas as well,  making this gym a super well rounded, exceptional place to get down and sweaty.  Check it out for yourself, dont take my word for it!  (climbing is addictive.)", "date": "2/27/2015"}
{"review_id": "fQOf2iZHr6AoSxeeOIetrw", "user_id": "EjOdjwWQ2dFUBVSc6dYB2w", "user_name": "Colin R.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The manager, Diane, is so committed!  She'll go so far above and beyond her normal job duties.  Touchstone is all about climbing but, when it comes down to it, it's a business that's in the service industry.  Touchstone excels because of people like her.", "date": "2/13/2017"}
{"review_id": "WCCDsbBuUBgisW_IoS-h2w", "user_id": "wC4GmYftCk0_HNyExw70ew", "user_name": "David C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the place that got me climbing. The staff is chill, the community is chill, and what they offer is great. People are always happy to see you and help out to boot.Bouldering and workout equipment upstairs, yoga/workout/bday studio at stair-level, top-roping and slack-lining at ground level. Plus they have a sauna and some \"secret\" workout areas. Only complaint I'd have is parking, since typically you won't be able to park right outside. Typical parking spots are the Convention Center Parking Garage and/or San Carlos parking lot.", "date": "6/1/2015"}
{"review_id": "5C2-6qvsUxI6Xn7ROmQQew", "user_id": "WQ6wmPcH6H_ueQUjwWxohg", "user_name": "K B.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 0, "funny": 0, "cool": 1, "text": "I'm a beginner and went for bouldering only. found a pretty small area that was overcrowded. It was Sunday so perhaps I should have expected that but it made it hard to do much. I spent 25 minutes looking for parking before calling to find out that they do validate at a lot a couple blocks away. The belay area is very pretty and spacious and I imagine folks going for that would be pretty happy. The people working there were nice. But given the small space and parking distance I probably won't return.", "date": "2/20/2017"}
{"review_id": "rgn2XipKkbcVFVQTbBlPHg", "user_id": "8sLNQ3dAV35VBCnPaMh1Lw", "user_name": "Kathy Y.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My friend and I got a groupon deal for one month unlimited climbing at the Studio. The intro class was very informative. HELLO, people! SAFETY FIRST! It's not just your life at stake, it's your partner too! I'm glad it was just me and my friend taking the intro course because we got individualized attention. I've never been part of a membership for rock climbing so I can't compare this gym to other rock climbing gyms. This gym is very clean and staff friendly. The gym includes classes such as conditioning, yoga and spin and a sauna room! Too bad most of the classes are in the evening. I'd take them if they were in the early mornings! Yoga at 6am to start your day? SURE!!! I'm all for it. Classes usually start around 4:30-5pm. They're all posted on their website, which is also nice to plan your rock climbing and/or classes. Lockers are clean; you can borrow a lock with your ID.My only gripe about this place? Finding parking in downtown San Jose is a pain in the butt.", "date": "11/14/2012"}
{"review_id": "UgH5g0Q0NxofLkniW0p9gA", "user_id": "g3P32YlvYBT6qrKi6Ltstw", "user_name": "Colleen L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "The to-be-opened Studio has all the makings of a great climbing gym.  There's tall walls and a whole second story for bouldering.  I went today for their first public display of touchstone in the south bay since 2008's close of the previous downtown san jose bouldering gym.  The location had previously been a movie theatre which makes for a perfect climbing spot!  They pack a lot of climbing/wall space into a small footprint.  I'm really looking forward to climbing here after they open. They have a fitness room area (thinking maybe yoga or aerobic classes area) and nice bouldering area.  I've never seen formations like this for bouldering.  Though it sort of looks like a picasso painting...if you know what I mean.  The climbs were fun and different.  I think some of the ratings were a little soft, but that made it really fun to send a lot of things.  A lot of the holds were dusty with new construction plaster and there were quite a few spinners.  There weren't many n00b friendly routes (easiest thing I saw was a 5.9) but that might have been only for the open house day. The people were incredibly friendly and nice.  The gym lay out is pretty cool.  The adjustable crack is awesome.  The pockets/windows they have around on the walls is also pretty awesome. The nice new grips were great!  Touchstone really does make some incredible holds.  I loved the different shapes and the different pinches were really nice too.  I particularly loved the amount of stemming problems they had.  Always a plus with me.  Four stars due to parking (which was metered parking or the dtsj parking structure) and the crazziness of the unfinished construction which contributed to disorganization in belay tests and sign ins, lack of changing facilities, and tripping over sheet metal and angle iron.  Can't wait to try out the new bouldering area.  It looks incredible!!!", "date": "2/18/2012"}
{"review_id": "lKItOUzUiO09JsyC2pRPGg", "user_id": "lNM1AOtuFOydVsc2x56Bcw", "user_name": "jen l.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great birthday party here. You can bring your own food. Big thanks to belayer Eddie, who was super awesome and patient with my rambunctious turning nine year old and his friends. The gym wasn't crowded and each kid got a turn mastering a climb so they felt confident and successful.", "date": "2/5/2015"}
{"review_id": "0dC_KYZ7GKZOFG-nm9_gag", "user_id": "7eFY4I4XUggDI8S1qBVtpA", "user_name": "Kabir A.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was my first time here..had great service from Henry! Thanks again! I appreciate the help and service", "date": "1/30/2015"}
{"review_id": "z0sZfQZcGtdBfL8F0WxIqQ", "user_id": "erUQ6-C4MSuSN9ZdzPcONQ", "user_name": "Lyly N.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 5, "funny": 2, "cool": 4, "text": "First timer here and rock climbing! It was a really fun experience! -Decent prices. -Big-Great staff Negative:So, all the rocks were section and marked by level of difficulties. 5.4 is the lowest. 5.12 was the hardest.I made it to 5.8 ^_^ but I was hoping there would be more choices of the middle level ones. There were TOO MANY challenging ones (5.10 +)", "date": "9/2/2013"}
{"review_id": "q30JXXj7cChBSiKhIailPA", "user_id": "DL_0lsGbnwynSF7T5az0iw", "user_name": "Jaime D.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "it was fun to try something new! the parking is pretty bad, but its downtown san jose what do you expect? so make sure to bring plenty of quarters.its $12 to boulder (no intro class required) and $4 for rock climbing shoes, definitely worth it.you have to take an intro class to be able to rock climb, which makes sense, after all you don't want to hurt someone else or yourself. i forget the rates for the classes but it ain't much.overall the bouldering was still fun.the only issue i had was that when you first start they have all these rules like you have to wear shoes, shirts, makes sense to me. They don't enforce the rules i saw a few dudes with no shirts on and some barefoot, pretty nasty.other than that its definitely a cool place to check out and try!", "date": "2/18/2014"}
{"review_id": "zrJ5DRRNj86UWCqZfzDUXg", "user_id": "fDhoKBPqGlnEMlVNTGl9CA", "user_name": "Leila K.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Free parking vouchers for the parking facility off 1st. (Ask the front desk).10% discount at Sports Basement and in-house pro shop.Access to all Touchstone gyms. Discounted group lessons. Private lessons available.All sorts of fitness classes every day at convenient times.Discounts for students.New routes set regularly.Friendly and knowledgeable staff who care about your safety (maybe more than you want). Friendly crowd! Just be nice, lol!Climbing is the best. The Studio will help you train.Sorrynotsorry but the negative reviewers dont know what they're talking about.", "date": "7/23/2014"}
{"review_id": "W7aOScswuTqAUwrbD8T8Fg", "user_id": "Pe5I1jPCrCFlAMMyMXcTsg", "user_name": "Colin G.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Attitude, amazing attitude. Easily, the best staff and regulars I've found at any gym in the bay.", "date": "12/25/2015"}
{"review_id": "TQUcZGFH2picPOF80z-yMg", "user_id": "wWZocoDFjsIsksZNkisvcA", "user_name": "Liz M.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Definitely the best climbing gym in downtown San Jose.", "date": "1/10/2016"}
{"review_id": "1RuD3bxX6bS1FVpfTs3TAw", "user_id": "VX-9msRhjPM6yzk0rds6WA", "user_name": "Kim Q.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 3, "funny": 2, "cool": 1, "text": "First Yelp review ever. Had to do it for Kendra at The Studio. Management, if you're reading- give the girl a raise woooooopClimbing's been on my bucket list for years. Why did I wait so long? Why do we always procrastinate? Anyway, I'm the kind of stubborn person who insists on doing everything on my own BUT I had no idea where to start. I figured, why not sign up for the Intro to Climbing Plus class and get it all done in one go? Not down to go alone, I dragged my sister and her best friend along with me. It was super easy to make a reservation online and we only made ours a couple days in advance. We got to The Studio 15 minutes early, filled out a quick waiver, got our gear, and started our class with Kendra.Class began with learning how to tie knots. These are important for, you know, keeping people alive and stuff. Pretty casual. All jokes aside, we got a little knotty, learned how to belay, and got up on the walls. Kendra started us off on a 5.5, which was a good climb to begin on. We each got a chance to climb and belay, focusing more on the belaying- safety first, kids. The second half of our \"Plus\" class featured a lot more focus on climbing technique, learning which way to lean/hold your body weight on different types of rocks, strategic ways to get to the top, etc. After seeing us get up the 5.5 earlier, Kendra took us around to look at more \"unusual\" climbs throughout the gym. We stopped at a 5.10a and she asked if we wanted to try it out. Well then. Not one to say no to a challenge, I regretted it almost immediately when I found myself 20 ft up in the air with each leg on a different wall and sweat trickling down my back (out of exertion? fear? not sure which). I honestly have no idea how it happened, but a combination of reckless Tarzan-like body swinging and Kendra's coaching resulted in finally reaching the top. No more regrets, finished a 5.10a on my second climb ever. I Googled it afterwards and it sounds like a pretty good thing so I'm bragging to my friends because my ego's been needing a little boost lately.All in all, I was super comfortable learning something entirely new, everyone in the gym was kind and welcoming, lessons were efficient and well worth the investment, our instructor didn't hesitate to push us towards challenges, and I've discovered something awesome. I'm already making plans to come back. Boom.Oh and there are cute guys there so that's cool too.", "date": "3/27/2015"}
{"review_id": "YZaYLGvDlpo_mEDBUsjVFw", "user_id": "qNrHLZPurBWJzeAMkFLvvA", "user_name": "Tracy T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "Highlights: - Very clean and new. Great first rock climbing experience. - Plenty of space to climb and not crowded (maybe because I went before Christmas eve)- Variety of walls, levels, and bouldering on a separate level. - Yoga room and mini gym. - Separate men's and women's locker rooms. - Mini co-ed sauna room. - Employees are very friendly and helpful. Improvements: - One wall had a loose rock and friend scrapped his finger.  P.S. Go with friends that have been before, so that they can teach you the ropes and belay for you.", "date": "12/24/2012"}
{"review_id": "i0U-F_ZM4BeyopwNB4eu_w", "user_id": "OBXnIV80Jsi2Fv6GfEXy4g", "user_name": "Don B.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, staff, and instruction! My 8 yr. old is on the \"Rec Team\" and it's been an extremely positive experience. He gets high-quality individual instruction and it has a \"team\" feel of camaraderie and social interaction with the other climbers. His climbing ability, confidence, and physical fitness all have noticeably improved since joining the team. The instructors (Pete, Alyssa, and Andrew) have been excellent: the workouts are consistently different, challenging, fun, and safe. This is a well operated organization with good people.", "date": "12/22/2016"}
{"review_id": "nwi4oBnyHiG2uWNEb5z4Qg", "user_id": "egAPuEE8Gm5nd8bWGw0bOA", "user_name": "Vanessa H.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am really happy that I started climbing at The Studio! I top rope, boulder, and also use the gym area here and they are all awesome. I have also tried some of the classes and loved them! I highly recommend this gym!", "date": "11/23/2016"}
{"review_id": "tYtqrMNY67XECLugAzroSw", "user_id": "YRWNaQxT3Y4-NDOACWNtvw", "user_name": "Faye S.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I took my 6-year-old here for the Weekend Kids Belay ($20 per hour for children to climb, which includes harness rental and belaying by a staff member). The facility was nice and clean, and the staff was great with the children. They were very friendly and helpful!My only suggestion is that maybe there could be another staff member to help belay the children. At one point, there were four children and only one staff member to belay (max would be five children), so there was a lot of waiting for the children not climbing. My daughter still had a lot of fun, and we will be definitely be back.", "date": "2/26/2013"}
{"review_id": "-rdgg6WRq2IoggGHwMDcMA", "user_id": "UZRZ6tKfO0Ga6zqBaue6pg", "user_name": "Christine V.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 6, "funny": 1, "cool": 2, "text": "I've been climbing at The Studio for a couple of months now, after having jumped ship from Planet Granite Sunnyvale. I have to say that I'm really liking it! Some of it is still a work in progress, but that's okay. There are 3 levels going on here in this former club/theater: level 1 is the ground floor for the toproping area, level 2 midway up the stairs leads you to fitness rooms where you can take yoga/pilatoes, and level 3 (or I guess 2.5 and 3?) house your classic treadmills, dumbbells and the like, along with the bouldering area.The initial draw for me was that this gym is a lot closer to my house than PG Sunnyvale. Don't get me wrong, PG is really a top-of-the-line facility, but it was getting pretty annoying to have to make the drive after work. Enter The Studio -- it's a smaller gym, with a lot cozier vibe and fewer people. It's really nice being able to toprope and/or boulder at a gym and not have to wait for 3 other people to climb a route first!! I did notice that some of the routes were rated a bit easier than what I'm used to, and some of them MUCH harder (I warmed up on a weirdly, way-too-difficult-to-make-sense 5.4 before). You can park on the street (free after 6 PM) or park in the SJ Convention Center garage, with a 2 hour validation, which is really nice! I was worried at first that I wouldn't be able to find parking downtown, but there's usually plenty of room at the garage. Only other things would be that the holds have had some residual plaster on them from time to time, because of the new construction, and that in the fitness/weights area, there weren't any barbells that I could see. I was really looking forward to seeing barbells so I could do squats and dead lifts, but maybe they're bringing those in later?If you're interested in climbing and live in the area, definitely check this place out!", "date": "6/14/2012"}
{"review_id": "woOFVHxKRTWDwwEfX_HxUw", "user_id": "tsBhRd4NNaP3QC2lX63FIg", "user_name": "Steven Y.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been coming here for the last month, and the best thing this place has going for it is the friendliness of the members. It's very easy to speak to anyone bouldering or belaying!Additionally, today I bumped into a long-time friend from college. I knew she had been working in the area (downtown), but never knew she rock-climbed. And to have seen each other at the same time, quite coincidental!I'm still new to bouldering, but definitely feel that I have improved in strength and endurance for climbing. However, I need to keep going!On top of the climbing, they have multiple yoga classes throughout the week, core classes, a TRX class (I just learned about this!), a sauna room, and weights (bars, free, kettle, bikes)! Literally a plethora of things to do, for just $100 this month.", "date": "7/31/2013"}
{"review_id": "h03peRRxR9s6hjJ0PHmd9A", "user_id": "7TkojMG64NyzCcc1scJkfw", "user_name": "Ryan C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have become a big fan of rock climbing and like the Touchstone Climbing gyms.  I find myself in San Jose for work often and appreciate that my Diablo membership allows to a chance to work out here.  Good top rope area with a range of difficulties.  The walls are higher than at DRG.  The bouldering area is large with a large range of difficulties.", "date": "4/26/2013"}
{"review_id": "-PzOQB4l2eyUrXm_bjEWgA", "user_id": "AJclrxlB0I_zWVcf2jrmeQ", "user_name": "Sarah L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Try yin yoga with Serenity on Mondays and Wednesdays 6:45-8:15. She is amazing. Om!", "date": "8/5/2013"}
{"review_id": "oSYawRQZTtOzQpRBwsZOuw", "user_id": "OUtDX1RsaZDdsunjI0rtiw", "user_name": "Shih Fa K.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Great climbing environment with challenging walls. I just wish they had a spin class. And I wish they could've done something different with the bubble wall. The climbers here are very friendly and social. Henry, Art, Diane, and Ian are awesome.", "date": "2/15/2015"}
{"review_id": "yl_unfNx_Z84Z_xmPt0deQ", "user_id": "xRvVbC40LZSbblpIxoZRlA", "user_name": "Tiffany T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is pretty decent for being located downtown. The only downside I would say is the parking- they do validate it if you park in the garage nearby (only for two hours). I've been here once to boulder and it was just okay. Climbing here makes me feel spoiled for being able to climb at PG. The rates are lower but it is smaller. It was fairly crowded when I went and it made me feel claustrophobic because of how tight the space is. I probably wouldn't choose to climb here again unless some of my friends wanted to go for a quick climb nearby.", "date": "4/27/2015"}
{"review_id": "O13sqxzA0_kcuGj62hcfnw", "user_id": "EeR8kUsDq26HbAenwNG48Q", "user_name": "Susan S.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 2, "useful": 8, "funny": 0, "cool": 1, "text": "First off, I've been climbing indoors and out since 2001, I've been lead and belay certified at other gyms in Utah, Ohio, and DC.  With that said, I was shocked at the ratings on the routes in Studio.  The ratings are all over the place, a beginner could do any of the 5.10a routes as a warm up.  The 5.10a routes are more like 5.8s and the overhung ones are more like 5.9s with multiple jugs and footholds to choose from.I'm giving them a poor rating because as a climbing gym they should follow the Yosemite Decimal System (YDS).  I fear for the beginner climber that attempts an outdoor 5.10 after having their ego inflated at Studio.  My first time lead climbing was outdoor (Thailand) and after speaking with climbing friends I found out I wasn't alone.  If you are a studio climber and considering an outdoor lead, please be cautious and adjust your skill rating downward.The other downfall of the gym is the lack of skill building climbs, it doesn't take much skill to complete a 5.10, just strength.  The 5.11 climbs may have a trick or two and the 5.12s weed out the strong from the skilled.  So far the route setting has been predictable and humorous; I have checked  my opinion against other members in the gym have agreed.  As for the rest of the gym, they have equipment, which is a perk in a climbing gym and the yoga classes are a great plus.I've heard Planet Granite rates their climbs better, but haven't tried them out yet...", "date": "1/24/2014"}
{"review_id": "skzPqIqAEEFJPnU5PBmVtg", "user_id": "QC8DJyAycjJsS9pTzCCrlQ", "user_name": "Kendall C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great new gym that just opened up in San Jose. I've been visiting here for the bouldering wall. The routes and holds are brand new, so the grips are very good. The staff are friendly as well.They have a variety of projects, and crash pads to move around as well as a padded floor, so you don't have to worry about falling though it does help to work with a partner. They add new routes regularly. Morning/noon on weekdays is a good time to go, as the gym is empty so there's plenty of space to climb.There's a sauna and a locker room to put your clothes. There's also a shower room with soap and shampoo for cleaning off the chalk dust after your climb.", "date": "8/25/2012"}
{"review_id": "wNwCYf7a3jNuvWKlAavcUw", "user_id": "jsbpAFTOpCGRdIYgr7XZRw", "user_name": "Paul R.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Studio Climbing on First Street was a wonderful event location, though it is highly recommended that new climbers take the class first. The instructors have great patience. Thanks!", "date": "6/24/2015"}
{"review_id": "gH5lOxlENQs0UI8lxtwx4g", "user_id": "YZhnbnpoHhbaTdA1hve1rA", "user_name": "Jimmy P.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Sometimes they get a bit crowded, but overall this is one of my favorite climbing gyms. They have a variety of top rope routes that are consistently rated between 5.10a to 5.11d, with a few easier and more difficult. Bouldering I feel the routes are a bit more difficult than they're rated, and aren't quite so consistent in how they're rated either.", "date": "2/28/2015"}
{"review_id": "HtKEzJXh78lKjIauNESqug", "user_id": "QUzZzgakRg_75HW0UiLNMg", "user_name": "Jen G.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "Opening night here was awesome.  It is always fun watching others climb 5.11-5.13, which is what I'm working up to.There are a couple of great staff members, and then ones not so great.  Christian + Joshua are the awesome ones. Super knowledgeable, honest, and easy to talk to.  Always willing to stop and answer questions or help out with problems.  These two guys get me excited about climbing in general. Joshua taught my Intro. to Climbing class in March and I passed my belay test successfully on my second visit! He's really good at teaching newcomers to climbing and I'd recommend attending his class!My encounters with Henry and Matt have not been as good, and unfortunately, several of my friends will not return with me to this gym in particular because of them. -2 stars because of Henry and Matt. -1 star for crash pad hogs in the bouldering section.On the second level, there is an exercise area (ellipticals, treadmills, weights) and a bouldering section.  The locker room / shower area is generally clean. They have locks available if you need.I usually have to search a bit if I want to find parking after work. Earlier in the day, it's a bit easier.  Before 8 or 9am, it's also pretty easy.", "date": "4/25/2012"}
{"review_id": "2xwyKRaM2Z_TC3yyJOasaw", "user_id": "tdfKdI3XJVbR9aawyYVlFQ", "user_name": "Trish A.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great new climbing gym!! I'm excited there's a new space in San Jose to climb at! Came here over the weekend with my sister, who is new to climbing but very much enjoyed her time here too! She took the top-rope for beginners class, taught by Matt. He was super attentive and patient, and thankfully did a great job teaching her the ropes because I was her practice belay partner and she didn't drop me! The whole facility was really spacious and had plenty of variety on the walls & climbs. I saw at least two cracks on the far left wall, too. The upstairs bouldering section was pretty sweet, too, though not very tall. Christian at the front desk was also super nice and helpful.My main gripe was that a lot of the holds higher up on the top rope walls had hella debris in the pockets!! I'm guessing it's from recent construction or whatever clean up they're still doing, but it's disconcerting when you reach for a hold and grab loose gravelly stuff. Maybe they're goin' for the real-outdoors feel, though?Regardless, I'll be back again next time I'm in the area! Loved the \"cave\" and hope I can make it to one of their movie nights. :)", "date": "6/12/2012"}
{"review_id": "1W66ZKUtQibedvmTsiX6pg", "user_id": "zGwbyaPw1hLuit2QRgfzCw", "user_name": "Carey B.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Moved to SJ and immediately got this membership. Great routes that are updated constantly. Cool people and vibe. Always good music playing. Plus, monthly membership includes all their fitness classes. Serenity is the best yoga instructor! Recommend her Monday class for newbies and then work your way to Wed/Thurs. This place always has classes/workshops to improve on a variety of things. Super safe and chill atmosphere.", "date": "12/17/2014"}
{"review_id": "Fh-w0P1Ww83-w-0LsGc_fQ", "user_id": "FJivSJwVyeUDwLED7V495A", "user_name": "Ryan S.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great facility with a variety of fitness options. The bouldering area is complex and varied with many puzzles. The facility is always spotless and I've yet to be in there while someone isn't cleaning some area of the club. I'd recommend this place for all levels of  climbing or general fitness goals.", "date": "3/20/2015"}
{"review_id": "Yt5LAacoASV_QFfnNJvkFQ", "user_id": "sPer-F5cQ-lEEowjy-yEfQ", "user_name": "Ash R.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been coming here with a 10 year old for a few months, the staff are great and it's kid friendly on Saturday mornings. There's also a good bouldering area and gym. They've always been flexible and made it easy for us, even with last minute plan changes. Much better than my experience at planet granite.", "date": "7/12/2014"}
{"review_id": "uROU5E-vWTsDTrZHWoHf3w", "user_id": "GkOGXXMW3qr-vD7LRT1HWA", "user_name": "Alex M.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 6, "funny": 0, "cool": 1, "text": "I discovered the Studio last spring and quickly became addicted. Biking or walking to the corner of South First Street to climb is incredibly convenient as an SJSU student looking for a fun way to relieve stress and hang around. If you're just starting to climb I recommend taking a technique clinic with Alex Miller or an intro class with one of the staff members. Also, try yoga with Serenity. Btw if you drive downtown, park in the Convention Center parking garage and the Studio validates your parking for two hours.", "date": "2/10/2013"}
{"review_id": "AvBxvqYn5jhnk_bA2BAZUw", "user_id": "TwhTe_WBiWaArKELqjumEg", "user_name": "Christine Y.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Awesome facilities. Super friendly staff. AND it's not just a climbing studio - they also have weights and other gym equipment as well as a studio for yoga, pilates and other classes!", "date": "4/17/2013"}
{"review_id": "NSHTk3YY4YemEuwUCX2w9Q", "user_id": "ZPX89Dwia-8IX9fldaFFYQ", "user_name": "Christian T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Like stated before, this place used to be a movie theater in downtown San Jose, so the walls run up pretty high, I think about 40-50 feet for the belaying section. They also set a nice bouldering section, but it's a bit smaller than the old Touchstone that used to be just down the street, which was strictly all bouldering. The walls for bouldering go up to about 15 feet high and there's a pretty big diversity of routes ranging from V0 to V14. Aside from just the climbing aspect, they're currently setting up their yoga and fitness programs, which are going to be free for members. Touchstone offers monthly and annual memberships, which you can get a discount on if you happen to be a student. There's also a sauna, although I haven't tried to use it yet. Lastly, they also have nice bathrooms with showers and a mini locker room which you can lock your stuff up in if you want.", "date": "4/4/2012"}
{"review_id": "f7rkLKaqAzBG2xTwQONh2g", "user_id": "NArMkJa5JSxR6qTU9IaQCg", "user_name": "Hunter D.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing Gym,Cool people,Chill atmosphere, Lots of fun :)", "date": "7/28/2014"}
{"review_id": "7wtOyJ3_nTxnnsxK9sGBxA", "user_id": "eOntLu20uI_IO06gl6S60Q", "user_name": "Leon T.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff here is eeeeeee-mazing! They have lots of top rope and bouldering courses. The atmosphere is chill, you can sit and meet a bunch of new people everyday. They have expansion ideas floating everywhere so the place is constantly changing throughout the year... Or that's how it was last year. The only bad part is parking but they'll validate your parking for up to 2 hours and you end up in the middle of downtown San Jose, so you have a vast number of new hipster restaurants in the area to hang out at.", "date": "3/3/2014"}
{"review_id": "weYAuz3RCQnasRkFqCmCoA", "user_id": "ggx2AZd2tmgFzWrLlOLgGw", "user_name": "Ajay F.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Seriously go here! Climb don't be a fatty! And have a rad time working out- and getting sexy!", "date": "11/9/2013"}
{"review_id": "QYjsV1kkdA5NcdTvLU1lQw", "user_id": "NmxX6-8VrAIUsZuERF9u8w", "user_name": "Andrew P.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym, awesome staff, welcomed my buddies and I with open arms. The rock walls are some if the best I've seen and the little resistance training area has plenty in it to get a workout in.", "date": "10/5/2013"}
{"review_id": "4d_2xJ4AmEwTWGjkOn01ew", "user_id": "Q6HzJUoAjZxHzYwDcvVMtw", "user_name": "Ernest C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This has been my home gym for 2 years. I had a membership at PG Sunnyvale for 1 year, and also at Pacific Edge in Santa Cruz for 3 years when I lived over there. The Studio is a nice, clean gym. Sometimes people complain that it's too small or that it's not as \"nice\" as PG. I agree that PG is a bigger facility with more equipment. But the Studio also has everything you need - Good bouldering, lead walls, top rope, conditioning and yoga classes, TRX, a mini weight room, hangboards and campus boards, etc. If you wanna get in shape, try Serenity's \"Core and More\" class twice per week...it will help you build a good conditioning base that transfers over to climbing.Also this gym has a great crowd. The regulars are silly - they love to have fun as much as they love to climb. There's almost always a group climbing together, or playing an impromptu game of add-on. The best energy is on weekday nights between 7 and closing, in my opinion. The environment is not quite as competitive or aggressive as some other gyms. There are a lot of beginners, young college aged people, and some working professionals in their late 20's / early 30's. People are generally nice and willing to b.s. about rock climbing. There isn't too much attitude or dudes with huge egos to prove - that's one of my favorite things about this gym. I would say that if you're a beginner or even if you're experienced and are just looking for a mellow environment to climb in, then this is a better gym for you. However, if you're a completion level climber and rock climbing is your life's goal, then you should probably train at a bigger gym.The other nice thing about the studio is their setting. There are a variety of setters - some new and some veteran, so you really end up experiencing a spectrum of different styles and technique. Also the staff in general is helpful and friendly. Some folks are new to climbing and some are old school.Lastly, the downtown location is fun. You have 2 cafes on the same block, Stritch is a nice bar right next door, and there's no better entertainment in San Jose than downtown San Jose (for better or for worse). Public transit runs nearby. Parking can be a pain, but the gym does validate for certain garages. Your other option is to park a few blocks away toward Reed in free street parking and walk over.All in all, this gym has been my favorite \"home\" gym.", "date": "1/3/2015"}
{"review_id": "it68bYjDcUsBpeyf3jnoXQ", "user_id": "6IdZ9TTQqArWq6gnhxFptg", "user_name": "Lauren G.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 1, "funny": 2, "cool": 1, "text": "I've since become a member.  I've gotten my ass kicked by Jack (Crossfit-style circuit class).  I've had my guts busted by Serenity, only to be relaxed and stretched by her immediately following (Core&More, Vinyasa).  Linda is also good for yoga on Saturdays.  I can never remember who teaches on weekdays, and the website doesn't help with that. The desk people are all friendly and helpful, so I just call and ask.  The sauna has been my favorite discovery!  Top-roping and bouldering are great, but nothing quite gets me out of my freezing apartment like the promise of a sauna toasting my buns ;)", "date": "11/27/2012"}
{"review_id": "NOTx7T_RmdhEOXjbxdcQog", "user_id": "VaUjYNmvAfOAVzpOYuJlzQ", "user_name": "Alexandra E.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff were really helpful in teaching me and my friend how to use the equipment for the first time. The place had areas that were mark to indicate the level of difficulty the climb would be. For a first timer like me, I only had two areas that really fit my athletic skill level, which isn't much unfortunately.  But overall the staff were wonderful teachers and took time to explain things thoroughly and I had fun.", "date": "10/7/2013"}
{"review_id": "aEUZgzE5tYHj1bey_U8ddg", "user_id": "8-lSjwqZpylN7q3UC9-NFg", "user_name": "Maggy C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "close to home! friendly staff! I wish you guys have more room for walls and routes!", "date": "3/27/2013"}
{"review_id": "NDSa5VvLK3KGTEi92cx4CA", "user_id": "2Q9tnZjmehVQAxnj0Sxn_A", "user_name": "Phillip L.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place is pretty awesome. I haven't done the ropes courses yet, but I've done bouldering and it rocks (pun not intended). There's a fairly large space for bouldering with a multitude of paths with different difficulties. If you go on a weekday before 3pm, it's $12 for an all day pass. They also have a gym there if you want to work out.", "date": "9/27/2012"}
{"review_id": "6sM7l7c342wtmlwUXHkm9Q", "user_id": "YbpLvFrMPiStbPPkj7K3qg", "user_name": "Liz Z.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 1, "funny": 1, "cool": 0, "text": "i'm not a member yet, but my bro took me here on a guest pass he had.  according to him, the venue was a former night club turned into this fitness utopia that opened up earlier this year.i'm a big bouldering fan (didn't say i was good) + so we bouldered for an hour or so.  i'm glad the clientele around us using the walls were nice + patient enough too.  i'm a big fan of courteous boulder peeps who don't act like snobs because i can't complete a route that is above V4.  the main level has all the top rope + is also the location of the yoga/crossfit (non-smelly) classroom.  the boulder section, cardio + free weight areas are on the upper level.  walk up the stairs + try not to get bewildered by the huge + unused fish tank beside you.  though the free weight, machine + cardio area is smaller than its sister establishment in oakland, i definitely enjoyed the bouldering area here better.the front desk people are extra nice + greeted us promptly when we arrived + when we left.  being just a few miles from where we call home, i think i'm going to get us a family membership here.  it is a bit pricey ($128/month for individual + family member or $69/month for individual only) w/ initiation fee ($50-$100 depending on type: individ, senior, junior, etc.); but that includes all classes, bouldering + top rope, a free gratis guest pass every month + the workout area.  i think i'm that close to be sold on it.  can't wait to come back!", "date": "7/22/2012"}
{"review_id": "hmODe7qaNDITzCEbWuxaOg", "user_id": "ERqra0QEE0DSRlCstKyEZQ", "user_name": "Rosa C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "This gym is super rad! Having gone to the other Touchstone gyms, I'd say that the San Jose gym is the most unique considering the location and architecture. It's cool how it's built in an old movie theater, and from the outside you can't even tell that its a gym. Definitely makes you feel like you're entering a secret clubhouse. When I went with a friend we only bouldered, and the features were fun and different than what I'm used to. There's a section of the wall that has these giant boobs/bubbles that made it interesting to climb around. There's no cave, per say, like in the Berkeley gym, but they have challenging overhangs that I think the hardcore climbers would enjoy. I wish this gym is closer to me so I can go to it more often!", "date": "4/9/2012"}
{"review_id": "__ezjQz1gOCXrwnLFpBPvA", "user_id": "lU6H8ZVATyqwQE4HinNJPQ", "user_name": "liebersbach m.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "First time in the studio and first time rock climbing (my young child).Parking is horrendous unless you want to pay $7 or more for a lot (we were here Sunday afternoon with no big events in SJ) and had to make several circles around downtown to get a free street parking. I guess it is not their fault. Next time I would consider VTA. Arriving at the front desk: big mess, the confused lady cannot get (maybe asking could be a solution or better yet have different person responsible for parties) who arrives for birthday who is individual. Only 2 computers to sign a waiver, located by entry with people asking/bumping/waking thru to get inside. Nobody explains what the charges are for (what is included). Other parent suggest to get kids hour with the instructor for $20 (they would take up to 5 kids). Great paid and someone said find the guy in green shirt. Guy in green shirt is already with other kids, says we have to wait a turn. OK. Waiting, waiting, waiting (is our hour already started?nobody says anything). Make a way to check in area and go back with check in person. After first intervention the green shirt now says it is our turn. Hooks up my 6 years old but does not give him any instructions, asked for his name but not if he had done any climbing before etc. etc. etc. Well the 6 years old goes up like a wind (not a beginner but does ok up to the more horizontal part. It takes maybe 5 min then he got scared and let go. The green shirt instructor does not offer any instruction and the boy bangs the wall several times. Well he is a boy, takes it quite well. Then again other kids turn and they choose another part of wall to climb (no one ask us if the new spot will also work for us). The little girl goes up and stays up (again) for more then 20 min. (the green shirt chats with her mom and her friend dad all the time). Obviously the girl is not only a bit bigger but not a novice, nevertheless it does not look fair. I had kept checking with the green shirt instructor when the girl will be done but he ignores me completely. Now my 6 years old is off to play on my phone. I get tired of waiting, and head to check in. After hearing my story the lady said that no money will be returned since my son got ONE short go. She offers extending the hour. 6 years old not interested anymore. Finally I suggest pass for another time. I also state that if they take $20 for an hour for up to 5 kids, it must be split equally between participants. I am not paying for other kids to hang out with the instructor for 50 min while my child gets one couple of minutes go. After many minutes at the front I go back inside and the same girl is still hanging up (at least 15 minutes of time I was in the front dealing with them not giving equal time). After we are getting ready to leave the green shirt instructor shows up to ask if we now want to have a turn. Declined.I would strongly suggest that if the venue offers semi private instruction, they would be fair to all and say: all gets equal time x min up and down, you make it to the top or not, you need to rest or not, you are done and next participant takes turn. No preferences. And give the children instruction before hand if needed. And ask if they know what/how to do it. Not sure if/when we will use their come again for another hour but very disappointed about the experience.", "date": "11/11/2014"}
{"review_id": "9xgoJ32bQQWiIx2fYMg9eA", "user_id": "eE5Ixsbxe4SNHmuo6-y-pg", "user_name": "Danny Y.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Just signed up here. I love this place. Great hours and a very friendly staff. They have yoga and they have weights to work out with. Well maintained and clean. Plenty of lockers to store your junk in. Good music good vibes what more more could you ask for?", "date": "2/25/2013"}
{"review_id": "ny58H18dBG0BgwYG7On_7A", "user_id": "jeiavYXul2QluhX2fi2tHA", "user_name": "Erick S.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is fantastic! Clean and new, pristine climbing walls and Precor equipped gym. Henry, Christian, Matt and the rest if the staff are great, kind, personable, and knowledgable. Haven't met all the instructors yet but all classes including yoga, conditioning, core, and climbing are included in the monthly fee. Quite reasonable considering the amenities. Discount for students too!", "date": "1/2/2013"}
{"review_id": "4G0jJcpppZqA0NNv7ujHtg", "user_id": "hOf8wckfHJcclQ924p5D3g", "user_name": "Cynthia G.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 1, "useful": 3, "funny": 2, "cool": 1, "text": "A comment on your customer service: My brother and my niece came down from San Francisco this morning to have breakfast with me and to keep an appointment later in the afternoon. After breakfast we came back to my house located not far from The Studio.Since they had time to spare my niece mentioned she'd like to go rock climbing and I promptly suggested your facility.When they arrived at your business my brother asked for the restroom as one customer service representative explained the services provided to my niece. The young lady pointed out the restrooms, but my brother was stopped by another woman who explained that the facilities were available to members only.My brother asked the woman, \"How am I to become a member when you won't even allow me to use the restroom\". He was upset and said, \"this is b.s.\" Perhaps he should have used a better phrase to express his dissatisfaction with your customer service, but in the end he is right.As a customer service representative (I think it was possibly the owner, Diane?) you  should have been able to discern between a person who is genuinely interested in your establishment and who is there simply to use your restroom.I live downtown and I pride myself on being a supporter of local business. I am disappointed to hear that the woman who refused to allow my brother to use the restroom as his daughter learned more about your services didn't think first or recognize a potential customer. I will never visit or recommend your business again.", "date": "7/2/2013"}
{"review_id": "xde59VQYhxP--fqFrmihbg", "user_id": "uPOzZuJ0Pgk-XlNfjJBhKw", "user_name": "Shufang C.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had my daughter's 8th birthday there. It was great!  The girls had good time there. The staffs there are very helpful and them encourage the girls to explore and challenger.", "date": "11/7/2014"}
{"review_id": "EuwHRitMv85_w6DMw8lBvg", "user_id": "zSTUfwy0pa0RWqcsZnI1Dw", "user_name": "Josh M.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good gym, great staff and community. That said, I'm leaving due to routes only being switched out every couple of months or so and because they only use their own brand of climbing holds which are not that great IMHO.", "date": "4/28/2014"}
{"review_id": "Q3Fr3aMBKTkkoOsmquOp9w", "user_id": "lptxErykrnvSU-0QJtI-gw", "user_name": "Tim W.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This place is amazing! I'm so glad they took this place over because I never went to the nightclub that was there before. The height inside of the building allows the rock climbing walls to be really high, although I do have to admit that when you're at the top and look down it is a little frightening the first go-round. They've also got the small bouldering walls that doesn't require you to be tied into your harness (just be careful jumping from the top, especially if you have bad knees).", "date": "6/3/2013"}
{"review_id": "9W-Wvz1zpP9zHSeEHmXOOw", "user_id": "uGvA7PQoxw7EtWhBxQw6AQ", "user_name": "Ghaida Z.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is super friendly and the gym is nice and clean. It's a little small compared to other climbing gyms, but I've been coming here for almost a year and never had trouble getting a hold of a route to climb.", "date": "9/12/2013"}
{"review_id": "Znq4RoS1d9komcFCgHFV6g", "user_id": "o82SI5VdMqah2NdMefxCBg", "user_name": "Jordan W.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing here since the Studio opened and I love it!  Downtown San Jose has been in need of a climbing gym ever since the bouldering gym shut down.  Staff here is great and it's never overcrowded.  I take my 10 year old daughter here and she loves it.  Great gym for climbers of all levels.", "date": "4/16/2013"}
{"review_id": "bbTUDu19luAokDxBP8mt1w", "user_id": "KoRmFHTVPjOlO_dG0WXnpw", "user_name": "Matt H.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I went for opening night and had a blast. The walls are tall and have great features. Theres even an adjustable crack for those who are interested in crack climbing. The bouldering area has some unique shapes on it that I really enjoyed climbing. The staff was friendly and knowledgeable. I cant wait to see what sort of yoga classes they end up offering. Also, membership here includes membership to all the other Touchstone gyms. Yeah Diablo Rock Gym!", "date": "3/17/2012"}
{"review_id": "UiM0useEdY6eOijREs-Wbw", "user_id": "1fkv7gsOkRLHFzobHgqZAA", "user_name": "Michelle D.", "business_id": "u1J4Kt6T2PlvzCblr-fnXg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a Touchstone member and I mostly go to Berkeley Ironworks and/or Great Western Power Company.  I recently started working in East San Jose so I decided to check out The Studio Climbing today.  Wow! It's super nice!  The women's locker room has a large, very clean shower room, the walls are a great height and have interesting looking routes, the bouldering area is ample and all the fitness equipment looks barely used.  I will definitely be adding this third Touchstone facility to my routine.  The only reason I give it 4/5 stars is because it has no dedicated parking and street parking was a bit difficult to find midday as it's located in the heart of downtown SJ, steps from SJSU. There are public (pay) lots nearby if/when meters are hard to come by.  I wish BART would hurry up and connect to the south bay at which point parking will be a moot point because I'll finally be able to take mass transit everywhere, conveniently.", "date": "6/10/2013"}
