{"review_id": "1mRT48suUV44nHWAQHfNmQ", "user_id": "gxdB880kZ60YmKVf1Z8HIg", "user_name": "Don P.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Our son attended one of the climbing g camps at the pad, over the summer, and he loved it. So our son has birthday in January and we reserved the birthday package which turned out to be a great experience. We paid $375 which entailed a two hour window of time which included the following:- 10 climbers included in the package (includes parents if they want to climb)- two coaches assigned to the party for the entire session-1-1/2 hours of climbing time- climbing harnesses and shoes are included in the deal- a party space for the food and celebrationWith the above, the ten kids had a blast. Each kid was given time with the two coaches during fitting and the climbing. The two ladies who were assigned to the party were great. They were patient with the kids and cordial and patient with the parents as well. The facility as well is awesome. There is no shortage of climbing walls at varied difficulties. From what I could tell they did a great job of keeping the space clean as well. I'm personally too gravitationally challenged to climb myself but I won't hesitate to take our son there for either their camps, classes, or just to climb.", "date": "1/21/2019"}
{"review_id": "JpmvgI3axA-PGxwWZLxI3A", "user_id": "lqkBeFC178gmGoaGUd-e0A", "user_name": "Kate W.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of the best climbing gyms I have been to! There are really good vibes with super friendly members and staff. I instantly felt welcomed when I stopped in to get a day pass while passing through SLO on a trip up the coast. A day pass includes access to the climbing/bouldering areas, slackline, and even the yoga classes for the day! It was a well-worth stop on the road and I will definitely be back next time I am in the area!", "date": "3/16/2019"}
{"review_id": "Ms9xWaYwQBA0lU-i8AIZGA", "user_id": "hKOaZHyMSkSVE6ZlBz1cwg", "user_name": "Cherie D.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I Took my kids to check it out Wednesday and got a complimentary 10 day pass for both of them and they started climbing within minutes! They also went today after school & came home ready to wind down! So fun for both of them and my sons learning patience since he doesn't wanna fall after reaching so far up!!", "date": "8/30/2018"}
{"review_id": "hc0AX3LeZul0rqVdny1TCg", "user_id": "-U60SgwVH5IjfqnZEyYz-Q", "user_name": "Mark M.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I dropped by this gym for the first time today, and have to say this is the best I have ever been to. The staff members were super friendly, yet still were professional when it came to getting us set up. The environment was great, and so big that there were plenty of places to explore and enjoy. There was even a whole area just for smaller kids (not present late at night when we were there). I loved the thick bouldering mats.Despite the fact that I was obviously a total novice climber and 30 years older than almost everyone else there, there was no attitude from the expert climbers with negative percent body fat. The other climbers were nice.", "date": "1/14/2019"}
{"review_id": "Vlm9l-1NKPglffZNjgvNTg", "user_id": "wnRhiV9Nlrv2bXQN2EwpWA", "user_name": "Stephen M.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "There new location is such an improvement over SLO-Op. The bouldering area is larger and there is an equal size top rope and lead climbing area on the other side. The routes are changed regularly and some routes have interesting moves. The membership typically includes 24/7 access to the bouldering, but this is not fully open yet due to some construction delays as of 5/18.There are two yoga studios with both Barre and Yoga. There is a smaller free weights area above the bouldering which gives a nice view from above.The only downsides right now are the limited parking, and limited bathrooms. As mentioned above this is due to construction delays and will be improved soon. Parking will likely always struggle due to the location and popularity.", "date": "5/28/2018"}
{"review_id": "Y-fQk0Rr55PaE4b51UrDGw", "user_id": "kJ-ojfZrgv9UckS2baZspw", "user_name": "D. M.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 6, "funny": 0, "cool": 3, "text": "This place is, hands-down, the best climbing gym at which I've ever climbed. Here are the things I like about it most:1. LOTS OF CHOICES. For those who don't know, bouldering is a type of rock climbing that doesn't involve ropes, because the height of the \"problems\" (i.e., bouldering routes) are so short, and the setup so safe (i.e., the floor is thickly padded), that ropes are unnecessary. Personally, the only kind of climbing I do is indoor bouldering, because I like the convenience of not having to climb with a partner, the safety of not having to worry about acts of nature or equipment problems (however rare they might be), and the comfort of not having to scare myself by climbing high. The Pad has a huge room, dedicated exclusively to bouldering problems. They also have a huge room, dedicated exclusively to roped routes. So whatever you prefer -- bouldering alone, roped climbing alone, or a mix of the two -- you will have lots of choices. By contrast, some gyms have tons of bouldering problems, and only a handful of roped routes -- or vice versa -- which can limit those who prefer one style of climbing over the other.2. FUN FOR ALL LEVELS. Bouldering problems are graded from V0 to V17. The lead route-setter at The Pad -- i.e., the main guy who screws in the holds -- a guy named Joe -- told me that he considers the jump from V2 to V3 to be the dividing line between beginner and intermediate. I'm right on that dividing line. The V2's and V3's I've climbed (or attempted to climb) provide the perfect level of challenge, for me. At the same time, my nephew, his mother, my brother, and my friend are completely new to climbing. They seem to find the V0's at The Pad to be the perfect level of challenge for them. Everyone I've seen at this gym seems to be having a good time.3. ACCURATE GRADING. At first, I was bothered that the bouldering problems didn't have pluses and minuses (e.g., V1+, V2-), as some climbing gyms have. Over time, though, I came to appreciate this omission (which Joe told me was intentional), because pluses and minuses can (in my experience) be frustratingly subjective. Last time I climbed, I was able to ascend all of the V2's at The Pad, but none of the V3's. The fact that there were zero V2's that I *couldn't* ascend, and zero V3's that I *could* ascend, indicated to me that the grading is very accurate.4. 24/7 ACCESS FOR MEMBERS. Members get a keycard, which opens the door, 24/7. No need to wait until staff gets in, to start climbing!5. SINGLE-COLOR PROBLEMS/ROUTES. Every hold in each problem/route has the same color. I've climbed at gyms before that used holds of multiple colors, in each problem/route -- which meant they had to use colored tape flags, to mark each hold in each problem/route. Doing away with tape flags makes it much easier to know which holds I can use, and makes for a much cleaner wall. I imagine that doing it this way means they have to buy more holds, which means more expense, on their part. The owners' willingness to make this investment is something I *really* appreciate.6. EXEMPLARY CUSTOMER SERVICE. The staff, here, couldn't be friendlier. Every staff member from whom I requested advice, regarding how to complete a problem (\"beta,\" in climbing lingo) offered it readily -- even when I was halfway up the wall. Also, the lead route-setter (Joe) generously offered me training tips, on numerous occasions.7. FAIR POLICIES. The Pad has an explicit policy (listed on their website), saying that they will immediately freeze a member's membership, if and when that member gets injured -- meaning members don't have to pay, while they heal. I love climbing at The Pad so much, that I got overly excited, when they started their 24/7 member access. I immediately went from climbing once a week, to climbing once a day. Eleven days later, I developed tendonitis -- which is not terribly surprising, because my body clearly wasn't ready for that level of activity. A week later, I asked the staff to suspend my annual membership. I was told that this was the first time a member had asked to suspend an annual membership (as opposed to a monthly membership). With approval from the owner, and help from the website/database developers, the staff figured out how to suspend my membership -- and did so retroactively, to the date I got injured.8. GENEROUS OWNERS. I won't go into detail, here, because I don't want to give people ideas about how they might take advantage of the honest, hard-working owners of this gym, but I will say this: I found myself in a bit of a pickle, with regard to a matter concerning my membership, at one point. I asked the co-owner (Kristin) whether she'd be willing to help me out, out of the goodness of her heart, which required some sacrifice on her part. She would have been well within her rights to have told me, \"too bad,\" or to simply ignore my request -- but instead, she bestowed on me a significant act of charity, with zero hesitation.", "date": "9/1/2018"}
{"review_id": "gFwwbjENO9zwBTSj1IqWOA", "user_id": "dOjWgvf7psUNLt9TH696sA", "user_name": "Christian S.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great way to work out and tone your upper body. If you are a visitor, you can bring the entire family for a climb with auto catch systems for kids and even some adult courses. For $15 for a day pass it's great. Better yet, it has a gym for those who don't climb. I find this to be the most fun way to work out.", "date": "6/24/2018"}
{"review_id": "YaHdPxDcQqqFfaEk3rb9yw", "user_id": "OOKFKB_HRRzmomMPpD_Uww", "user_name": "David P.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very excited for The Pad - SLO during their soft opening and am looking forward to the 24/7 hours for members!", "date": "3/29/2018"}
{"review_id": "D1aNHmUwzb0EzQYap-0_pA", "user_id": "MOqhdiFqWdIqd79peAaamQ", "user_name": "Antonio V.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "Unprofessional, Not ran by real climbers, money driven, No 24/7 like advertised.", "date": "5/7/2018"}
{"review_id": "Y8SWhb7Bj9nTFCUEfV2fIg", "user_id": "Ap9eBJ-IzhJQK-OjMmtH0A", "user_name": "A E.", "business_id": "Hn-frca8Mpe31yj1uSlafA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My teen went to The Pad in SLO for a birthday party and went back with a friend recently for day use.  We completed the waiver online and arrived late morning so parking wasn't an issue.  The front desk staff was efficient and helpful and the vibe toward beginning climbers was awesome.  The layout of the gym is good, with many levels of difficulty courses throughout.  I took a few videos, but mostly stayed in their lounge which is comfortable and has free WiFi and coffee.  All of the staff were encouraging to them as beginners to the sport!  I'm positive we will return.", "date": "7/7/2018"}
