{"review_id": "vwtwpPFTz5tXGez1TrGu3g", "user_id": "uBFSK8aQmspuJ2LjjMYLEg", "user_name": "Elaine H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This has been by far my favorite climbing gym of all the ones I've visited in SoCal. They do only have one wall that you can top out, but it's quite long with varying routes for both beginners and skilled climbers. It's also pretty sweet to be able to walk down the stairs after a climb.What I loved most about this gym in comparison to other gyms is the auto belay system. Yes, it's quite scary at first, but try not to think too much about it. If it makes you feel better, I had a friend who was up there for 45 minutes and took about 3 gym staff to calmly bring her down. So, I promise, you won't die. There are routine checks for the belay system, so you can breathe now. In terms of crowd, there are quite a lot of people and children on weekends and starts to build around noon-ish because of the intro classes, so try to get there when it opens or earlier in the morning if you can.Parking can get a little bit tricky in the lot, but there are plenty of street parking available if you can't get in. I also started attending the workout classes earlier this year--just the sculpt lab and the full body circuit. They're both challenging and totally worth the pain, sweat, and possible tears, but the instructors are amazing! Many of the peeps that come to the class are climbers themselves and come with a variety of pain and aches, but the instructors are super patient and really work with you through it. I would definitely recommend and hope that they open a few more HIIT-like classes in the near future!**Also, these classes are included in your day pass. Woot Woot! It can't get any better than that!Belay on friends!", "date": "4/6/2019"}
{"review_id": "Cw_Uvsytrrvopi8OOCrTbA", "user_id": "nbup582T2-ec6KJQSSa1dw", "user_name": "Lady Esmeralda Q.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What a work out! Such a fun place to go climb. I went with a couple friends my first time there. If I lived closer I probably would get a membership. Good place to keep active. I was a first timer and a class was not necessary for me. My friends have been climbling in the past and where able to help me out. It wasn't difficult to figure out how to climb. They do have different levels for more experience climbers and they have beginners which is neat. I would definitely come back, It was one hell of an experience. I was sore for about a week. A lot of muscles strenght involved but so much fun.", "date": "1/7/2019"}
{"review_id": "tr2GHCGeWbLKwYdMcXuchw", "user_id": "vuP33DbcEAtfhRXTUoK_-g", "user_name": "Peter Q.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "very helpfull staff, especially moe? i believe thats his name, they took the time to explain to us first timers and gave us tips on how to approach the climbing. love this place and would be great for a date.", "date": "3/15/2019"}
{"review_id": "RtG0yF8AAq95pr0gMUbO1Q", "user_id": "OYqAv1_0SJFo1CTYRpvRFQ", "user_name": "Jameson S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "T-----H-----E cultural C-O-R-N-E-R-S-T-O-N-E of Santa Clarita!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!Let's be real guys, Top Out Climbing is the largest gathering place of positive and self improving people in the entire Santa Clarita Valley.Howard Konishi opened this place single handedly (with the help of Gaby, Caleb, and others), after accumulating the mere modest winnings of underground hamster race gambling, and then finding a cure for hamster cancer, selling the medication to Pfizer, and funneling all of the profits into another cure for people who can't stop curing things, namely himself, and putting the remainder in the Grand Opening of Top Out Climbing!!!Now that you know the history, let's begin with my review:Top Out Climbing is an indoor rock climbing gym, with state of the art waiver forms (ala iPads), and auto belays (an automatic pulley system designed to catch you perfectly every time, without the need for a belay partner, mainly someone who will drop you on \"accident\" while checking their text messages and playing clash of clans instead of paying attention to you, which is quite common at other gyms, 2-3 broken backs daily on average at most other gyms.  NOT AT TOP OUT, which puts your safety first and foremost, and hasn't had an accident since the San Francisco earthquake of 1906.But I digress, back to my review.So after you're checked in and signed away your liability at the front desk, what next?Well, likely JAH or some other dope person, Tyler The Likeable or other some such person will \"show you the ropes\", literally.They will explain the safety equipment, more so if you decide to \"Top Rope\", less if you decide to join the slightly less morally supportive group of \"Boulderers\".Top ropers receive more claps for finishing a climb from their fellow top ropers, and boulderers generally wondering if they should go \"shirtless\" for their next feat of grandeur.But again, I digress.The next thing you'll require is an explanation of the rating system, top rope goes from 5.5 to 14D, or 15Z, or something.  Bouldering goes from VB (very beginner I've been told), to V10 or V100, I can never remember because I don't boulder, except when I'm in the mood for an injury.So now you know the rating system, and then what?Well, it's time for Summer BBQ, DUH!!!!!!Or a Halloween Party!!!!Or an epic game of foosball, Top Out has an amazing foosball table, a TORNADO (some of the best players are Ethan, Medvis, my brother John, Tyler, Clint, and HOWIE THE KING KONISHI.Or making tons of friends, these people are H-E-L-L-A F-R-I-E-N-D-L-Y!!!!!!!!!Most of the parties are pot-luck, and I'm sure you would imagine a lot of these folks would be vegan, given that they are so health conscience, but alas, most are meat eaters, so, you might wanna stop at Whole Foods, eat a dope little salad, and show up to one of these parties and put on your pretend meat eater face, with a solid \"Oh man, I'd love to, but I just ate a Cow down at McDonald's, it was wonderful!!!\"  Or whatever it is meat eaters say to each other.So now that you've made a million friends, you've learned to climb, and you've navigated the socially sensitive world of various dietary lifestyles, what's next???Well, what is next is to take selfies with the staff, and post a hilarious review!!!Top Out has changed my life, literally, and so much for the better that I can honestly say I wouldn't want to live my life without it.Thank you Howie, thank you Jah, thank you Danny, thank you Davis, thank you Tyler, thank you all the ones that are no longer there, Gaby, and Larry, and Caleb.I love you all so much, and you've put up with way more of my antics than any human being possibly should legally.I can't thank you enough Top Out Climbing, I don't know where Santa Clarita would be without you, and I can truthfully say that I don't know where this valley would be without you.Thank you Sunny, Jacima, Ethan, Medvis, Suzy, Justin, Mike, my brother John, everyone who allows The Brother Monkeys to be who they are, hover boards and all.I LOVE YOU TOP OUT CLIMBING!!!!!THANK YOU FOR LOVING ME!!!!!!!", "date": "10/10/2017"}
{"review_id": "Bd8-LTAjRN5Eita7lmv-tg", "user_id": "OD05sJSh7rK8nUGKSZPecQ", "user_name": "Abigail K.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very very fun!! At first I had doubts that it will not be safe..however..it is so do not worry! I love this place and I want to come again because it's so enjoyable~~", "date": "1/3/2019"}
{"review_id": "J7UUce6sOMf_adQyM0asnw", "user_id": "2xK02j-N0sBmZaOWrKyF9w", "user_name": "Kami H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place for a person alone, in a couple, or a family! I'm not a fitness person but I'm so happy every time I'm here. Staffs are friendly. The faculty is clean. My 10 year old and 13 years old enjoy climbing here too. They change a few climbing rocks every Wednesday. Plus there's auto-belays and bouldering. If it's your first time there, you can pay to get a \"first-timer's\" lesson.  The first timers lesson is a huge help. Do not skip this lesson! My 10 years old daughter couldn't take this lesson because she was too young. Check with them for the minimum age if you have young children. This area is also so clean and appreciated. Also, if you're looking for yoga classes, there's one here too. You could easily do a yoga class and go straight to climbing! My family hasn't been in the yoga place so check out another review or go there yourself! There is also a small workout corner for 12 years and above in the climbing gym. I really wish I would've found this place earlier. So if you're looking for somewhere to exercise and have fun, well now you know where to go.", "date": "6/26/2018"}
{"review_id": "Ds75tByq-X67xrPm3xllYw", "user_id": "02N_Ibqd6Pddg-5mCma0Rg", "user_name": "Shannon S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Back in March I took an 'Intro to Climbing' class with an employee named Davis....and bought a membership right after! The gym is clean, with several bouldering options and an auto-belay wall. They have a mini gym section plus hangboards and bars. Prices are fair, the staff is wonderful, and the routes are changed regularly. I've been coming weekly (sometimes several times/week) since! It's great for families as well.", "date": "7/31/2018"}
{"review_id": "q9cGSx7ic4AkA-KVUh7JEg", "user_id": "ZlKh2QnlWlmpxFggX08Gjg", "user_name": "Tina L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love Top Out. It's great for beginners: I had no experience when I started out, but Moe was awesome when orienting my group and I to the walls, rules, and terminology. The holds and tape are both monochromatic, making climbs very distinct from one another. The auto belay system is simple and easy to use, and there's a lot of bouldering space. The setters keep things fresh with new routes every Wednesday, and the grading system is pretty consistent throughout all the climbs. Though it can get crowded on set days and when there's a party/event, there's almost always an available problem to work on.", "date": "1/22/2018"}
{"review_id": "BK51kLi27w50RD98gTcHkQ", "user_id": "xjH-XzS3eH1zaEnfrUqzcw", "user_name": "Karla A.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Everything is almost great, I drive an hour to get here, but that's not the issue. Good gym for kids 5 up.", "date": "7/2/2018"}
{"review_id": "geFJQNLckNOhZCJFo-WSjA", "user_id": "n_0giw1uSgg-z9DRuOmiKw", "user_name": "Veronica C.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had a good time at Top Out. It's quite a distance from my home but it's challenging and fun and for a reasonable price... I just found a new hobby and will be back for sure", "date": "6/25/2018"}
{"review_id": "JID4TUyYeIFgu2oYFrUTng", "user_id": "HUbS10XoRDDhT1RvkgEztQ", "user_name": "Mayumi M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I purchased a Groupon deal for two. Went with my friend who has also never done any kind of rock climbing in her life. If you're a beginner I highly recommend taking the introductory session. We had Jah as our instructor and he was the best! Was very informative, patient and passionate about rock climbing. He had lots of energy when cheering us on and even though his scheduled time with us was up he still stuck around to finish giving us his rock climbing tips. You could tell he really loved the sport and it was contagious- I wanna go back already!As far as the location, it was easy to find, easy to park and All of the equipment looked clean. Maybe it was because it was a Sunday but the gym was nice and empty too so we didn't have to wait around to try any walls. I'd recommend this to friends and family! It was a great workout and I didn't even feel like I was \"working out\" because I was having so much fun!", "date": "9/20/2016"}
{"review_id": "VzOlSbjGFUlBVdNeil-Dpw", "user_id": "obvi_P8w01U-Fnq82m9-Cw", "user_name": "Scott G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fun place! Lots of different climbing routes and other gym equipment too, friendly staff, nice!", "date": "1/28/2018"}
{"review_id": "5b5Yg1WHLxtQRHmRA1JgSg", "user_id": "jI_ShrDTB0f6RydVqVI7kA", "user_name": "H B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place! They have auto-belays here. My 10 year old can go almost anywhere fully independent. Mats are everywhere. There's a foosball table when he wants to take a break plus the sitting area is very communal.", "date": "3/11/2018"}
{"review_id": "d4wBjgh8-d2Fv_EHLuXukA", "user_id": "dOJOgfp1i4VKCdD5lQ1NsQ", "user_name": "Feliz A.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "First timers, Lawrence was very nice ... he gave us an intro to the place. Law enforcement, fire and military discount. As we walked in, I noticed the funky odor of this place of stanky feet or shall I say shoes. They definitely need a air freshener timer or plug ins. Location was a large warehouse with a variety of walls. They have 3 walls and a center cube. We had blast harness and without", "date": "6/16/2018"}
{"review_id": "vvmpdvIF7r2961OOwwdRAA", "user_id": "TWmLx1d9gNkI_icJuV6SNg", "user_name": "Tara D.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is sooooo nice, respectful, and knowledgeable. It's clean and has great climbs hat are changed every week. My son loves his team and all the staff", "date": "3/27/2018"}
{"review_id": "9SfaQNPGoCHLn2k4RCtOoA", "user_id": "ksEO9PWtfqZElPewY_ExSQ", "user_name": "Andy S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great rock climbing place. Different difficulty level. Friendly staff. Love this place.", "date": "9/20/2018"}
{"review_id": "fGDnE5WLnNvpI_6VmLi5sQ", "user_id": "p0WizOqtDCDpd0L8vLqd8A", "user_name": "Billie L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "A good friend recommended this place and we got hooked. We live in the AV (Lancaster) so it's a 40 minute drive for us (worth the drive), but if we lived closer we would totally get a membership. We brought our two oldest kids the following week of our first visit and they LOVED it. They change the rock layout often (lots of level options), have a little gym in the back to help strengthen climbing muscles, and the staff is super friendly with helping and giving tips. We go during their matinee pricing saving us $4 a person which is a savings for a family of 6. People who go here seem to be really laid back which makes for a great experience. They have pool tables for guests not climbing and nice music playing in the background.Only weird thing is we can't wear our shoes in the bathroom if they're rented. I get why, but it's awkward to take of and put back on... so I just hold it until I have to leave lol.LOVE this place :))", "date": "1/24/2016"}
{"review_id": "XSaUwmCb_P_er2dS5WV3DA", "user_id": "tMn5GVecf1lyKtZDHX6AXA", "user_name": "Skye H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My girlfriends and I had a great workout at Top Out Climbing. The environment was clean and the staff was great!", "date": "12/11/2017"}
{"review_id": "43kh8GCvidQlzNjDTHdTbA", "user_id": "cEgewJBlRPOrc5Zm46rJEQ", "user_name": "Tammy B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "For our first time indoor rock climbing experience we could not have had a better time with such a passionate instructor! The whole experience was so much fun and an amazing workout. The staff is very personable, knowledgeable, and extremely professional when teaching all ages how to indoor climb properly and safely. The gym area is very well-kept, temperature controlled, and very diverse with many different boulders and climbing exercises. We will definitely be returning as much as we possibly can. Thank you again to Jah for being such an incredible instructor and host! You 'rock'..", "date": "3/4/2017"}
{"review_id": "2-w-Y-ecYspmU1GdIrAbCg", "user_id": "toxKkSqxvP19XhqLz8EKzA", "user_name": "Denise A.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My favorite indoor bouldering spot !Staff is super friendly ! Feel like we're starting to get to know them considering how many times we've been here(regardless of what my check-ins say). They also have great products especially jai-bah! That balm lotion feels AMAZING after a climb and also helps heal the callouses even after working out.", "date": "9/19/2015"}
{"review_id": "_r2cvR3_mXLkqbVSOWElbA", "user_id": "8e-Q5jGQQXyGVR39ny8NPQ", "user_name": "Kristen V.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Still going here. Still love it. It is getting more crowded though. Other than that, I enjoy coming here and getting some climbing in at night. The staff are sweet.", "date": "6/28/2017"}
{"review_id": "_XzyD6wNlBb75ThooZbhCg", "user_id": "kw0TYU-AJhLOo9zw59gMjg", "user_name": "Mike F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I boulder here often. Usually 1-2 times a week. Been coming here for over a year and still enjoy it. Always solid routes and it's never overly crowded. My favorite climbing gym to go to for sure.", "date": "8/22/2017"}
{"review_id": "nOovetRm49Evhb6H6bkOBQ", "user_id": "N2Pe1OOZW0geTlkLu7Sy9Q", "user_name": "Christina L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "Came once just to check it out with a friend that has a membership. Can't believe this place has been open for a year and I'm just now finding out. I've gone only twice (gets a bit expensive driving there from Palmdale in addition to their fees), which is why I checked groupon and found one for their intro to climbing class. I keep inviting friends to join me and their intro to climbing includes a free week membership, which includes gear rentals. Anyhoo, I'm rambling. Here's what you need to know. The staff are awesome! Friendly chill people. Don't be afraid to ask questions. Even making my reservation for the groupon, they were super cool. I've made reservations at other places when using groupons and almost immediately you hear a difference in their tone and you just feel like a burden to them. Not here! The chick I spoke with (forgive me for not remembering your name!) was really sweet and it was like talking with a pal just trying to set up a date to hang out with. The vibe in the gym is really relaxed. Everyone does their own thing but are more than willing to help out others if asked. You never feel judged. This was awesome to experience. Especially going in as a complete newbie, I half expected there to be a bunch of \"bros\" to be acting all superior and judging those of us that can barely manage the VB's and V0's but I have yet to experience that and I highly doubt that I ever will so please forgive me for going in already judging you. Rambling again. In a nutshell, check groupon before going but just be warned. You will leave with a sudden passion for climbing.", "date": "2/13/2015"}
{"review_id": "_ZCgAQ4wxw9UrHBPjVF3Og", "user_id": "1A86xGEon5SvBVYn3rWv-A", "user_name": "Mariel N.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I took three kids under 11 for the first time last week and we (including me who did not climb) had  a great experience.  The staff in the front were very helpful and patient.  The place is nice and updated although they were doing some sprucing up that day which we were told they do every Wednesday which actually makes me feel better - safety first!. Will definitely be going again, kids had a blast!", "date": "4/19/2017"}
{"review_id": "DyivlyR9sw1j4Dyc_qyOpA", "user_id": "Cbw3lXAJv2T4p5X-B7KfEA", "user_name": "Jeff P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kids love this place. The staff is very helpful.  It's the cleanest climbing gym I have been too.", "date": "7/2/2017"}
{"review_id": "WnOyqtriPlUhhqVMpAyFGw", "user_id": "tjo-GuapjcUN47mUWr5bcQ", "user_name": "Justin A.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my 6 year old climbing for the first time at this indoor gym on a Sunday of Memorial Day. We were visiting family and looking for something fun to do. He was intimidated in the parking lot, so we asked for a tour. The employees were really friendly and one of them showed us around. My son decided to give it a try and he loved it. They have lots of bouldering areas as well as several auto-belays. It was a great gym and a decent price. I wish there was one of these in my neighborhood as I would definitely become a member.", "date": "5/31/2017"}
{"review_id": "qTTMYhYqrwaFgAgcJRTtJQ", "user_id": "boMnKkDbriSaVYqZuxZTdA", "user_name": "Cathy L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "This is my home gym for Bouldering and I absolutely love it. The prices are pretty reasonable although I believe the day passes at ARC are cheaper. If you happen to live in 626 area I would recommend going to ARC. Top out has 5 auto-belaying walls and 3 massive bouldering rocks. 1 of them you top out and walk down the stairs. The crash pads are super awesome, one of my friends fell pretty high I'd say 15-20 feet and she didn't even hurt herself. No pain no sprains no injuries. It's a very safe environment, the people there are very considerate and the staff make sure the kids are not getting in the way of other climbers. I.e. Running under someone or leaving their stuff under climbers. They keep a fridge there which is awesome!! Because I love to just chill there all day. They have a foosball table, sofas, and a mini gym with a treadmill, weights, and of course the ladder wall. The facility is large and has knowledgable staff. I once was there pretty late at night I stopped by not to climb but I wanted to try on some shoes. Granted they did not have the specific shoe I was looking for, but the guy that helped me I can't remember his name went into detail on helping me find the best rock climbing shoe for me. I wish I could remember his name because he was so kind and I felt like he cared about what I was climbing in. Thank you to you! I appreciate everything. I highly recommend this place! Cons: there's no ac so it gets super hot in the summer. But they keep all doors open and have huge fans.", "date": "1/27/2016"}
{"review_id": "oz49mo2BvNo1u4yz2G4eGw", "user_id": "ZH6xJx_axR-61SHM-CeRpg", "user_name": "Dean P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "This place is fun. I brought my kids here and had no intention of participating. Next thing I'm putting on the climbing shoes and going for it. They areas for all levels of climbing. It's cool to see your kids push their limits and tackle fears. Cool place---- we had fun.", "date": "1/15/2016"}
{"review_id": "zzsW_s5Wr2p79XkkDoZEkg", "user_id": "Ev49t8gI41I1JCw7zPp3ow", "user_name": "Stephanie A.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is my go to gym. The staff is incredible! Extremely friendly and willing to help when ever asked. Its difficult to find great customer service these days. The gym and equipment feels clean and inviting. I also like how they have other gym equipment in the back.  I gave Top Out 4 stars instead of 5 because I wish there was more harness climbs. There is a more advance free climb wall that I hardly ever see anyone on and wish half of that could be replaced with more harness climbs or find a spot to install more harness climbs. I dont think there is enough variety in climbing choices and after a couple hours I get a little bored. Also I wish Top Out would bring the pool table back! They still have the foosball table but games such as those allow me to take a break from climbing while waiting for my arms, hands, and feet to relax. Now I have to just sit around and lose momentum while taking a break from climbing. Overall I always have a great experience when visiting Top Out. Everyone from the customers to the employees are extremely nice and willing to help. While I'm climbing, I love seeing staff approach new climbers who are struggling. It shows that they really do care and want their customers to learn this awesome sport.", "date": "9/5/2016"}
{"review_id": "Gfm0vLnKjkxO1bTpGFoT9g", "user_id": "tgxOMt72pALx3_r2uZ92tQ", "user_name": "Aileen K.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 3, "funny": 0, "cool": 3, "text": "Woohoo! Awesome workout and class instructor, Mo, who makes you feel very comfortable. I took my younger brother (13 years of age and he owned it so feel free to bring your sons/daughters/youngins) to a Saturday 1pm class and was very grateful to find that there were only 2 other people in the class. For those who are shy and anti-people, you would want a small class because many times, the groupmates take turns trying a course while the others watch on.You really have to push yourself physically and mentally, even for many of the beginner routes, but the point is to not be discouraged because everybody started somewhere, even the monkey-pro climbers you'll see smiling at you to encourage you.Beware: your hands will hurt like a mother- and you will get calluses on your hands (yes, from one experience). Also, you WILL be sore if this is your first time, regardless of your daily workouts, so plan ahead!", "date": "7/7/2014"}
{"review_id": "6ncRzOi8CI4NhQ5MgjGIuw", "user_id": "TF5Bu5S6WZqqXgt9-C59QA", "user_name": "Stephanie W.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 4, "funny": 2, "cool": 4, "text": "Amazing. Life Changing. Oh my god.Went here Sunday. I spent the first hour terrified. I tried to climb but couldn't get more than about 5 feet up any wall.I never knew I was afraid of heights, but I was SO SO SO scared.I took a breather on the couches and let it all sink in. Watched others do it. And of course saw fearless kids take to the walls.Somehow I gained courage and motivation, and ended up killing some course and reaching the top of a few paths!Now I truly have this URGE in me to go back. It was amazing! The prices are SO AFFORDABLE. It's clean. The staff is friendly and helpful.It's about a 40 minute drive from me - otherwise I would go every day!I am still sore! Great workout! Wonderful challenge mentally and physically!", "date": "5/6/2014"}
{"review_id": "ZcNVfO4tGS7v1Y6F_AD4fA", "user_id": "k8kRZlnPcpsL_lCruCp73Q", "user_name": "Josh L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Huge Fan so far! Great service and a great no judgement atmosphere!", "date": "1/11/2017"}
{"review_id": "1L8ZL91DxGmGRDSfKfC1qA", "user_id": "GqDqSS5tzWnfD6y-PzJj1A", "user_name": "Beethoven S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is a nice climbing facility. The staff are kind and helpful. If you like to climb this is a good place to be. They change the routes weekly. Periodically, they have family night which is a big hit.", "date": "8/26/2016"}
{"review_id": "JtyU35BHxYuc8bS2fE20fQ", "user_id": "DxtaozQwfnJaVKiU5NQwKw", "user_name": "Chris M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love the facility and the community is incredible. The staff are helpful and friendly. I have climbed in a lot of gyms in SoCal and this one has the best selection of bouldering.  The ratings are fair but on the hard side, the routes are varied from pumpy to pinchy to tricky and balancy. They keep the place really clean and set new routes regularly so it never gets dull.", "date": "5/12/2017"}
{"review_id": "QbBICjvQBKPR-JvZfH_xmg", "user_id": "_u2EvCe83MXKeq_MY7QiCg", "user_name": "Matt S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place, kids had a blast, great staff too, had fun watching the skilled climbers", "date": "4/2/2017"}
{"review_id": "uxx72mudfnSq1vZSwj_ATg", "user_id": "N9Futp2p_4r8R5MLcCRMVQ", "user_name": "Lauren P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 7, "funny": 4, "cool": 5, "text": "Absolutely loved it!ServiceCaleb was awesome. He literally went above and beyond when it came to service. He checked us in, talked us up, and walked us through the whole process.Prices$16 day fee and $6 package rental which includes shoes, chalk, and harness. I have seen deals for Top Out Climbing on both Groupon and LivingSocial so I would double check there before paying full price.OverallGreat experience. I honestly thought that we would be there all night since they have so much to offer. However, I found it rather tiring and only stayed for about 2 hours. I'd go again for a date, girls night, party, or anything else you could possibly think of.TipThey have a fridge, microwave, Foosball, jenga, and pool table.", "date": "10/29/2013"}
{"review_id": "wKjZnRCDrDZpg1CposEnWQ", "user_id": "NiBPqkabaYFO_Usyw35z4w", "user_name": "Sarah B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is awesome! A friend recommended this place to me and they had a living social deal going on so we bought it! Once we got there, we were a little iffy about it from the outside looks of it in an industrial office building area. We were greeted the second we got there.  Everyone was super friendly they showed us around and explained everything to us since it was our first time. They have about 6 automatic belays along one wall and then all the rest is bouldering.  The automatic belay made me slightly uneasy but that's just a mental thing for me.  We had a ton of fun and will definitely be back.  Their prices are pretty reasonable.  16 for a day pass and 6 dollars for shoes,  harness and chalk. 4 dollars just for shoes if all your going to do is bouldering.  I recommend this for a great date night for that active couple.  **note: they offer civil service discounts on day passes and month memberships.", "date": "1/7/2014"}
{"review_id": "7xAxKoE_34vxWTDxX8nGrg", "user_id": "mPmZ4Pvk8EJo3156Rxc6sQ", "user_name": "Danielle S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What a great workout for experienced and novice climbers. Great course markings and skill levels for everyone. Go in the morning to avoid the kids and crowds.", "date": "1/8/2017"}
{"review_id": "86iarwoUE9Z2oqoeX6CsPA", "user_id": "c4myimB289Ac8xM-2Dprgg", "user_name": "Jay C.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I've done indoor rock climbing before but those weren't real classes. I just went w/ the flow. I did one a while back @ Six Flags & the other time was @ the CA Science Ctr. GroupOn had a newbie special so I decided to give this place a try. PROS:-easy to find; close to Walmart-plenty of free, spacious parking lot spaces-they give you a free week card after class to come in & utilize-yoga ' s free to members & only $10 to non-members-front desk staff & Jah (my actual instructor) were super welcoming, friendly, & Jah was so knowledgeable. after filling out the online waivers, we (a group of 9) were given specific snug fitted shoes, our own adjustable harnesses & chalk bags.-I enjoyed Jah's passion & enthusiasm in sharing w/ us on how to properly use/develop technique while bldg up strength. he broke everything down accordingly & is/was opened to constructive feedback. -he had us pair up by 2.  we each test climbed & dropped by ourselves against the walls w/ the ropes about 30 ft high, educated us on proper body placement, spot climbing & types of grips-he also gave us great tips on how to effectively & efficiently save our energyCONS: -w/o the groupon, it's pretty pricey-it was super humid in there :/ idk if their ac was just broken or if they didn't even have one-due to my work schedule, it's hard for me to come back & utilize my free week :/OVERALL REVIEW:I'd definitely come back; I could get used to this!", "date": "8/16/2015"}
{"review_id": "dj_mEvY9vzALyLmDkXk3Ew", "user_id": "I2eoH5pg9lujyRqSrHxs5g", "user_name": "Eden S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is my go-to if I wanna climb but I don't have anyone to belay me. I live A LOT closer to Boulderdash in the SFV but if I wanna climb up a wall, I can rely on the auto belay at Top Out. Luckily, I don't have a M-F 8-5 job and I can enjoy the matinee hours at Top Out which are M-F before 2pm. If I happen to happen to have an itch to climb after 2, or before a work meeting, they also have discounts for anyone that's an EMT, police, fire, medical, etc. The only downside to Top Out is that it gets so hot climbing in there even with the fans on.", "date": "9/17/2015"}
{"review_id": "bNMU8LHqfmWHVFfi7IaT4g", "user_id": "fyGC7uymT4u24pxPsahT1A", "user_name": "Megan S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My fiancé and I have been here a couple times now, and it has always been great. We love to go hiking and camping, and have just recently taken up climbing and bouldering. We live in Santa Clarita, so we were very happy to find and indoor gym so close to us! The staff are very helpful ad knowledgable. They gave us a quick rundown of all the routes and equipment since we are relative novices. They were also able to tell us about a couple outdoor places nearby to check out! Their prices are pretty reasonable compared to other indoor climbing gyms in the Los Angeles area, and they send out newsletters by email letting you know about specific events and discount nights! We will definitely be getting our monthly membership soon, just gotta let my forearms rest up a bit;) Oh, and they also have yoga!!", "date": "2/5/2014"}
{"review_id": "aVeWqyLcapF2u38v9yyR5g", "user_id": "9kOiuctWS1NN7sRis6DF-Q", "user_name": "Edwin M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Staff and Routes are just amazing. Jab was just all around helpful and threw in some helpful tips while i was just starting to climb.", "date": "10/21/2016"}
{"review_id": "d4NwJFF-u8s3181QFo68hA", "user_id": "PNYjUn2Cm59-rNHIVRhsqw", "user_name": "Enrique B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I enjoy myself all the time when I'm here! I'm not the most skilled rock climber but it provides a big selection of different levels so at times I'll try to challenge myself or at times I'll just try to excel at the lower levels. I've also been there when there's experienced climbers and they don't ridicule you for not being as experienced as they are. For the most part everyone stays to themselves or they offer advice. Never felt uncomfortable due to my lack of experience. Although I will say I did feel embarrassed when I saw a 6 year old girl climbing a V3 when I couldn't do it....haha! Great place overall, staff and climbers are very welcoming!", "date": "11/6/2016"}
{"review_id": "8FYj-7yo1DtILA1LdcE-ig", "user_id": "uF4IOKp_I2TIN5kwmFTbew", "user_name": "Ethan H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Finally, Santa Clarita has its own rock climbing gym, and an amazing one at that.  This place didn't skimp on quality of equipment, from their pads covering the floor, to the automated top rope devices this places is set up!  Best part about this place, has to be the employees, every employee is super helpful, and love to climb.  When your hands are tired, they have a slack line and a pool table to mess around on.  climbing is quiet diverse here, there is a large variety of runs to chose from, would highly highly recommend you try it out.", "date": "6/19/2013"}
{"review_id": "Xm45fzKzMh-4LZ4DAJEfbQ", "user_id": "tubaFoiU67XgNlIta5lMbQ", "user_name": "Katie C.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I used to climb a long time ago but then I moved around and there was rarely a gym anywhere near me. I've pretty much forgotten everything. When this place opened up I was super excited to have a place that was actually driving distance.My first time here was a little over a week ago. Myself and my friend went and rented the gear and got the day pass. I had never used an auto-belay before and the staff was super helpful in showing me how it all worked and gave us some tips and pointers. And then we were climbing away.I really like the courses they have set up on the belay wall. There's a ton of beginner ones but also some very difficult ones that I'm a long way off from trying. I watched some more advanced climbers do them and they seemed to find them fun and challenging as well. (They have the easy 5.6-5.9's and then a bunch of 10's of all different letters if you're trying to gauge if there's something difficult enough for you)The bouldering area is AMAZING, even if bouldering scares the crap out of me. It takes up probably about 70% of the gym including a top out wall that has stairs in the back to go down. I did it once, on the easiest route I could find, and some how managed not to hyperventilate and die. The staff is very friendly, helpful and knowledgeable. These are people who enjoy working there and love climbing. They made me feel welcomed and taken care of. I lasted about a week before I knew I had to go back and I bought a 10 visit pass. I can only go about once a week with my schedule so the 10 visit made sense for me. If you plan to go twice or more a week you'll want to check out their memberships instead, which are pretty reasonably priced. After climbing again tonight, playing a giant game of jenga in my down time,  trying my had at the tension line, and meeting other climbers who were just as nice as the staff, I'm hooked. I LOVE this place!(Pro-Tip: The Sunday I went on didn't have many kids around but there was a few very well behaved ones. The Monday evening at about 9:30 pm was entirely made up of adults. They're open until 11 so if you're looking for a good time to go and not deal with kids or crowds, later on a weekday is ideal, try to time it a little after the intro to climbing class is over.)", "date": "10/21/2013"}
{"review_id": "Cl3J0PyK-H241xiqTXqs3A", "user_id": "ZSbnQ5LpxAR_95P8nV9xfg", "user_name": "Manoj N.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Great place for some rock climbing. I got a Groupon for my 12 year old daughter and she loved the 1.5 hours climbing lesson. The teacher was nice and explained everything is detail. There was only 2 other learners with her. There is a place in the center where folks like parents , friends etc can sit and watch their loved ones do the rock climbing. Plenty of parking available outside the building. Staff was courteous. You can bring in your food and water if needed but there are snacks counters. Restroom was clean and smelled good.", "date": "7/2/2016"}
{"review_id": "JVZXxMV4TifTn38B1rQn_A", "user_id": "I3oYKntTnIuXc_7Fqd6m2A", "user_name": "Xenia Z.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Love everything about this place !! Even my 4 and 5 year olds climb to the top ! I will definitely be coming back and telling everyone about this place super recommend", "date": "5/6/2016"}
{"review_id": "OUlRUaiW5RH_562kB0k37w", "user_id": "XA4pMGh0NUF82kuOT_q_mg", "user_name": "Paolo H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my new favorite place to go in the SCV. I had been to other places that had rock climbing walls but I had never been to an actual rock climbing gym. This place is huge. There are a number of different level courses that you can climb. I love to go here with my kids. I encourage them to climb as high as they can. It allows them to dig deep in themselves and to push through their fears in a safe and controlled setting. The only downside is that it can get a little pricy especially if you add on the shoes and chalk. Similar to trampoline gyms, you will also need to sign a waiver before you enter the facility. This is important if you decide to bring a nonfamily younger guest. Make sure you have their parents download a waiver online and bring it with you. Lastly, it can be a little hard to find. It's the large white building on your left off Ferry Court near Sky City Bounce House.", "date": "8/12/2013"}
{"review_id": "tTvpNvGqU_MA1Zk05AaFqg", "user_id": "_Kyxm6z_UrtUwrGBAIUk1Q", "user_name": "Jackie K.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 5, "funny": 2, "cool": 5, "text": "Ow, ow ow. My arms, back, legs, feet, fingers, & even fingernails are all in pain after 2 hours at Top Out. I got a better workout attempting a few of the climbs than I would have gotten 30 minutes at the gym. Sore never felt so good! Top Out is fairly small, but it offers many different climbs. You have to follow the colors to get to the top! I'm not going to lie, I struggled more getting down than going up. Sure, I wasn't able to climb the more advanced levels, but I still had fun. As soon as I got to the top, I ended up getting stuck there for a little bit. I attempted climbing down, but I failed and ended up hanging there for a solid 5 minutes. You see, I like to know that I'm being supported by the harness and rope. As soon as I pulled on the rope, I realized that it kept going. But sure enough, the rope will catch you as you fall. Reminder: there are student discounts so be sure to ask about them!", "date": "10/21/2014"}
{"review_id": "GPA_uGDYNeaGBKUePFD0wA", "user_id": "xy1UjyJEkeY5vD5r_S8KdQ", "user_name": "Katherine D.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This climbing center is one of my favorites. It's mostly a bouldering gym, but it does offer multiple auto-belay top rope routes as well. Unfortunately there's no lead climbing, but the vast amount of bouldering routes makes up for it. It's a great place to practice technique for all levels of climbing. You can also work on endurance and breaking any height mental barriers because the walls are 15 ft. for bouldering. This gym is a lot bigger than most gyms I've been to. Like many other climbing gyms, they also offer yoga classes and slack lining, which helps with flexibility, strength training, and balance. There are also climbing lessons available for those who are new to climbing.They also have events, like college night and family night.The rates are also very reasonable and well worth it, and the atmosphere is very chill, It's great for people of all ages. You haveeee to check out this climbing center!", "date": "6/26/2013"}
{"review_id": "9JODdUAp4oxUSBogjEshNQ", "user_id": "2EjfO1-gitGFJ0MDFK7VKw", "user_name": "Bonnie L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great, clean facility with something for everyone to enjoy. I love coming here!! :)PROS:- Reasonable prices ($16 all-day pass; $4 shoes, $2 harness, $1 chalk bag rentals)- Great hours for coming after school/work (open until 11 PM weekdays)- Easy and ample parking - Auto belay system (super convenient for solo climbers who don't have belay partners and perfect for beginners who want to try rope climbing but don't know how to belay. Everyone wins! :D )- Friendly, easy-going staff- Lots of great bouldering for all levels- Dat little loft at the top of the top out wall. So simple but so freaking awesome.- Yoga classes on Monday and Thursday evenings  (FREE for members and pass holders)- Gym/training area to get yo cardio and lifting on (small but it's got the essentials so no complaints)- Nice open lounge space where you or your non-climbing friends/parents can chat, read magazines, study, play foosball, shoot pool, be anti-social and play Candy Crush/check Facebook, etc. FYI for newcomers:- Getting there is easy, but finding the place may be difficult since the sign outside is quite small and colorless.   Sometimes the auto belay wall gets crowded, but thankfully there's a ton of bouldering to keep you thoroughly entertained and challenged while waiting for the walls to free up. :)Overall I love this gym - it's always worth the 35-minute drive from Palmdale, even on a weeknight. Come in and have a good physical and mental workout!P.S. Their pro shop has pretty decent prices. I just purchased a harness from them yesterday for cheaper than anything comparable on Amazon. Can't get mad at that. ;)", "date": "12/22/2014"}
{"review_id": "gznPGqVMfxQMvxrkZIW9ig", "user_id": "tQ6JnQdKq7v0CnLFlYdglw", "user_name": "Patrick K.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my 7 and 5 year old boys here on a Sunday afternoon. So glad we came here instead of one of the downtown places as I've heard that they can get really crowded. This place was not crowded at all. Moe gave us the orientation, and he was very friendly and very clear in explaining the rules and how to use the equipment. I like that this place has both automatic belays (harness wall climbing) and various bouldering (free-climb) options. Although when I called on the phone they said that they recommend children to be at least 8 years old, my boys were still able to find a couple routes they could tackle. This place also has a nice lounge area with a foozeball table right in the middle of the place. My boys have asked if we can go back, and we will definitely come out here again!", "date": "5/31/2016"}
{"review_id": "rKjEaO9RaDuyAtPlIkpilg", "user_id": "4URikmwj4XZgOUQ1vCnZHQ", "user_name": "Shelly B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great indoor rock climbing. The staff assist you if its your first time and are very friendly.The prices are very reasonable, especially because you can stay as long as you want for the day. Thank you for a great experience.", "date": "8/6/2015"}
{"review_id": "va9eRx0Jrl64dD43lbkVhQ", "user_id": "kMV0ZEG8v8yup6E7GJrWmA", "user_name": "Eric T.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had an amazing experience here. For two day passes plus all rentals (harness, shoes,  and chalk) I paid a little over $40. This was a great deal because we had such a great time and a great workout. I am fairly athletic and workout, but this gave me a hard workout. I am considering the annual membership. The place is pretty clean,  and there is a lot of room. The staff is also very helpful. 5/5 for sure.", "date": "4/26/2015"}
{"review_id": "Mxa_TLUU8_Jt_V56ldr8sw", "user_id": "t7J3jjkwdHNJArIH4U8NBg", "user_name": "Amy L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. It's a bit far away for me, but completely worth the drive.Highlights: clean, open space, friendly staff, and fun additions like the foosball table and rest/hangout area above one of the climbing walls.The auto belay system is both fun (really scary the first time, but that's also part of the fun) and easy to use. I think the belay wall might not be as varied in angles as some other places, but it's still really challenging. If you're planning an active day out with your friends, Top Out's a great choice.", "date": "1/20/2015"}
{"review_id": "vSuO1-AknvTPg-xqPW4tDg", "user_id": "GpuH4_61Nv3k0Zn8dSM5DA", "user_name": "Honey G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I was here around March of this year.  I'm originally from NorCal, but I was in town for a vacation with my husband.  Whenever we take a trip out of town the first thing I do is look for a climbing gym since I wouldn't be able to have time to pull on rock outdoors. I found Top Out Climbing and my husband was more than willing to take me here during the evening after a full day of whatever we had planned during the day (I forget, lol!).The staff is AWESOME! Super chill (as expected because, DUH! it's a climbing gym).  It's $16 for use of the entire facility. I didn't have to pay that since I work at a climbing gym up North, but still... that price isn't bad!  It is mostly bouldering here, but there are a few routes available to do work on, on auto belay.  This gym is also equipped with some couches for lounging and a pool table (how cool!)Now for the problems...I was impressed at the style of climbing this place has to offer. A+ for the setters, whoever you guys are, because damn... most of the shit I got on were pretty fun and some had some burly moves. Love it!The members here are pretty chill too.  I'd climb with them any day!Overall, this place is dope. I'd definitely come back and do some damage.", "date": "10/3/2014"}
{"review_id": "fAQVVgDt88mW739YJgKQdQ", "user_id": "Gfi1rqQtbGit0qpWwx24rA", "user_name": "Hsiawen H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 4, "funny": 1, "cool": 1, "text": "My new obsession!Being fat and lazy is not really an option in my house. With a two year old who runs on Li-Ion batteries and a wife who thinks working out 7 days a week is mandatory (along with school, work and being a mom), I'm kind of required to be active. Thankfully we found Top Out in December and I immediately signed up for an annual membership! I'm an absolute beginner at rock climbing, and this place is perfect. 7 lanes w/Auto Belay (that line that drops you down safely) and countless bouldering routes, from super easy, to 'I don't think I'll ever get this', Top out has something for the crazy kid in everyone that wants to climb stuff and jump off. Staff are awesome, the regulars are incredibly friendly (often rooting on new climbers or offering words of advice), and their prices on gear or equipment are pretty much spot on with even online pricing. They run specials every month, Ladies Night, College Night, Family Night, etc... As well as running Yoga classes and competition teams. Definitely a fun place for a date or to drag the kids to burn off some energy.", "date": "2/13/2014"}
{"review_id": "Zkdz0ryks_2mEeuqmgDciA", "user_id": "fScZjUVT27fwbeFRkiRUWg", "user_name": "Wheels G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 1, "funny": 2, "cool": 0, "text": "Let me preface this review by telling you that i am afraid of heights.  Deathly afraid of heights.I bought a Yelp deal.  $20 for $32 worth of credit.  The kids and i went there and took a visual tour.  My daughter and i decided we'd climb.  My son wanted to play w/the giant jenga that they advertise on their website.  I paid for my daughter and i to climb and rent harnesses.  It was $16 for me, $14 for her and $2 each for a harness, so it was another $2 in addition to the credit i had.They guy who checked us in then handed us over to the guy who showed us how to use the belaying tether.  Did i mention i was afraid of heights.  So he shows us how to unlock the tether and lock it onto our harness.  I start climbing and he says \"lean back and let go\".  No, i'll climb down.  I start climbing down and he says \"no, no, lean back and let go\".  No, i'll climb down.  I got down and he said \"let's try again\", so i climb up and he says \"now, lean back and let go\".  No, i'll climb down.  He tells me he wants me to \"experience it fully\" and i didn't want to.  My sick brain thinks about the one time in a zillion that the tether can break or malfunction.  I just can't make myself repel down the wall, sorry.  My son couldn't find the advertised giant jenga, couldn't play foosball w/only one person and he's not much of a pool player, so he had nothing to do but watch.  Of course after watching us for 15 minutes, he decides to join us.  It's another $12 for him.  Wow, this is a bit pricey.  Granted, we could stay there all day, but really, it's hard work and after an hour and a half, they're tired.  We also did the regular bouldering, where you don't need the tether.  OMG  That's the scariest thing to do.  I get about 5-6 feet off the ground and i have to climb back down, even though you can easily drop down onto the crash pads below.  My daughter was the bravest of us all and climbed to the top of one of the boulders, slipped over the top and walked back down the stairs.  Too high off the ground for me at 15 feet!!  I had a heart attack just watching her.I'd be more likely to go back for the early bird special during the week.  I had a lot of fun trying to challenge myself to go higher, but it might be cost prohibitive for my whole family on weekends.", "date": "4/9/2014"}
{"review_id": "aDjiL_1Xz5iZYTgD90eIEg", "user_id": "jIZ9hSbuoqJWghsi4XVuzQ", "user_name": "Adam T.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "I love that there is a gym in SCV!  Everything about this place is great for me.  I love that it is mainly bouldering so I can go in there and quickly pump out a bunch of climbs.  They need to be careful here though and get their staff a little more accident aware.  Back in August, I saw a girl fall from the top of the (rather short) climbing wall and deck.  She wasn't dead, but she definitely could have sustained some major injuries.  No ambulance or anything was called and some people or employees ended up moving her around and stuff.  Yikes!  Leave injured people alone and call an ambulance, done.  I've seen at Mesa Rim in San Diego, that they have these big red tarp things that you attach the auto-belay biner to.  That way, a climber that walks up to the wall is confronted with a red tarp in their face and has to actively remove the biner and lower the tarp before they can climb.  Pretty necessary, especially at a bouldering gym.", "date": "1/5/2014"}
{"review_id": "c7EAFs6xHx7C1sYrIJILvw", "user_id": "YlYiCd59JZf_pmcYSfwX6Q", "user_name": "Chloé M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 2, "cool": 2, "text": "Started, started, started from the bottom now we here! Right, right? Okay enough with the Drake reference. Okay, anyways top out climbing is most definitely amaze balls!!!! And \"gym\" is totally accurate. I didn't know I was so out of shape until I tried to pull myself up those blasted walls!  I have like no, none, nada, zip upper body strength whatsoever. My arms were seriously dead for 2 days; I couldn't close car doors, I can't open refrigerator doors, couldn't open jars of almond butter all thanks to Indoor rock climbing. Thanks to them I now joined a gym so that I can pump weights and be more prepared for my next encounter.When we went it was a Saturday night. There was a kids birthday party. It seems like a great place actually to have a birthday party. You know, have the kids run around for a little bit, get in them car and get the home they'll knock right out. I also think it's a wonderful place for an adult birthday party.The front desk individuals were really nice. For two shoes and two harnesses it was $12 and our entrance fee was covered by a Groupon we had. We were there for two hours and that's a good amount of time to be there because you're surely tired out. All in all I had a really great time. I can't wait to go back. But I'm not going back for maybe another two weeks because I want to get a little swole before I go ;)", "date": "1/9/2014"}
{"review_id": "wfwEkQovbjdkUL_4Ud9vHw", "user_id": "DaKA1DX59AkUwxYR3qauVQ", "user_name": "Chris H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "AMAZING! My kids had a blast with the auto belay and bouldering!!! The staff IS SUPER NICE AND VERY KNOWLEDGEABLE! Im looking into a family membership for me and my two kids, since we will be going every week/ two weeks!!!!!", "date": "9/21/2015"}
{"review_id": "-ktYpmQj9-kpTBRS7bJ23g", "user_id": "LuGeOe105tZ2TbsUqiUsgg", "user_name": "Jason G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Topout is my home gym. I frequent many different gyms and Topout has been my favorite. The staff is pretty cool and helpful. The routes change on a 6 week cycle so there's always something new every week. Routes range from beginner to some pretty advanced climbs with a wide array of climbs in between. Whether it's bouldering or top roping, Topout will not disappoint. Also the community there is pretty cool.", "date": "3/4/2016"}
{"review_id": "D_DEOYMvt6txzHh5AV9_Tw", "user_id": "565yZehTQWZ2D_GRuw19ZQ", "user_name": "Liquid P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "This was my first time doing indoor rock climbing.  I had wanted to try it for many years, but had never got round to it.I took advantage of the weekday early bird special, which gets you all day for $7.  If you check in on Facebook, that's an additional $2 off.  It costs another $6 to rent shoes, harness and chalk bag.  Total price was $11 for all day climbing.The facility is large, airy and clean.  Bathrooms were clean too.There were kids, teens, college kids and adults/parents all having a good time.", "date": "11/12/2013"}
{"review_id": "KZ_GkB9K40-5mFYeHVvmYQ", "user_id": "7eHHg9xRGzYeJucvxZxueg", "user_name": "Leisha P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here with a friend because of a groupon. We were paired up with a couple and since it was my first time rock climbing, the instructor was helpful. He encouraged me to go all the way to the top with my first attempt, against my instinct to give up and head back down. However, so glad I did. I got a lot of information and had fun!", "date": "12/2/2015"}
{"review_id": "9KXkax7J-pNAAankwmMzYQ", "user_id": "JfC7c-iqfKxnNgfuiD1OWw", "user_name": "Marty S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "As a climber in the north part of valley, it was great news to hear it was opening. Stoney Point can be fun from time to time but it loses its luster after awhile; plus it can be really hot in summer. Top Out offers a new place to climb with new routes set up every couple weeks. New climbers and kids are more than welcomed as there as some easy routes for beginners. For experienced climbers, don't worry; they have many routes from V4 - V10 range as well. The gym has an auto-belay wall with multiple routes on each line. There is a pretty tall topout wall (~25 ft.) that can be a little scary to topout on if you don't feel comfortable at heights. I recommend that wall for more experienced climbers. There is also a backwall with a nice overhang to practice that type of climbing.If your muscles get a little tired, you can take a break and practice on a slackline they set up or at the billiards table they have.To pretty sum it up, they got stuff for anyone looking to climb.", "date": "6/26/2013"}
{"review_id": "6XhoUeY59RVd9lBCwxiCew", "user_id": "VagcUt8uAf0LMWcd4zZK6w", "user_name": "Santiago G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing! I got hooked the first time I visited this place and everyone there is very friendly. They really help you improve your skills and technique.", "date": "2/16/2016"}
{"review_id": "qrWwNyRfmEb70xelIOss2w", "user_id": "eyHW_diFXlqqL9EMu4LeHg", "user_name": "Leslie G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 6, "funny": 0, "cool": 0, "text": "Cool place!  I am a super beginner (like, below beginner level, somehow) and was happy to see they had a lot of VB and V0 routes I could try while my friends climbed the tough stuff - other places I've been to only have one VB and maybe two V0 routes.There is a fridge you can use, and a microwave.  Awesome.  The staff we talked to at check in were very friendly.I wouldn't hesitate to go here every time I'm in SCV.Minus one star because I think they could do some safety improvements.  While we were there, a climber fell from probably like 25 feet up on the auto-belay side, because she had forgotten to attach the auto-belay to her harness.  I know we all sign our life away with the pre-climbing waivers, but until there is a better solution to prevent accidents like that, I'd suggest having an employee stand by the auto-belay area and make sure everyone is hooked up before they climb.  This is a small change that could prevent serious injuries.", "date": "8/27/2013"}
{"review_id": "iTcSwMdiE_HVw2YBEe9AMg", "user_id": "dVrorDWkrGuPou2JmUvhVA", "user_name": "Lara H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Participated in their ABS comp and had the best time! This really is an awesome gym--super spacious, great bouldering problems, and great people! The owner is always around and is always very friendly and ready to aswer any questions you have. Would recommend this gym both beginner and advanced climbers. Can't wait to go back!", "date": "11/24/2013"}
{"review_id": "xoasTUYveGYic5W_7ReWnw", "user_id": "LvpOoyQT8d_DXnsAKNfbNQ", "user_name": "Lauren B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Love this place. I'm a transfer from Rockreation in West LA, and this is a welcome change! Not only is the place enormous, there are...gasp!...opportunities to top out on the walls, which is nothing short of a miracle for me. I am a scaredy-cat when it comes to heights and climbing outside has always been incredibly challenging due to the fact that topping out is probably my least practiced skill. I love the fact that it's all auto-belay so you're not left out of the top-roping world if you don't have a buddy. I think a staff member should always be supervising (which is not the case) for safety reasons, but I think that's the only downside. The routes are well set and the setters are mostly outdoor climbers. It's a fun spot even if you're not climbing--there is a pool table, a foosball table, giant Jenga, and lots of sitting space for parents happy for a little relaxing break. The staff is kind, and they play really good music! It's a great place to wear yourself out and have a good time--for beginners all the way to advanced climbers.", "date": "10/3/2013"}
{"review_id": "7sG-H_H_rvJ4tjR4FqlbSw", "user_id": "laEfZI-J3UedvbT7w_gJgA", "user_name": "Ashlynn R.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is extremely nice, helpful, and knowledgable. There's plenty of space, so you never need to wait to climb. It's not very crowded, and majority of people there are regulars. It's also super affordable, and the staff doesn't pressure you to rent shoes or a harness; they recommend it, but they don't push it.", "date": "2/10/2016"}
{"review_id": "sAjeH5hS4zDVEUht4e7p2A", "user_id": "m2dfoPuH9-hWtECkthVIEQ", "user_name": "George M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is 100% gnar. Shredding the mighty peaks like spiderman on the daily is now possible due to the lovely top out gym. Chalk up and it's time to grip it and rip it. I like the variety of route levels even though i'm just a noob climbing a V0. It's also nice that they change the routes about once a month so you're not bored climbing the same routes over and over. 5 stars all day everyday.", "date": "3/27/2014"}
{"review_id": "cr8RpbynK8ftlJ9gadtnVw", "user_id": "T3Gr7JkJskpQZK-GgW6NBg", "user_name": "Olga S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Newly opened and added to my list of favorites. They don't offer TR, but the place is safe and clean, they have 7 auto-belay machines so getting your laps done is a breeze, tons of bouldering area, slack line, and they even have some yoga classes going on for members I think... For experienced climbers this is a great place to work on techniques and endurance, whether you have a partner or not. As far as being beginner friendly, it has is +'s and -'s, The good: there is no test to pass to use the walls, since they have auto-belay machines, so you can focus endurance and improving your climbing technique... The bad: you don't learn to tie a figure-eight knot or how to belay when using the auto-belay machines.  But all-in-all if you are a beginner, this is a great place to start if you don't want to spend a ton of money right away, which is usually what most beginners don't want. Once you develop an interest and improve your technique, you will want to go take a class and learn how to tie in and belay, before you ever go outdoors. :)Staff here is friendly and helpful. Place is clean, comfortable and spacious. Parking is great too. I brought my climbing partner in this week and he loved it.", "date": "6/18/2013"}
{"review_id": "YIcqz_klcER4FtTs6cxhaw", "user_id": "3k4H7AudSyg62Qk1Vg81KQ", "user_name": "Vitto V.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Helpful and knowledgeable staff, very clean facility, clean bathrooms. It's  sooo fun climb here, sad it is so far from me, otherwise I would go more often. They have other fun activities if you don't want to climb, giant Jenga, pool table, football table and other fun activities. All these and the good music keeps you busy and you'll have a good night.Just a note: For safety reasons a staff member should walk around, watch and supervise people climbing. Things can happen even if you are attached to harness or you might have a question stuck on the top.", "date": "3/20/2014"}
{"review_id": "AO0eNI3W1aoAn16AGtHZvg", "user_id": "x1nn6Y0YQJxp6Am06GNomw", "user_name": "Sara F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "If you're looking for a gym to start climbing I would highly recommend Top Out. The first time you step in will not be your last. The facility is equipped with 5 auto belays and 3 massive bouldering walls. You will always be entertained here. There are endless routes that challenge you yet remain fun. Top Out is very clean, I have never had an issue with cleanliness at this location. This is the spot to go for a solo train day or a fun night with friends. Staff is super friendly and will make you feel welcome from the get go.", "date": "6/5/2015"}
{"review_id": "B5uWS0hbWHn1k-8MU3lXQA", "user_id": "RygVRu8HF9SLlx4y7W1l_g", "user_name": "John S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I was a member for 6 months, and an unusual and eccentric member at that.The staff and management was always accommodating of my eccentricities and peculiarities while keeping it friendly and informative.I walked into the place on a one day fun trip, and stayed for 9 months...I was a novice climber, but due to the friendliness and instruction of the community and staff, i became a good enough climber to climb an 11A before my membership was up.The workout is great for mind, body, and soul, and especially great as a confidence builder (kids really benefit).I have made great friendships in there, it is hard to say which is better, the climbing or the community!Much love to Top Out!", "date": "11/13/2014"}
{"review_id": "iin0L7F2wku1U6i2fovW1g", "user_id": "3k5foHdP0SB60mBN5NkmyA", "user_name": "Kevin H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "Went here on a high school night since they paid less than i did. =( hahaha. Anyways this place is new. A couple of months old i believe. Went around 5 on a friday and there was not that many people. My friends and I had fun. Had our workout for that day. The place is bigger than other climbing gyms that I have been too. The place is clean and staffs are friendly. They have auto-belay which for me was much scarier. I dont know but thats just me. Had fun stayed here until closing. They have lockers and place to put your stuff. They have a pool table and  a huge jenga if you want to chill or rest. Overall its great!!!!!", "date": "8/19/2013"}
{"review_id": "CJCgJHjgsIvkhZ2H0Y8jmA", "user_id": "mTgvZhd61XbjwvBjMkM1Wg", "user_name": "Dan G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A great option for me. I can still get some climbing in after work when it's already dark or on those rainy weekends. Staff is friendly and helpful.Every time I go there they do a great job of always mixing it up and changing the climbs around.Always seem to meet nice people there.", "date": "1/15/2016"}
{"review_id": "qUdtIRqJY5WDtrzmOzz97g", "user_id": "ia0I0Ay6Uh3OddrTHJcZkA", "user_name": "Live F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Came here to check out the facility during the grand opening.  The facility had a nice set-up, and I had lots of fun climbing the different walls.  They also provided Yoga class on the second floor that oversees the first floor climbing walls.  Being a fitness enthusiast, I enjoyed climbing and doing some Yoga afterwards to relax/stretch out my muscles.   They have cubby's to store small items (shoes, small bags, etc) and lockers (bring your own locks).  Overall, was a great and pleasant experience.", "date": "5/20/2013"}
{"review_id": "u9oPb6n1jlc2rf3GZdKoOg", "user_id": "1DSOSSH1OSotL5-Ku9fUfw", "user_name": "Vanesa D.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went for the first time last night through a groupon and loved it . I hadn't been climbing fior about 3 yrs and figured hitting and indoor gym would be a good refresher .. And it was . Thanks to Tyler for awesome class .", "date": "7/14/2015"}
{"review_id": "hMbGVu9DntDA6EmPV5LZ0Q", "user_id": "Gt0j-nRQ80axDOQGzdGaZg", "user_name": "mollie k.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Mo was a fantastic 1:1 instructor for my first time in 25 yrs.  I thought the price was reasonable for 2 hrs private.  The place is cool. will return!", "date": "7/28/2015"}
{"review_id": "s663RKBgrra9qtbUcjjNSA", "user_id": "1K90FyxuIYRX1IOVdWopew", "user_name": "Robert P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 3, "cool": 0, "text": "They gave me free stickers but It was weird to see people standing around pretending to be mimes right before climbing the walls. I don't know if it was a secret ritual that people preformed to help them rock climbing better or if they were all crazy. I'll probably be back for more stickers.", "date": "4/11/2015"}
{"review_id": "iTNXUDEr6VaDU2gwxvIJHA", "user_id": "YR9qIZWDUcAP_j93T9t8HQ", "user_name": "Cristine R.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Santa Clarita finally has a climbing gym, and it's a great one! I have not been able to climb here yet (as I am very much pregnant) but my husband and several of our friends have already spent a lot of time here enjoying the problems. The yoga studio upstairs is a nice feature and the staff is super friendly. The prices are reasonable and they have lots of discounted nights (college night, family night, matinee pricing, etc.) Great place for beginners and seasoned climbers.", "date": "6/9/2013"}
{"review_id": "MswKdb00gCl1gDfle7GRGQ", "user_id": "-yWrQ3FQavDW-ztrOvSO8A", "user_name": "Erin D.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My young son wanted to give climbing a try, so we went to Top Out, the staff there gave him a great easy to understand overview of what to do in the various areas, and helped him for a little bit before letting him explore on his own.  He had a great time and it was a really positive, self confidence building experience!", "date": "7/15/2015"}
{"review_id": "UOVnEtvxLmusIOvwIEEc8A", "user_id": "1CNSSI_h1yUv2Blcl4BRDQ", "user_name": "Kendra F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is awesome! I've never done rock climbing before and I was a little worried. I went with my friend last week because she really wanted to try it. Let me tell you - it was so much fun! It's a challenging workout - works out all of your muscles. The staff is very friendly and patient with new climbers. Also, the facility is very clean and kid-friendly. I will definitely return here again and I am thinking of having my daughter's birthday party here.", "date": "10/13/2014"}
{"review_id": "NNue4Pj-80II6SHMIiDpqQ", "user_id": "-XI3ZA1JDt4gn8Du-usBKg", "user_name": "Virgo L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time climber and my family and I had a great time. The facility is really kid friendly. My 9 and 6 year old couldn't get enough of the self-harness thingy. They had more fun going down than they were going up. As first timers, me and wife's hands were really hurting afterwards. We haven't built up the toughness yet so when we do this again, we're going for the hard courses first before our hands give out. My 9 year old is already asking if we can have her 10 year b-day here so we're definitely coming back.", "date": "10/7/2013"}
{"review_id": "2l-_tAPwtBkPjJZQwwGqFQ", "user_id": "qIhHTi0XhdVVjMomMIEaNw", "user_name": "Quan G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I are beginners and learned about the place before it opened. We signed up for a full year membership purely on faith that we'll like the sport --- we were right, totally HOOKED now because of the gym.Friendly people, clean environment, fun events. They are constantly changing the routes so things never get old. All the other members are super open about giving pointers to newcomers.And when your arms are totally pumped and you can't climb anymore, you can always relax and shoot pool or play 2x4 sized Jenga", "date": "7/15/2013"}
{"review_id": "UmoKQWg4vnfTDV33W6hG0w", "user_id": "pT678GpeKsBLFWJeIPcc2w", "user_name": "Steve Y.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic place to climb with your friends, family, little ones, or just by yourself. Everyone in the gym is extremely nice, and alway available to give you some pointers when needed. The staff is amazing, and extremely helpful.  Great place to hang out, and get a great workout in. Experienced climbers to beginners here too. Glad I'm a member!", "date": "6/26/2013"}
{"review_id": "bJY8PBK833hdov1MC2JMqg", "user_id": "PzjSqQC7cQzzqTv-swyzCQ", "user_name": "Richard D.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Excellent time!  3rd time here, first party for my 14 yr old. Kids always have a good time. Staff is amazingly helpful, kind and knowledgable. Facilities are clean and atmosphere is pleasant. Pool table and fooseball with lounge area a nice touch. Definitely a strong recommendation for a fun day.", "date": "4/12/2015"}
{"review_id": "BoEQnS9sfnixsyDYEgrOWQ", "user_id": "brfVUC_WPPu8LrFI_66HGg", "user_name": "B B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Ok this is fantastic for all ages above 7. Lots of fun even for grown ups. Downside they need to keep up with the cleaning .... Bathrooms were dirty and though lots of chalk area look like it hasn't been cleaned ... They need to keep up this dept.bern there for s birthday and it was nice.....so rock climbing is a 5 star but the place is getting run down", "date": "3/21/2015"}
{"review_id": "1Rc3r359Bhuzs3FP7bPrLw", "user_id": "WSgEvA53hhRbd9a1acsIAg", "user_name": "Carrie P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the second rock climbing gym I have been to, and throughly enjoyed it! The prices are decent and the staff is super friendly! I loved how big the gym was. This gym is mostly for bouldering, but there are plenty of routes so don't worry! I can't wait to go again!", "date": "6/16/2015"}
{"review_id": "bekgkZYnuOYH-Hsz-i4kTA", "user_id": "zpqjL08nluzYml7viKr7rA", "user_name": "Chris S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My friends and I have been climbing for a few years now and have been waiting for a gym to open up closer. This being right in our neighbor hood is great. The staff here is great they know myself and all my friends by name. This is definitely the best gym I've ever been to. Everything is clean and the routes are outrageous. The setters are true climbers and challenge people with there routes. I've been to other gyms and most of the time the routes are sloppy and I can even skip two or three holds. Here they are solid,challenging and fun as hell.- Jon Sokol", "date": "10/30/2013"}
{"review_id": "z1wrTf7GXkmna0Ib7l1NdA", "user_id": "3QwuCrlhJ8jWGg8SUdwrRQ", "user_name": "Danny E.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just went back to top out and I decided I would try some of the walls that require harness and belays. I went to the desk to get my harness and Shannon came and assisted me with the entire process. She helped me on my first wall and she gave me pointers on what I was climbing. I really appreciate your help, Shannon and hope to see you again.", "date": "8/2/2015"}
{"review_id": "TqCJ0WzhmP9bQ48yddMT3w", "user_id": "XqdP42nc4q9gC6JqKanCIQ", "user_name": "Nick F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time climbing - loved this place!  We had never been climbing (always thought it was too expensive).  Found a deal on Living Social.  Anyway, we went early on a Saturday right when they opened.  The staff was very friendly and helpful; got us our gear, showed us how to use the auto belay devices, etc.Afterwards, my hands were pretty raw and they gave me some of their hand goop - so it wouldn't hurt so much.Two weeks later we came again with my son and a few friends for an unofficial birthday party.  We really had a good time again.  The staff was helpful to all of us.  Even though it was a little more crowded, it was still not so crowded you couldn't basically use any wall you wanted.  Checking their website I found they have special deal nights for students, ladies nights, etc.  This is a great place overall and I highly recommend it.", "date": "10/4/2013"}
{"review_id": "yeBzj7DZd6OcvZSB4jdQUQ", "user_id": "fDqIijPYpagyHsZBBlTztQ", "user_name": "Michele S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We love going here on the weekends and I am currently considering a membership so I can stop by a couple times a week after work.  The place is fantastic, in my opinion!  They have mostly bouldering problems, but there are some auto belay stations where you can do some climbing.  I love the routes and problems they set up, and they change them pretty regularly.  They also have a small work out area with weights and treadmills.  Like I said, I think I may get rid of my Y membership in favor of working out here.  :)", "date": "3/15/2015"}
{"review_id": "y5S4g5DM4F46hiHoYY8vtA", "user_id": "aGsJzn2fDfEMUnsJ8CHSUg", "user_name": "Melissa C.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I'm not an avid climber, but I do like to cross train when I get the chance. I normally go with my brother climbing elsewhere when he is in town so he can belay me. Given that I don't have friends that climb, I came here. The staff is great, the place is clean, but I would say this is mostly a place to go bouldering. They have a wall for the auto belay but it isn't much. I have climbed levels that are similar elsewhere, but it seemed off. I would say come here if you want to Boulder, because there isn't many climbs for auto belay.", "date": "4/3/2016"}
{"review_id": "7l_-VCbZwXC0n_xCNQr6-Q", "user_id": "Q4xYjjFoiYtAqfZJ7OjYfg", "user_name": "J.D. A.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing climbing gym! Lots of great bouldering routes and a great workout area. Definitely one of my favorites!", "date": "2/15/2015"}
{"review_id": "ZxsfBR49PJVxzA1LoB8DQA", "user_id": "QRRMR6f46O-b2aFLMWHPAQ", "user_name": "alicia q.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "More fun than we expected! Jah taught us well. Not as painful as I expected either! Definitely use groupon & they'll even give you a free week!", "date": "8/23/2014"}
{"review_id": "jlBE8UkiaGj-vW1XfLwtqw", "user_id": "5AeG-shetdLdTwiHqhT_pA", "user_name": "Sarah L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So. Much. Fun. Such a great facility, I'm totally hooked! The staff is super friendly and helpful.", "date": "6/29/2016"}
{"review_id": "3dnZ8l89cCereMn_AIIYlg", "user_id": "oMe4vx0MtfIDOQgzdgCMVw", "user_name": "Anna B.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great, fun, and friendly environment with a clean, easy to use, and dynamic facility.  They have great theme nights and discount nights so that you can try it out at a lower cost.  There are challenging courses for beginners and up.  It's a fun place to try a new sport and there are always people willing to help.  If you are at all interested in rock climbing give this place a try!  This is a great place to spend a evening with friends or to visit in lieu of the gym.  Parking is free and they have awesome hours!", "date": "1/18/2014"}
{"review_id": "gpeX3xrdEi1ReMrd-SFBtw", "user_id": "ssQ0DATLCVofn9pWg3-vTg", "user_name": "Lo I.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Got in some good climbs here. If you're ever free before 2pm, don't think anymore, just go. GO.", "date": "3/31/2014"}
{"review_id": "xAoZU_pbe5vuhCBoL0ZT7Q", "user_id": "UOtye_4hoDN4FiYnL34PbQ", "user_name": "Jean L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is great! Went here today with a friend. We bought two day passes and the package that comes with rental shoes, a harness and chalk! (Trust me, you NEED THE CHALK.) We paid $18 each. We got here around 3 p.m. and stayed for an hour or an hour and a half. We expected to stay longer but it's surprising how tired you get. The staff here is so, so SO nice. They're friendly, easy to talk to and easy to joke around with. Love a place that knows how to treat their customers! Their customer service definitely made the experience 10x better. We asked one of the staff members to take a picture for us at the top of the wall and he waited patiently for us to climb to the top! So nice. Will definitely return when I get the chance. A great place for kids, a great place to workout, etc. A+! Note: Go before 2 p.m. on a weekday and get the matinee price for only $7! I wish I had come a bit earlier so I didn't miss it. I got there an hour late :( BUT if you check in on Facebook, you get $2 off! Sweet.", "date": "8/6/2013"}
{"review_id": "t0cSn8vqtz628ke2AcIBPw", "user_id": "zOcONk4D8RUZNTJ06oPVcA", "user_name": "Kevin M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took the intro to climbing class and got a free week of climbing with the package. Caleb was a great teacher. This is mostly a bouldering gym, although they have about 8 auto-belay stations. There are no non auto-belay areas, so practicing belaying or working with a partner is not an option. I love this place and go as often as I can. Ages from two year olds to people older than me (I'm 62).", "date": "4/2/2014"}
{"review_id": "eImsXGhhELLL5rjR97J6ig", "user_id": "wAYmSRMQHIFCm9auEK13fg", "user_name": "Cassandra E.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My best friend recently had her 30th birthday here. I've never been indoor rock climbing before, and even though I was feeling a little under the weather, it was still an amazing time. The staff is great and the facility is clean, up-kept and welcoming.", "date": "4/3/2014"}
{"review_id": "N-PpyO01Vj0HV9GxfnLaKA", "user_id": "dHmE-8KAXHHxf_TUZJgeKg", "user_name": "y c.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a great time with my 3 year old boy. 3 years old is probably still a little young but the instructors there were very polite, accommodating and really stressed safety. Very approachable and took time to explain the difficulty levels of each climb area. We went on a Wednesday and the place was not crowded at all. Not sure how the weekends are as I assume there would be a lot more climbers there.", "date": "8/13/2014"}
{"review_id": "Wkq74vYmV7GNfABXGtnPIQ", "user_id": "5i1TWe5idYsD62GvserCtQ", "user_name": "Charlotte S.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I LOVE THIS PLACE! I save my 5 stars for the best businesses. This place has an amazing selection of climbs even for a novice 5.7/V0 girl like me and still a good selection for TOTAL beginners (5.5/VB). Their best selection is in the 5.10-5.11 and V3-V9 range. It's huge and airy and when it's not actually broiling outside (80+) the fans keep it just cool enough to work out (not cold, and not as good as an AC, but you make due). I really love the auto belay (though I do miss the teamwork of real belay) because you can climb by yourself and its less scary for a lot of beginners than trusting a person to hold them up. There is more variety in the free climbs too and I find climbing up and over the top of a ledge much more satisfying. Between routes, I love playing at the fooseball table, the pool table, using the cycling machines or the treadmill, and just chillin on the little couches. It's a great way to take a breather or finish off a trip to the gym. Their store is also super cute with quality gear and supplies. Other rock gyms in LA are smelly, small, and a pain to drive through traffic to get to. Top Out is truly TOP TIER.", "date": "10/1/2015"}
{"review_id": "91uQHt08yDHlimpmg9srdw", "user_id": "PAY7jkEKcSwM4j75Mw3iuQ", "user_name": "Mac And Cheese G.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Got my membership two weeks ago. Price is very affordable. They give discounts for college students. I love this place!", "date": "1/26/2016"}
{"review_id": "UzohfvMbIQNt1SrqSIQPJg", "user_id": "95ZdUPaqlU046YyHHLDrEQ", "user_name": "Dana D.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing.  Ive been to a bunch of rock gyms, and this is one of my favorite.  The bouldering has a wide range of levels, extensive problems, a ton of wall space and a lot of longer problems.  The staff were very helpful and friendly.  We are visiting the area and they helped acquaint us with some outdoor bouldering areas.  There are about 5 top rope lines at about 20 feet high.  And couches in the middle with a fuze ball game set up, if you want to chill.  We loved this place.  Best indoor bouldering I've experienced in a while.", "date": "1/20/2016"}
{"review_id": "1dyTEbCzrwKkPmmat3_3ew", "user_id": "ol9EpAz84itYd3qjExFGSw", "user_name": "Madison F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! I went with a friend yesterday and we both had a great time. Friendly staff, clean facilities, great equipment. I personally am more comfortable with the harness and belay walls rather than the free standing boulders but I did like both! Very challenging workout...I heard one instructor say that 15 mins on the wall is equivalent to 1 hour on the treadmill!! So not only is it a fantastic workout, I had so much fun doing it :)", "date": "9/17/2014"}
{"review_id": "zD3zAVwWaYim2Y4jFKEiDw", "user_id": "ePNXzJDE0qGPyq8x3FQnLg", "user_name": "Bob C.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my son and six of his buddies for a 12 yr old birthday and it was great. Facility is fantastic - this was late morning during the week and there was plenty of room for everyone. Staff was great and they provided a nice room for our pizza and cake. Fantastic place.", "date": "8/4/2014"}
{"review_id": "FtDLO3hGXqBiCnDs9hiqGA", "user_id": "L4rQOq0OyKlA7lRJ0TTO-Q", "user_name": "Michelle R.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "LOVE this place! Thanks to Olga I found a great place to climb and I dont even have to know how to belay...Although I still want to learn to belay to take it outdoors...I can come here by myself and climb because they system is an auto belay!! Fun place they had a disco night when I went and if you dressed up you got a discount to enter...", "date": "7/18/2013"}
{"review_id": "DPZ1-2yxi-q9lhpvY5wEXg", "user_id": "svUHHQY-eOqdjhCMNU7sFw", "user_name": "Tanya M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Had a great time with the kids here last week.  I had never been climbing before and the staff working that day was super helpful!  Got us all hooked up and gave us some tips before we starting climbing.  They don't hang around and bug you but are there if you need help.  If you go before 2pm on weekdays, it's half price.  Great workout!", "date": "7/31/2013"}
{"review_id": "erXfIwUyGVMIBYHW6gspPw", "user_id": "Nm_UlElsrl0I2uWwDS9WzQ", "user_name": "Matthew F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome...thats it. See you on the wall.", "date": "1/18/2014"}
{"review_id": "IcrRwKBhAEiP4gwCNVcczg", "user_id": "An5fKxihsWoPxxFNpmCnhw", "user_name": "Tania K.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Top Out during their opening weekend and had a blast.  My husband and I are pretty much beginners (we've both climbed before but not regularly) but I think we did all right thanks to tips and pointers from the helpful staff.  We stuck mostly to the easy top rope routes but there is a large bouldering section that we'll have to try out next time.  There is also a yoga studio upstairs and a slackline too (also looking forward to trying that out next time!).  Overall, the place is fantastic...it was easy to park, clean, safe, and offered a fun climbing experience.  As novices, we did not feel intimidated at all and the auto-belay devices made it easy to get started without remembering how to tie the figure 8 knot.", "date": "6/26/2013"}
{"review_id": "3BDn23IJqy-njBCXHw9AcQ", "user_id": "MXNj6bt34KWw6MH9aqLs7A", "user_name": "Alejandro R.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "huge gap between climbs for kids and climbs for professional climbers.  the foot holds have a lot of slippery rubber worn into the gripping surface making them slippery.  my knee still hurts 3 days later. my friend said she ran into the same issue on a few other climb routes.  the boulder wall that's way in the back doesn't have a top or a platform to it so you are forced to either jump down or climb back down once you reach the top.  I saw it as odd as to why no one was climbing it then I saw why once I got to the top.   kids and their moms take over the auto belay.  mom's like to clip in and then just stand there and watch their kids on the auto belay next to them; if you're trying to climb the auto belay don't hold your breath.  at least reading this as a heads up as far as what to expect is going to help make your visit fun.   if you don't really want to do auto belay then you'll be okay", "date": "1/10/2016"}
{"review_id": "vxhWqrARJ7h4Un9A9FDi0A", "user_id": "-4wqYky0o5GMb5cXrP9LSw", "user_name": "Killer A.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is Awesome!!!!! I'm a basic first time climber and let me say , the staff is very friendly and helpful. They don't make it seem intimidating at all. They'll explain everything to you down to your silliest question. All the \"regulars\" there are also very helpful. The equipment is all extremely clean and very well kept, actually the hole place is extremely clean and well kept. I would recommend this place to anyone, even if you think you don't want to climb just being there in that amazing atmosphere will make you want to get on one of the walls and go for it. The only downside is I thought the actual building was hard to find. Other than that I could go on forever about how awesome this place is but all I Gota say is GO THERE FOR YOURSELF AND TRY IT OUT!!!!!", "date": "10/23/2013"}
{"review_id": "2uZUC_-x1zVRP1sYLdwF2g", "user_id": "GaR6LMp0tRPBVkCJDewx8w", "user_name": "Wendy H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is very friendly and helpful, they genuinely enjoy what they do and it shows.  We really like Top Out and recommend it for anyone that is new or a seasoned climber.  Lots of fun to be had there!", "date": "7/26/2015"}
{"review_id": "FhBm61P2MnRFNZAeaWi-eg", "user_id": "FrX9g4b5T3eSDt3fBs7aaA", "user_name": "Christopher P.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the closest gym to where I live and I had a membership for a year. It's very well run, bright, and excellent for beginners too. I made friends with a lot of the staff and came here frequently for a while. It's just a really well run rock gym. No lead climbing and no belaying, they only have bouldering and auto-belay. They do have a good small-ish area with treadmills and other exercise machines.", "date": "5/24/2015"}
{"review_id": "-cdsoJMWGA5gd5LU9tAP5w", "user_id": "X7DnBN_jnQJMYN7GlNB8Bg", "user_name": "Storm W.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my 4 year old son , and my first time at a climbing gym I have to say very friendly staff and a great experience for my son and I !", "date": "8/18/2013"}
{"review_id": "IYumaL_IuTNQLXS8ajzUJA", "user_id": "qw-EoIY_dSwe4RRJZvQJAA", "user_name": "Bridgette C.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just started climbing because my friends brought me on opening day and it has been a great experience! I've learned so much and had a great time doing it. All the staff is really helpful and friendly and the yoga classes are an awesome plus. The space is really nicely laid out and you can't help but enjoy yourself with all the different climbs. Definitely check this place out whether you're looking for a fun new experience or a seasoned pro!", "date": "6/26/2013"}
{"review_id": "dMpm6YdFZLwTGWzAHzENEQ", "user_id": "cXteuU2LB7ba_jDPKI-B5g", "user_name": "McKenzie L.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Wanted to like this place, but not for me.  Got a deal on the intro class through Groupon and had an awesome class with Mo.  However, I was looking for rope climbing, not a fan of the auto belay.  The climbing routes were minimal, and the walls are not as high as I was hoping.  The gym seems to be more geared towards bouldering, not climbing.  But, if you don't necessarily want rope climbing, this could be a great place, again, just not for me.  Everyone was super nice and welcoming, and I liked that they gave a free one-week pass after taking the intro class.", "date": "12/20/2014"}
{"review_id": "7lhCmgLTtpF3llpf2Ytssw", "user_id": "JmCNQ_Sbq24UPk98-dbwIA", "user_name": "Alex F.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Got the yelp deal, check it out.  It is a nice place, not too crowded.  I got a 10 visit pass and I am coming back for more.  They have a pool table and giant jenga for the parents, if you bring the kids.  Less crowded than other gyms I have been to in the LA area.", "date": "1/1/2014"}
{"review_id": "zIJG5KeoMF_DwgctLzyxMQ", "user_id": "7saUZxDiHx7AZ5eVnVRLow", "user_name": "Steve M.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time here last night.  I have been to a climbing gym once before, and this one kicks a$$.  Staff was very cool and friendly.  Once a month (last nigh was that night), they serve food and drink to the climbers.  They have 7 auto-belay systems.  Huge amounts of bouldering walls.  They also have a slack-line, pool table, and what looked like a Jenga Game made with 2X4's.  Matinee price of $7 before 2pm M-F is great, since that is when I'll be climbing!", "date": "9/19/2013"}
{"review_id": "zXir8HD35WVb3ot5bPIfig", "user_id": "zaeztwvBnbAlCuoE4aYalQ", "user_name": "matthew b.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been excited about this gym since i first heard about it last winter.  I signed my son and I up for a year and we love it.  I'll have to add my daughter.  It's a great place to bring the family.  The walls are great!!.  The slack-line is always well loved.  My only problem is my age and my strength.  I hope to continue to show up to this great place and will bring as many friends and family as i can afford.  Honestly, this is worth every penny.", "date": "6/26/2013"}
{"review_id": "cqEj7SEpQkPWGiaFgPxZYw", "user_id": "r9lM0FQqBm8t3XRwkAxDeA", "user_name": "Stacy H.", "business_id": "GibVU4INC2Y9DuNk7_mOdg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Our family LOVED climbing at Top Out Climbing Gym!  My hubby & I brought our 4 kids for the Family Night held on the last Friday of the month.  Our kids are 7, 5, 4 & under 1yr. (kids have to be 3 or older to climb so baby was a spectator only).  The staff was awesome...friendly, helpful and made us feel right at home!  We are beginners with almost no climbing experience and had no problems getting right into it!  The equipment was in great condition, the gym was clean and well designed, there was even a pool table, foosball, & couches for when you need to rest.  The owner & staff were visible and available to help, but not obtrusive in any way.   We stayed for almost 3 hours and my kids said \"Can we come back everyday?\" and \"Make sure you put family night on the calendar so we never miss it!\"  Even the other gym patrons were amazing...neat community of people!  My 4 yr. old didn't want to climb very much so he ended up playing Foosball with a few college kids who were sooooooo sweet to him.  We will definitely be back and hope this place never loses its relaxed and welcoming vibe.  Thanks for the best Family Date Night so far!!", "date": "9/2/2013"}
