{"review_id": "KtvnGa8h9bhwLiQPbjrkvQ", "user_id": "jvAYoHTfygQJFCx0FYgxqQ", "user_name": "Rose R.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very friendly staff! Nice variety of routes, something for every climber. There was also a weight area and the bathrooms were nice and clean.", "date": "4/16/2019"}
{"review_id": "r10m7sixaDbT-_yQy8-MOg", "user_id": "5WNpVilRzHWPky9uZNsQtw", "user_name": "Coleen J.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I'm so happy that this gym finally opened up! I used to always go to LA Boulders but now I've been going to Verdigo a lot because Burbank is a bit easier to get to compared to Los Angeles! This gym will eventually offer the same amenities as the other Touchstone gyms but right now it's still under some construction. PROS: - new facility with fresh and interesting walls- friendly staff just like at all the other Touchstone gyms! - although there are no top outs, problems are still very challenging and exciting! - added new seating area in the entrance and it's a great place to eat a quick snack or work a little between problems - convenient area of Burbank with a lot of food options - convenient parking structure right by the gym! - hasn't been getting too crowded CONS: - currently not all amenities are available - hard to smear on the walls because they're very slippery - black rubber soled shoes leave marks on the fresh walls - a bit smaller than the other gyms - no top out problems", "date": "3/17/2018"}
{"review_id": "hE1Iexjmcr9Zk3E8Bo59sQ", "user_id": "1wgdfrsfieIl5OiZd1eHJw", "user_name": "Iva I.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "This gym is smaller and a bit stuffier than its Touchstone counterparts in SoCal. Like the other climbing gyms, Verdigo Boulders has a mini gym and cardio machines, but it lacks fitness classes, only offering a daily intro to bouldering class as well as an occasional fundamentals or technique class. I come here mainly because it's nearest to and least trafficky from my house, so I can squeeze in a quick climbing session in a time crunch. However, if given the choice and an unlimited amount of time, I'd probably choose to go to Cliffs of Id, LA Boulder, or Hollywood Boulders.", "date": "5/27/2018"}
{"review_id": "kEGXyEV2sXnK-L0yTqe34g", "user_id": "hDH_9mlCUmbKDJ9ZIgDALg", "user_name": "Anna C.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Decent climbing gym... definitely one of the smaller touchstone gyms in la. The gym is about 20-30 percent smaller than lab or Hollywood and about 20 percent fewer amenities. No sauna, always runs out of towels, no cardio machines etc... The climbs are on par with other touchstone gyms - a little less variety than the others due to smaller location. It's a decent place to climb - but if you want the full climbing experience consider checking out cliffs of Id instead...Parking is a breeze... but WiFi leaves much to be desired - very slow...", "date": "4/9/2018"}
{"review_id": "OO324roWWjyc12wciOZBkA", "user_id": "oe4hJAevffrd8mQvd5JM9g", "user_name": "Sera G.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Finally! A climbing gym in Burbank! FYI-- as of the time of this review, it's only a \"soft opening\" for members of other Touchstone climbing gyms (so, no day passes, etc). Half of the wall is done and set with problems, but there's still lots of work to be done before they have the rest of the gym and facilities ready to go. Whenever that will be... I have to commend the staff of this gym though to let us Members climb around while they get everything up and running! Especially for those folks like myself who have been rabid for MONTHS waiting for Verdigo to open! So, the nitty gritty only because it's the soft opening and I am sure the best is yet to come. Technically Verdigo is a bouldering gym, no top roping here! The walls have a lovely color band design, the problems so far have been really fun, the limited facilities that exist (locker rooms/shower/bathrooms) are really nice, and the staff friendly! What more can you ask for other than finish up! Looking forward to giving you guys a more full review once you're open for reals! Five stars because I'm so excited and you guys killed it with your soft opening!", "date": "12/29/2017"}
{"review_id": "vEavQTskAiXIwT52m1h2hQ", "user_id": "L2MVxXahCzxAQVM8uO7W7w", "user_name": "Emily G.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "I have been waiting nearly a year to climb at Verdigo!! After much anticipation, I got to climb during the soft opening. Because it is a soft opening, the hours are from 6pm to 10pm. They were a little bit too crowded for my taste. There were ample amounts of problems on the walls. However, they were wayyyy more cramped and overlapped than usual. The grading on the problems seemed fair, but I think the degrees and angles of the wall made them a bit more challenging than the problems you would see at their sister locations such as Cliffs if Id or LAB. The size of the location seemed comparable to Hollywood boulders' back wall. I think I hyped but this location. I thought there would be a better parking situation. And I thought it'd be more detached from the DT Burbank scene. (I also think it's strange that it's called downtown Burbank. When I was a kid it was just Burbank Mall. Lol) The facilities are clean and well maintained. The locker room only had a few lockers and two shower stalls (maybe wrong on this number). Perks to getting a membership now (before the grand opening), they waive the 125 initiation fee. Pros: I love the climbing community. Everyone is super helpful and they look out for you. Yea there will be some jerks out there but overall they're good people. I also love than this gym membership can be used at any of their gyms. My friend planned a road trip two summers ago where she went and climbed at all of their gyms in NorCal. #goals Also, they have yoga classes, the occasional salsa class (mostly during Feb. at the Cliffs location), rando tacky prom nights, free guest passes, etc.Cons; classes are not offered here yet. Parking situation is a bit cumbersome. Smaller facility than the other locations. Crowded.", "date": "1/8/2018"}
{"review_id": "5lQWK_Pb50OWYvEHSZglbw", "user_id": "nH8HzjEDO9_qAxszoPpgtw", "user_name": "Kate O.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "How convenient it is to have a rock gym right in the middle of town! The bouldering-only gym isn't huge but it does the job if you want a close-by spot! There is a fitness area with weights and training boards and they have a couple treadmills/elliptical out front. Some classes but not many.It isn't massive, especially compared to the other Touchstone gyms in the area.But PARKING! There's a garage attached. Heavenly!", "date": "7/5/2018"}
{"review_id": "lkySZ1Lo4h-hbcT0OJH-xQ", "user_id": "jXCHvrz9WzYPAMsCiXLO2g", "user_name": "Slim Y.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 4, "useful": 0, "funny": 2, "cool": 0, "text": "Their staffs here are really nice and helpful! I just signed up for a membership at Verdigo this month. I initially signed up because my 7 year old really wanted to go bouldering ( she is free with my membership ), but was surprised to find myself having fun climbing with her. Since I've only climbed once before signing up here I was worried that I would feel out of place, but their staffs made me feel welcome every time I go in for a climb. If you are a beginner like me you could sign up for their intro class ( free for members ) where you learn the basic safety tips and how to get started. There's a free parking in the structure around the corner which is really convenient. The facility is new so everything is nice and clean.Overall friendly vibe from other climbing members I've encountered in this gym :)", "date": "4/19/2018"}
{"review_id": "cdNMQpTBZEcY-ScXcOMZ-g", "user_id": "xyTkLiw0iCBAVi9thHB3Wg", "user_name": "Madison Z.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love it here!With my anxiety about parking, I hate trying to find a spot at LAB. Vertigo is the same distance from my house and has a lot of great routes for beginners (which is definitely me!). The staff is incredibly helpful and friendly. One staff member helped me try on some shoes in their retail section and explain to me how they should properly fit. When we couldn't get quite the right thing, they recommended I go to another store for a more specific product. Being the newbie that I am, this guidance was so appreciated. The whole gym is really clean, well lit, and has free and easy parking at a garage on the other side of the block with an entrance near the gym.", "date": "9/22/2018"}
{"review_id": "WKXpWmgULnnUAmRuWi9QWw", "user_id": "nBzwAhatr48LnLe4eouH6A", "user_name": "Abbie R.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "If I could give this -5 stars I would. Let me start by saying WORST!!!! customer service. I don't know the name of the guy, but to be honest the way he treated me I don't know it anyways. I walked in hoping to be informed about the facility but I was talked to like I was an idiot for not knowing the place ?!? \"You've never been to a boulder climbing gym\" UMM NO SR I HAVEN'T CLEARLY !!! And all I asked was what are the hours because it didn't say anywhere inside or the flyers and he said \"the hours are posted on the door but I GUESS I'll  read to you\" I was offended because I could read. I was so ready to sign up and become a year member but his dusty ass won't have any of my moneys !!!!!!", "date": "5/30/2018"}
{"review_id": "rGwVbUTDMjoD-eO-ElBmzQ", "user_id": "A4JoXQbQ-q1WjEFZ_WrIqA", "user_name": "Joanna H.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Bouldering gym on the smaller side, but nice, bright, clean, chill and generally less crowded than others. Unlike what another reviewer mentioned, there ARE cardio machines. Lots of extra amenities typical of climbing gyms like nail clippers, lotion, band-aides, shampoo AND conditioner, even locks for the lockers and a bike lock if you've left home without yours.", "date": "10/11/2018"}
{"review_id": "iPM0JYTN13YL3-WNnSHTAQ", "user_id": "RXg_Vtf39aeQREn5dAdA2g", "user_name": "Harrison T.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "I love bouldering. I'll climb pretty much anywhere and anything I can. That being said, I've been to a lot of gyms and Verdigo Boulders has to be one of the smallest I've visited. It's certainly much smaller than the other Touchstone gyms in Los Angeles. As a result, it gets incredibly stuffy inside. The walls are what would be really bright, pretty colors if they weren't so grimy. On the plus side, the traffic in and around Burbank isn't quite as congested as that near Downtown. All in all, I'm not opposed to climbing here, but this definitely isn't my first choice of gym.", "date": "6/1/2018"}
{"review_id": "bGrhuhYOANkCm25oEb2tRw", "user_id": "uyAP7keYu1C5nDhdWOF0pw", "user_name": "Sheri W.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'd heard rumors of a climbing gym opening in Burbank for forever, and I'm so glad it's this one. After taking an intro to bouldering class at LA Boulders, I got a membership, and I've been hitting up Verdigo at least twice a week. They just recently completed setting everything up and now have full open hours. The staff here is super nice, the boulder problems are of widely varying difficulty, and I'm looking forward to improving my climbing skills here.For now, they don't have classes or a weight room at this location, but the plan seems to be to add more stuff soon.", "date": "2/9/2018"}
{"review_id": "xtIR59nf7vTRE2hnHwAiNA", "user_id": "uF4IOKp_I2TIN5kwmFTbew", "user_name": "Ethan H.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good location, still very very soft ratings. If you climb out door V5+ just ignore the ratings or assume they are all 2-3 grades soft. Hope they set up a legit training area in the back space or just set a variety of holds on the 40º wall.", "date": "3/27/2018"}
{"review_id": "OT2aqBpT_zeY1_qkXwI_BQ", "user_id": "bWPcQ1QGSnjkLBFe3D0bhg", "user_name": "Sam C.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym! Although it's a little small, it's set up very nicely! Every time I come around Burbank, i'll be sure to stop by!", "date": "4/3/2018"}
{"review_id": "ZeJ7YRIHCocJ4Ljckz7JHw", "user_id": "X0RdLOv4ehfDQlvPgXtm7w", "user_name": "Brian C.", "business_id": "qSsjmHbBK1eJZm2Z5DmTRQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to climb and much more convenient than driving to Hollywood and LA. Friendly staff and usually a great selection of music playing in back.", "date": "4/14/2018"}
