{"review_id": "njpXAyJToSogo3E78Ut_Lg", "user_id": "-tzm_K3meWHUdOe_vi1Pbg", "user_name": "Soren B.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Many of the best times I have had since moving to Sonoma County have been while climbing at vertex with my friends. I find the layout and interior of this rock climbing gym to be more appealing than other rock climbing gyms, but I can't entirely wrap my head around why. Right when you walk in on the left, there is a bouldering section right there as well as another larger bouldering section in the back, and ample variety in rope climbs. They also have three automatic belays which is great if you happen to be waiting for your friends to arrive (it's also nice to switch it up every once in a while). This place can become rather packed, especially after 5 PM, but there is so much climbing space that it doesn't really phase me. If you plan on going often, I suggest getting the punchcard because you'll be getting a better deal. Best rock climbing gym I have been to so far.", "date": "4/6/2019"}
{"review_id": "F5UPpujkPAxqNrbRdIn7DA", "user_id": "VW0lOndvhlle8ZTYDoTWvQ", "user_name": "Gabrielle B.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I recently got into climbing and my friend and I decided we would like to go to a class to work on our technique because our college doesn't offer classes. I went to a class with Steven called Movement and Technique and he is AMAZING! Such a positive man and seems to love helping people. He is patient and has a way of making you feel like you're doing great even when you aren't. I decided to go back because of how awesome Steven was. Here's where it gets tricky- I went back about 2 weeks later with my coworker in the morning to climb because we learned that we get into Vertex for free since we just got the job at our school's climbing wall. We walked in and the lady at the front desk acted like we were crazy for saying that. She then asked a lady named \"V\" and she confirmed. We asked for harnesses and shoes and V acted like we were incompetent for asking that. We then waited about 20 minutes for our belay test because V was changing the music instead of helping customers. Once she asked us to start belaying she rudely said \"Is that how you learned to belay?\" to my friend who hadn't even started yet. V then did an \"accidental fall\" where she yanked the rope as hard as she could and pulled me across the floor and jammed my knuckles into the counter. I now have a bruise. V is completely disrespectful and doesn't seem to care about anybody but herself. She acted like people who didn't have their own equipment were dumb and didn't seem like she wanted to help us.", "date": "4/9/2019"}
{"review_id": "OuY-tuo51Nja4FZmOhym-A", "user_id": "zmWGkNHfIx78lrlZ1sggDQ", "user_name": "Colby W.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 4, "useful": 1, "funny": 2, "cool": 1, "text": "I'm pretty sure this is the only climbing gym in Sonoma County. They've got a weight gym upstairs, that is usually kind of disorganized and sparse in weights, a patio backyard area where they do Pilates, and the main ground floor room with all the routes.They've got everything from 5.6 to 5.11c I believe. Staff is very friendly, and helpful. They have rentals for those who have none of their own gear. My main problem is all the B.O. It blows my mind that there are still some people who have this problem. It's such a big personal problem, with such an easy solution. I guess some people are just animals.", "date": "5/6/2018"}
{"review_id": "5Q0CMSAr4dK2ZAma2dN0mA", "user_id": "PflhSwBrvN39mwq4A3Crgg", "user_name": "Rebekah V.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vertex climbing center is a very special part of Sonoma.  I lived there for a few months and spent 4 months as a member before moving to San Francisco.  The community, the vibe and the energy of Vertex are absolutely incredible.  I felt at home and welcomed.  This was the first place I felt like I had met other souls like mine.  The community events they do and the focus they have on being sustainable makes them one of the best climbing gyms I have been to.  If you have questions on the equipment or climbing techniques, ask anyone around - the staff and clients are all excellent. Much love to Vertex family!", "date": "2/8/2019"}
{"review_id": "mFo7ru3scEpS2-G_Vermkw", "user_id": "0k5Jlo_8HG8gHf0J1z3ftw", "user_name": "Sharon S.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My six year old son and I went yesterday for a birthday party. He had a BLAST!!! One of the employees, Carlo, made our experience very special. He was super friendly, helpful, encouraging and passionate about his job. He is a dream employee! We will definitely be back!", "date": "1/28/2019"}
{"review_id": "_cLCkxUeH4Df5nb_oSyS8g", "user_id": "I1dxxhHkUQxmGsbHbLbmiQ", "user_name": "Monica K.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Vertex rocks! ;) the people that work here are very friendly and I can tell that this is a very caring community. I am a member here so I was able to go to the yoga and Pilates class, at no charge because it's covered in the membership! Both classes are fun, I enjoy the Pilates better. Most of all though I enjoy climbing the best.", "date": "8/17/2018"}
{"review_id": "pgfASJxYcXAZW_XAmgBIKQ", "user_id": "EkcuqkGC2SQqgJcxG_AfoQ", "user_name": "Mrs. E.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kids love it here. Nils is a great private instructor!  Wonderful local awesome place.", "date": "10/19/2018"}
{"review_id": "sdVeBUp4UWcC9RPYCo2P0w", "user_id": "AdnL1ZEYB3S2a8iWzQJSyA", "user_name": "Anisa A.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "If you're looking for a fun way to get fit and stay active - I'd say, this is the place.The yoga and Acro yoga classes are FIVE STAR classes taught by a FIVE STAR yoga instructor.The community here is incredibly welcoming and encourage you to try new things and test your endurance.There is a locker room with showers. Even a room for birthday parties.", "date": "10/22/2017"}
{"review_id": "GGGn57s8PqNdVgG2Nn4dzw", "user_id": "5Xb9O-Meg1rpNUfNVwJxPw", "user_name": "Courtney C.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 1, "useful": 4, "funny": 1, "cool": 0, "text": "Service at the front desk was horrible. The women named Rachel was working and asked me to fill out the waiver. I did and waved ro let her know i waz done. She took two people in line and had a long flirtatious conversation with her friend that was using the center before finshing my transaction. Then when she was finally about to process my payment and give me rhe punch card she stopped and answered the phone and had me wait again when she could have just given me the card i had already just paid for. It was my first time there and i felt very uncomfortable in this situation. It sucks to because im a black women and when service is this bad i feel very alien and unwelcomed in the space. Unfortunately this is the only climbing center i could find in santa rosa so i have no choice.", "date": "12/18/2017"}
{"review_id": "97np66jKhRGxnGMpZB_rNA", "user_id": "D5P9LBQ6Js4LCun5bDL7Pg", "user_name": "Lily G.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place with a great community. Good routes and a great staff. I would totally recommend this gym to anyone.", "date": "1/21/2019"}
{"review_id": "mQXs7Q5WO6NOvoc9-B7hbQ", "user_id": "Hwf7hdKRNCtANo62LnpHgQ", "user_name": "robert b.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "So, where do I begin. I recently went to Vertex with my two young daughters and girlfriend for a little climbing. I have been to Vertex with my kids about a dozen times or so over the last year, my girlfriend is an avid climber. Upon getting to Vertex the nice guy behind the counter asked me several times about my belay card, bordering on the absurd (I did show him my Vertex belay card). While getting ready the young man came over and asked to see my card, he wanted to see who actually issued me the card, keep in mind that I was getting ready, it wasn't like he saw me do anything wrong and he was double checking the validity of my belay card. I don't look like the typical climber, I'm 6' 240lbs and of the darker complexion (my people aren't the typical climbing type). At this time I felt I was being harassed, or at the very least accused of doing something. I let it go, but I watched other people entering in and not once did he ask to see a belay card from the white members (I know, I said it), and one of the guys I knew and he wasn't an avid climber at all. I spent good money to take the class to get my belay card, punch cards for my daughter, and drop-in fees. I'm a little offended at my treatment, and I don't know if it was related to my color. I have had this feeling before when going into stores back in my college days and I was the only one asked to leave my backpack at the counter, so you get my drift. I find that the staff there are hit and miss, arrogant and self-absorbed at times. In all fairness, I did try and contact the owner Gorden Cooley to talk to him before posting this, but my msg. fell on deaf ears, but in all fairness, I had to give the young lady who took my msg. my number about ten times before she got it. In my over twenty years of being in the outdoor industry I have learned a few things that I believe are true about this situation. One, this falls under poor ownership & poor management category. Two, the staff at Vertex has no direction, or work ethic. And finally, management either doesn't see it, or fails to do anything about it because they behave in the same manner. The new owner has steadily raised his dues since he took over and most of the members haven't seen any real improvements on the \"Vertex Experience\", maybe he should use the money to get better staff. Ultimately the new climbing gym coming to town will be a breath of fresh air, and I'm sure lots of Vertex members will be making the move to the new climbing gym.", "date": "11/14/2018"}
{"review_id": "jpOxvVudYuk87yORjVfpBQ", "user_id": "z3BX1WHnz78bcVj7UQO64w", "user_name": "Juan T.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My 9 year old loves her climb time and has been going for over a year now, doing regular weekly classes and the different camps they offer. Seeing her climb is a joy to me and good time for her.", "date": "7/24/2018"}
{"review_id": "98egMkhOxiRGwydIgQolmQ", "user_id": "j0MjOLIORBKaArWKJHfDbA", "user_name": "Linda J.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 2, "useful": 2, "funny": 0, "cool": 1, "text": "I'M took my 3 year old Granddaughter here last Sunday for the first time, from the gate the front desk experience was bad, I felt like I had to plead for some assistance in helping her get started once I signed the waiver and paid the girl at the front desk, long dark hair with bangs seemed like she'd really rather  it be there and was not assertive in the least, she found a harness for her, and a father nearby questioned me as to the fit of the harness, he felt it was too big, we finally, after about 30 minutes of more got the same girl to assist in something my kiddo could actually do, she got one good climb and she was done, she's a three, a little young maybe but it was fun for both of us but the service sucked", "date": "2/15/2018"}
{"review_id": "tDPOTIkB7WXalBZdgGkW8w", "user_id": "dupnzUdvxrXanj7MCrHd5Q", "user_name": "Eric F.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We got our 6yo climbing at Vertex after we couldn't get her down off the trees. She loves the gym and looks forward to her class each week. Her 8yo sister decided to try and now it's a \"sister regime\"  each week.. Great place and builds confidence for your kids ( and maybe the parents )", "date": "3/11/2018"}
{"review_id": "qQtiK7_TMFBIf5RdJRVGFQ", "user_id": "DsMAHJyjYc-dL5AnV4Dxlg", "user_name": "Mike B.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love it here.  Everyone here is incredibly friendly and helpful.  Training at Vertex helps me send routes outdoors with confidence, and crush routes at other climbing centers (I'm looking at you Planet Granite).  The owner, Gordon, is so amazingly friendly and humble I didn't realize he was the owner until I had been going to the gym for almost a year.  If you want to begin climbing, take your indoor climbing outdoors, or climb at that next grade, try Vertex.", "date": "3/25/2018"}
{"review_id": "yGcaKqu7AcwLtB-bOl5Dtw", "user_id": "jw0XNu_gWTTwEkGw2wHwRQ", "user_name": "Karen K.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 2, "useful": 9, "funny": 0, "cool": 0, "text": "I had heard about this place from a friend and called to see about pricing etc. I was told I needed to sign my 5 and 9 year old up for a 2 hour beginners class 25$ each. I was excited and signed up too over the phone. My excitement quickly changed to feeling not welcomed after arriving. I walked up to a girl at the front desk to let her know I was ready to fill the paper work out before class started. She rudely told me someone will help me. We fill out the paperwork and then just were standing around with no info or guidance on what to do next. The same girl thought I needed something from her and looked up rudely and said what's up guys what can I help you with. She seemed pissed to be at work. And incredibly annoyed with me. Then after we met our nice instructor I realized there was no way I could climb and watch my boys as well. I gave my harness back and was promptly refunded my 25$ portion. The instructor worked with my boys individually some but only one could climb at a time. Then new people showed up and he left. We were able to use the climbing that the boys could climb on their own but other times of the 2 hour \"class\" we stood around. I was was disappointed as I had heard great things about this place. I will not be back and didn't feel it was worth 50$ to have my kids just stand around and to be treated with rudeness when we first arrived.", "date": "2/21/2016"}
{"review_id": "OSd9rZN0IizfIhLPiK8uTw", "user_id": "hJeQYfE7pHnPowxpoBsx1Q", "user_name": "Lauren F.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "I've been climbing for 4 years and this gym is what I've been looking for. I was a volunteer and member at SLO OP in San Luis Obispo and after I moved recently to the North Bay, I've been searching for a solid gym. THIS is it. It's a cozy little gym that has super friendly people and the routes are challenging. I was climbing V4's, V5's, and V'6s, but when I started climbing at this place, I'm down to V2's and V3's. It's like outdoor ratings. This isn't a place for the lazy climber... you definitely get stronger and better climbing here. It's all about feet work. I love that they change the routes pretty frequently too. Good place. It reminds me of the climbing community in SLO.OHHH, and if you're an employee with REI, Agilent, or other nearby companies, you get a discount off your membership :)", "date": "7/19/2012"}
{"review_id": "d0fQbuWUL3MAu_IKZenVdQ", "user_id": "b-EP0vh5yKs8WNptdAnhMA", "user_name": "Sierra F.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "What a great community! The perfect place to workout while working on skills-love the lunchtime crunch time class. I always feel welcome when climbing or working out up in the gym. Definitely recommend getting a membership and joining this community.", "date": "1/31/2017"}
{"review_id": "b1YJcd1jsrWov-EbjU6j1w", "user_id": "4OncEifistVHOIDzHOieww", "user_name": "J. F.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "I am a current member here. In general the staff is really friendly and always greets me. I often bring first time climbers here to just show them what I do for my workouts. They do have a lot of great events and comps. Routes are fun, people who climb here are friendly.The reason why I rate at 2 stars:My experience today with a female staff member was terrible! She was so rude to me and my friend, in which it was his first time at this gym. Great first impression- NOT. I usually frequent this place on the weekdays during the evening- never the weekend. So I was so shocked at the lack of professional customer service this girl had shown to myself and my friend. Even though she was a bigot to my friend and I, I told my friend to come back with me during the week when I know there is better staff on hand who are much more friendlier, helpful, and actually have a smile on their face!", "date": "11/10/2015"}
{"review_id": "M62a-pW8UMXODmmtTAl3mQ", "user_id": "eh5xSPZFD81Et4EBLnT-qg", "user_name": "robb d.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 3, "useful": 0, "funny": 0, "cool": 1, "text": "There are two types of people that work in the service industry when things go sideways.  One could care less if a customer stays or leaves and isn't shy about conveying contempt. The other proactively tries to resolve an issue to keep the customer.The young woman I dealt with today should consider a career change or her employer should do it for her unless they like negative Yelp reviews.  Joao, on the other hand, is an asset as he personally helped navigate a positive outcome and a great experience for our group.My experience with rock gyms in fours states over more than 25 years tells me the climbing community is small, friendly, and helpful.  Small businesses like these places can't afford unnecessary liabilities.", "date": "10/2/2016"}
{"review_id": "hEVFleu5JhWEPEMf0QIXfA", "user_id": "xzZcN4IBwi7jvGWkWmPuKg", "user_name": "Jeff M.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Dropped in for a few hours during a visit to Healdsburg. Was easy and straightforward to get set up and there's plenty of bouldering and belay walls to go around. Small workout area on second floor was a nice place to warm up and get a small work out in, if needed.", "date": "7/30/2016"}
{"review_id": "5xzPWcwbgM0MHz1S3i_kag", "user_id": "PIPvxzdiX9SU3qWynX_xuQ", "user_name": "Karl M.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a regular at vertex and I love climbing here, the people are great and the routes are challenging. I have done camps and climb for 2 hours every Week. They Change up one of the walls about every week and all of the walls are different. I love this place!", "date": "9/28/2016"}
{"review_id": "d0L2XO92qXPTXy4DntUnDQ", "user_id": "96Ad0OjVF0rUhxVfGacc-A", "user_name": "Randy K.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I went there yesterday, the instruction was constantly interupted by other employees, once we got turned loose, I was confused and had to learn on the fly, which was suitable by me, I quickly noticed only two areas were open to us with the type of harness we were issued, which we made do, but were board very quickly.  One item of main concern, was the amount of spare parts lying ion the middle of the landing zones, one particular time, I fell back into a pile of plastic crates and extra climbing handles. and lost my balance,  This is a law suit waiting to happen, I quickly changed my mind and left the building. Lack of proper management will sink this business, Other wise the staff was friendly, but when my group went exploring to the rear of the climbing area, we were almost hearded like cattle back into the main area where all the loose parts were, I was told that area was closed.  Simple sign would have been sufficient. I dont think I will spend $100.00 for 30 mins of climbing here again.", "date": "5/16/2017"}
{"review_id": "D5fid_24bFwcDOjnHKp6vw", "user_id": "4S7wbtHA6y51sbaQTX1aOw", "user_name": "Brandon K.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I love this place. I have been here for a little over two months and enjoy the atmosphere and workout. Rock climbing is becoming my passion and thanks to the kind staff and awesome walls I'm getting the knowledge and skills to climb outdoors.", "date": "2/8/2016"}
{"review_id": "cwoRLWnzGGzjjvLtShVOoQ", "user_id": "3UkcxlMW00OCCyx4Nvl7aw", "user_name": "Dan F.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I visited Vertex for a date night and we were both immediately hooked on this place! The staff is incredibly friendly and knowledgeable. Prices are reasonable compared to any regular gym and you definitely get a good workout! Can't say enough about Vertex, but we are ready to go back ASAP!", "date": "4/1/2016"}
{"review_id": "-SJuG0bkhEHzYv1KLjvBqw", "user_id": "Tv_ThZXSanPNgnm378z_dg", "user_name": "Brittany S.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was amazing. I was nervous being someone who has never climbed before but they are so warm and welcoming. All the staff was helpful and super friendly. They wanted everyone there to have fun and you could see that. This place is somewhere I will definitely go again.", "date": "5/7/2017"}
{"review_id": "SbUsUo33q7KXtZv5rDFk8A", "user_id": "UN-CZ7ZTzvD-n5M8ABwhHw", "user_name": "Albert N.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place to workout, and climb!!  What I really enjoy about going to Vertex, is not the wonderful climbing routes they put up (true to their rating too!), not the great workout facilities, but the community that the gym fosters!!  They have lots of fun events, and excellent classes.   All people (including employees) are happy to be there!All of these wonderful things make \"going to the gym\" a highlight of my day, instead of a chore!", "date": "6/6/2014"}
{"review_id": "QwcHRXo-rCEx4LfVnCunPw", "user_id": "_qB0LZUOFFkgNy6WoofH_g", "user_name": "David M.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Super cool! One of the best activities to do in Santa Rosa, hands down. I did the two hour \"Climb Time\" on Sunday with my brother and friend. We had a blast. Dillon, our guide and belayer, was great and helped us navigate the routes with expert advice. I had never climbed before, but after just one session I'm hooked! I'll definitely be coming back to Vertex. Thanks for the great experience!", "date": "5/18/2015"}
{"review_id": "ReW4A5C7ca14Svnrg9XY1A", "user_id": "ZUWzOv5kX9wRZTjSgnudfA", "user_name": "Adam L.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 4, "funny": 3, "cool": 1, "text": "Best climbing in Santa Rosa! ;)Also rated the best place to meet hot singles in rosa, not just the best place to meet singles, but the best place to meet HOT singles... D'awwww thank guys! We are hot! Come climbing!", "date": "11/26/2012"}
{"review_id": "3qlzEMQFRDz4_sU8UP8w1w", "user_id": "V6HKNA3rnEDXSzETyIzb1w", "user_name": "Sam M.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 1, "useful": 0, "funny": 3, "cool": 1, "text": "I'm glad that this place exists.It's much like a tool shed in both size and content. And I'm so grateful that it's keeping the pretentious hipster gentry out of the fun gyms.", "date": "5/20/2013"}
{"review_id": "lVvx-YKT5wtFG4X8Kgtw6Q", "user_id": "KgUkbXn1ai3GvUt2Q1PhOg", "user_name": "T. W.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My boys had lots of fum climbing on Saturday.  The facility is challenging, clean, and a positive experience.  I marked-it down a star because the young man who was with my kids was really quiet, and didn't offer much instruction or energy to the experience.  It would have been nice if he was more helpful getting the gear on and off.", "date": "8/25/2013"}
{"review_id": "s7Djr-qBcz61pgUwoi8N2g", "user_id": "hR-5Z-uxD9dSGuVwvvOosQ", "user_name": "Shelly H.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Loved my Climb Time!! Everyone was friendly and our belayer was not only super sweet and encouraging but gave excellent instruction!! They also honored a gift certificate that was probably over 10 years old! I hope to get back to this place soon. :)", "date": "9/24/2016"}
{"review_id": "NFkNlIIJcgM4R1CJKVovLg", "user_id": "8sqWPN4eumH229aFJw1Xhg", "user_name": "Joao P.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A great place to climb indoors and get educated about climbing technique in a friendly and non-competitive ambience. It also offers high quality work out and yoga instruction, and is the perfect place to host a kid's birthday party. Five stars!", "date": "7/14/2014"}
{"review_id": "dkdgp9IIWb9jPMoiXME_ig", "user_id": "g9aCHVOssc9322JpoZBszA", "user_name": "Amelia H.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The staff here are so nice and eager to help teach others. It's a fun place to hang out with your friends and also get a good work out. It's like doing a trust fall but x10. Now I come with a group every Wednesday and we have a blast! I could see how it's known as \"the best first date\". They're clean, spacious, informative, and just all around a good feel to the place. I strongly recommend checking this place out!", "date": "4/16/2014"}
{"review_id": "o80iF30aLrSrCgbbraPDSQ", "user_id": "OHMhr2xt4ahsaVFlHBMKnA", "user_name": "Thomas E.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Vertex is a great gym! If you are into bouldering, sport climbing or working out in a full gym with equipment this place is for you!", "date": "4/13/2015"}
{"review_id": "YYke0H-mlMM_RLmC7d8BbA", "user_id": "eWV_zVbcwlhJbsn3DubQtw", "user_name": "Mandy L.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Love this gym! The staff is uber friendly. Very encouraging and great for newbies or veterans. I have been going again for their assisted climb time where the staff is your belayer and it is awesome. You just get to show up and climb for 2 hours! The staff is encouraging to keep you going and challenge your strength and keep you growing as a climber. Love this place.", "date": "10/5/2009"}
{"review_id": "FtDZ0-oJSe2Q2VOfNHJvxw", "user_id": "2uDbc40-EH15mnztaAgdnQ", "user_name": "Gorden C.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the best climbing gym that I have ever been to.  Everything that they do is held to a high standard. Weather it is the rout setting \"which is HARD\" or the fitness classes \"which are designed for climbers\".", "date": "8/16/2014"}
{"review_id": "TItKbCs7niCNJH-if3AxEw", "user_id": "36wqeMWxSTCzjGOZH7vBqw", "user_name": "Ashley M.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is so fun. People are down to earth and friendly and excited about climbing! There are soo many routes to choose from (though sometimes, it's actually hard to follow the routes because there is so much tape on the walls). The routes are nice and challenging, I think. The place is big enough with lots of top roping (I don't do much bouldering).As for facilities, those are great too. There are showers with soap and shampoo. Places to store your stuff. And outside there's a balance beam thing, and a tire swing and just a nice general outdoor chill area to get a break from the gym when you want to walk around for a little bit. There's also a great community bulletin/posting board by the drinking fountain. And the staff. Always friendly. Always helpful.If you're thinking about going -- go. :)", "date": "7/29/2014"}
{"review_id": "19ERw1NjqHQhukb0qNy_jQ", "user_id": "ll4Pqxnf0HkplBOr8p5fsg", "user_name": "Ian C.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I was a member here for almost a year, and absolutely love the place.  Unfortunately it's been a while since I climbed regularly, both because I don't have as much time to keep up with it, and some friends moved away and I don't have many people to go with anymore (nice to go with a group).I did a lot of climbing the 30' walls on a rope, as well as bouldering.  This place is fantastic, and I love the staff.  They even have a small gym upstairs, although it is beyond me how anyone could have the energy to lift weights after (or before) climbing the walls.", "date": "3/28/2011"}
{"review_id": "v4YdJ3Vi84ZDQhQ9Nqg12A", "user_id": "GBjuvIaKMAcH6EafSbVtag", "user_name": "Yelp M.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 2, "useful": 2, "funny": 1, "cool": 0, "text": "Great activity center and the patrons and some of the staff are really cool. Unfortunately, the management should be more selective about who it chooses to represent them at the front desk. I recently attended a kids birthday party at this facility. the girl who greeted us first off seem annoyed that I was interrupting her \"chill\" time. she then responded to me with such lack luster engagement I sincerely thought she may have been stoned.  There was some confusion on my part, along with some other parents, as none of us had been there before. questions about waivers to sign, location of \"party room\" and process to get kids ready to climb were received with the same attitude. it was actually surprising that she seemed so annoyed and sincerely upset that we needed her to get up out of her chair, take her hands out of her pockets, and speak coherently to us. In the end this is a really cool place, and we did encounter some nice, engaging staff out on the floor, but this front desk experience was such a turn off, I would not recommend it to others.", "date": "10/28/2015"}
{"review_id": "AndsSfJjwCBST0ilMfauPQ", "user_id": "3XLYi9u90o3PyteGfiRCog", "user_name": "Peter L.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Went the other day with a friend.  I am a total novice climber with a serious fear of heights.  I explained this to Rob (owner who was working the desk) and he was respectful of this and very helpful putting me at ease and suggesting ways to get started that were not intimidating.  Obviously mid range and experienced climbers like it here, but it's a damned good place for a novice as well.", "date": "1/23/2014"}
{"review_id": "VkERW25p2Npp6B4VYd67tA", "user_id": "LXE8H69AchHgmCkvRY7e0g", "user_name": "Taylor F.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is rad, I just got into climbing a few weeks ago and joined up with them.  I love it and appreciate their challenging but welcoming environment.  plus they have a full workout area upstairs, classes, and friendly staff.  They even gave me free shoes because they are getting new ones to rent out.  Seriously great spot!", "date": "10/12/2014"}
{"review_id": "_rt_Y79metjbtL4Anc55sQ", "user_id": "oHDmO-4wlTnS4UL8yh_TLA", "user_name": "Marty F.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Vertex manages to fit a lot of climbing into a relatively small space (compared to the other gyms I've climbed at).  Even so, it almost never feels cluttered, and you can always tell which holds are on a given route.The route setters at Vertex are very active and talented.  One or two walls get completely redone every week. The routes are quite difficult, which makes ascending them very rewarding.I would guess that 9/10 people that climb at vertex regularly are totally awesome and friendly.  I probably just never got to know the other 1/10.  No matter what your skill level is, there will almost always be someone around who can and will help you out.", "date": "8/19/2009"}
{"review_id": "VfqrJPsIxd_IzJA3hI9kKA", "user_id": "if80Vlms0BAGz0HrkoyMPA", "user_name": "Nicole M.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Been going here since I was 5, so much fun an a great way to work out. They'll teach you as you go, so if it's been a while you'll get caught up quick.", "date": "12/22/2010"}
{"review_id": "-c8XX9btxdqdtgBzPmug0A", "user_id": "2CCN227CtaTdqtTYnzR20A", "user_name": "F.A. V.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great gym!  The staff is super friendly and knowledgeable. I just had my first lesson, Sarah McKay made me feel safe and empowered all while cheering me on.  I can't wait to go back for a Bouldering Betty's session!  So family friendly too, have to bring my 6 & 7 year olds next.", "date": "2/16/2013"}
{"review_id": "Xv39kOEjS8jc7yOazliK5w", "user_id": "9GfmLaX81bjMqB7-0cl9Rg", "user_name": "Charlie D.", "business_id": "-t2QKod63eW3cUPpjEgsrQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "What fun, you have to love getting high... Um I mean they have 30ft walls for you to climb up. Great rock gym, their routes are challenging, the staff friendly, plus they switch out two or three walls every Sunday. Great hangout, not too bad on the wallet ($12 dollar day pass).", "date": "5/5/2005"}
