{"review_id": "kndEC0HuyumwRFkFRDiGRA", "user_id": "biLg0l3mLcCfsRY8XNGThg", "user_name": "Tyler J.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My wife and I went a couple of weeks ago. I'm somewhat athletic, and she isn't. We went here for a date night to try something different. The worker there were super nice to get us oriented. Once we checked in, she helped us each get up our first climb. As we went through the night, she checked in with us repeatedly to make sure we were having a good time, and to give us tips.The location itself could be a second home - it has wifi, drinks, couches and weights in addition to the extensive climbing area. The other climbers were super nice and approachable. If you haven't ever been, you should definitely give it a try. The climbing itself is hard, but this course has climbs of different difficulties. We were told that the Oceanside location was already really good for beginners.", "date": "1/15/2018"}
{"review_id": "phH7lmX2UGiMuV0cY5Fj0A", "user_id": "n-STAxIxz8tVqPt-3zV6QA", "user_name": "Elven B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "Clean, beginner-friendly indoor gym.  A bit smaller than my home gym in Dallas and they were remapping some courses so about 20% of the gym was roped off. $17 for a day pass and $4 for shoe rental.", "date": "7/26/2018"}
{"review_id": "7BdHhuCTrONcOJ4a3FqM9Q", "user_id": "EDBTE8HMO-iN5hAi9B382A", "user_name": "Cindy W.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 8, "funny": 5, "cool": 7, "text": "Came here with my husband for our day together and he suggested rock and wall climbing. This place was bookmarked so I suggested here. We got there about 40 minutes after they opened so we were the only ones there. They were resetting the marks. The place is pretty cool. The process: you sign the disclosures and read through them on a screen and sign. Then you're shown around on how to follow the path and from there, you can rent your shoes or anything you may need and you're on your way.To climb, it's $10 and the shoe rentals are $2. We spent about 45 minutes climbing and were so exhausted. It really works your upper body and your arms. My hands were hurting too since I didn't wear gloves or have chalk on my hands. We got to talking to the owners afterwards and it's pretty cool how they came about. They have more than one location and they're doing well. Glad to see that. We'll have to come back again soon!", "date": "7/20/2016"}
{"review_id": "cVb7pJpIYijr64yw73BkAw", "user_id": "qprObELxmffp1mfDwdLUZQ", "user_name": "Kristian E.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Staff was super friendly and provided a great guided tour for me and my girlfriend. The gym is probably the most aesthetically pleasing gym I've been to plus has a lot of things to do there besides rock climbing, like yoga, functional fitness and even slack lining. Went day for a day, super fun! Definitely planning on getting a membership!", "date": "5/16/2018"}
{"review_id": "vBZ1NzFa9zUUlNavn8yy9g", "user_id": "BsM1FFv4_qSnxmkBnzfniw", "user_name": "Stephanie Z.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 2, "funny": 2, "cool": 0, "text": "I can't give this place a negative review because it IS a really cool place but I realized real quick that it's not for me. It's a rainy day so my plans to hike didn't happen and I get bored of the gym so I thought I'd try something new and come here. Let's just say it was a good idea... but no thanks. I lasted no more than 15 minuttes. $14 down the drain like that for me. It's certainly not as easy as one would think. There isn't much easy ones for beginners like myself. There are no harness things to catch you if you fall. I got about halfway up the straight one and got scared of how I'll get down. The \"rocks\" don't all have those grab holes.  It's really hard! And the coloring was confusing to me. I was so embarrassed that I couldn't do it :(I'll stick to hiking. Once again... it was a good idea. Lol", "date": "1/22/2017"}
{"review_id": "NWVm0X-t-xq4d17daK86Qg", "user_id": "bqUZPIi22hSj9QWPGzsH2g", "user_name": "Cameron G.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbingGood people and atmosphere Should tryGood workout and new wall/renovation Try out a membership is worth it", "date": "4/29/2017"}
{"review_id": "40hTZssi9R3g5_9Wxsq2Ew", "user_id": "GFj7NiEhYIoo_2QRjr94pA", "user_name": "Erin S.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This was the coolest place I've ever been !!! Such a cool atmosphere and so many cool things to do!! Slack line and bouldering and yoga! All my favorite things ! The crew was super amazing also!", "date": "2/9/2018"}
{"review_id": "SDrfA5CqRBDTlBBF8UMa0Q", "user_id": "3TMM_CrO30OIznHBx7vnXQ", "user_name": "Beth C.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Vital Carlsbad is tucked away, and is less busy than Vital Oceanside.  It has all the same great bouldering climbs and setting as Vital Oceanside, and parking is usually pretty easy.  It has fingerboards, workout mats and weights upstairs, and a pull up bar downstairs.  They have coffee and cold beverages.  The staff is great, and the gym has a family feel.  Come check it out!", "date": "11/4/2017"}
{"review_id": "NtxEPYWQ43QG8FJNAnDCIw", "user_id": "OGLkivfkMESvh-2Fkg3bjw", "user_name": "Doris W.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Came here on a Sunday afternoon with the best friend. It was our first time here, so we had a little difficulty locating the place, but once we found it, we were ready to get our climb on! We were greeted immediately by the one man staff it looked like. He was very informative. He handed us some forms to fill out and from there, it's $10.00 to climb! Shoe rentals are $2.00 if you want them. He explained the routes and how it works after we were set to go. There were a handful of children climbing but besides that it wasn't crowded, we could sit around and watch other climbers. It was a fun time! Definitely a good workout. The atmosphere is really cool. With a living room like upstairs area, and a nice big couch downstairs. I think membership is $45.00/month with 24/7 access. I don't do this enough for one, but it's pretty cool.", "date": "3/23/2015"}
{"review_id": "cMZwSxl9LO2KFvQfoUkLqw", "user_id": "IQLXOesnWH_nJsoJYZvHzA", "user_name": "Janel E.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I joined Vital (Carlsbad) about a month ago. Its smaller than the Oceanside location and seems to have a different vibe. Very clean too! Climbing in a gym is very different from climbing real rocks outdoors, so it's nice they change the climbs/problems up often. There is a certain \"climbing culture\" in general that I've experienced here. Vital uses a trust system that makes the members feel a sense of ownership and pride- which is very cool. (Ex: making the gym accessible 24/7.) One doesn't have to be scared to be here alone or at night. There are security cameras around which creates a sense of protection.The staff is very friendly and helpful. It's nice to be greeted with a smile by everyone who works here!  (FYI: There are a couple of the doggy staff members are timid/barkers which can be distressing for people who are scared of dogs.) One thing that doesn't make much sense is the membership fee structure for families. All in all, one heck of a great gym! Love the work out! Can't wait to try the training classes! In one month I went from not being able to do a single pull up, to being able to do 6!", "date": "9/1/2016"}
{"review_id": "Q1TF5daNdtHmwdkJTdydvQ", "user_id": "eh9LgHpDZiCbQ0mISJK2FA", "user_name": "K S.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Hands down best San Diego county gyms there are. I started climbing at the Carlsbad location back in 2013 and it was the perfect bouldering gym to be a part of. Sets are always creative and fun, with a wide range of difficulties. Staff are always upbeat and friendly, facility is always clean, and nothing beats the 24-hour-membership!!! I don't live in the area anymore but whenever I am back in town I make it a point to stop by. Favorite gym!", "date": "10/1/2017"}
{"review_id": "dk2bm0wmrlpEKymdyxxicA", "user_id": "VAXXfS4TgPJkw2MmvHvKhA", "user_name": "Aaron B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the smallest of the Vital climbing gyms, but my favorite.  The atmosphere is welcoming to all skill levels.  This gym has more character and more of a community feel than I have seen at any other climbing gym.  Perfect for V0-V6 climbers.  But, even If you're climbing V7 or above on the regular the setting here is really good and allows you to have a lot of good movement on problems that may not be at your limit.  However, if you feel like you need to stress every tendon in your body to have a good time just head up north to the Vital Oceanside location They have plenty of stuff in the V7-V9 range to keep you busy.", "date": "12/2/2016"}
{"review_id": "ePYB2YhCYugUZzmiOXJnCw", "user_id": "25sTjJLuXXOjJmsPGmXmIw", "user_name": "Mike M.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place, great staff and a great atmosphere.Vital has truly captured the climbing community ethos. You'll be fulfilled physically and spiritually at any of the Vital climbing gyms.Being bouldering focused is also genius. This makes it easy and enjoyable to go by yourself or with friends without worrying about bringing extra gear. It's the perfect place to introduce people to climbing with even the slightest bit of athletic aptitude or interest. Vital really gets it.", "date": "11/13/2016"}
{"review_id": "hdJDriOcXrdlYC7FcU-Lsw", "user_id": "nFS-ULo2TNlyqoNP09Po7w", "user_name": "Alexis H.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The Carlsbad gym is smaller than the others, but super homey. Everybody there -staff and customers- are all very friendly. The climbs are all very friendly and organized by skill level. It's so nice that specific climbs all have uniform colored grips (rather than all the grips being the same color with a bunch of different colored tape designating which climb it belongs to).They're pretty affordable for both a membership and a day pass ($12 for a day pass, $2 for a shoe rental). It's family friendly and an all-around good place to spend time with friends.It's tucked away within a parking lot so it was weird to find the first time I went, but definitely worth a visit!", "date": "8/3/2016"}
{"review_id": "N6Qjae5sFyif4ii8Yi9LAw", "user_id": "P5dUyO9BCOlk-okVzWkVrg", "user_name": "Krista J.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love Vital!! I was looking for a home away from home to retreat to after work was crazy and I found it here. I am a member and love the classes, chill atmosphere, lack of judgment at my elementary climbing skills, and space to chill and relax. I am so thankful for Vital and the peace of mind it brings me when I am ready to take on my next challenge - be it rock wall or corporate sales!", "date": "1/2/2017"}
{"review_id": "fqNL_7RPywKRPL_VzsR21w", "user_id": "1-ghH04LX97O8IknObBHyg", "user_name": "Danica M.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is my home away from home! Staff is fantastic, climbers are great, very welcoming environment. Small, but a really good collection of routes considering. The Carlsbad location is way less busy since the Oceanside gym opened up, which is great for those of us who tend to go at the 5pm rush.", "date": "12/1/2016"}
{"review_id": "fAJPEBNY-noPbX9Uze_jcw", "user_id": "ufHvTw0SgCFwTg3mkf2i4A", "user_name": "Chris C.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place: cool idea, cool equipment, cool people. Adam rocks it when I'm there on Mondays. 99.67% of the people rock it too (I did leave my chalk bag there once, never to be found). But hey, nothin's perfect, right?Thanks Vital, we needed you.", "date": "5/4/2016"}
{"review_id": "EjHEt51LiBHexp9ozLqNUA", "user_id": "GU_UUf9MlXbTCM82TRlGZw", "user_name": "Dan H.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Fantastic bouldering Gym.  The idea that members can go 24 hours a day 365 days a year is fantastic.  I love going at 5am and having the place to myself to play whatever music I want and just work on routes.  Like company?  Great!  From 11am to 9pm, the place is open to the public and the crowd is always super friendly.  Best of all: they reset 25% of the gym every week!  Every Friday you have new, creative problems to work on.", "date": "11/4/2015"}
{"review_id": "xlFrdLURzfsbMFARz_35kQ", "user_id": "NnNh-1PXIE4u8xqz_4TrXQ", "user_name": "Chris W.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place has become my 2nd home and family.  I've been climbing here since they opened in June & it has truly been a vital change in my life.  They're open 24 hours to members, so I can go during peak times to climb and socialize, or I can go at 5am to get a more focused workout.  Vital's team and the climbing community here are truly amazing.  I never say \"I HAVE to go workout today\", it's something I look forward to each and every day.  Vital provides an amazing venue for such a great mix of people to come together and expand their horizons.", "date": "12/1/2016"}
{"review_id": "P7Zv3fc98due_MTU6crDUA", "user_id": "BueGtYFFAS8FjGzgta2h2Q", "user_name": "Keenan G.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I cannot say enough about this place. My buddy brought me here when I moved back down to San Diego and didn't really have anything to do or anyone to hang out with. And I fell in love. I have climbed before as a younger kid but it was so much different being able to actually learn how the sport works. I have gained a good number of personal friends from this place, both the employees and members/random climbers. 24 hrs a day for members which is a godsend when you get off work at 2am and know you can't go to sleep. All the employees are really awesome and helpful, don't hurt to ask them if they know beta to help you on a problem. Good luck and climb on!", "date": "3/2/2016"}
{"review_id": "FdkyHURP01Tu3wjraPEEbA", "user_id": "JIc5mfhuGbMDH5XgeLnY1Q", "user_name": "Amy A.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's a really awesome bouldering gym. After the first visit my friends and I signed up for monthly memberships. I'd say those are worth it in the long run. :)The gym is a bit on the small side, but they keep it entertaining and fun by resetting a portion (about 25%) of the wall every Friday. They do a great job at having routes for all different levels of difficulty so whether you're starting off fresh or have been climbing for years, you bet you can find a problem to suit your needs.All the staff I've interacted with has been super friendly and helpful, and with the membership I'm able to get myself in there at whatever times suit my schedule. Which, if you prefer solitude while climbing, is fantastic.Overall, it's a nice little place to go climb for a few hours. I'm glad to have found this gem in Carlsbad.", "date": "1/2/2016"}
{"review_id": "YHQM7uqS42_JaAVFdYEfgQ", "user_id": "ZGKWE9umr5JMoqzk19yAvQ", "user_name": "Mia G.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Small, intimate and so pretty. Also only $12 compared to the average $16-$20 at other gyms. Love the atmosphere here.", "date": "11/11/2016"}
{"review_id": "bKQKXEPN1iQZWDyY4WCEig", "user_id": "SfDhKdBRnmhPFBKotc2n0w", "user_name": "Giuseppe G.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "This has got to be my favorite gym in all the land. The crew is amazing, route setting on par and the most friendly climb vibe you'll get.", "date": "10/2/2016"}
{"review_id": "RjW83wkbPgTngPNyrmn2Bw", "user_id": "0ndPj44KmqBDblIzopiSDg", "user_name": "Michael S.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been a member here for a couple of years, and this is definitely the most member-friendly gym I've been to. The 24hr access for members is great when you want to get in your workout  on your schedule, and sometimes you show up and you have the place to yourself!It's a very comfortable place, without a ton of egos that you run into at some other gyms. The only downsides: it's a little bit small, and doesn't offer rope climbing. Big pluses: 24 hour access to members, friendly staff/regulars, Pandora music usually chosen by members, self serve coffee machine, ROUTES CHANGE REGULARLY, and they don't use old holds that need to be retired!Vital, you're doing it right! ...Please open a gym with rope climbing though!", "date": "2/17/2016"}
{"review_id": "2AmOEhJAs_x-wr-NE_EfbA", "user_id": "OZKVUQS2XEXz7DhglTKV9w", "user_name": "Mike C.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vital Carlsbad is the my favorite climbing gym.  Super friendly and knowledgeable staff.  Feels like a family owned operation not a big business.  Very laid back relaxing atmosphere.  A portion of the gym is reset every Friday so there are always new routes.  Despite it's small size there are always plenty of routes of all skill levels.Everyone that works there is a climber and they engage the customers, helping with a climb or just asking how it's going.  Other patrons are very friendly too, whether they are best climber there or just learning they always seem happy to talk to you.  I think the small size works in the Gyms favor by making it more intimate.", "date": "2/1/2016"}
{"review_id": "yWTlo_s08vre1Js2OIXrlg", "user_id": "C1f0wUF-M6AjMecsULyK3g", "user_name": "Christopher S.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love the space and atmosphere! The crew is great and super friendly (Pups too)!", "date": "1/2/2017"}
{"review_id": "9EsWImmZgapxXlhvdElJkQ", "user_id": "2dubkVlMgh3-QZbVXqEplQ", "user_name": "Greg B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 4, "funny": 2, "cool": 3, "text": "At first I was a bit concerned that the place is a little small, but the number of people that show seem to match, so even when theres a mini-comp it hasn't been an issue for me. Very fair prices for SoCal and the routes get reset often, like 3-5 weeks. The staff is cool, theres some beverages you can buy, but the coolest thing is that if you sign up for a membership you get 24 hour access.. Thats right you get the door code and as long as you agree to some basic common sense rules you've got free-run of the gym whenever you want. I've only used this once but it was a great convenience. Get in here!", "date": "7/16/2014"}
{"review_id": "Jupcg-HPjaPqHnfycvifpA", "user_id": "FsZVsoDPa9C49l6MjE1VgA", "user_name": "Maria G.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "I finally gave in and got a membership because I recently moved closer, was going at least once a week, and the membership to my previous gym in San Marcos lapsed. I'm glad I did. :)Pros: routes are re-set on a regular basis, so there is always something relatively new to work on. Their holds aren't all polished and slick, they mix up route-styles (I LOVE volumes... and crimps) and every re-set, the routes are significantly different, not just a different iteration of the last set. Staff is cool, dogs are allowed, and they have a nice selection of snacks/drinks. I also like that aside from their monthly membership fee and initial i.d. card fee, there are no other hidden fees. I go so often that May has pretty much already paid for itself.Cons: Umm... I think the biggest annoyance for me is that some people who climb there don't know basic etiquette, like starting a climb when there is someone climbing above them. Also, this may be nit-picky and a personal preference but it also makes me cringe when people just drop down like rocks from the top and they land really heavily. I always hope that they looked down before they let go, cuz if they fell on someone/something it would not be pretty.This place can get really crowded in the evenings. Sometimes it's good (if the crowd is good, y'know, supportive, friendly, not trying to out-climb each other but working together), but sometimes it gets so crowded that it is hard to really climb what you want, especially if it traverses or if it's a popular-or-new route. I can't wait to start going during member hours, just haven't gotten around to it yet. It would certainly eliminate my few cons.Oh - please re-instate ladies night!! I would love to meet other fellow lady crushers. :)", "date": "5/13/2014"}
{"review_id": "94b39b_eaSef0SimDrnDbA", "user_id": "liSHmXHtYJoH7CoPeWSLVQ", "user_name": "John B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is so fun! My kids and I are new at climbing. We went the last two Fridays from 5-9 PM when students, children and military get in for $5 including shoes. The first time you come you get a briefing on safety and how to read the route markings.  The hand holds are color coded by difficulty and there are plenty of routes for all skill levels. The staff and other customers are all super friendly.", "date": "12/18/2015"}
{"review_id": "BYqRttCylyJMcAoE9MtifQ", "user_id": "Dl3T-OYCzV5dxMSOu-aUmQ", "user_name": "Brad P.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "Been a member for almost two years now.  Love how it is open 24 hours a day and they trust you in the gym by yourself, even the food and drinks are on an honor system.  You can use the iPad to play whichever music you want.  It really feels like it's your own climbing gym.  Everyone whom works here is extremely nice, as our all the other members.  I like seeing kids at the gym, because it is better than them sitting on their butts playing video games. However, if you bring your children make sure they know climbing etiquette, and keep an eye on them.  They need to wait their turn to climb, most people are here for their workout.  You wouldn't let your kid cut in line at the bench press at a normal gym would you?  Also, make sure they do not walk under anyone climbing, this can be dangerous if someone falls.", "date": "3/18/2014"}
{"review_id": "ZixASuwVb_5q2gmaZuWnAQ", "user_id": "oqvZbddB_bL6F-Z4FYUPVA", "user_name": "Michael S.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I've been a member for about 6 months now. I've been to quite a few gyms in California, Washington, and Europe... and this place is definitely different. First of all: NO FEET SMELL!! If you've been to stinky gyms before, you can appreciate this. Vital is bouldering only, which is a tiny drawback... but they are GREAT about changing routes regularly, which is a MUST for anyone who goes regularly. It's easy to get bored at other places I've been. They really try to set all ability levels on all the walls. Other places have quite distinct \"beginner walls\" and \"advanced walls\" which intimidates beginners, and isolates people with a lot of skill.  Their lounging areas feel very comfortable, which is nice for spectators, friends or just taking a break during a long session. Members can play their own music from a built in iPad, or plug your own stuff in... I haven't seen anywhere else do that! Also, since it's 24 hours for members, you can go when nobody is there. I've been there first thing in the morning, just climbing with natural light coming in and my own music playing... Definitely a pretty cool feel to have the place all to yourself. Their staff is really great about making you feel welcome and valued as a customer, too!", "date": "5/2/2014"}
{"review_id": "wgajYY0qkSA9lgMzOVOWaw", "user_id": "9TtKxPCBtTjagrN0keme5g", "user_name": "Connie B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great time on five dollar Friday. My kids here all the time lots of fun. Lots of fun. If you want to challenging Boldery place to go, is good for beginners to advanced.", "date": "5/22/2015"}
{"review_id": "JqGnuqvTrXeRAYiG7c04zw", "user_id": "9Jby36JmbC2nM_iSBC-A4w", "user_name": "Alison B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "I love this climbing gym. $10 gets you a day pass. All bouldering.. It's small but comfortable. Great place to learn at your own speed and strengthen your technique. I just wish there were locations closer to where I live.", "date": "10/29/2015"}
{"review_id": "4HMEOuUeBD6KgokJUuzu6w", "user_id": "tyGsjYf1_1BF3-Vmx-Foyg", "user_name": "Braden T.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Great bouldering gym. As fun as it's a challenging workout. Memberships are relatively inexpensive compared to other gyms, and there are discounts available for military and law enforcement. Each successive family member gets a cheaper membership as well. Very relaxed, friendly atmosphere; kids love it as well, and won't find themselves out of place or under foot. A suggestion - because it's such a fun and potentially successful idea, in the future, I can see it becoming increasingly crowded, unless they expand.", "date": "5/15/2011"}
{"review_id": "pva14zQiln3LcFNpWUiXYQ", "user_id": "vTkSHsl1xhh0wwHZF4_APA", "user_name": "Cristina B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I loveeeee this place! I signed up last month with Adam. He was so helpful and let me climb for a little bit before I made my decision to sign up. That day was actually the first time I ever climbed at a gym. That being said, it was pretty intimidating to walk in there and start climbing! It is so awesome that Vital has different routes for different levels and everyone is very helpful and nice. Alsoooo another reason I love this gym is the fact that they are open 24 hrs to members! This works out great with my absurd schedule. Go Vital!", "date": "11/1/2015"}
{"review_id": "CU1AvuG-0lMwvKr9jL9zqA", "user_id": "EjT2N4_rjN2aUqijY3JVOg", "user_name": "Nick B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really fun place to go. They change routes pretty frequently. Definitely worth getting the monthly pass. Everyone that works there is pretty knowledgeable about routes, so if you get stuck feel free to ask away.", "date": "12/1/2016"}
{"review_id": "9gr0PpY9Hx-58b-UI3BFeQ", "user_id": "BvAVIkX-VV2e6IKZ9M7iPw", "user_name": "Jacob A.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Everything you want in a bouldering gym: New problems every few weeks, high quality training equipment, and best of all it never closes. When I moved away from Carlsbad one of the things that I missed the most was this gym. Most of the regulars are really cool people and the staff are super friendly. Also it's cheaper than my regular gym membership!", "date": "3/4/2015"}
{"review_id": "mAz80EroVEfbxMMDced0Ag", "user_id": "VRECer7kgIQ3Gvav4EUkqA", "user_name": "Pre P.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the original vital that I had been to when I first tried out the gym. My husband brought me here so that I could slowly start building up my strength while bouldering. It's really close to our house and very conveniently located. It's really quaint and has some workout equipment as well just like the new Oceanside gym. It's been a while since I've actually gone back to this location, but I was pleasantly surprised today when they were offering a class which incorporated various types of training. Michelle was an awesome trainer, and I'm looking forward to more classes with her as well as other members of the team :-) hopefully I'll be able to keep building my endurance and my strength as I continue to train during these classes that they offer. I love that both locations are dog friendly, and I was really excited to see one of the resident dogs. I think I'll be bringing mine relatively soon to introduce him to the other friends at the gym. Definitely check this out if you're in the area! You won't be disappointed.", "date": "7/5/2016"}
{"review_id": "CDeW4X2tB6Y84Ej12fQPaQ", "user_id": "vLfpHuRz2meAJTl3cXFvmA", "user_name": "Stokely C.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is incredible!  When you join, you can go on your schedule. They give you an access code to come in at your leisure.I brought my dog here on a sleepless early Sunday morning and we cranked up the tunes. This led to a fun hour until another member showed and was almost immediately greeted by the one Shania Twain song I have on my 700 song-strong GuyPod, blaring from the bombastic sound system.  This resulted in him staring through me and me smiling goofily.The routes are mostly well designed and are changed after just the right amount of time.  It's a lot of fun to work your way up to the harder stuff, but upon plateauing, you can time trial the easier ones.They also have slacklining available for those so inclined.This place does a great job instilling a sense of community among its members, with frequent events such as workshops, contests and movie nights (no, not just Cliffhanger).  I haven't attended these, but they seem like a good time!The only thing I would suggest, and this is probably a lot to ask, is that they color-code the actual holds, rather than using duct tape to mark it.  Perhaps they could use textured paint?", "date": "12/16/2012"}
{"review_id": "GSYS2nm_7pcCMqhfq9v5rA", "user_id": "TpnyIxZ21vxDjWiPHMo-ow", "user_name": "Janet P.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 4, "funny": 2, "cool": 1, "text": "I recently introduced my friend to bouldering (though I'm still an absolute beginner), and for my birthday she bought me a great Groupon deal for Vital: $39 for a 10-visit punch card. For non-members, it's $10 per person per visit, for which you receive a day pass bracelet. (Though if you're brand new to Vital, your first visit is free, rentals and everything!)It's very small, compared to other climbing gyms I've been to, but provides a warm and friendly atmosphere. I would say that Vital is more suitable to those who are beginners at bouldering, since the size of the place is less intimidating (versus, say, Bay Area's Planet Granite). There's enough variety within the same grade of difficulty to allow for steady progress -- I completed a couple VB's and V0's with few problems, but several V0's that involved a change in terrain definitely posed a challenge to me. I resolved to make those particular V0's my projects. Gotta conquer one path at a time!Another great thing about Vital is that you'll see a wide range of people there bouldering, including tiny kids (whom you'll secretly loathe because they're clearly more agile than you'll ever be) and hardcore enthusiasts (whom you'll also loathe because they're dyno-ing while you're stuck on the wall, trying your damnedest to reach a handhold that's just one inch too far to the left). But seriously, everyone is friendly and the more experienced boulderers are happy to help -- super useful when your technique is rough (or nonexistent), like mine. Especially since Vital doesn't have a technique-focused practice wall for traversing different kinds of handholds and footholds, like the one at the Vertical Hold gym.I didn't make use of the lounge area upstairs, but it looks like a cozy place to chill and relax after a hard day's climb. As others have said, there's a small coffee bar, which is right next to the bathroom (unisex and, most importantly, clean).The only complaint I have is that Vital does not offer size 6.5 shoes for rental. I tried to make do with size 6 (since size 7 was too loose to be safe), but after a couple climbs, my feet started screaming in protest. So I popped out to REI, bought my own shoes, and came back. Maybe not a lot of customers are size 6.5, but still, if a place is in the business of serving climbers, it should always have their size available, no matter how popular. I mean, they already showed up at your gym, ready to go. How the hell else are they supposed to climb?(Note: all the rental shoes are velcro-strapped. If you prefer laced shoes, you must bring your own. Also, this place is a bit hard to find, as it doesn't have a sign. You'll want to drive towards the back, where -- if I recall correctly -- it's located next to a dance studio.)", "date": "11/15/2011"}
{"review_id": "noFvfQsIO2j3tOZ0xBGqbg", "user_id": "bGoTd_dg4NRGsiFYynjxUQ", "user_name": "Daniel V.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym!  Everyone in the gym (both staff and members) are really friendly and give great advice/tips on climbings.  There are lots of routes for all levels and they are updated frequently.  I haven't had the chance to try out the 24 hour access yet, but just having that option is awesome, I never have to worry about rushing to the gym or missing a chance to climb.  Vital is the best bouldering gym I have been to.", "date": "5/2/2016"}
{"review_id": "Y2jnICj08gLMa_rY-dllvg", "user_id": "10x2bVX3gNvGgR8DzZej0Q", "user_name": "Vanny B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 1, "cool": 4, "text": "Become a member! This place is amazing just to hang in!Works great for all levels of climbers so don't be intimidated! Try it out!Ladies night on MondaysYouth climbing teamRandom events and competitionsYou will find a great sense of community here. And as a member, it's open to you 24/7.Coffee bar, gear available to rent for a couple bucks, play your own music. Ahh it's bliss!", "date": "10/24/2011"}
{"review_id": "uVxdFci6YzBP2Q6hT5LLmQ", "user_id": "uYGjfQz0Qhz7V4ki6G4b8Q", "user_name": "Marissa M.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It was my first visit to Vital and I was very impressed; the way the whole place is set up is really nice! You get a great work out and it is also a chill environment. Its is $10 when you go in and $2 shoe rentals. Definitely worth it! I will be coming back in the near future!", "date": "8/10/2014"}
{"review_id": "k4ypT9QsiCiCGKu_knevGQ", "user_id": "wbXhtOXWim6ebkZu-wlBwQ", "user_name": "Andrewd S.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just went for my first time to this place. Had a great time. There are plenty of friendly people here and I will be coming back as much as my fingers can handle it. Great way of working out in a no traditional way.", "date": "7/28/2014"}
{"review_id": "Mff14d5UgUDzdwpX5QCD0A", "user_id": "Vb2uciDeRsje9EE2tdRgxQ", "user_name": "Matt F.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I love this place. I never liked how far away and expensive climbing gyms are but vital is the spot. Everytime I go here I meet new people and have a blast!  And it's 10 bucks to try how can u mess this up. Free your first time!!!", "date": "5/17/2013"}
{"review_id": "Klz7GbLPpeGpV1MyZH1-hg", "user_id": "i636pVrHh5HTq98hcUF_NA", "user_name": "Christine P.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place!  It's open 24 hrs a day to members, which means you go more and when it's best for your schedule, and the garage style doors open for fresh air.  They change the routes fairly often and the route setting is of good quality with fun climbs for all levels.  They are very good at putting up fun routes for both beginners and advanced, so anyone who goes has a blast.  There's an Ipad for playing Pandora over the soundsystem or bring your Iphone/pod/etc.  I wish it were a bit bigger, but for a place so close to home and always open, I have no complaints. I recommend this place to anyone.", "date": "4/18/2014"}
{"review_id": "hoyL7Dj6JiKiH19vErkW6g", "user_id": "Yvlpt4W7j2NRLQA8B5H4Jw", "user_name": "Greg P.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A bouldering gym open 24 hours to members, with routes that are changed regularly, a mezzanine chill area, iPad built into the wall for your Pandora listening pleasure, great staff and cool members - what more could you ask for?  I've never been a \"gym guy\", but the workout you get climbing is so much more enjoyable than pumping weights.  Climbing requires mental acuity and technique, and the shared experience of working on \"problems\" with others creates a communal vibe that makes the workout enjoyable and rewarding.  I'm more fit for it.", "date": "5/11/2012"}
{"review_id": "M-FVYCL-hARqcNbe6T1O5Q", "user_id": "Y6zLfO3f2-w88Xhopwituw", "user_name": "Cat T.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "I'm surprised this place doesn't have more reviews!I've been to probably a dozen climbing gyms around CA and I really like this one. It's cozy and not corporate-y. I really dig the co-op vibe. At first glance, it looks really small, but the frequent resets ensure that you'll always have projects to work on. The wall construction is important to me. If the walls aren't accommodating, no amount of creative setting can make up for it. Fortunately, Vital's walls enable very fun routes of all styles. The setting here is diverse and have everything from balance to burly. Other gyms with \"new school\" climbers often have the douchey/bro vibe, but that is not the case here. Courtesy is observed and most importantly, good behavior = SAFE. Everyone is down to earth and friendly and leave the drama at the door! Staff is super friendly too. There is definitely a sense of community at this gym.I live fairly far from here but I stop by whenever I can. Looking forward to the next session!", "date": "6/22/2011"}
{"review_id": "nDZ-5JbI_6mN7jS1DupfGw", "user_id": "XQnNYUr3iiSHjIeUns4wrw", "user_name": "Orlando B.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The gym is open 24/7, which helps for chaotic schedules.  Everyone in the location is helpful and encouraging.  Although I only signed up for a two month membership, I think I will extend it to a year.", "date": "7/4/2012"}
{"review_id": "en6Aht9vl7QjEkEMusPH6Q", "user_id": "nCbLLrCweNoRcaK5Snw6RQ", "user_name": "Philip W.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely awesome place. Everyone here is super friendly, really great environment with a reading/relaxing area, a huge projector, and a great wall setup. It's a great workout and progressing is such a rewarding experience. Great place to come with friends to challenge each other. I just got my membership last week and I'm a bit addicted. Come try it out, you'll love it", "date": "5/29/2012"}
{"review_id": "YPmOqTJObDbznxxmE8fxIw", "user_id": "pNTAqgkrsW7pLfEf7HIgZg", "user_name": "Shawn H.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a truly fun bouldering gym. Everyone at the gym is friendly and welcoming; including staff and patrons! I like the convenience of being able to stop off and climb for an hour or 2 after work. Great atmosphere and many challenging climbs for all experience levels.", "date": "1/25/2012"}
{"review_id": "3E0SiAHdOg8QSPw97ac_-g", "user_id": "WbjBJPGGu3T8VfLwFuGq3A", "user_name": "AJ M.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Thjs was my first climbing experience, the staff was helpful and kind. None of the other climbers made me feel like i didnt belong on the wall. great experience.", "date": "11/27/2013"}
{"review_id": "6_BKpFs0iT2tP4lFsNCAIA", "user_id": "MDO_MA4QX5g1I-WZuEwJFw", "user_name": "Rachel F.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just started climbing a few weeks ago and I'm hooked!  Vital is awesome.  The atmosphere is really welcoming, and you will not feel intimidated at all, there are climbs for all skill levels.  The people there are so nice and friendly, and everyone is always willing to offer advice if you're stuck on a problem.    If you're into morning workouts, the gym is basically all yours.  I normally go in around 7am, and when I do, there's only one or two others.  It can get a bit crowded on the weeknights, but it's a fun environment and a great way to meet new people.  Overall I'm really happy with this place :)", "date": "4/3/2012"}
{"review_id": "aCF9ZpUPV18LxftzexHnbA", "user_id": "JGieWLHTd5XRPAyhejBJ2A", "user_name": "Kasey A.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun, encouraging staff and members. Chill vibe. Perfect hangout and great workout. They play good music and have plenty of regulars.Highly recommend!", "date": "5/11/2012"}
{"review_id": "ORBLkad3Q-d7qxJPhK2HPw", "user_id": "tifEk5occScrs7TZGrdHkw", "user_name": "Gina T.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "My favorite place on earth! People of all ages go and everyone is friendly and encouraging.  The staff is helpful and super awesome!!", "date": "12/23/2012"}
{"review_id": "swm3Kgqj9gM6T8L-djTr0g", "user_id": "zMxXLj5g0-vlmXP79yfr3A", "user_name": "Preston V.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym! Small, but all they do is bouldering. Walls are 15ft. Sweet place to hang out, climb, or watch people climb.  Only coastal climbing gym in North County!!! Day passes are cheap at $10 and lots of amenities. Free wifi!", "date": "3/30/2012"}
{"review_id": "kdfyFEH660L-LZaA0fcYRQ", "user_id": "n_u_l3BLFEKaSZ_Ncx4AKQ", "user_name": "Rachel S.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "To echo the other Rachel S., Vital really does feel like home.  I've met tons of amazing, friendly, and inspiring people since becoming a member; I never expected that my membership would increase my body strength AND amp up my social life.  In addition to the espresso, wifi, and ipod hook up, there's a pretty sweet loft with a couch, a stationary bike, and a drafting table.  It's definitely a cozy gym, but that makes it easier to get to know other climbers.  You might come to work on a problem route and find two other people also working it out; you get to talking, and by the end of your visit you've made two new friends.  Plus, everyone pushes each other to be a better climber in the most positive way!  Other climbers are patient and courteous if you're taking some time to work out a problem, and it's not unusual to hear applause when someone finishes a tough route.  Your first visit is free, so why not experience the awesomeness of Vital for yourself?", "date": "5/11/2011"}
{"review_id": "YquM7frwMtoJtt3-FLzAaA", "user_id": "ntLjgJfy1UT1WTX72zLJ8Q", "user_name": "Ray W.", "business_id": "GGNNSI1vc0pHOppe91gzLQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been going pretty steadily for about 3 months and this place is awesome. Open 24/7 if u have a membership so a 3am climb is always an option on boring nights or if you work late. Super friendly staff to help the newbies during non member hours. Great place to come for a fun and challenging work out. Would recommend to anyone fit enough to try it.", "date": "8/2/2011"}
