{"review_id": "MEe_wvjWDOOuLKRIRINa1A", "user_id": "sgLHKBWqSgP8a9d46AZgOQ", "user_name": "Cassandra L.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I almost don't want to give Vital a 5 star review, because it's too good to be true. I am a member here, and although I don't rock climbing I go to their yoga classes 4-5 times a week. A few years ago I started doing yoga at Crunch fitness in San Marcos, and fell in love. I was seeking more challenging and frequent classes. I joined a studio, but it became unaffordable. A good friend and yogi told me 'you should never have to pay that much for Yoga.' Vital makes Yoga affordable, offers classes started at 6:30am, throughout the day, and the last class ending close to 9pm. The quality of classes are amazing. The sense of community is great. The staff is friendly. They offer workshops feee to members on a regular basis. I have had nothing but positive experiences at Vital Oceanside, and even commute up from Encinitas.I hope they expand the yoga program, because the classes are becoming crowded, but have good faith in the innovative staff in finding solutions.", "date": "12/14/2017"}
{"review_id": "gdzF54e8H6p6Qzy08WXOHQ", "user_id": "M_S8VDQqbTmK6yaQW-NpJw", "user_name": "Cecilia E.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I am giving this business 3 stars because the two men at the front gave me great customer service. However, I came here to take the Silks Yoga class (noon-with Daisy) for the first time. I had invited my friend so we both were very excited to try something new. My friend and I waited near the other students and instructor for the noon class to begin. Not once did Daisy greet us, look at us/make eye contact with us, nothing. The class began and my friend and I still had no clue as for where to stand, what to do, or even knew what was even going on. We did not feel welcomed at all as the rest of the class and the instructor seemed to have known each other very well. All I expected at the very least was to be acknowledged as a \"human being.\" There was no way I could stay where I didn't feel welcome so I asked the two men at the front if we could get our money back and shared my experience with them. They apologized, understood the situation, and we were given a refund. If the instructor had been more welcoming and friendly I would consider giving this place 4/5 stars.", "date": "4/8/2019"}
{"review_id": "a1nBE7hUGLSJC-nD2Us-uA", "user_id": "eZGbbeDi97-2SA0vQUQMuw", "user_name": "Joseph L.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "Super friendly place even when an old guy walks in and wants to climb. The walls are good, lots of different angles, easy to difficult. I would rate the place 4 or 5 stars except they didn't spray the shoes after I was done climbing. This means I probably put my bare foot into a nasty shoe. They did stuff some dryer sheets into the shoe... I don't think dryer sheets kill germs. So cool place $15 per day, $60 month or punch cards. If you are a member the place is 24x7.", "date": "6/18/2017"}
{"review_id": "SowvlcyyguMn9RAdqELXIg", "user_id": "BnMTAeLbAxdYYg9cYiAmZw", "user_name": "Evette G.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Let me start off with that I' am not an experienced climber but I would say I am decent ;) I've been to two other rock climbing gyms and I have to say that Vital has definitely stolen my heart. Starting off with the location and the cleanliness of the gym. I love how open and fresh the gym feels. The weight area is always kept nice and neat. The different levels of rock climbing always makes for a great challenge every week. I haven't tried the yoga classes but I am very excited to try them out once I've finished my other membership at mantra. I've gone at least 5 times here and continue to bring other friends so that they can experience the same kind of experience I've had. Thanks to the staff that's always been kind, helpful and welcoming. *Oh yea and the gym neighbors a bar right next door!", "date": "10/13/2017"}
{"review_id": "dvR7y4GhEpTXuO7AzrW5Zw", "user_id": "TEB-E5ABlfdkmRqO5guj8A", "user_name": "Shannon D.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Everyone is so cool and nice and encouraging Makes everyone feel confident and very inclusive", "date": "10/5/2018"}
{"review_id": "wenYEwSD_nk-i-TOLsJs7Q", "user_id": "TU5j2S_Ub__ojLOpD_UepQ", "user_name": "Deanna N.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Just finished my bouldering 101 class with Sarah! And I loved it! She was so sweet and knowledgeable. She helped us and gave us tips as we were climbing. The gym is beautiful and very spacious. Everyone is super nice and welcoming. Love all the equipment and can't wait to do yoga too! I really look forward to climbing and getting better! Can't wait to go back again!", "date": "2/13/2018"}
{"review_id": "ERd5CjlLSghuD2aM8IVvYQ", "user_id": "yX1Km3A6yju4-1na7Oa6Yw", "user_name": "Brandon S.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place and their staff is amazing!! I went today and was greeted by staff as I walked in, Adrian checked me in for my day pass, which is a great deal since you can use all of the facility and then if you decide to leave to go grab some food or sit by the beach for a while you can come back anytime that same day to pick up where you left off!! Any questions I had were answered and I could tell Adrian was knowledgeable in every aspect of that gym!  They have so much to offer and I will be back to try out yoga and hop on that slack line to work on balance. I highly recommend this place if your looking to build up your bouldering skills.", "date": "7/13/2018"}
{"review_id": "UfyA_SjCEgqCs_nIQHnztg", "user_id": "864nL0po2ldN8TPgbSiwOQ", "user_name": "Walter M.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 7, "funny": 5, "cool": 8, "text": "Vital may be double what I paid for 24hour fitness, but no one uses the weights and that's really what I come here for. ROGUE weights, that's world class and I'm not sure all these gumbies know what they have at their disposal. Without going into my climbing career I decided to come back for cross training and the whole 24hour access for members was really intriguing. The showers are a little weird as they are shared bathrooms, but aside from being a little dusty(dirty) this happens with climbing gym chalk dust/dirty (my old Solid Rock Days). I use this as my workout place when I'm not working out at my office, it's not close, so it's not used for my daily stuff, just convenience use. It's modern with yoga, some light fitness equipment, couches, food, merch for sale and a nifty cool water fountain. They have some nice easy stuff, some steep stuff, but could use a more clear designation/rating system and a traverse. Plenty of hang boards, bars, grip training devices. The matt is nice, not too firm in the way Spot's are. There are some higher bouldering areas, but no slab. You can see they have multiple setters based on styles, I'm slowly learning them, but I'm still re-beginning my journey while I take breaks from lifting in the corner. It's a bit of a early 20 something hangout and a lot of people just lounge here after climbing. You can plug in your music, but suggest Bluetooth as somehow climbing has become about the individual and less about the community to get you to the top and that's a shame in a way.Like most gym's you can spot the people who climb outside. Spray on young gumbies and let me crush heavies. So much to teach these kids.", "date": "5/8/2017"}
{"review_id": "GzeDWqFHbhlZLAhaB1vmtA", "user_id": "LpG55WaQ8M7TQCJ9wd6Maw", "user_name": "Heather T.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We found this place when we were visiting Oceanside and the children needed a break from the sun. Elizabeth was professional, helpful and SO GOOD with my 3 children. She helped show them the way and was cheering them on as they climbed. The gym is clean and modern, featuring multiple classes (we watched in awe as the silks class was taking place. The restrooms are spotless and everything about the place looks amazing. If we lived nearby, we would have a membership.", "date": "7/14/2018"}
{"review_id": "yNK8cesL8YoQUQgVsVQ7bQ", "user_id": "oDktNz4nP_XnQvD_FdrYZA", "user_name": "Lindsey M.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 4, "useful": 5, "funny": 0, "cool": 2, "text": "A bouldering gym neighboring a bar (a good bar at that)?! That in itself merits a decent review ;)Great corner-most, downtown location. My first visit was on a drizzly Friday afternoon, even with the weather, their large [storefront-like] windows were wide open, allowing for a fresh feel throughout the gym. A spacious gym with lots of climbing routes varying in levels of difficulty. Upstairs they've got equipment, a studio for classes (yoga primarily, I'm assuming), couches and  a chess/checkers board that I took full advantage of (checkmate!). Downstairs, aside from the climbing area, more equipment is housed in a training corner. If you're going to come to boulder (and you pay for the all-day pass) might as well get in some burpees, squats, arm curls, and Turkish get-ups with a kettle bell -just saying.$2 shoe rental. (Myriad of other products for purchase, of course...) The shoes are walled and ready for you to pull out yourself. The only thing between your feet and the person who wore the shoes before you's feet are fabric softening sheets. Kinda weird, but not a deterrent. Like other climbing gyms I've been to, this one certainly follows suit with the sort of \"chill-spot\" vibe. Couches everywhere, loungey-kitchen area, woodsy feel meets modern design. Where one star is lost is the weird sort of environment created by the climbers. Maybe it's due to being located adjacent to beer on tap, perhaps it's just the downtown hipsters, but I didn't like how so many people sit AND lie down on the mat watching others climb. I felt totally judged! I'm not the best climber, I'm not the worst, but avert your eyes! And they all seemed so comfortable, like frequent climbers with their chalk bags and such, that I approached feelings of intimidation and apprehension watching them watching me (and the friend that accompanied me). I also had my 6 year old son and 1 year old daughter with me and the aforementioned gym-goers seemed so bothered by the presence of my kiddos, whom I was vigilantly trying to keep out of people's climb space!I will very likely come back though! I still had tons of fun, as did my spawns. The people will come and go. I'd like to visit again on a day and at a time when fewer people are there.", "date": "2/24/2017"}
{"review_id": "K79swcZiSUGjO-jPv5E80g", "user_id": "r6NWAwxlsFjT1mzhTNwvdg", "user_name": "Sean H.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 12, "funny": 7, "cool": 10, "text": "Vital Climbing Gym....5 Stars no question1. Gym is welcoming, friendly staff and lots of food, drinks, and areas to sit2. The open air feel keeps it cool and feel like it are outside3. Slack line was a great touch, I am terrible at it though4. Routes change, have been 5 times in the last couple months and every couple weeks they change them so that is great. 5. Other gym equipment around to extend work out times6. Great for bringing groups of people, having fun and challenging yourself. 7. Friendly patrons looking to help navigate routes and get you to the top. Come to Vital often and let me know and we can all climb!!!", "date": "9/17/2016"}
{"review_id": "74zdVTiBrWj7Ry2TOCxS7g", "user_id": "m2gygoZRjImGU19kicSZfg", "user_name": "Kimberly M.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing! We were visiting Oceanside and a friend recommended we go here. We brought our 19 year old daughter and 17 year old son along with his 15 year old friend. They had a blast climbing!  There are walls available at all levels. They also have yoga classes and aerial silks class. My daughter and I will be coming back for the beginner silks class tomorrow. The facility is welcoming and modern and the staff is extremely friendly. We happened to arrive on their 2 year anniversary and hung out for over 3 hours.  Highly recommended!", "date": "6/16/2018"}
{"review_id": "iQLmKS02SR2Kww2q69xKkQ", "user_id": "xlc0O_4JSH-HDDZCSqUbjg", "user_name": "Sofia B.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Absolutely love this gym!!! The staff is awesome and everyone in the gym is always willing to help on a difficult climb.", "date": "11/1/2018"}
{"review_id": "npmz-6RRgcD-DK2WORzxiA", "user_id": "ozxvzOA0Bg7CRfF5JmyVgw", "user_name": "Karen P.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 1, "useful": 0, "funny": 7, "cool": 0, "text": "I appreciate the gym and climbing walls, the staff is friendly, but if you're joining for the yoga run far away--it's an absolute joke and most of the \"teachers\" are newer teachers (and practitioners) who are focused on their image versus actually teaching yoga. Note that several friends who are long-term practitioners have complained about injuries due to adjustments. As an update--now seeing a response from an employee there I'd like to mention that I have my own practice (of 18 years) and have no intention nor need to attend a class by novice practitioners who stay on their own mat when they teach because they don't have a strong enough practice to actually teach without it.  I never mentioned that long term practitioners recommended this place as a place to develop an internal yoga practice.  People seem to go here to \"get their yoga in\".  It's embarrassing as a teacher of ashtanga and vinyasa yoga of 14 years to see that yoga has come to this.", "date": "7/12/2017"}
{"review_id": "qEZzaqOfOD7wwSLds2PgTA", "user_id": "uU6hFB663BPnkGpkn6E_PA", "user_name": "Sarah S.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I can't believe I haven't written a review for Vital yet - better late than never!I have been coming to Vital for only about 4 months now. I started out at their Carlsbad location, tagging along with my husband who recently got into climbing and generally feeling super intimidated by the sport as a whole. One of the first things I noticed was the friendly attitude most climbers seem to carry naturally. Most everyone is willing to give pointers where welcome, offering their own tips and perspective on the problem you may be working on, allowing you to see it a little differently.All of the Crew members are equally as awesome. Friendly, happy to help and answer any questions, quick to respond to requests, knowledgeable and overall super approachable. The location itself is pretty large, especially compared to Carlsbad. With wood paneled walls, concrete floors and industrial-type details, it's beautifully designed. Upstairs there are some stationary bikes, rowing machines, a lounge and a bookcase for those who only come to accompany their climbers to enjoy, and a small yoga room with a sliding barn-style door that stays closed during classes (6:30am, 6:30pm and 7:45pm M-F). Downstairs there is some more equipment and a weights station where they hold the Climb Fit class. Vital is dog-friendly, so bring your pooch (as long as he/she is social and comfortable with other dogs and friendly climbers). Kids are allowed, too, but anyone 12 and under needs to be accompanied/spotted by an adult at all times, and kept off of the exercise equipment, which is for adults only. Climbing is fun for the entire family!Obviously, the actual climbing is the best part. The routes change frequently, so you're always finding new climbs to challenge yourself with. Mostly everyone is courteous and there is a great community feel amongst the climbers, beginners and experts alike. I am so stoked that Vital moved into Oceanside, and love getting here a least a few times a week. Do yourself a favor and give it a try - a day pass is $15 and the shoe rental will cost you $2 extra, and after one visit you may find yourself scraping your pennies together for a membership, because it's SO fun and so worth it! I have officially said goodbye to standard \"gyms\" forever. Thanks Vital!", "date": "9/1/2016"}
{"review_id": "h4Vu6DcwFcYgt-BlXnWcuw", "user_id": "mti3PGrRkkW3h3GpFoYHOw", "user_name": "Krystle K.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place for some bouldering action. They have great classes by superb instructors - love attending the yoga and aerial silks classes. Try them out!", "date": "3/10/2018"}
{"review_id": "AWSN2daW9g822MOJZdpGBA", "user_id": "jW_wNiJ4h2Rj0Kgcr0r3rg", "user_name": "Courtnie C.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! -Very affordable- The staff is always approachable and helpful for anything and everything. The yoga classes are some of the best I have taken; every instructor is different but all are equally amazing. The entire facility has great vibes; would highly recommend. : )", "date": "10/29/2018"}
{"review_id": "nO2mNAY364A8HTivMWas0g", "user_id": "dhqFWRznqZhlFRM9mGFtcQ", "user_name": "K W.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "As a longtime gym climber, the first thing I want from a gym is safety. I want a fall zone marked off on the mat with tape, and I want other climbers outside of my fall zone when I'm on the wall. Not only is Vital set up without any fall zones marked, the walls and angles are such that nearly half of the gym has no safe place to stand near the wall. Climbers didn't seem to know not to walk underneath others. I got really uncomfortable when I was on the wall and others were beneath me, because falls and landings are unpredictable when you challenge yourself.I hope Vital cleans this issue up, because otherwise, there was a lot to like. The light and the air in the gym are great. Everything feels so open. Prices are reasonable and the bathrooms/changing rooms were really nice. Routes were interesting, although there was a limited number of challenging options. Take all this with a grain of salt - it was one visit in April 2017. I'm sure the yelp ratings will be great, because this gym is great for introducing people to climbing-- we need that! But safety should come first.", "date": "4/25/2017"}
{"review_id": "9NSPO6cOMIcl8crD7zZcvQ", "user_id": "3TMM_CrO30OIznHBx7vnXQ", "user_name": "Beth C.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Love the new bouldering gym!   It is beautiful!! I haven't tried the yoga yet, but the bouldering set up is great!  Lots of climbs, that will be a challenge to any level of climber.  As a member you can come any time of day (or night).  Friendly staff here, and it has a community feel.  It is on The 101, near the beach.  Come check it out!!", "date": "11/4/2017"}
{"review_id": "UG-iHkEGxNTCJKViMsWqEA", "user_id": "7omcKtjKG5O9IfhKuYP2dg", "user_name": "Kristian N.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome climbing gym with great yoga classes. Super good facility with great vibes  and good people", "date": "2/13/2018"}
{"review_id": "ehRpP9huy0fBScnC-oYhNg", "user_id": "HN0BV1plDlgEYRguzz5JRA", "user_name": "Janelle S.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great bouldering gym open 24/7 for members. One of the smaller gyms in San Diego County - I have been a member at The Wall Climbing Gym in Vista, Mesa Rim in Mira Mesa, and a regular visitor at the old Vertical Hold location. Regardless of size, the setting and the layout of the facility are great. The walls are well spaced so you never feel like you're sitting in someone's fall zone. HOWEVER: I enjoyed being a member with Vital Climbing, but things ended on a slightly sour note. I experienced a lot of trouble when it came time to cancel my membership due to a move back down to San Diego. I submitted an online cancellation form and received confirmation of cancellation, BUT my credit card was still charged for the next billing cycle in spite of the fact that I cancelled in the correct time frame to avoid payment. When I attempted to correct the issue by getting in contact with General Manager Luis Falero THREE TIMES via phone and email over the course of three weeks, Luis failed to get back to me, until after I had already spoken with my bank about the undue charge. That said...Overall, I highly recommend a membership with Vital! The staff is friendly, the facility is great, and the 24/7 access is invaluable! And there is NO initiation fee as an added bonus.", "date": "2/17/2017"}
{"review_id": "l7zkGEF9capbLimfM-6WhQ", "user_id": "jckSxfZNR1Q16Ja-Ypw4og", "user_name": "Heather A.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "Vital is amazing. I never used it for climbing - strictly for their yoga classes. It was the first time I was able to find yoga classes that worked with my schedule. I love that they have the early morning class right before work. All of their yoga instructors are amazing, but Michelle is my favorite - she is probably one of the best yoga teachers that I've had thus far!", "date": "8/3/2017"}
{"review_id": "pfSPq86FdLRHRAxrdgNGrA", "user_id": "CH1AAHHlEbGo-0Y-QmKoqw", "user_name": "Leslie A.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been climbing for a few years now and this is an Awesome place to climb love all the locations and all the workers are super friendly, great atmosphere love how they have a slack line, free weights and yoga!! Definitely a place to check out", "date": "9/3/2017"}
{"review_id": "tOdoFEvqJD3a8bAzzRnnxg", "user_id": "p48vAY1WXmqm2mitYnDnig", "user_name": "Julie C.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 2, "useful": 2, "funny": 2, "cool": 0, "text": "Not great if you have any kind of mental health disorder or are easily over stimulated by music.  It feels like a constant rave and, as if the music isn't loud enough, they turn it up even louder during peak hours.  Because I really want loud, thumbing, auto-tuned sounds swarming in my brain while I'm trying to think about where every muscle is.  It's so loud, headphones would be pointless.There is 0 description of what the ClimbFit and yoga classes entail.  I enjoy the ClimbFit class, but I'm still adjusting to it and the yoga has not been a pleasant experience.   I've been out of town for a couple weeks, so I'm going to hope some changes have been made since I was last there, but I'm strongly considering cancelling. Especially considering yoga anywhere else would be costly and this membership would have to go to pay for it.Basically, if you have any kind of anxiety issues (which according to the ADA, 18% of the population are diagnosed with anxiety at some point in their lives) or any other kind of mental health issue aggravated by excessive environments, don't come here.  If it wasn't the only climbing gym in the area, I wouldn't be putting myself through so much to try and make it work.It doesn't help the environment that they let people's dogs run around off leash and children are often unsupervised by their adults.  During these same times, the limited staff is so slammed, I don't even know if they want to address such issues, because they can't.  I've stopped going in the afternoon except for ClimbFit because it is such a disaster.  But, again, haven't been in two weeks, I look forward to some changes.  I'll update this review if any of this has changed.", "date": "8/2/2016"}
{"review_id": "eofcWg3ElCT1jjZsnDR65w", "user_id": "t-Cgg3J2BAWPiAPV-b2KHw", "user_name": "Zynny L.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Honestly I joined to get over my fear of heights. I knew they had yoga classes but figured they would be bare bones basic. The yoga classes here have truly excellent instructors and a variety that will challenge you at any level. They provide expanded workshops for specific issues, acroyoga, and inversion classes all for their low 24/7 $55 a month membership with no contract... seriously-best value and rad classes around.", "date": "8/2/2017"}
{"review_id": "rUOIoUY96gStcjazOONxYw", "user_id": "f46fg7BtcF5VOdqpPD6INw", "user_name": "Victor B.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Came here for the first time! It's not as easy as one might think; the climbing that is! People and staff are friendly and the place is exceptionally clean and organized! The view of the building from the street is spectacular and draws attention to the eyes! This place is a must visit for anyone if you're looking for a nice workout, or just looking to have fun! Thank you Vital Club!", "date": "6/29/2016"}
{"review_id": "71cn_f_CMtM0PwYQKx7-tw", "user_id": "nFS-ULo2TNlyqoNP09Po7w", "user_name": "Alexis H.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I signed up for a membership in Carlsbad a few months back, and immediately checked out the Oceanside gym after it opened up. It's huge and has a plentiful amount of climbs to attempt! It's very crowded during the day, so I prefer to go during the early morning or late at night. As a member, it's open 24/7, which is so handy. They have a great set up of free weights here which is great if anybody is looking to do some weight training and climbing. They also offer yoga classes and something called \"Climb Fit\" which I've never tried due to my busy work schedule.", "date": "8/3/2016"}
{"review_id": "ivtf3_qJtOAIedRTixcv7g", "user_id": "qfRBZ5LABFlyjlBS1NS3UQ", "user_name": "Franco E.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Checked this place out three days ago with the fiancé. We got the day pass and it was a blast for the both of us! The atmosphere was extremely welcoming, met lots of friendly people from the crew to other climbers. Difficulty ranged from beginner to advanced. All ages were climbing and enjoying themselves. There is a rack of weights, dumbells and barbells as well. Upstairs has some rowing machines and a yoga room with a full size mirror.Definitely will be coming back, hopefully sooner rather than later.", "date": "7/23/2016"}
{"review_id": "grWSNAJW_70L6Iv4PLU9JQ", "user_id": "3hNEdPNzvbT_muu9BLiG1g", "user_name": "Dan Q.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. I'm new to climbing, and it's been so easy getting into it at Vital.  Everyone is very friendly.  There is also a ton of variety in routes, and new routes being set up every week. (I also love that it's so dog friendly)", "date": "2/4/2017"}
{"review_id": "vaKuzzWgyVkFl0pSjplafQ", "user_id": "QG51Dkyl_qZJYj86sgRDtA", "user_name": "Ryan O.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I used to climb at the Carlsbad location when if first opened. I just moved back to North County after being in LA for 5 years and let me tell you... Vital stepped it up BIG TIME. This new location has anything you could ever want. I've done a couple yoga classes in the AM and they weren't too crowded. Very good instructors with a nice, but challenging flow. The weight section is a HUGE plus. And the actual climbing doesn't get any better. Hands down my all time favorite gym and community!", "date": "1/24/2018"}
{"review_id": "Oamh9mjfzsh-WrjANPUz7Q", "user_id": "zpJy08uWdKFDphmrVeCSSg", "user_name": "Lisa G.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My son Rock Climbs here. It's a great place, great instructors who have great attitudes yet are serious when teaching the kids techniques and working out. They offer other routines, classes and trips but I only know what I know. My son rock climbs here, The only reason I sound like this is because, as kids, my brother and I did \"parcour\" before it was EVER called parcour. I mean we lived on acres of country land and we climbed trees, ran on (real) rock walls, got the wind knocked out of us on real rocks and when climbing from tree to tree if a limb snapped, oh well, we started swimming if it was over the pond or we stood still while our siblings laughed at us because we could only make 1 sound while being scared to death of not breathing out. The whole idea seems pansy to me, BUT Vital Gym is awesome. Adam the serious one is really quite funny and Parker ( who I nicknamed Parker...hot Parker) is the friendliest easiest going man bun bearing young adult ever!!! (btw, I am not allowed to say Parker...hot Parker in person or my son will disown me...lol) There are a few benefits to turning 52, no one takes you seriously or at the very least dont worry about you hitting on them. I love this place, it's by the beach and the instructors are awesome!!!!", "date": "9/11/2017"}
{"review_id": "qwtqapFdpn317_-PZLg54g", "user_id": "ul_oDwN_gp_GhvxHKcBTuQ", "user_name": "John M.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "This place rocks! No pun intended, well, actually several puns intended. I belong to a bouldering gym down in San Diego city and when I saw this place while at a friends party across the street, I had to check it out. The staff there were super laid back and very helpful, some places can have a snobby vibe but it seemed like everyone here wanted to just have a good time. The guests were nice as well, had a good conversation with other people working on the same climbs as I was. Now, one important thing to me is the music; it can make or break my mood. This place was playing a great variety and a lot of classic rock, which I seriously appreciated. I wanted to move to north county and was bummed I'd have to give up my climbing gym so I was so stoked when I found this place, two locations at a reasonable price? I'm down!", "date": "4/12/2017"}
{"review_id": "vDW9I6s_xLA-HdNWTjvKDQ", "user_id": "vcVqj8ydVhL6g6VP4Cwjyg", "user_name": "Sara L.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm in love with this place! We just started going to this new location and it's amazing! It's huge! I mean for $55/a month, you are getting a ton! Rock climbing,yoga,fitness classes,a slack line,a small gym set up(bikes,free weights,rowing) and a coffee/reading  and wifi area. They also have showers!! Seriously amazing!Most gyms and yoga studios in the area cost $120-$150 a month and are not as nice feeling as this place.. I'm so impressed!  I love coming in the morning towards the early afternoon. It's quiet and peaceful, and lots of room to climb. Also the staff is so friendly and attentive!", "date": "10/25/2016"}
{"review_id": "XJ7XsddO0w-3wfTGyzfA3Q", "user_id": "nFifLThqiT6SrWsEuQ7jtQ", "user_name": "Liam A.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. Went there with my Cousin recently and I personally loved it. Considering getting a membership here after our visit. Only thing that prevented me from staying longer is my hands, they were strained from all the climbing I did on my first time. But that's part of the experience, so overall it was absolutely great. Will be coming back soon.", "date": "8/7/2017"}
{"review_id": "bVWXvMRYkoAP99VYyrEZHQ", "user_id": "rgwpxGB5m4JOAn38VQ7mdQ", "user_name": "Eric V.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome fun gym! Very well designed with lots of open spaceOn top of that if you become a member it's 24hrs,daily yoga, and a great climbing community!I highly suggest taking a visit", "date": "10/6/2016"}
{"review_id": "FXx8cc-aGZ8X8w-d4PiaNg", "user_id": "7uolvi4hXIaT3GbgvoFJNg", "user_name": "Caitlin J.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been climbing at vital for several years. Great staff, great locations, and they change up the routes at both locations in San Diego", "date": "6/1/2017"}
{"review_id": "CelKk6OcDIB94lWnK9nthQ", "user_id": "cQhjjYIPlrqwOnVZTY8D0A", "user_name": "Jordan K.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is one of the greatest things to happen in downtown Oceanside! The community of climbers are really friendly. They have routes set up for beginners through expert. The yoga studio is an added benefit along with the free weights so you can get a full body workout. I often find myself leaving Vital with a big smile on my face because it's just so much fun, not to mention a great workout! They keep the gym really clean and you won't find a crusty under serviced corner in the place.", "date": "7/3/2017"}
{"review_id": "pMH4RDbc4FQHCa88m9gIgA", "user_id": "OZKVUQS2XEXz7DhglTKV9w", "user_name": "Mike C.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First class indoor climbing gym.  Building is open on three sides, feels like being outside without the messy sunscreen.  Every type of bouldering offered - Cave, slab, climb over and top out.  Most areas also have down climb holds to make downclimbing less traumatic.Cool, helpful staff made up of real climbers.", "date": "8/2/2016"}
{"review_id": "r0R6aFWt7KRvom28r0l8xg", "user_id": "3rPVCO27TQw73rjTTPE4iw", "user_name": "Jon K.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What a great climbing gym with plenty of fresh air! Staff is awesome, friendly, service oriented and easy to approach.  Whether 1st day climber or years into it they're there to support you.  Team Coach, Adam is awesome and a wealth of knowledge that he is eager to share.  I started climbing a little over two years ago, Carlsbad Vital, with my teenage daughter and Adam's skillset and positive attitude are the primary reasons of why I got into this sport-good people with good fun. They do outdoor outings which really are cool to make you a well rounded climber. Fun-fun-fun. See you there!", "date": "5/9/2017"}
{"review_id": "iDEEu1bS9eBagry-OyMttA", "user_id": "97-xhOit8OqZXl6Y_3dp_g", "user_name": "Matthew C.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love it! Great vibes, great staff, awesome facility. I saw the place on Coast Highway and gave it a try. I am now hooked. It's become my meditation and exercise. I try and climb at least two times a week and go to a Climbfit classes they have on Mondays and Wednesdays. They also have a bunch of awesome Yoga classes and all the classes are included in The membership fee. The gym is bouldering only with a decent selection of climbs for a variety of skill levels. The rocks are changed out in different sections once a week to add variety. Also has weights and benches with a campus board and finger training boards. Highly recommended you try it.", "date": "12/1/2016"}
{"review_id": "leQSUsxIVnVFYHVKFs3whg", "user_id": "lriMkRbNEx5842Hd8BcbAA", "user_name": "Chris B.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We are visiting from Texas, and the staff was extremely polite and knowledgeable. They took the time to explain the details as well as price questions. 10/10 will be back. Service and gym were great.", "date": "10/28/2017"}
{"review_id": "A_nAbYsnWPtktx_Bd2wS-g", "user_id": "mEkLFrfUugMf_ZPRcsIBlg", "user_name": "Angel G.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great People and Gym.  My 11 month old loves it as well.", "date": "3/9/2017"}
{"review_id": "RGDZf7ZXhjMloSE9UaYu1Q", "user_id": "DaAslAa3NaStChMiyRyfZg", "user_name": "Lisa B.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome! So much fun and perfect for the whole family. I LOVE how there is weight lifting equipment too. I can't wait to try some of the classes. We had a cute young gal working and she was super friendly too!", "date": "2/26/2017"}
{"review_id": "Z5pCVQzjH8q-GSH6hH48rw", "user_id": "1K5tGSHIGP70GJ3HsR4kWw", "user_name": "Nari T.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym! I'm not into climbing, I just do yoga here. But watching everyone makes me want to climb! Space is fresh and relaxing and just nice to be in. The crew is wonderful, especially Emily! Check it out!", "date": "10/1/2017"}
{"review_id": "PefPDoRKYYrmJ-m7zjwuKQ", "user_id": "64a8r3jVxY-gDzd-d8jaXw", "user_name": "Iain H.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What a great facility and community Vital has created.", "date": "4/4/2017"}
{"review_id": "kgfCu1u4RGkdY_VJ8WpGTA", "user_id": "QfTyzl4czurD4o9H69TsZA", "user_name": "Chris W.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym has been incredible.  I have been to many rock/bouldering gyms and this one is probably the one I have the best opinion of.  It is a very open and friendly atmosphere for a super affordable price.  Dogs are allowed, the classes are well taught, routes built for all levels, and right next to a bar for a post-climb beer.  I am so glad that I joined!", "date": "3/1/2017"}
{"review_id": "GLcctVEip3s-Hi8ARLQKfQ", "user_id": "FCfX3tBBmMGoonUym11IqA", "user_name": "Tim H.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love the vibe & the community. Good variety of climbs, super kid friendly. The yoga classes are good to, especially the price for members", "date": "8/4/2017"}
{"review_id": "7sDpoafDlYQ-mmGmR6WCEQ", "user_id": "UVnBjDlcMxo3EimUszAw1g", "user_name": "Valerie H.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My sister in law took me here tonight and showed me the ropes. I will be purchasing a membership very soon. Lovely came by and was so energetic and sweet. She needs a raise coming to work so late! I will be back very soon.", "date": "10/15/2016"}
{"review_id": "jyXwj5TUyo299YOCRi_CnA", "user_id": "wRRKT6nLzkpma8VRn5qN2g", "user_name": "Conner A.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place!  Full of beautiful people.  Great music! Cool style.  Truly enjoy going to Vital to relax and focus on improving my mind Body & Spirit.  Thank you Everyone at Vital for being a positive in my life", "date": "12/1/2016"}
{"review_id": "j3pkwYw84amy44TSL_T-aQ", "user_id": "MsZ8xXdxQ2JzkkNkM03mMA", "user_name": "Shaun H.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've always wanted to be a member at a climbing gym, so when Vital opened its Oceanside location, I didn't hesitate to check it out.After being a member for a few weeks, I couldn't be happier.  I have yet to take advantage of the yoga or climbing classes, but I plan to soon.I highly recommend Vital to anyone who is looking to get in shape while having a great time.", "date": "9/1/2016"}
{"review_id": "ffAhbnKtpGmra4gk2v2p-Q", "user_id": "VRECer7kgIQ3Gvav4EUkqA", "user_name": "Pre P.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We have climbed at vital in Carlsbad, but decided to check this out since they just opened up yesterday. This place is huge, has yoga classes, and other workout equipment. We came in towards the end of the day but it was still lively. The staff is very friendly and the setup is awesome. And hey, the great perk is that it's right next to Bagby's and is right on the 101 just a few blocks from the ocean :). Definitely check it out if you're an experienced climber or a beginner. It's worth it!", "date": "6/19/2016"}
{"review_id": "cRIoOpZszv9slqajFEmmqA", "user_id": "AkAxToRLxWY2V8l5AEP0hg", "user_name": "Jason A.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is solid. Great climbing, yoga, and workout equipment. The staff is really chill and friendly. As a member you have 24/7 access to all of the locations, too! It's one of the best climbing gyms I've ever been to.", "date": "2/1/2017"}
{"review_id": "g7K8kaCP7uBuMnRDHuJMXQ", "user_id": "eH5M34I2Lusjk2H9ibgVdw", "user_name": "Jada R.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Well after a few months of member ship I could never get a hold of any one. The oceanside location for some reason didnt answer phone for 2 weeks of trying and leaving voicemail. I finally called another location and they told me oceanside has been very busy and they are short handed and the owner is on vacation. 2 weeks later still no return phone call. I was able to get the owner email address and will.need to email and hope to receive a reply.", "date": "7/16/2017"}
{"review_id": "iIkt7jYP4ZKtqV40wu359g", "user_id": "ceTqQTWsixriwuXhv9cDIw", "user_name": "Eric K.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I had a membership here for 6 months. I love the staff. Adam is very informative to any question you can ask. Unfortunately the management does not reflect the staff members. I was hospitalized, could not climb and had to refund my membership. They refused for weeks until I had to threaten to take them to court. On top of that I was not refunded my climbing competition fee because I quote \"we spent your money on the refreshments for the competition, so we cannot refund you, sorry for the inconvenience\". I was never contacted back by the owner. Apparently he is to busy to take care of paying customers. So they are okay with swindling you of your hard earned money. To pay for their mistakes. It gets FLOODED! With kids who are completely unsupervised by parents who sit on their phones. Dog hair everywhere. No heat or A/C. The entire gym is only cleaned once a night.... not to sanitary place, I picked up a horrible staff infection from the gym equipment, partially the reason I was hospitalized. Still was never refunded my money.", "date": "6/24/2017"}
{"review_id": "ULnoA50PAMsdoSnBpIASxw", "user_id": "YkGDwV2BelwFzgtClZDGLQ", "user_name": "Phebi F.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is probably my favorite place to come to after work. The staff is always welcoming and will actually talk and hangout with you. They will even show you ways to help your forearms not die immediately. The yoga classes are fantastic, the routes get changed up on the regular and the are always fun and challenging. Over all love it here , I bring my dog, I bring my friends. The only thing that would make it better would be as a member to be able to have one free guest pass each month.   ;)", "date": "9/1/2016"}
{"review_id": "zC2xb0DB7Sg5AwqG2xHtLQ", "user_id": "rje3ZaFZ_HEOr4a0j3rwvQ", "user_name": "Jerry G.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Haley is a great rep for vital climbing ! Very well spoken and a such a sweetheart ! Give the girl a percentage of the company already !", "date": "7/16/2016"}
{"review_id": "NbtpumhbO0IYW_APm5RdCQ", "user_id": "mqof0aq7501NDe40OrRYqQ", "user_name": "Brian L.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love climbing at Vital. Super friendly staff and members, kind tunes playing and a relaxing atmosphere where you are able to push yourself at your own pace. Being a more non-structured workout person, this place works great for me. I go there to play & challenge myself and wake up the next day sore and happy.", "date": "8/5/2016"}
{"review_id": "4y54FUQd9BzJ-naG0_rnfg", "user_id": "kB-ujmHIvgSTHN91CNAnFA", "user_name": "Nathan R.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a blast. If you haven't climbed recently or ever, it will initially work muscles that you haven't used in a while. Since you will lose track of time and forget that you are exercising, you'll be sore if you don't take it easy. It's worth it.", "date": "9/21/2016"}
{"review_id": "q36S-xEwfrYs6T1dTySXiw", "user_id": "PxdMC9va64L0Z_PVM4YntQ", "user_name": "Steve B.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun, 5 Stars, will climb again. This is the 4th location for this gym by owners Dave and Nam.  This location is the largest of the 4 and offers so much. The fitness trainer is top notch and the staff is super friendly and knowledgeable.  Honestly my favorite climbing gym to go to.", "date": "6/18/2016"}
{"review_id": "apeJSaC-gnk0gBvJKvhZ7Q", "user_id": "UJnwB2WuDvH01kDh6Vu30w", "user_name": "Alonzo R.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place is great. Even if you are brand new to the sport, the great staff and patrons are more than eager to show you the ropes. Plus, there's yoga, a slackline and free weights to get even more out of your time here. I highly recommend stopping by at least once. Horrendous parking though.", "date": "2/18/2017"}
{"review_id": "B_R2N0lj6YhOwL_tmfNfyw", "user_id": "fP2ESvskxnAuzpRH2nuS0Q", "user_name": "Gezelle W.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Easy going gym that is FUN! Flexible access. Awesome equipment. Always clean and inviting. The yoga classes rock! Everyone is always so helpful and friendly. I vital!", "date": "5/9/2017"}
{"review_id": "6L2QZgQi51PrQSSRuHpXZw", "user_id": "r7FuAXGLZdapFEfl-drWWA", "user_name": "David V.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Checked it out on their opening day and it was an absolute zoo but I could see the potential for this place becoming my second home ...so I signed up for a membership and got a 10 pass punch card so I can bring my kids/wife now and again. As with anything this awesome it can become busy but with time you learn the traffic patterns and of course as a member I can come early morning or late at night to avoid the public hours. That being said, my favorite part of bouldering is the social aspect and Vital is the perfect place for that. Nothing beats figuring out a new climb with some friends and then when your forearms are shot you get to head across the street to Bagby's for a celebratory beer! Good range of routes, some easier climbs for beginners and kids and plenty of difficult ones that require equal parts strength and finesse. I'm somewhere in the middle but can already feel myself getting stronger and can't wait to head out to J-tree this fall and see how much I've improved since last year!", "date": "8/4/2016"}
{"review_id": "xaeaXIRO1ux2iFeGYKbijg", "user_id": "XWJOKHYoxvm2618cu1D4Vw", "user_name": "Jeremy B.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Spent the afternoon here on vacation from AZ as our three boys were climbing. Sat on the couch reading and watching. As a physician that employs people and deals with the public I was very impressed with the fellas working here- Parker and Adam. To the owners of the gym feel confident and appreciate a couple of very good employees. Great with people, kind, and sincere. Went back in the evening and I think it was Sam and he was also very good. We will be back and I can't recommend enough.", "date": "7/30/2016"}
{"review_id": "pLFW-LhJkvEXHxh1PE0_kg", "user_id": "pVCwrSxWaNxOWwCQQMYp9w", "user_name": "Costa B.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is Sweet!! The routes are awesome and the \"Hardcore\" class with Jamie will no doubt whip you in to shape. Great for kids as well.  An all around sweet spot to get in a challenging workout on and off the rock!! Way to go Oside Vital!", "date": "7/5/2016"}
{"review_id": "IKbWwLQEA6BVE09uAWvcQQ", "user_id": "SF_4G_FLmETuJM0mKPTrAA", "user_name": "Peter P.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Lots of routes for all ages and levels of experience, also an incredible staff with a good amount knowledge on the activities. Awesome facility.", "date": "7/3/2016"}
{"review_id": "c3TXuHS8TeAWAiyK3u6Wrg", "user_id": "E5lNonLIVIWCtuffYmx8WQ", "user_name": "John M.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love Vital! I'm new to climbing, but I have had so much fun at this gym. It has a very communal feel and everyone is super friendly. In addition to bouldering, the gym has free weights, slack line, a couple spin bikes, and free yoga classes. And it's open 24-7 to members! I definitely recommend this place to people of all ages.", "date": "6/2/2017"}
{"review_id": "Vmh6UrjYxLngjFpk5wqSdw", "user_id": "M9-BXxvngpYEpazd74Efkg", "user_name": "H S.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I was very unhappy with the the \" Manager\" Luis Falero's Customer Service skills and willingness to accommodate his members concerns with membership details. I had meant to cancel my membership and was one day off rather than deal with the hassle I just paid the $60 over emailing the manager like the staff member I spoke to on the phone had mentioned and then followed the steps to cancel online or so I thought.. When I was charged another $60 the following month after I had already canceled or so I thought( Did not still have email to prove). I reached out to the manager who was completely unreasonable. I had paid $180 in total to go ONE time.. This is not counting the two previous times that I had dropped in before becoming a member and brought a large group of people with me. Even after I had explained my situation I was responded to very corporate rather than situational based.. Apparently $60 is worth more to them than having a happy customer.I will no longer be recommending this gym to my friends nor will the ones that I referred  be coming back.. too bad! ..", "date": "5/16/2017"}
{"review_id": "jXXlGj9l5wXE_XCeLoVZqw", "user_id": "NYANySGj8WFEiPWeQVt1IQ", "user_name": "Chloe L.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vital's as rad as it gets. Got my membership for the climbing, stayed for the yoga. The instructors are everything I want to be when I grow up!", "date": "3/10/2017"}
{"review_id": "7l1MA4OJVtgOSd_J4pvHXg", "user_id": "KS-edDJ9dk0ePx9zhxSraw", "user_name": "Aaron P.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just started bouldering over this past month. I love going to Vital as a Member because I work long and bizarre hours, but I can always use the monthly code and boulder in the middle of the night if I want to. It's been a lot of fun.   You can also control the music in the place if you want to, built in pandora or hook up you iphone/music player.  Highly recommend it.", "date": "12/2/2016"}
{"review_id": "FzbeYzf-U_7GqTi4CT0nEQ", "user_id": "wfWUxRpExxQLylftM1CL8g", "user_name": "Jay L.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This location is absolutely awesome. Brand new. Clean and well organized. There is everything you need to have a great time climbing. There is also some free weights and other equipment to get your work out. It is a very fun place. The staff is super friendly and helpful. I have been a member for only 1 week and already hooked. Been there almost everyday. I highly recommend it. Keep up the good work Vital Staff.", "date": "7/1/2016"}
{"review_id": "PQkr8V4UitzDJNq_yL6zzQ", "user_id": "KTQfTYC5g-OWeNtwzY6isg", "user_name": "Karrene H.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Never have been rock climbing before and when I did it was a fake wall with a harness attached. My husband and I drove by this place the other day and the next weekend we checked it out. Wasn't at all what I thought I was getting myself into. So much fun!!!!! We did the day pass: $15/ per person and you can leave and come back all day. The walls are marked by difficulty levels so you know which ones to try. Very easy to navigate. It got pretty busy when we went so we did have to wait to climb some walls, but it was fun watching others and seeing how they got up to the top. The place was clean and very open. They have areas the rest and hangout when you get tired, believe me you will. They offer yoga and 24 hour access if you're a member. I think they offer other stuff, but again I'm not 100% sure. The staff was friendly and helpful. Bring chalk, we didn't know so after a while your hands get Raw. You will wake up hurting the next day, but you'll feel like you just did a great work out. All in all we will be back and it's sparked a liking and interest to climb in me!!", "date": "11/8/2016"}
{"review_id": "qbhBVPWOdMpAdafHuch06A", "user_id": "kRtjS9FjApEqen0dmxU8pg", "user_name": "Payton D.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vital Climbing Gym is amazing! My husband and I are members and for a very reasonable price, we get yoga, climbing fitness classes, and a 24-hour access to all of their locations. The atmosphere is laid back and friendly; the yoga classes are challenging yet encouraging. I'm thrilled to be a part of this community-friendly gym.", "date": "8/2/2016"}
{"review_id": "TGhr_-8oodRBoHgS8O3Bjw", "user_id": "QrqfFKXTFNR2-J8QHWjz-A", "user_name": "Rita T.", "business_id": "kNS9YGquy0KwL_KAmVuPpQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The yoga classes are great, schedule is good for someone who works, but there are a few things that don't work well.  One is the parking situation. I went to a 6:30 yoga class and ended up driving around the block six times before I could find a parking place. The issue is not with the gym, but Bagby beer across the street.  Not only do they have their own parking lot (which at that time of the day, was full) but their patrons park on all of the side streets.  Maybe it's better earlier or later, but at that time, it's a nightmare.  The other issue is the class itself.  I took one of the warm classes, and even though it was a good class, the room they have it in is not designed for heated classes. There is no air circulation, and the class was packed, so by the end of the class, the humidity level was very high and everything in the room was damp, including the floor.  I almost slipped and fell while walking towards the door in bare feet. (I don't think the flooring in there will hold up to constantly having that much moisture on an ongoing basis) I enjoy Vital gym, but cancelled my membership because of this. I may re-join if they build a bigger yoga studio to accommodate the large crowd it attracts.", "date": "7/1/2017"}
