{"review_id": "OJdo6zZNe_xCTMm0ssQwOw", "user_id": "rT024OojWoPY_zsinrkT7w", "user_name": "Marya J.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So far I like this place. The coaches are awesome and so is the facility.  Looks like they are making upgrades as well. The team concentrates on safety.  This is a plus for a mom.  There are a lot of practices which I cannot accommodate.  But if you can make 3 times a week this is best.", "date": "12/22/2018"}
{"review_id": "9WiO8U3bDfmFbYoEeOnGRA", "user_id": "ljn4msYAqcW5gHgI62onxw", "user_name": "Jennie R.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We love this place! You are greeted by staff with big smile every time you walk in. They are friendly and treats you like family! All the coaches are amazing. The staff loves their job and you can tell they only want the kids to grow and learn all about climbing.  I use to never feel comfortable leaving her at  practice at any sports  but here I feel that she in good hands and while climbing  she is with good coaches to guide her . The programs are  affordable and they are very understanding! My kids just loves coming here.", "date": "5/21/2019"}
{"review_id": "oiCg8w4Ovm2k1DuYNcjm2w", "user_id": "7103VMy5luZA3BpkBEtCog", "user_name": "Rachel N.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Had a nice climb here! I don't go climbing often at all but it's my fiancé's old haunt so we checked it out when we were in the area. Glad he was along to explain routes and such... I didn't even realize there was another side, derp. This place doesn't have anything to climb down on other than the wall, which for beginners like myself can be a bit intimidating while I'm learning to trust my feet. Especially in rented shoes. I'd give it another go sometime.", "date": "10/2/2018"}
{"review_id": "BwK6jYn8M0b6WVuavNlChw", "user_id": "Ke6ULh3vx6QmlKmiQywflw", "user_name": "thuy n.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great.  It's like walking into the bar Cheers, where everybody knows your name (or at least recognizes you). The other climbers are friendly, helpful, and supportive and there is a nice community feel to this place.  This place is also great for kids, especially teenagers.  I think climbing challenges them, gets them in shape, increases their sense of competence, and builds their self-esteem.", "date": "4/19/2019"}
{"review_id": "3thrNG8r9AyPQ605fDEF6A", "user_id": "J3lhOzKv0xLEB-DNNT4ZLw", "user_name": "Jody D.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had never rock climbed and came with a friend and brought my son and his friends. Both boys were 12 and not experienced rock climbers. We all tried bouldering and top rope and Dillon(one of the owners)  was helpful in teaching us how to top rope. I enjoyed it so much I came back a few more times with my son and then joined for myself. I am, in no way, a cool rock climbing chick...but the owners were always kind and helpful and were the other climbers in the gym. Eventually, my free time was limited so I dropped my membership. I took my son back last weekend; it had been over a year since the last time I climbed and Dillon remembered both of us and was so kind. My son can't wait to try come back!", "date": "3/29/2019"}
{"review_id": "lNztK-jMT3fiE59XajuryQ", "user_id": "lT8GMwid9h0hShr7lDroIg", "user_name": "Bri S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 10, "funny": 8, "cool": 7, "text": "Good gym for climbing for bouldering or ropes.  Affordable, pretty fun / laid back and challenging, long hours. Located towards Foothill Ranch in the back of a business park. Been around for 4-5 years but just tried it out for the first time and it was pretty good.  Unlimited monthly membership so I'll be back.The only head scratcher is they say members get free rentals and chalk. When you go up and ask for chalk they act like they don't know you. Maybe joking but it was weird. Why even put it on the wall if it's not a thing?Note this is not 24hr fitness in the wintertime it's chilly inside layer up.  Dunno how it is in summer. They also have exercise machines for members, and a ping pong table.", "date": "1/20/2017"}
{"review_id": "j0lvQ7i_1ytocBiJhOqYBA", "user_id": "KcuYNfY5olGTKU6PIMV7Gg", "user_name": "Hungry H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 1, "funny": 1, "cool": 3, "text": "3 stars for Gym quality - they have a decent boulder section, but the top rope wall is limited and the overall gym itself is pretty small. Also, you can tell the equipment is pretty dated and there were places were you can see plywood covering certain areas up. Since it is on the smaller side, when it gets crowded, it can get tight and longer wait times. 4 stars for having keg every 1st week of the month so you can drink and climb. I also think it's more of an affordable option compared to some of the other climbing gyms nearby. Everyone is pretty hospitable and the environment is super laid back, informal which I can always appreciate! It's worth checking out - Climb on", "date": "5/11/2018"}
{"review_id": "SpsRS3Tk1F3sTwasUeGaMw", "user_id": "hj1MJimLFUcUZMNbQjovkA", "user_name": "J J.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really love it here.  A great group of people and their climbing walls are solid.  Highly recommend over other places too!!", "date": "12/9/2018"}
{"review_id": "VB5dtxre5lUJg13cSoWmUQ", "user_id": "kPBxVNUosDsTL5-wHjrdPA", "user_name": "Diane V.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 1, "cool": 4, "text": "Best climbing gym ever! I'm so glad to have started my bouldering and top rope experience at ACG. In comparison with some other climbing gyms I've been to, nothing quite matches the quality of the customer service, the challenging fun routes, and the community of folks who boulder at ACG. The staff/owners - Trevor, Brent and Dillon are all really friendly and open to giving pointers and safety tips. I have only had positive and friendly encounters with them (and also with their cute doggie)! Some of the climbers here say that the routes at ACG are more difficult than some other gyms in the area (i.e. a v1 at ACG is a v2 elsewhere). Part of that might be due to the fact that some of their bouldering walls are taller, enabling the route setters to create longer (and more interesting as a result) routes. Another cool aspect of the gym is that the people who boulder here are so chill. You can openly ask for advice on how to send a particular route you are having trouble with and most of the time, people will try to help you out.", "date": "1/19/2018"}
{"review_id": "ykZAHKMoazLYUjt0E8nOMw", "user_id": "-hX8nYujbL0gGHAEec_76Q", "user_name": "nicholas c.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Dropped in while on vacation. Great climbing gym for old wall construction. Setting is solid. I had a lot of fun here. -1 star due to late opening hours.", "date": "12/29/2017"}
{"review_id": "kLh4zPQxM1H4SBVWhKaCMg", "user_id": "XLgs2uOdiG82AxjI-lyC4g", "user_name": "Ashley D.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome climbing gym! There's a wide variety of routes for beginners and experienced climbers and they've expanded their bouldering area as well! The staff are extremely welcoming and gave us a quick tour along with some great climbing tips. Everyone climbing at the gym was friendly too and they helped us out with some routes when we needed them! ASG has a great environment, we will definitely be back to climb more!", "date": "4/13/2018"}
{"review_id": "aBke2Pzv155q005X7U1mcg", "user_id": "DY_Ls-OTQZ5dr46hRIL-8w", "user_name": "Hope D.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I went here on Friday with a group and only paid $15 for a harness, shoes and a full evening of climbing. I like that they stay open so late (til 11 on weekdays). The staff were pretty friendly and helpful. I don't have my own pair anymore as the ones I've worn in the past were a good quality pair of hand-me-downs from my older and taller sister. I'm bringing an authentic, quality pair of shoes next time (whether they're borrowed or bought new) as the rentals weren't great for gripping at all.I really wish the walls were higher for top roping but I had a good time bouldering and trying out this place with all of its paths as new climbs are usually fun no matter how small you think the walls seems. There were a variety of difficulties and labeled pretty clearly and the grips were all differing in shape, size and texture.Definitely fun! I'd go again for a good work out but I want to go to a gym in Orange County that's a lot higher. (30' or more)", "date": "2/19/2018"}
{"review_id": "1ARQ45qb73Cp7w1V34w3BQ", "user_id": "NrvUoVo8tjhHhsZK2vjs0A", "user_name": "Nate V.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "When I first started going to AGC, I thought I couldn't do it, and I was REALLY nervous. My friend already went there and said it was amazing, and he was on the climbing team they offer at AGC. When I tried it out, it was a BLAST!!!  I had a lot of fun and now beg my parents to go there daily because I needed a challenge that was difficult but fun at the same time! If anyone has fears about this place, trust me, you will overcome them here! The staff are very helpful about shoe sizes, which wall to climb if you're a beginner, and they are just friendly in general! If anybody is looking for a good and exciting rock climbing place in orange county, this is the place you NEED to go!", "date": "3/5/2018"}
{"review_id": "BGvYv6RrWxOxg5e611IT2A", "user_id": "8VSQa6hfnkWAn4qpSyzwUQ", "user_name": "Matthew J.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is a bit out of the way from the freeway but by far worth the extra distance, the quality of climbs to start is the best I've seen. The staff that run it make you feel as though you're a part of a team or club rather than just a paying member. The people who climb here all have a welcoming and helpful social vibe and will motivate and cheer you on as you attempt a hard route. Unbeatable for the area and definitely have and will recommend to friends.", "date": "2/15/2018"}
{"review_id": "sR_HdHJ3mjafNz6BTlk7wA", "user_id": "vbVjDcuX8zi0Hp-LiVtqfg", "user_name": "Youssef N.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I climbed here for about 7 months, then I was gone for about 5 months. When I came back, they just restarted my membership with no problems. They were super chill just as they've always been; very welcoming and friendly place! This gym is definitely unique in its vibe.", "date": "12/23/2017"}
{"review_id": "lK_57WQC0ei8UZm_UD0EWQ", "user_id": "U1Nbo2wMqUcHQBJSMzOiKQ", "user_name": "Austin K.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Aesthetic is a cool gym nestled up in the business park.   I was visiting my parents for Christmas and figured I would check out the local climbing gym.   I brought my sister as she had tried bouldering for a b-day party and wanted to climb with me when we were both home.  The good: Clean facility, free shoe rental (if you need them), communal chalk, friendly staff, clean restrooms, and good prices ($15 day pass).  The bouldering problems were pretty good, but I feel like some were harder than their listed grade.   There were not many vb/v0 problems with big jugs that would make it easy for a new climber to accomplish a few problems.  While there were a \"easy\" problem on each wall, I feel that most were too difficult for a pure beginner like my sister.   A word of caution: the top out section is really tall for how firm the crash pads are.   You could definitely get hurt if you fall on the last move.   I would come back, but I am not sure if I would recommend this for people for their first bouldering experience.  (Note: I did not do any rope climbing while there)", "date": "12/30/2015"}
{"review_id": "tSfHt7YvJWGuyLnYwaKCaQ", "user_id": "fbCr7_XOKqjOwSY9KJAF1w", "user_name": "Dan W.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with some friends. The place was super chill and the owners very nice!! They were very accommodating for my first time here. The gym is quite big and has a variety of different things to do climbing, bouldering, slacking, and etc. Courses we're good, had a range of easy very challenging. Didn't have time to check out everything because I came a bit late but will come back for another visit!", "date": "10/15/2017"}
{"review_id": "Gq5008padAgNUqRaBF-X8w", "user_id": "FWEmJQspgDBsi7nK4TV9FA", "user_name": "Matt A.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Family-run vibes and ever-changing routes make this gym great! Be ready to be treated more like a friend, rather than a customer. I went from being completely new to climbing, to showing up almost every other day. The community that the owners have managed to bring together is incredible. Everyone is super friendly and helpful, and it's a huge part of what makes climbing so enjoyable. Whether you're pushing for progression, or just looking for something new to try during the weekend, I highly recommend checking this place out!", "date": "7/10/2017"}
{"review_id": "UnrkwdjARO2sPplr7rWztg", "user_id": "nAoFxTn2SImF5W2rvfFEvA", "user_name": "Becca T.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Beginner or intermediate climbing this place is a great spot for climbing to train or just have fun! My husband and I went here on a double date with another couple and we had a blast! For $15 we stayed for 2 hours climbing on the wall with no harnesses and the wall where you are harnessed in. Trevor was so friendly and down to earth. He showed us everything but let us go ahead and do our own thing. I don't really know all the terms of climbing, I'm totally a beginner, but it was so fun trying to use the patterns mapped out on the sheet to complete the climb and be challenged. We live in HB and would totally keep making the drive to do this more often. It's such a great workout and all the people there are so friendly! The sentiment behind the opening of this gym is so sweet. Ask them why they opened it in the first place. Looking for a fun date idea, or a different way to work out, go here!", "date": "5/31/2015"}
{"review_id": "gUT3W9_VFLoPGg78lkhglQ", "user_id": "DzxIqO2Ezes_k1DToLC65A", "user_name": "Liz C.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Revisiting this morning while in town today for the holidays, we had an even better experience than previous!  When we walked in, with all the renovations since our last visit, we were excited to see many of the changes Michael had mentioned to us he was planning the last time we were in town...  they had just opened a BRAND NEW BOULDERING AREA just two days ago with an abundance of routes and quality padding!!  In addition, they resurfaced all the walls of the the top rope area, making it brighter and great for smearing, and added an EXPANSION which included a small chimney/arch area.  The routes we climbed were well thought out and interesting.  As we were wrapping up, Michael and Hillary were just arriving, and it was like saying hello to old friends.  It's great to see Aesthetic continue to grow while maintaining a friendly family-business feeling.", "date": "12/24/2017"}
{"review_id": "-LAfnUYgzTRtMiZcoifDqA", "user_id": "438uozi2bxVTBE37Ip3WUw", "user_name": "Emmie S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I visited this gym the other day with some of my friends to try out the bouldering problems.  I've been to other climbing gyms around LA, both Touchstone climbing gyms so that's the frame of reference.  This gym had a communal, recreational feel.  It definitely got more crowded after we arrived around the bouldering areas. Towards the end of our stay we did have to be more mindful of where we were climbing and had to wait for our turns.  But the gym itself seemed very friendly and a great place to climb with friends.  The staff who greeted us were nice and positive.I do have a few complaints about the gym, however.  The bouldering walls lacked safety ladders which I really wished they had.  This affected me a lot while climbing because if I was stuck midway on a problem or even if I sent a problem it was often difficult to navigate my way down.  And really, by the time you're up that high your strength has diminished immensely that it's very difficult to climb back down.  Often you just have to fall, and this could be a problem when you're at an awkward angle or just really high up.  I have ankle and knee problems, and while falling is part of the sport, it's always nice to take any safety precautions to prevent injury.  Also, there's a particular bouldering wall that goes pretty high up but the pads beneath it only extend about 4-5 feet from the wall.  You could definitely get injured in this area if you landed in the wrong spot, and having some kind of ladder would have made this wall much less terrifying.One other complaint I had was that the routes were a bit confusing.  To figure the grade of each route, there would be a handwritten key/chart designated for each wall, showing the grade/color of each route.  Sometimes it was confusing to figure out where the start of a route would be.  In the end, my friends and I just ended up ignoring the charts and just hopping on random problems.  But really, I loved this gym and I would recommend others to come and try it out.  The routes are challenging but fun, and it's perhaps the most affordable climbing gym I've been to.", "date": "1/3/2018"}
{"review_id": "XyJDS1zT79HmS7H8Kb7eng", "user_id": "xkrRqxe_X9jwzfxgYXGCXQ", "user_name": "Cohiba S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Very welcoming staff and very friendly.  It's a super bargain considering $15 includes harness and shoes all day.  Good bouldering and top rope with a auto locking belay that's fixed to the ground. This lets someone lighter belay a heavier person. There is also a ping pong table, lunch room (I assume for people that spend all day there).  Definitely would go again.", "date": "1/4/2016"}
{"review_id": "Ftk3ewz1qLcaRsRLPg1WMw", "user_id": "TbQrK7xLI7U1D_KLLeWgYA", "user_name": "Mindy B.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First climbing experience. $15 for a day pass with equipment and chalk. Good instruction. 5.6 levels are definitely  doable for beginners so try the 5.7 levels first. I'm not athletic so 2hrs was enough. I wish there were  more beginner routes.", "date": "4/29/2017"}
{"review_id": "6FXTTq22-8sxyJREsqSo1Q", "user_id": "AopwIrPJUVIZRAFVRE2Uug", "user_name": "Tracey T.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 1, "useful": 4, "funny": 1, "cool": 1, "text": "The first time I went, apparently the 'boys'/owners had too much fun the previous night and did not show up.   There were a number of people waiting outside for someone to open the door.   One woman was texting the mother of the 'boys' to see if they were coming.  We all waited quite a while before we gave up and left.   So much for a climb during a lunch break.We did go back and I signed up for a membership.  As it turned out, I did not use my membership often enough so I was going to cancel. However, my daughter (who does climb) was in town so we thought we would go and she could be my guest on my membership.  I signed in and was told that my membership had expired (thought that I could have signed up for a 3 month plan) so I paid for the 2 of us to climb.  I had originally planned on cancelling my membership at the end but since I was told it had already expired PLUS I paid for us to climb, we went home. Turns out, it had not expired.  I take full ownership for not checking more closely but they had been charging me every month since - for 9 months.  I contacted the gym and all they will do is stop billing me.   No credit for any money I have paid to them - when they told me my membership expired. I received an email from an owner - he has the ability to remember me coming in to sign up - he remembers me with my friend (who was with me when we were waiting that first day).  However, nobody had any recall of them telling me it expired.   I even provided the Credit Card entry showing I was billed $40 the last time I went.  I paid for chalk and 2 climbs - but all they did was argued the bill.    There is not much you can buy there if you have gear and a membership so why I have a $40 charge is a mystery- unless of course they told you your membership was CANCELLED!The gym is ok - but management SUCKS!", "date": "9/8/2016"}
{"review_id": "RHxi5ClMPsjut4NfCSXUHw", "user_id": "wbf-H6omBXyqlOchvTBTuA", "user_name": "Joe K.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 1, "useful": 7, "funny": 4, "cool": 2, "text": "The owner was extremely rude to my wife.  Her and her sister called numerous times over the past month to confirm that they were going to be open on July 4th.  Every time they received the response that they were going to be open \"normal business hours.\"Come the fourth we arrive and are told that they are closed!  The sign in the parking lot directing patrons was still up, the doors were still open.  I think they decided to close last minute to BBQ and hang out rather than work.The owner told my wife that she had to check their social media sites to get the latest info (isn't calling even better?), the information that she received was incorrect, and \"uh, don't you know it's a national holiday?\"  I can tell you she obviously knew it was a national holiday... which is why she confirmed hours beforehand.  He told her it doesn't matter how unhappy you are, it doesn't change that fact that we're closed.  My wife was extremely aggravated and upset over the situation as we had people out of town and this was all pre-scheduled and arranged.  The major kicker was that they were not apologetic at all.  When my wife told them that that was the main thing that irritated her, they yelled across the parking lot \"WE ARE APOLOGETIC!!!\" (doesn't sound like it buddy).I'd highly recommend others to check out Sender One or another gym in the area.  There are so many high quality ones I'd hate for you to come here and have an experience like our group did.", "date": "7/6/2015"}
{"review_id": "fjGvinGpa3HGfri4XRj5aA", "user_id": "TzCVO7hpMS6dKE9NfJjPIQ", "user_name": "Yemi O.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "Great place! Staff is super friendly and helpful. The space is clean and has a laid-back kind of atmosphere that I really enjoyed. I'm a beginner and I'd recommend top rope climbing if it's your first time. Bouldering is fun too, though(:", "date": "9/18/2016"}
{"review_id": "WX3bIUGohYrPg8NAQjP9LQ", "user_id": "Xj2psCQsRLd6QzyuxMguUA", "user_name": "Melanie B.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for our first climbing experience... The owners are passionate, knowledgeable and talented!! We will definitely be back again!!", "date": "2/17/2017"}
{"review_id": "vaS56OwJtVgtZUxCNDv_iA", "user_id": "l1f9NjI7VwR79dGMb3cCpw", "user_name": "Max M.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "So a week ago I got the Groupon deal - x2 one-month climbing memberships with free rentals and chalk, and 2 of their classes for each membership ($30 dollar value each - 4 classes total) for right around 45 bucks total. Sweet deal. My girlfriend and I met Trevor when we got there, who set us up with shoes, harnesses, chalk and taught us how to use the auto locking belay devices. He's a rad guy who always seems cheerful and always happy to stop whatever gym-improvement related task he's on to help out a member with anything. He even remembered me by name since day 1.If I had to give some sort of comparison/analogy for this place, I'd call it a \"mom n' pop\" climbing gym. Granted, I haven't been to many of the other gyms in OC (just a couple), but this one felt different right away in comparison to the other gyms.I've seen all types of skill levels in here and I've yet to see the place get crowded to the point where it interferes with my climbing (let alone being crowded at all). If a certain wall is taken, there is always another wall with the same level route that's open and even if you're sharing a wall with someone, the crowd is friendly and everyone takes turns.A shower, bigger bathroom, etc. would be cool as someone else mentioned, but I've looked into leasing warehouse space myself and know that those are hard to come by - no big deal, there's a 24 hour fitness across the street for showering before work.Ideas for improvement: Although I doubt anything would ever get stolen from this place, having the little cubbies for your stuff in view while climbing would be cool just to keep an eye on your phone, keys etc. Maybe move the cubbies onto the angled wall next to the wave?Anyway, I need to stop wasting time on Yelp and go climb. Awesome gym. definitely renewing my membership after the Groupon expires.", "date": "7/19/2015"}
{"review_id": "9hnqhnoPi6mdPOvFprdBuQ", "user_id": "Nh-ZcT0pf5TswY2YgLJojQ", "user_name": "ATefeh E.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I was looking for a climbing gym for a while, I checked a few out but non looked good to me until I walked into this one. very nice/friendly staff, good prices!! Definitely recommend to try it out", "date": "9/27/2017"}
{"review_id": "bfpeUwcXk-863aVjADxcxw", "user_id": "AvSynsN0GKlZUPR5Ib1PCw", "user_name": "Dave L.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 18, "funny": 5, "cool": 7, "text": "We booked Aesthetic Climbing Gym for my son's sixth birthday party.  Yes, that means we had a bunch of five and six year old boys running around this place.  The kids had a ton of fun, and so did a few of the grown ups.We have two pretty active boys who like to climb on just about everything - jungle gyms, rocks, sofas, parents, you name it they want to try to climb it.  I used to be the same way, so maybe it is a genetic thing.  Anyway, we decided we would look at doing a rock climbing party for our son.  We looked at a place in Costa Mesa that said they did not recommend rock climbing parties for kids under 8.Undeterred, we contacted Aesthetic.  They were very helpful and accommodating over the phone.  They said they have done parties for five year old kids, and the kids have a great time.  The deal was 11 to 15 kids, two hours of climbing with some instruction and full time supervision, and a party room for $200.  If you have hosted a kids birthday party recently, you know this is a pretty good deal.Unfortunately, my son was involved in an accident the Sunday before Thanksgiving.  He was still in his sling on the day of his party.  We had decided to go ahead with the party because we did not want to lose our deposit and have to try to find another venue.  We hoped for the best with his sore shoulder.We arrived a bit early to set up.  The place is not very easy to find because it is in the back of a light industrial area.  When we arrived the person who greeted us took us to the back and opened a door that gave us easy access to the party room and the gym.  He was very polite and willing to help.As our guests arrived, I got them into their harnesses.  Parents received easy instructions on using the belay ropes to keep everyone safe.Then the fun began.The kids really enjoyed the climbing.  Most of the kids didn't go all the way up the wall because at their age and size those walls looked huge I'm sure.  Some of the kids were really brave and scaled all the rocks to the top of the walls.  There were lots of smiles and some nervous laughs.  Even my little injured boy got up and tried one-handed climbing.  Fortunately, it is possible to give the kids a bit of help by pulling them up with the rope.  However, if you are pulling people up the wall, be prepared for some sore hands.In addition to enjoying the climbing, the kids loved running around the gym playing tag or shoot-em-up or whatever it is five year old boys play.  The staff kept telling the kids to stop running, and so did some of the parents and I.  Our efforts to keep the peace were pretty much to no avail.The adults enjoyed watching the kids climb.  The party room was plenty big for us.  The staff was very polite and encouraged all the kids.  We had a great time.  I may check this place out again sometime soon.  They have a day pass for $15 that is all day and includes shoes and harness.  The staff said you can come in the morning then take a break for lunch or whatever and return in the afternoon.  I would probably be a quivering mound of jello after climbing for an hour or so in the morning, but it may be worth a try.Finally, since a few of our guests did not show and we did not have 11 kids, they reduced the price for us by $40 - AWESOME!Great party, nice facility, very good value.  Check it out.", "date": "12/3/2012"}
{"review_id": "DnCaSD5SwYsA5ExBlUyi6g", "user_id": "vJQ7mf09U_VhkVI28dUiCQ", "user_name": "Brian S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 7, "funny": 2, "cool": 3, "text": "I've never rock climbed nor have I gone to a rock climbing gym before.  About six months ago, I decided to give it a shot and within the first week of climbing at ACG (that's what the cool kids call it), I was hooked.  The sport is amazing, but what really clinched it for me was the owners and other climbers.  They were all so helpful and supportive and would literally go out of their way to help me overcome fears, help with  projects (no matter how small or simple), suggest better technique, etc .  They have a ton of other activities as well such as game night, climbing competitions, give a ways and much more.  As a matter of fact, a friend of mine won a crash pad last week.This place is easily 5 stars.", "date": "7/3/2014"}
{"review_id": "bQlxuRgz_gg_uv3GfRTkxw", "user_id": "rIEHhintJA_HGcy6X6hYtg", "user_name": "Heidi Y.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 3, "funny": 1, "cool": 0, "text": "Great for top roping and bouldering (if you are v0 and up)Large gym, has a kitchen and recreation room. the workers are really nice and will answer questions, give you tips, etc.$15 day pass, or $115 for 10 punch card.  comes with shoes/harness/any rentals you need", "date": "8/15/2014"}
{"review_id": "DAqMN2rwtib-ppMYigZWrQ", "user_id": "mm6TyJ9wrv826lBFUpKTSw", "user_name": "Victoria S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 1, "useful": 2, "funny": 2, "cool": 0, "text": "Rudest owners ever! Most businesses give us the same deals that are on Groupon without having us go through Groupon. We bought the two day passes for $15. When we put our shoes on they were too tight so we asked for a size up because our toes curled with them on,  he said \"they're supposed to be like that. Man up\". We walked around and decided we weren't in the mood to climb. So, we asked to get a refund and he said \"it's a climbing gym what did you expect?\" we told him we just aren't having a good day to which he responded \"too bad\". We weren't even there 15 mins! We would have come back another day if he credited us for our two day passes. I'm glad we ended up buying through Groupon because we called Groupon and they refunded our passes no problem.  The gym is not worth the horrible service. We won't be going there again and I warn anyone else that is thinking about going. I'd give them 0 stars if I could!", "date": "12/22/2016"}
{"review_id": "GxKRwMDdej0han3UZBLNTA", "user_id": "Y5_bq3KEjK0XhplmYioGlA", "user_name": "Paigelynn T.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 5, "funny": 0, "cool": 0, "text": "First time rock climbing in a gym and so appreciated how awesome the staff was. Trevor at the front was so welcoming and laid back. You can tell the staff knows what they are doing and they have a real heart for the beginners.The bouldering area is pretty sick, with a really wide variety of problems, and even though I was there on a Friday night the gym wasnt way too crowded. I was on the wall the whole time, no waiting in line feeling like I've heard about in crowded gyms this small.Pretty much the entire top rope area was for beginners, and they could improve their safety by teaching people to belay properly even if they have ATCs tied to the ground. Went for ladies night and got in free and brought a guy friend who only paid 10. We got shoes and harnesses. it is SO worth checking out and a GREAT spot to start if your a beginner. Super cheap!", "date": "2/8/2014"}
{"review_id": "IYDE3C_NdUPMXzfJoSGVeA", "user_id": "F8oWlo3e5k1fNWmNMvrP6Q", "user_name": "Jillian H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went rock climbing here for the first time in forever. I was a little scared at first but the employees were great and they did a wonderful job answering all my questions. The only thing that was slightly annoying was there was some little kids and the mother was attaching her kids to multiple lines and was tangling her up in the ropes. There wasn't a employee to tell the mom to stop acting younger than her 7 year old daughter. Other than that everything went amazing! As you can see this annoying mom didn't alter my stars at all because it was an amazing time. I am looking forward to come back again and again!", "date": "2/27/2015"}
{"review_id": "BACZebD1ckemHpCetPnHtA", "user_id": "mZHZztCyB6LwkLKA8WHRxg", "user_name": "Michelle H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great local climbing gym. Owners and employees are laid back and friendly. Great sport for whole family to enjoy.", "date": "4/30/2017"}
{"review_id": "k7InMIkUWmJlZ6v5c7DJzw", "user_id": "_cSVadq5T5QW-LMnzUEOFg", "user_name": "Serena J.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "We had 20 kids (ages 11-15) celebrating a birthday party. Dillon was firm but generous with his time in explaining and assisting the kids. Everyone had a great time on the ropes and free climbing. The party room was perfect for us as well. I was just a bit nervous about not having helmets and lacking constant professional adult supervision of the children, but all worked out and no injuries. Yay!", "date": "12/21/2015"}
{"review_id": "uv3FyfFCNssFpohTRNupSQ", "user_id": "RZZ3B7NdbhE-LFfi2UDBjw", "user_name": "Micaela B.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Aye that was fun!!! My hands hurt & my wallet doesn't have a huge dent in it, thanks!!!!", "date": "12/21/2015"}
{"review_id": "GTBXkVZWCQO5jMCl31re7Q", "user_id": "IF-miz07oeLt9_A4JWGaAg", "user_name": "Lorraine K.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 6, "funny": 1, "cool": 2, "text": "My friend and I came here for the lead climbing class and had the best experience so they now get a full 5 stars! It was 30 dollars (so cheap!!) for a long instruction that includes entrance, rentals (but we had our own stuff), belaying, figure 8, clipping rope to quick draws etc.  At the end you take a test which consist of the instructor watching you climb and clip to make sure you are doing it right.  I went up a route that's harder than what I could do and Jeremy was so patient and coaching me through the moves ... at the end I had to give up and try an easier route to pass the test (sad face).  Afterwards my friend and I continued climbing and all the founders were there and giving us tips.  I really appreciate they were so patient with a n00b like myself.  It really makes me want to work harder to become a better climber!", "date": "3/21/2013"}
{"review_id": "GcJ8HY8LBQsQ-IWsPON3mA", "user_id": "-OlMspdHux2RdB63PgNRYQ", "user_name": "Daniel B.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Kinda small, but had plenty of space.  A really awesome value with free equipment, free chalk bags all with a price lower than most other climbing gyms.  Those lead caves are super crazy and the padding done well with no gaps (felt safe)The staff is friendly and relaxed - helpful with betas or just chatting.Two warnings.  The difficulty seems more like outdoor ratings and the extra height is terrifying.  If you're mostly a gym climber, get ready for a challenge.  Will come again when I'm back down.Did I mention the price?  Bought a 10pack and was even better.  Less cost than a movie.", "date": "12/27/2012"}
{"review_id": "qzNJ3EeukobvJ2ycMr72uQ", "user_id": "AE-UV5fvrNPKv3wflLSF9A", "user_name": "Don P.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "I came by  to check out a new place to climb and it was fantastic! My usual spot only tops out at 14ft. for bouldering, this place topped out at 18ft! I was very impressed. The routes are challenging but the owners are helpful and give some guidance to properly place hand and foot holds. Its good to come into a place and see that everyone there is passionate about climbing. The owners really know how to create a fun and relaxed environment.I can't wait to get back in and have more fun climbing around and working on my skills.", "date": "9/14/2012"}
{"review_id": "GMo9cLzxJtH3UrQpFQg0JQ", "user_id": "864nL0po2ldN8TPgbSiwOQ", "user_name": "Walter M.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Climbing is on the rise. Literally. My years at Solid Rock Gym saw little growth or expansion, but when the Lake Forest location closed Orange County was left with a void. Since then gyms have popped up all over Southern California and dare I say it climbing is going mainstream. It's modern, it's adaptive and the training ground for the TOP climbers. Well these guys sure had a dream to fill that void with really what climbing has needed in OC and beyond. I heard rumors of a San Clemente gym and now there is TruHold in Mission Viejo, Sharma's new gym coming, obviously Hangar 18, Mesa in SD, Vital bouldering walls in Carlsbad, but let's be honest if you don't go to Rockreation or Rock City the 2 most established gym's besides SRG when they left you were stuck driving way out of your way. Aesthetic and Truhold serve a much bigger population which is great for us as a community. The Arndt brothers (Dillon & Trevor) and Jeremy Meza have done a great job addressing a lot of the downfalls of previous gyms in the area and abroad. Not to sound like an elitist, but too often kids are exposed to climbing in more of a babysitting way, relying on excellent gym employees to wrangle them, keep their interest and whatnot. Having a staging area for comps, having event specific area's for kids to have their parties and a separate vertical top rope area keeps everybody safe and happy. The Yosemite and Joshua Tree room are decorated so well it's almost a shame kids will likely thrash it eventually. Members and nonmember alike fully enjoy the top out boulder, training room, and top ropes. Lead area requires the passing of testing certification. The training room lets people get on intervals where you can crank out and hours' worth of toproping or bouldering in half the time. Like I said earlier gyms are the training ground and with these new state of the art padding systems you don't have to worry about dirty rocks ever again. Makes us setters happy because it's less we have to clean. I really dig that there are bouldering specific gym's now and that new gym's like this still offer it all. Competitions are a lot of work, but a lot of reward. Something 25-50% of gym's choose not to do for a variety of reasons. ACG had a comp almost immediately, showcasing this brand new facility. These guys are on a facebook media blasting tear doing more for marketing than I've ever seen done for any climbing gum. Oh technology and the internet. Good setting and maintenance is key to keeping people happy and safe. Testing limits and ego's. You'll find challenge and reward regardless of your skill level here. You couldn't find more friendly, honest and humble owners  and with gorilla strong climbers to newbies training here every day welcoming all with open arms, you'll find your place here. As soon as  have my surgery's to fix a few old climbing injuries I'll be back here training again.", "date": "9/20/2012"}
{"review_id": "EN1TW3AuVCxJbgoxGrHRcQ", "user_id": "P8CKN4XSOJ4DL6b9QNMd3w", "user_name": "Taylor A.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A very fun gym with both bouldering and top roping! The staff are friendly and helpful when explaining how to use the different walls. There is also water available and a ping pong table!", "date": "6/11/2016"}
{"review_id": "yVEkGePk-hU8HV5nXdaBog", "user_id": "Z4ObmEqhssOe-344Nnplaw", "user_name": "B P.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 6, "funny": 0, "cool": 1, "text": "Wanted to change up our workout routine and try something fun and daring. After read the great reviews we decided to try Aesthetic Climbing Gym. It was our very first time climbing...ever... and I was a bit nervous. The employees were great and taught us the ropes...literally. We both felt very comfortable and had a great time. And for only $15 which includes equipment and shoes, we will definitely be coming back!", "date": "8/7/2013"}
{"review_id": "KHW-98u5_9Z-DHze1H5Wrw", "user_id": "FvebbK97FRfYOQIiTXGzKQ", "user_name": "Devon G.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 3, "useful": 4, "funny": 0, "cool": 1, "text": "Having come back later to see what the day-to-day operation is like, I can report that things are neither as bad as my initial impression, nor as stellar as a lot of the friends-and-relatives reviews you are are seeing here. The good:Facility is spacious and cleanProblems are creative, clearly colour coded, and interesting.Handholds are good and KEPT CLEAN. Owners are present, friendly, and helpful. The less good:There don't seem to be a lot of intermediate problems. Selection seemed to go straight from \"for the kiddies\" to \"for people who spend their weekends dangling by three fingers\". No locker rooms. WTF? Some of us wear suits to work. Why have such a nice, spacious facility with lots of rooms, and then have us changing in the restrooms? The downright ugly:Grigri tie ins on every problem. It may seem safer, but you're not teaching novices how to really belay. A tool is not a substitute for a skill.", "date": "9/8/2013"}
{"review_id": "wz-AiVv1EoBfuepLXL5C3g", "user_id": "yFcASNw7gdqAIdgfF57LOg", "user_name": "Aidan H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best gym in Orange County, by far! The owners and staff are super helpful, friendly, and very informative! Great vibes from this gym. A memberships provides many perks like full utilization of their training equipment, free introductory classes on bouldering, top rope, and lead climbing, and free beer during Beer & Bouldering! Full gym Asana padding (the best in the business). Sublime climbing for the beginning climber to the best. No other gym like it!", "date": "3/1/2016"}
{"review_id": "yVsjYY_43n1aa7HcvqWu2A", "user_id": "UXEwwh-0oTRd8l1w5oNacA", "user_name": "Jordan S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "First time ever climbing. Had a great time and the staff are as cool and friendly as could be. Also very cool music and very relaxed fun atmosphere", "date": "8/30/2015"}
{"review_id": "sKYKjwnB4K7tToRl47qjfg", "user_id": "EFlMyTcaJtCWOZu8qOqi8A", "user_name": "jim d.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Our 5yr old son loves to climb.  This was his 1st time rock climbing.  Employees were extremely helpful getting him setup with harness, shoes and showed us their rope setup + routes.  Our son had a blast.  We will definitely go back regularly.  On a rainy Weekend it wasn't that crowded.", "date": "3/3/2014"}
{"review_id": "9-dDcPMPchgh8kXz9GFM7Q", "user_id": "cB5dA--dbm8O-wjr-gycTQ", "user_name": "Wes M.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 6, "funny": 0, "cool": 0, "text": "Blown away. I'm a sucker for small gyms and this provided the laid back atmosphere I've come to enjoy. The local scene is friendly, the staff HONOR the climbing gym deal, that is: you work at a climbing gym, you enjoy the one you're at for free. ONLY gym in SoCal to honor that system (have yet to check out San Diego area though) that I have been to.The terrain is better than the Factory or Hanger 18 South Bay. The top out is safe even at 18ft. The fall from the top is nice. The setting is also consistent. The V1 is a V1. The V8 is a V8. Didn't tie in, even though the walls are short it looks fun. I'll return here before going to the Factory or South Bay Hanger 18 for sure.", "date": "4/1/2013"}
{"review_id": "h0JJ7wa7lbFOtyEHYMSd5w", "user_id": "3ko1L6M0dwt_N2jRnIGKzA", "user_name": "Jeff K.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "This place is great.  I've been here about 4-5 times in the past 2 weeks and haven't had a bad experience yet.  Everyone here is so nice and helpful that I can't even tell who is staff or not.  If not for the soreness and blisters I'd come here every day.. eventually", "date": "6/27/2013"}
{"review_id": "9-lY-AKUleo_waR0-oNd0Q", "user_id": "KyMiIk3100DQsQKP4viRXw", "user_name": "Phil P.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my son in today to train for Divisionals today. These guys took time out of their busy schedule to work with him. They were patient, knowledgeable and overall wonderful people. Their gum is top notch and I will recommend it to all of my friends and family. I can't wait to make it out there again soon.", "date": "12/27/2015"}
{"review_id": "mjF_MtUfKp6E7HTj_4oW5w", "user_id": "o_lTVhanJozS7j-K7TlvKQ", "user_name": "Jackie H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 3, "funny": 2, "cool": 1, "text": "Tried out this place for the first time. I've been climbing for a little over a month and have only gone to rock climbing and have been going to rockreation and climbx in Costa Mesa and Huntington Beach. Aesthetic climbing has a great staff and were very welcoming on arrival. They're a pretty spacious facility with plenty of bouldering and top rope areas. They have an auto lock belay system and the ropes are anchored to the ground for top rope climbing. The setup is great for climbers who can climb and still be belayed by someone smaller. It's also great for beginners (we had a 1st time climber) who've never climbed or belayed.The price is also great, $15 day pass which includes gear if you don't already have. There was a kids bday party while we were there but otherwise it wasn't busy which was great so we could get some good climbs in.My only complaint and why i took off one star was that the walls for the top rope climbs isn't a rock facade but boarding, at least it's decorated but yea aesthetically I would've wanted a rock look like the bouldering walls. I also would've preferred color coded routes versus the taping but again just minor personal things.I would definitely go back as the staff is great and it's a good size facility and not as crowded as rockreation", "date": "3/30/2013"}
{"review_id": "5nMn5OROkgFm8XB3NDyvxw", "user_id": "IVNCg2IPXUc3OJLvlk2OkQ", "user_name": "Siu-Ling S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 4, "funny": 0, "cool": 0, "text": "Been here about 8 times in the past 3 months. I really like the challenge of this gym. I started as a v0 and now can do v1 and some v2s. I like how the routes are longer and require multiple techniques than most bouldering places. They also have top roping for newer climbers, but I haven't tried it since they rerouted it with actual grades. I current jump between here and factory bouldering in orange and I like both of them for different reasons. Staff here is super courteous for any level climbers.", "date": "2/17/2013"}
{"review_id": "rb-r2MMg0WXjb7rcA_v7jw", "user_id": "7d3rJq2mqApo03dKReTfUg", "user_name": "Mike S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing family friendly climbing gym.  The staff are helpful and friendly and are very encouraging.", "date": "11/27/2015"}
{"review_id": "t15t6Rliv5uriyb7kzNW9g", "user_id": "MuRCysEN-4Q4UtQrCgQXDQ", "user_name": "Andrew L.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great staff, great facilities. The atmosphere at this gym is laid back and noncompetitive, if you are a beginner the staff and regulars are happy to help.  The routes are reset often so there are always new problems to work on!", "date": "11/12/2015"}
{"review_id": "WFyEfg_lvL8aP8ZTKPYWGQ", "user_id": "5KjUnUG8iNtanYTEW4SJfw", "user_name": "Jacob S.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "I would like to start off by first mentioning the staff (the 3 owners). I can't say enough about how friendly and helpful these guys were so I'll keep it short. As soon as we walked in they were very friendly and willing to help. They really gave the whole place a warm feel. They were always around to offer and hand or advise about a route/problem if needed and they seemed like they genuinely wanted to help you. I think this positive attitude must be contagious because all of the people climbing in the gym were extremely nice as well. Everyone seemed to be talking to each other and helping out other climbers.As far as the gym is concerned. I would say that it definitely has a different vibe to it than most gyms I have climbed at and I think that is mostly due to the owners attitude and hands on approach to running their gym. It had a very communal/small gym feel to it, even though the route diversity was great and well spread out. The routes were fun and challenging. There was also a good variety of climbing style within the bouldering area and the rope sections. The different climbing styles offer bouldering, sport climbing, and top rope. There is also a section towards the back of the gym and around (a somewhat hidden) corner that offers more of a beginner top roping area.The pricing for the gym is amazing also. $15 for a day pass and that included shoe rentals and harness rentals if you don't already have them. This is nice because most gyms charge additional (small) fees for the rental of shoes or harnesses. I was able to bring my friend who had just started climbing and since he didn't have any climbing equipment yet, he really appreciated that he got to save a little more than usual.Overall, I would definitely say that this gym was not quite as polished as some other gyms I've been to, but it covered all the basics and then some. Also, the community that it already seems to be establishing sets the bar above other local gyms. The owners approach to running their gym is amazing. I can only hope that this is something that is carried on permanently and not a short term means to make a good first impression.Try this place out! chances are you will end up loving it like I did.", "date": "9/10/2012"}
{"review_id": "6KHBRXXqbNZd-OblUXzeNQ", "user_id": "2ZQwHueucwKkLVv6ewG6KA", "user_name": "Lucas P.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Sweeet spot to come work out or mess around. Awesome staff, never crowded really cheap and reeeally close to my house! definitely going to keep coming back!", "date": "6/6/2013"}
{"review_id": "FKgmz41nRD26tc2AAE7LUQ", "user_id": "wnz8dhqj0M6soujUZ-96xg", "user_name": "Eric C.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I contacted about a half dozen different rock climbing gyms a few weeks ago to find who would be best to take our boy scout troop to.  Well after coming close to making arrangements with others, I was contacted by Dillon at Aesthetic CG..  He impressed me with his enthusiasm and offered a very reasonable price for the boy scout climbing merit badge activity that we wanted to do.  I went by and he gave me a tour.  I was convinced.  So last Saturday we brought the troop and we had an amazing experience.  Dillon is a great individual.  He is experienced, personable, professional and great with the young men.  he gave us so much personal attention that we completed all of the requirements and everyone had a great time.  I really can't say enough great stuff about Dillon and his company.  We were all so impressed.  We are very thankful for them and that there are people like him that really care about what they do.  Man, I wish so much success on these guys!!!", "date": "3/4/2015"}
{"review_id": "oVeUYApIhFZU5EwLYCiK1w", "user_id": "STlJRM97P-3TQaJt-3tMUg", "user_name": "Jamie V.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Just brought my 5-year-old son into Aesthetic Climbing Gym yesterday, 2-26-2013 for the first time, and he loved it! All of the staff including Jeremy were so helpful and really took the time to work with my boy and show him the ropes; they even took the time to push him in his harness, in what was their version of a swing. When I asked him if he wants to come back again, he replied, \"tomorrow\" so at that point, I signed him up as a member. Thank you guys!", "date": "2/27/2013"}
{"review_id": "sOKVyttFYEmysEFs-sW2gw", "user_id": "iCggRg8YUw8JXTGh1FsdkQ", "user_name": "Geeyoung L.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Very nice place, the staff was friendly and helped us out a lot. It was pretty fun and I came on a student night so everything was free. The equipment was pretty good, but the shoes were hurting my feet.", "date": "6/28/2013"}
{"review_id": "dgsALy3YeKumkSQ0e9nbDw", "user_id": "NlVG8Ey9OSAUrKeIQzTvnQ", "user_name": "Super H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Highest boulder problems I've been on in a gym.  Friendly staff and great climbers.  A++", "date": "10/16/2012"}
{"review_id": "8zY-f6lwmA6ZewjUEBuC1Q", "user_id": "BhLNd1mEysiDCu5qIk66bw", "user_name": "Laura H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Laura HMy son Hunter loves this place.  The staff is great with kids.He is now attending a slack lining class there on Mon. and Wed.nights.  Keep up the great customer service.", "date": "10/15/2012"}
{"review_id": "LNEA7mWgfI6GnpkqkkB8Bg", "user_id": "gmx4_OdLCfoA91XEiDeoaw", "user_name": "Lilia H.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My daughter practically lives at the gym. She started climbing almost a year ago and loves it more than ever. She's learned so much about climbing, bouldering, dynos, .... and teaches us rock climbing jargon. Even her siblings love going to the gym and she invites friends and family whenever she can. The owners and staff are so friendly, knowledgeable and super cool. We couldn't be happier our daughter is in such a friendly and encouraging environment. The owners and staff really care and look after their clients. Good job guys!", "date": "6/4/2014"}
{"review_id": "uiiwdvVjTpDMp57eXLTZmg", "user_id": "lpgzryruSdF246blsNsAGw", "user_name": "W T.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Had a birthday party today for 7 teens and 3 adults.  Super friendly staff greeted us at the door, and immediately showed us the way to the party room, got us equipped and gave us climbing instructions all within a matter of minutes.  Stuck around to answer questions, belay and make sure we knew enough to belay each other.  A really easy, stress free and fun experience.  Strongly recommend this place.", "date": "7/5/2014"}
{"review_id": "cXW2UGhX8NCUG-n2uJnC0w", "user_id": "REvR2VnWjk3OOVtj8w4pnA", "user_name": "Ben R.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 2, "useful": 1, "funny": 3, "cool": 1, "text": "I really wanted to love this place, but I have mixed feelings.  I have climbed here at least 8-10 times with my kids and a few times on my own.  The owners?? seem nice enough and seem to have a lot of rock climbing experience, however in between helping on the floor they are running back and forth to the desk to answer phones and climbing themselves. It feels as if they come to work to climb and if they \"have time\", they will help you out.  In addition, I have dropped my daughter off during \"normal\" business hours to find that they decided not to open that day or just took the day off.  I am concerned that this gym will find itself in the same graveyard as Solid Rock did a few years back.  I did take my kids to try a few different places in Laguna Hills, Santa Ana and Costa Mesa and they definitley had a more professional feel to them.  As nice as it would be to have a \"local\" rock climbing gym, I think we will have to drive a little farther.**In addition as a parent, I think I need to add that the last time I came to pick my daughter and her friends up, there were fellow \"climbers\" (yes, I have seen them in the gym)  in the parking lot smoking weed.  I'm not one to judge others and their choices, however this is not the environment I want to leave my kids in.", "date": "8/9/2013"}
{"review_id": "2bR4eeLcAyU9wzLPzatvdA", "user_id": "3OiIUn5BZP7_W1PkzWPIog", "user_name": "Kristen P.", "business_id": "3J-Q42JoMUPqRHfUckA2bw", "stars": 5, "useful": 5, "funny": 0, "cool": 2, "text": "I brought my teenage son and his two friends to the Aesthetic Climbing Gym today. The boys had no climbing experience but everyone working was VERY helpful! The boys all had a great time and there was nothing snooty about this place!! (not sure why another reviewer would say that). In fact, quite the opposite. The guys are all excited to share their love of climbing and very positive and encouraging. This would be a great place for all levels of climbers as well as parties,scouting events, and just a fun place to hang out. We will be back very soon!", "date": "9/4/2012"}
