{"review_id": "hxGo27fP7k92GyRUj3yO7A", "user_id": "AdnL1ZEYB3S2a8iWzQJSyA", "user_name": "Anisa A.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super stoked to have an indoor climbing gym in Tahoe now!!They've seriously utilized every inch of space in the building strategically. There's a yoga room, work out/gym space, bouldering room, tall climbing walls with just enough routes (and auto belays!), a coffee shop, bathrooms with a shower and a coed sauna and more.The staff was chill- even though they were super busy.A super fun place to hang out.Keep an eye out for a good parking spot coming in.", "date": "12/30/2018"}
{"review_id": "KPwnGV67aIKxYvWpj_3zgA", "user_id": "zE-d-l1oEHV54f6jBI2nWg", "user_name": "Shawn K.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, great people... I mostly Boulder when I visit, so I can't speak for the quality of the top rope or lead routes, but the boulder problems are fun (a bit highball vs other gyms - I consider that a good thing).Lots of options for everyone... new to gym climbing right through very experienced... and great for kids too. The only \"negative\" I can think of is that because the walls and holds are so new - they eat shoe rubber. Be sure to grab some coffee while you are there - some of the best in town.", "date": "11/23/2018"}
{"review_id": "j3pYOPm_KU5E1KxHzWKcrA", "user_id": "UP-xTot-0NpOT5kOSmtb6Q", "user_name": "Anastasia C.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! Affordable and routes are constantly changing to keep it fresh. My ONLY suggestion is to have more supervision on the kiddos. Lots of really young kids doing dangerous stuff like climbing under people and swinging on the ropes. No parents in sight. Maybe have an employee hang out downstairs to keep an eye on them and make sure everyone is safe and following the rules.", "date": "5/19/2019"}
{"review_id": "HUzaDiNw_e8O7QOfy-QXfw", "user_id": "K0rK3slK5PQlHjX-4nQ06A", "user_name": "Jennifer S.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My 5 year old daughter was so eager to stop in and give climbing a try. We were not disappointed. The friendly staff set us up, showed us around and gave us pointers. They also provide gear so you can get up safely and comfortably. We got to witness some of the youth classes and the trainers they had were so great with the kids and real respectful with their teaching and making sure that they were safe at all times. For a first time walk-in, we were very impressed and had a great time. Check out the coffee shop inside as well and the selection of merchandise. We're looking forward to heading back in and possibly signing up for the classes after witnessing how great it watching the youth train.", "date": "4/5/2019"}
{"review_id": "JDylMVOqJfiq6RnzXMS2uQ", "user_id": "SRNgUnm0mcOdY7fcEN0jvw", "user_name": "Kelly K.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The facilities and the staff alone are super nice and helpful, I was taken on a small tour and felt very comfortable with everyone there.I live about 5 hours away from Tahoe, and I managed to forget my chalk bag in the gym. It is only a 10$ chalk bag so replacing it wouldn't have been a problem, but inside the side pouch were two bracelets that held a lot of meaning to me and I couldn't replace. The staff were incredibly helpful helping me identify it and going out of their way to mail it back to me. Thank you so much Gianna and Blue Granite Climbing Gym staff, for the good climbing and all your help!", "date": "3/18/2019"}
{"review_id": "P7NoQDa3xVZxbhTftyCOrA", "user_id": "Z8CR3sgsjFywCivm6Sz5Tw", "user_name": "Susan C.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Great place for kids and beginners to experience rock climbing . We went on a Saturday morning and  there was a kids bday party during our visit, even with all the commotion, we still got a detail tour and Q&A before we started . my two girls loved it , age 6 &8.", "date": "10/28/2018"}
{"review_id": "9pYhYIO5Qvunrh5vrFQc8w", "user_id": "QFunNjg0nOEEWzd2u0fs8w", "user_name": "Evan R.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "They explained they were limited in space due to the airport and the price of land in CA. Overall its very good, I love having a gym closer than Reno, but the Reno gym is much larger, with more space. I really like the classes at Blue Granite also.", "date": "2/11/2019"}
{"review_id": "9SBT7FT0OxQRdKg4PV1dNg", "user_id": "2KKYu3L66N_-XcQD_EfR3Q", "user_name": "Bryn S.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Such an amazing place! Everyone is very helpful and knowledgable, and the gym itself is beautifully done! Definitely worth checking out.", "date": "9/30/2018"}
{"review_id": "l9CMoOpH4mxpKodEn24t7A", "user_id": "7mbLg1CA4q_iP7sVWyUFnA", "user_name": "Chris C.", "business_id": "R_cs-7blb1R56oWLvBtwrQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It's good Fun place to go in Tahoe Glad south lake finally has another climbing gym !", "date": "11/29/2018"}
