{"review_id": "sKf2AHBAiRgvwT9ERiO80A", "user_id": "brya1ISDpuiskKmAmJSs-Q", "user_name": "Anne Joy U.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is our new home for rock climbing.  The prices are super reasonable, facility is spacious, music is poppin', and staff are very helpful and friendly.  Christian signed us up and covered everything included in our membership.  Dane conducted our belay class and made it fun while super informative.  I look forward to spending a lot of time here to excel in this sport.  They also have Yoga and Acro Yoga classes which I can't wait to try.", "date": "4/26/2019"}
{"review_id": "NWqTJZjOYGB_I8-BAFk19Q", "user_id": "blQFWJ5R6TYSAyyScBY8yA", "user_name": "Nadia B.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love how they change the routes every so often. I go about 1-2x a month, and every time I come back there's always new routes. Nice staff, clean bathrooms, friendly climbers. They also have some kettle bells, pull up bars, gymnastic rings, treadmill, & stationary bike, if you want to do more workout. Also, check out their yoga & aero-yoga classes. I took the aero yoga class, and it's so awesome!! Instructors are attentive and make it possible for totally beginners to actually lift another person.", "date": "4/4/2019"}
{"review_id": "PTXxfsyXyHDqtd1GE_eLfQ", "user_id": "F0KGODVVUNL5FrI4N5M6qA", "user_name": "Donna N.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 1, "cool": 1, "text": "I'm a beginner in rock climbing. This place is nice and spacious. I went on a Sunday and it wasn't too crowded. There were many different levels and varieties. I had a lot of fun when I was here. I truly would recommend!", "date": "3/9/2019"}
{"review_id": "Wzie1o2b6nVNhRmkx9xgmA", "user_id": "07y-LMrhVtFsDiBrf30Jww", "user_name": "Rylee N.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 3, "funny": 2, "cool": 3, "text": "I had a terrible experience rock climbing at another rock climbing facility and was about to give up on it all together. My family has passes here and asked me to come with them and try it out at Boulderdash SFV. I am so glad I did because I had the best time ever! I was properly explained the safety precautions to take, the correct way to climb, how my shoes should feel, how my harness should fit, etc. When I came to climb for my first time at another rock climbing gym, they pretty much said 'have at it, have fun!' and I was off. Although there are mats and harnesses etc, it can be dangerous to go out there and not know what you're doing or how to properly put on your equipment. I felt so safe at this gym and I really thought that the staff really took care of me to make sure I had a safe and fun time. This gym is not only HUGE, it has something for all skill levels. They have walls for children, and great staff members that stay with the kids and help them climb. Something I really liked is that they clearly label the difficulty of each climb and my sister (who has a pass and goes often) says that they change the routes frequently so you're always doing something different. I can't wait to come and climb with my family again. Unfortunately, there isn't a Boulderdash around my house. Come to Long Beach!", "date": "3/5/2018"}
{"review_id": "kqjPAV0AKdKenvUJFCLF6Q", "user_id": "RRrCqO8W8fh3ZM5B8mz9kg", "user_name": "Chasen R.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great options for bouldering and lead climbing. They always switch it up with new routes as well making it extra fun to try them out. Friendly staff and clean bathrooms are also a plus!", "date": "4/10/2019"}
{"review_id": "AVPoGbpRmsR1GY7JFt1Tlg", "user_id": "wGaEioJtVv4-XAnWxLhorQ", "user_name": "Janet S.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my home gym and been a member for about 10 months. I love it. Started climbing a little over a year ago. Great community. Fun and responsible staff. Great route-setting. Good walls. Crack tower. Fun and challenging bouldering. In particular my hat is off to Spencer (Manager) and the crack class I took with him. Exceptional class, superior education. Spencer downloaded 10 years of crack knowledge (plus tons of climbing to practice what we were learning) in just over 2 hours and I left the course feeling confident about my ability to take what I learned and take my climbing to the next level.  If you want to find your next home, this is it.", "date": "3/15/2019"}
{"review_id": "7BlXiiZ6VyFEMXSHdFrNJg", "user_id": "Nx8Fj76jZ0Ze1lxmxL_u_w", "user_name": "Kassandra C.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My first time rock climbing without a harness, of course optional depending on what you wanna do. Staff was helpful and friendly I got a very good workout some what intense didnt think I was gonna be as sore as I was but it was definitely worth it. I want to come back again and get over my fear of falling everyone else looked like they had a blast being spiderman lol. Will definitely come back again!", "date": "1/16/2019"}
{"review_id": "_VSwZlHu9oBasM2LHRj-OQ", "user_id": "AkU6PyZNatuzAD22ylNS2g", "user_name": "Chrissy A.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 1, "funny": 0, "cool": 3, "text": "Awesome indoor rock climbing gym, bouldering     and all.  It's challenging and a lot of fun.  It's a little hard hard to find though.  I've been passing it for years on my way to my gym and never noticed it.  You will like the instructors; they remind me of point break surfer dude guys.  Very cool and laid back.", "date": "10/31/2017"}
{"review_id": "tkp554uF-MvgSFUYCEWKiQ", "user_id": "QmxKJlme2aHCiK3BfSDpmw", "user_name": "Susan G.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Thank you so much Gabriel for your kindness!  I brought my 4yr old to Boulderdash today for the first time to rock climb.  My son was belayed by Gabriel,  because I still need to take the class to get certified.  Gabriel immediately connected with my son.  He was so kind, patient and encouraging!  My son continued to climb higher because of his encouragement!  I can't rave enough about how great Gabriel is with kids! Thank you again Gabriel for everything you did to help my son out.  You are an asset to Boulderdash!", "date": "11/8/2018"}
{"review_id": "FPg4aHuAbLN1Cj_qwqXsng", "user_id": "UFTyMKyIaNHLzO8wTBoG3A", "user_name": "Mikhail I.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I like this place a lot! My kids love taking classes here and it's so convenient for after school activities. They're learning more than just climbing techniques and learning about patience and to be persistent. The staff is always a great bonus as they are always helpful and friendly and enforce safety.  We always feel welcomed here and we will definitely be coming back more and more!", "date": "4/2/2018"}
{"review_id": "QmIXgdfkNXBSTizr_yaNiw", "user_id": "T2IkLgAKf0aF5jzaApcXfQ", "user_name": "Brett C.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going here for a year now. Outstandingly friendly community, amazing routes and always new and friendly faces coming in. Through bouldering i have increased my self confidence tenfold alongside developing some key friendships in my life. Thankyou boulderdash!", "date": "12/4/2018"}
{"review_id": "FcylOwv6N4IyFY8TQ0MavQ", "user_id": "V4ufnFKJNV8kEwFMx_5qEw", "user_name": "Kathy V.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "I like Boulderdash SFV. The staff are always friendly and sweet. The community here are also nice and welcoming. They have their own parking lot. They also have a variety of sections where you can climb. Each course has its own unique challenge. There's levels of intensity and difficulty for each course. They are all labeled so you can climb at your own pace.", "date": "5/5/2017"}
{"review_id": "GP_2nHXEjgLr7qGhSeZtug", "user_id": "esbng8cYpXGaGK5yoP54kw", "user_name": "Edson P.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Great atmosphere, the staff and guest are nice and considerate. This place is diverse it welcomes all levels beginner, intermediate, and advance.", "date": "6/15/2018"}
{"review_id": "shr-hDFg9ZSWLNIXrdd7uw", "user_id": "1dGxoOUw6pE4AbEwoKqSzQ", "user_name": "Nick D.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 1, "useful": 6, "funny": 1, "cool": 1, "text": "This place is an absolute last resort, must climb now, the weather completely sucks, and I'm stuck in the valley for some reason experience. The route setting is truly the worst I've ever experienced in my decades of climbing. To say the ratings are inconsistent is giving them too much credit. Easy climbs that have loose holds and require far more technical insight than makes any sense. Then supposedly hard routes that send blindfolded. Frankly, I don't really care about climbs on the harder end of the spectrum (10+) that are soft, but when a 5.7 climb has a bunch of crimps, high steps, smears, and even dynos, it just plain unsafe. That's no way to build confidence in climbers. But the real problem with this place is that it's unsafe, which is really the most critical aspect of an indoor climbing gym. The staff is absent. Once you pass the front desk you will never see any one walking around monitoring for safety -- and given how many newbies riddle this joint, it's unfathomable how inept and self-involved they are. Most of the time talking amongst themselves, while I've watched people in the gym for their first or second time making life threatening mistakes. Only gym in the city that requires ATC and forbids Grigri. Supposedly something about insurance -- well if that's the case, your insurance blows and you might want to train your staff to spend more time keeping an eye on the clients. Whoever handles the insurance for Stronghold, Cliffs of Id, and Sender -- give them a call. Stupid policy to not allow Grigris. Ignorant or negligent staff, that reak of arrogance and minimal actual climbing experience. Lead ropes that should be retired. The worst route setting in the city by a stretch.  Not just a leaky faucet in the bathroom, but a broken one -- staff doesn't seem to care; hey guys -- the sign on the mirror ain't cutting it, the faucet is broken no amount of fiddling with the handle will change that. Did I mention this place is unsafe and the route setting is wack. The only good thing about this place is the parking. Period.", "date": "3/3/2018"}
{"review_id": "cJanRDrDsm61XpqwGrAxqw", "user_id": "rmUcAXZK4XRB_MTDb1pZlw", "user_name": "Cheri R.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 3, "useful": 3, "funny": 0, "cool": 0, "text": "I have been a Boulderdash member for a couple of months now, and I enjoy the gym a lot. The staff is really amazing & they make it a blast to come here! (Darren, Matt, Spencer, Aaron, KJ, & Gabe) I don't live close to Boulderdash anymore so I drove over to take my Lead test today, after working 15 1/2 hours for the day, I just wanted to take my lead test & climb a bit then go home. I get to the gym (it's 8:48 a lead test only takes 10 minutes, if that), I walk up to Andrea, and tell her in a friendly way \"I'm ready to take my lead test!\" She looks at me and says \"yeah sorry I don't do lead tests after 9.\" Then shrugs her shoulders. I have taken a lead test, and watched my buddies take their lead tests after 9 with the other certified test employees. So it did kind of come as a surprise and I don't really think I shouldn't get the chance to take my test just because of someone not wanting to do something. Especially when it's not just a 10 minute drive from home. It sucks because I love Boulderdash and have gotten about 5 people to sign up for memberships. Everyone else is really great, they truly make Boulderdash a fun & great place to go. I just think there was time to do my test, and it also wasn't even 9 yet. I still love this gym & recommend people go here.", "date": "1/25/2018"}
{"review_id": "OeG4BludVzZuBA0V-h5PxA", "user_id": "LpzNA0nFgz4OY4s33--utw", "user_name": "Salam A.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Pros: The staff is great and super friendly and the price is pretty good too! Routes are a little on the easy side but plentiful. Music selection is really good!! Cons: Staff does not monitor activity. In 4 hours of being there, 1 staff member walked around. Safety should be a #1 priority at all climbing gyms and I watched 4 separate belayers belay incorrectly (brake hand came off the rope EVERY TIME). Staff only came to climbing/bouldering section to give belay tests. Putting one more person on staff to stay on the floor and monitor would be wise and highly recommended. Those who are belay certified are given a TINY orange zip tie, which isn't a clear or visible enough indication of certification.Would be nice to have FREE staff belays, especially for the price paid for entrance. Just my thought. Overall, good place to get your climb on but I was put off by how lax the staff is about safety and the horror of the unsafe belaying they allow!", "date": "8/5/2017"}
{"review_id": "VivJzVia6-8_zwBOtkLvkw", "user_id": "jI_ShrDTB0f6RydVqVI7kA", "user_name": "H B.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I must preface this review as a beginner...This is a nice place but not great for beginners. I wish they had autobelays because the climbs are quite good and exciting. I hear they cater to the more experienced climber. The belay situation creates more time and cost for the more casual or new beginner. Overall a good place.", "date": "3/11/2018"}
{"review_id": "wj8YFHjrPuJarXSuU6I7fw", "user_id": "JcvJXyXguvkVmtqh5pX0uA", "user_name": "Lani F.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "The experience at both locations constituted a update review! It was a good experience with a skilled instructor, and we had a much more pleasant staff experience. It can be pricy to climb with someone's help (if you want to do walls solo). The membership package seems like it is meant to train you to do-it-yourself. Still cool place!", "date": "4/17/2016"}
{"review_id": "mm_u6aG3gbz-Y9uLStR2ow", "user_id": "bKqEwSBKG4QivgaMd_JmGQ", "user_name": "Kristen H.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my Son who is 5 to climb for the very first time. Now we are a family of hikers and today we climbed with no fear! Excited to come back !!!!! Excellent Staff!! Yay!", "date": "2/1/2018"}
{"review_id": "JtR9V7T6F5gm5WGVt75sxg", "user_id": "fTE-Iaupg7uoCehXYe8_lw", "user_name": "Luz S.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "OMG! We loved this place. I went with my eight year old daughter and both of us had so much fun. The man in the front desk was very nice, gave us the proper shoes, and set the ropes on us. The guys who hold the ropes were very attentive and knowledgeable about their job. They explained clearly what we had to do and were our cheer leaders the whole time. Lol We will definitely go back again!", "date": "7/23/2017"}
{"review_id": "-s_3krlzSVf1jgKQDQCs2g", "user_id": "UoVU_YjBAjgDIE2PpMqMWA", "user_name": "Damion D.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My wife and I have been here twice now and to the Thousand Oaks location once and both of them are cool places. The SFV location is much bigger and open feeling which I like! We have had the pleasure of climbing with KJ all three times and this last time was for the belaying class. She is a very good instructor and is cool and fun as well! Two thumbs up! This is a great activity for couples and families too!", "date": "12/29/2017"}
{"review_id": "umRf6M-t8AILkjySrXep8A", "user_id": "8FO1hlBXq3-0SyEByTpTIA", "user_name": "Calvin W.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 2, "useful": 8, "funny": 1, "cool": 0, "text": "I guess I'll be the first negative review then. I just wasn't feeling it here. The dude that signed us in was kind of a dick. I could add details, but I'll spare you readers. But basically, he made all of my previous climbing knowledge sound like the most inaccurate and ridiculous crap he's ever heard, using comments like \"I don't know WHAT gym YOU came from, but that's COMPLETELY wrong!!\" But when I asked him why I was wrong, he got distracted by one of his friends that happened to walk by, intentionally avoiding my question. I'm not opposed to admitting I'm wrong if I truly am. But either way, there's simply no need for arrogant sarcasm.It's a decent gym, so I'll give it two stars instead of one. But I'm not going back anyways. I only climb with friendly folks!", "date": "9/10/2016"}
{"review_id": "S3wRyOO8cTGOLTd1DhBc4g", "user_id": "2EjfO1-gitGFJ0MDFK7VKw", "user_name": "Bonnie L.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 3, "useful": 8, "funny": 0, "cool": 0, "text": "The climbing itself is fine, but I'm gonna agree with another reviewer that the staff are the reason why I dislike coming to Boulderdash. I've visited 3 times so far, and not once has a staff member greeted me when I walked in, even when I smiled at them or we made eye contact. I felt unwanted on my first visit (foo, you want my money or nah?), belittled when purchasing my 10-pass (...why?!), and one staff guy thoroughly creeped me out and made me want to hide every part of my body. And that was just my first visit. Last week I was ignored by 3 workers who watched me walk in and then looked away to continue their conversation. Triple diss, yay, just what I wanted after driving an hour after work to get here. Every visit to Boulderdash makes me regret having purchased a 10-visit pass on my first day. Unfortunately I still have visits left on that 10-pass so I'll need to come here and deal with the creepiness/rudeness/arrogance/being ignored (every visit is different to always keep you on your toes!) until those run out. It's no wonder why so many people in the SFV choose to drive to Top Out in Santa Clarita 3-4x/week rather than climbing at their local Boulderdash. Yes, Boulderdash has more variety climbing-wise, but if you actually want to enjoy your sessions without dealing with snobby, creepy, or condescending staff, go to Top Out.", "date": "9/11/2016"}
{"review_id": "rjrN-nZKs6fWSvT-ynLgYg", "user_id": "y9OGAQUEX9dJbrWaeHNMDw", "user_name": "Anna K.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Every single staff member I have encountered at both the SFV location and the Thousand Oaks location is extremely helpful, knowledgable, ego-less, and passionate. I am thankful to have gotten a membership at Boulderdash and am so excited to learn and grow here!", "date": "9/11/2017"}
{"review_id": "_r94mxaoXCFK79IZGYOY8A", "user_id": "_-8cFQ7aAqtreDsL9shrpQ", "user_name": "Gavin Chandler S.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 2, "useful": 4, "funny": 1, "cool": 0, "text": "This review is strictly for their bouldering area since I haven't had the time to climb their top rope and lead sections. The bouldering area is a decent size but quantity does not make up for it's lack of quality. I'm a moderate climber (V4-V6) and have a few years experience indoors and outside. On warming up and getting my shoulders ready jugs on 3 separate V1 slipped out of place. I would ask for a T-bar to tighten it myself but when I have in the past the gyms staff flat out ignores me. After warming up I quickly realized how poorly the routes were set. The majority of anything above a V4 heavily relies on reachy moves to increase difficulty. On a flowing level the route setters seem to have a complete lack of continuity in their setting.", "date": "6/11/2017"}
{"review_id": "j9pzB_T9r3o8FsSuWwe4jg", "user_id": "rxQkKx8FYZDvhUeRjE91fg", "user_name": "Matt J.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First was taught to belay and climb at Boulderdash in TO, and now go to SFV. It's been years of climbing. Great staff, great routes!", "date": "10/20/2017"}
{"review_id": "dMsdEXHs3X7zZcFXL31WpQ", "user_id": "xrGLy0dRQIeBm4jKmFsRjQ", "user_name": "Isend R.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Solid gym. Dig the setting and height of walls. Staff are cool. Someone is always catching a mad stoke here!  I've never  had a bad experience when rolling through.  Give the Traverse a try!", "date": "9/27/2017"}
{"review_id": "reUq7iZD11Rno1pusIarjA", "user_id": "8e-Q5jGQQXyGVR39ny8NPQ", "user_name": "Kristen V.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here with my husband to meet our coworkers for some fun exercise. This place is HUGE! Not so much for bouldering though. Great for straight rock climbing with plenty of routes. The owner does take the belaying test pretty serious, so make sure you know what you are doing because he is watching you. Safety first! I like this place and plan on coming back. Only downside is they close early, like 10pm I think. I wish it would stay open a little later but then again, im sure no one wants to be there til midnight lol", "date": "6/28/2017"}
{"review_id": "gx0Uw0XyQ3wzMm_xCtuuFA", "user_id": "h-wuMrCHg3aktXqHHyJymw", "user_name": "Heath M.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "So fun a must go!!! This place is great fun. We went for the first time and had a blast we for sure will be back very soon!", "date": "6/30/2016"}
{"review_id": "a_zsMPTtqqfu926elyIIUA", "user_id": "6vmfgZN3IC3toXRQdmKtBg", "user_name": "Pauline T.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 5, "funny": 2, "cool": 2, "text": "First time climbing? Wondering about the staff? How about a party for ADULTS?Wondering about the facility in it's entirety? Wondering why I'm giving it a 5-star review? Then read on...My husband was turning thirty and he wanted to do a repeat of last year's active birthday (games at the park then karaoke bar). But of course, I wasn't going to have 30 be an ordinary repeat of 29... Also, I was worried about the rain. So, with the fact that he and I always wanted to try rock climbing, I yelped and found this gem!BOOKING PROCESS: Their website is very detailed. It pretty much walks you through the process of taking classes, what to do when it's your first time, booking parties, etc. I was a little concerned about the fact that the reviews on yelp only covered kids' parties. After making the phone call to book it, I was immediately relieved as the person I spoke to on the phone explained that adults, beginners, and kiddos would have an awesome time! AND INDEED IT WAS AN AWESOME TIME! I had to send them a list of climbers so they can have the proper belayer to climber ratio. Just a tip, make sure everyone in your party fills out the waiver online prior to walking in in-order to expedite the check-in process. Parties are booked for only 2-hours and filling out those waivers in person eats up precious climbing time. 30-mins of that two hours will be spent in a spacious room for the party to enjoy some grub, cake, ice cream, or whatever the party in your tummy desires.STAFF: From start to finish, I commend the Boulderdash staff! The dude I spoke to on the phone was super friendly. I spoke to someone else on the phone to make some last minute changes and he was very helpful as well! When we got to the gym, they were very detailed with the rules, the timeline, etc. They didn't make any one of us feel rushed! A lot of us were first time climbers and they made all of us feel comfortable. They were EXTREMELY ENCOURAGING!THE CLIMB: We felt very safe and secure. They have plenty of roped climbs and the option to use the hook thinggy (yeah I'm a noob). They also have a bouldering section which had thick padding on the bottom to break your fall! They had different rated climbs with colored climbs for more of a challenge. They also have a crack wall for those who want to practice that type of climbing.OVERALL, I had a wonderful experience from start to finish! It was quite a difficult task planning a surprise party for my husband with 16 other people involved (not to mention someone literally asked him if he was going to go climbing on his birthday even after I've told everyone it was a surprise. Luckily he didn't pick up on it)... The staff at Boulderdash along with a few close friends and family helped put together a wonderful surprise for the hubby. Thank you guys so much for a memorable experience! Thanks for hookin' up my husband with a gift of your own as well!For those yelpers who are still not convinced, just know, a good percentage of the 16-climbers from that day are already planning their next visit ;)", "date": "1/20/2016"}
{"review_id": "51t-g-36ygg9_44xrOGUxg", "user_id": "MXNj6bt34KWw6MH9aqLs7A", "user_name": "Alejandro R.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Good climbing for top rope and lead.  I climb only bouldering: the name got my attention.   unhappy with their limited routes. you either climb entry level or competition level as there are hardly any routes in between.  no dust filtering that I know of.  the crash pads become heavy after a while and when it gets busy you have to wait for a crash pad.  some routes are just impossible so you find a group of people climbing particular routes and leaving everything else untouched... hrm I wonder why...  I don't climb here anymore as I grew frustrated with the lack of progress I was making.  No locker room!! I climb at another gym now and I have made more progress in the few short months than my entire membership at BD.  Avoid Tuesdays it smells like feet, armpits and sweat!", "date": "3/1/2017"}
{"review_id": "LV_lD_JsFIB9Ap1Si4O_1g", "user_id": "cH8JmZAcsSPMfAifrjQFDw", "user_name": "Mike L.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun for my first time, knowledgable staff and clean gear to rent! Love the atmosphere, love the climbing courses. Had a blast!", "date": "7/17/2016"}
{"review_id": "8BP_DHTH2KS4s_ktn9LLew", "user_id": "DzxIqO2Ezes_k1DToLC65A", "user_name": "Liz C.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It's taken a while for the review, but I have to thank Boulderdash for launching our family's love of climbing!  It's really an wonderful community here.  Boulderdash SFV came to my radar when it first opened after my kids (9 and 11 at that time) had been itching for a place closer to home to learn climbing after we'd hosted a climbing birthday party in WLA. Over the last two years, we have moved from signing up for kid classes to hosting a birthday party with over 25 kids to taking belay classes (initially so we could belay the kids but now we often go without them!) to visit punch cards to membership, and most recently to learning lead climbing.  I don't think it would have happened it if weren't for the enthusiasm and support of both the staff and the fellow climbers here.  In my experience, the staff has been friendly and approachable.  I have never been made to feel like I couldn't ask a question, raise a concern, or ask for beta on something I was struggling with.  The few times we reported loose holds, they were immediately addressed.  There is very much a culture in the gym of climbers encouraging and sharing with each other.  The belay and lead classes we took with John and Matt were great, really focused on safety and technique.  It's actually a good thing that Boulderdash requires testing on a different day than class to earn belay or lead certification.  Climbing is of course by nature dangerous, and I was particularly impressed as a parent in seeing how Matt worked with our 14 year old daughter in the lead climbing class.  Sure, when we were first starting, I had wished that there were more weekend climb classes for those who just wanted to get on the walls without having to book private lessons or find time during a weeknight.  While I have mixed feelings about how it may limit access for those who just want to try it, climbing is still a sport, and I can't say I've seen too many negative reviews out there that there are limited drop ins for gymnastics or soccer or classes at conventional fitness centers.  Over and over, I have seen the Boulderdash staff be terrific with both new and regular climbers: I even held a team building event for our office here a few months ago with rave reviews from every one of my staff and colleagues who came out.  Having now climbed at quite a number of other gyms in LA and OC, as well as in places across the country, I have come to appreciate the route setting and the general community of Boulderdash, and am happy that it has become our home gym.", "date": "12/25/2017"}
{"review_id": "mamDsTtbrn2omOTih7zOiQ", "user_id": "r9sTMJVD92DR31RDUzyXSw", "user_name": "Alexandra G.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Awesome!! Had so much fun with my kids here. The staff was amazing, very helpful and fun. Can't wait to go back.", "date": "2/8/2016"}
{"review_id": "ZKYvGYbOm-2Aafl30ZoELQ", "user_id": "mndATB_Q2nTQOEpdTINEjw", "user_name": "Jaimi M.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "My son loves climbing so we wanted to try boulderdash. He had a great time with 2 of his friends. They can't wait to go back. The staff was awesome! We will definitely go again:)", "date": "3/7/2017"}
{"review_id": "rEGKo5PW_-QaXXfym-sNZg", "user_id": "Fmk0zWfAZud133YEzPDM2A", "user_name": "Cheri B.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Sometimes it takes going to another gym to realize how good you have it... And sometimes it doesn't. Boulderdash is clean, the staff is super cool, and the routes just keep coming! It's usually not too busy either!I really like this gym. I'm pretty new to climbing and it's nice when the staff comes by from time to time to give some helpful pointers.Overall, Boulderdash is pretty stinkin great.I was recently out of town for the holidays and went to another climbing gym that was crowded, a little dirty, and the holds were so worn down on most of the routes that they were super smooth to the touch, and really hard to hold on to.It made me miss my home gym. ;)", "date": "1/1/2016"}
{"review_id": "sItxEo0U1I1Ac2OffHeU3A", "user_id": "zUn4wTl6jegj_Y7ymHhPvg", "user_name": "Ken M.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I needed to find something for my daughter's 8th birthday party, on less than two weeks notice.  (Yeah, we procrastinated a bit.)  She climbs on everything and is outdoorsy, so I thought of renting a climbing wall to come to our house, but my online searching turned up Boulderdash.  It seemed simpler and safer to go to an indoor climbing place.  They were able to accommodate us on relatively short notice.  We had about ten kids and a few of the parents also tried climbing.  The package was two hours, including 90 minutes of climbing time (wearing a harness, guided by a staff member) then 30 minutes in a side room for food, cake, etc.  You bring your own food/drinks, whatever.  They had a good ratio of staff to guests, less than 5 to 1, so three of our group were climbing at a time, and there was not too much waiting.  I thought there'd be some significant pre-climb instruction, but there was not, and it did not seem needed, was pretty easy to figure out.  I felt everything was safe the whole time.  Kids can wear sneakers, though the place also rents climbing shoes.  I was worried a bit that the kids might be too young to climb in that environment or to enjoy/appreciate it, but they all did fine.  Everyone had a good time, the kids got exercise and had fun and challenged their fears (they climbed pretty high), and a number of parents were complimenting the idea afterwards.  We used the party room for about 30 minutes past our reserved time, but there was no one waiting and the staff did not rush us.  I'm interested in taking the kids back, and doing some climbing myself, and I saw they had a kids summer camp which I might look into.  I'm giving it four stars for two reasons.First, at the end of the climbing time, I approached one of the staff who had been chatting with a parent for a few minutes, and asked him if he could guide one of the kids for one last climb.  He checked the time and said it was too late (that was just a few seconds to the 90 minute mark).  IMO, knowing he had spent the last 5 minutes of the climb time chatting away instead of looking for climbers who wanted one last climb, he should have accommodated this request.  Alternatively, if he's going to be a stickler to the minute on climbing time, he should have spent the last five minutes looking for climbers who wanted one more climb instead of chatting the time away.Also, I tried climbing myself and, before doing so, I asked a staff member if I should wear climbing shoes instead of my sneakers.  He said he recommended climbing shoes if I was really serious about climbing.  To me, that sounds like the difference is small, but worth investing in when you get serious about climbing.  Based on that, I stuck with the sneakers, but then I struggled up a couple routes and was told by another staff it was because I did not have climbing shoes that would have made a big difference.  By then, it was too late to be worth renting them.  So, um...thanks?  I would have had them already had the first staff member simply told me they would help a lot.  Also, had the other staff member who belayed me told me when I approached him for the first climb wearing my own shoes, \"Hey, this will be easier if you go rent climbing shoes,\" instead of waiting till after I struggled for two routes to say anything, I would again have gone and gotten the shoes.  So, there was a lapse in communication that marred the experience a bit.Overall, though, it was a good experience and I'd recommend it for a kids party or just for climbing.", "date": "12/21/2016"}
{"review_id": "JmbPYROs_m17gJNWLhN9YQ", "user_id": "5lcYn2JxyPAaX4FpulB_4g", "user_name": "Kellie T.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Super cool gym. My friends and I had the gym all to ourselves. The staff is great and the climbs are a LOT of fun, but I feel like a really tall person (or someone with really long limbs) set all the routes.And they play cool music.", "date": "11/13/2015"}
{"review_id": "QXyFcXmaq7u7vYB4kEMbtw", "user_id": "T-GsQVpda2mPTotdFyVKjQ", "user_name": "Jamee H.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went rock climbing once, on a cruise ship.  One wall, one run.  That was it.  My brother wanted to do something active on his 30th birthday, and we came here.  It was so much fun!  There were 16 of us, inexperienced climbers.  Some of us are fit, others of us aren't.  It didn't matter.  They had numerous courses and walls to try out.  The staff were really supportive, encouraging, and knowledgeable.  None of us died - so YAY!!  It was a complete body workout and we had the run of the place.  More experienced climbers were there too and so we got to see how it's supposed to be done.  They have a lot of offerings: classes on belaying, yoga, pilates, monthly memberships.  Boyfriend and I are probably going to learn how to belay so that we can come on our own.I have a 9 year old daughter who came with us.  She was pretty amped about it and got scared halfway up.  The young man working there was really helpful and supportive.  She tried her hand at a couple more routes and they showed her the ropes.  It meant a lot that they wanted to instill the confidence and self assuredness in her trying something so new and so scary.", "date": "1/19/2016"}
{"review_id": "gXH8fZ11BBYjdItB41C-Cg", "user_id": "9WxC_n8pV-iB1J5lml8_TA", "user_name": "Amanda Paige M.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I love climbing and I love that boulderdash opened a gym in the valley! I'm excited to see how the SFV gym grows. They have a friendly staff, the belay class I took with Cory was awesome! They have innovative and a wide variety of routes. The SFV just installed a crack climb. A couple things I wish were different, I wish that members had access to free equipment rentals, since we're already paying the membership fee. I wish there was an option to bring a guest. I have a ton of friends who I hope to turn onto climbing, but coming in the first time isn't necessarily easy because they haven't passed the belay test, and it's quite expensive to come in just once. Lastly, I wish there was an autobelay option for those times I've come and wished to top rope but didn't have a partner.", "date": "9/28/2015"}
{"review_id": "43Ja5dUg5ftEdG-WBuXAHg", "user_id": "SKOfpncUmRVYoy_zwsMyeQ", "user_name": "Chelsea J.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Boulderdash has such a large, open gym, and the other patrons who tend to go there are extremely friendly. It's a cool community to learn how to properly rock climb as a beginner, and  coming here makes a fun date idea or an interesting strength workout for days I'm not on the bike!", "date": "9/10/2016"}
{"review_id": "tqix1oE4e2frdwa7GWzYvQ", "user_id": "yRnW60CQMac-I5X6ttFvIQ", "user_name": "David C.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Staff was very friendly. Place has a small group of people that love to challenge themselves. The place is kind of pricey, but overall, I really enjoyed the experience. I took my kids who are 7 and 5 years old, and they had a good time as well. They were able to climb up the easiest of courses.", "date": "11/26/2016"}
{"review_id": "NSwIVFXQrS1OfdEn85YNeQ", "user_id": "xy1UjyJEkeY5vD5r_S8KdQ", "user_name": "Katherine D.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I was really excited when I heard Boulderdash was opening a SFV location. I've been to their other location in Thousand Oaks before, so I had great expectations for their new gym. I was not let down! I actually like their SFV location even more because of the amount of bouldering routes they have. Such a great place to challenge yourself and get in a good workout. They offer a variety of bouldering, top roping, and lead climbing routes for climbers of all levels. Their staff is super friendly, and I felt welcomed right away. Affordable, convenient, lots of options, and great resources. Definitely check it out!!", "date": "8/20/2015"}
{"review_id": "7EwNHLETS7AdA6VQbAjh1g", "user_id": "6KaZSjv2udgpDBr30KC-Zw", "user_name": "Masis P.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Surprised to find that as soon as you try the routes you can actually feel, physically, that the people who set the routes know what they were doing.  This place stands out from other amateur climbing spots.  A gem in the valley, hope the community will coalesce around this place.", "date": "8/25/2016"}
{"review_id": "DfTMYxqSDPos_rqxkF13fA", "user_id": "ZOKIdzaXpAc-oYU9iQFBXQ", "user_name": "Monthy C.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to get a great and fun workout whether you are a seasoned rock climber or just starting. After climbing here once, I was hooked! Everyone there from the staff to members there are very down to earth and willing to give pointers and be your belay buddy if you need. Included in the memberships are yoga and strength training classes which compliment rock climbing skills.", "date": "8/15/2016"}
{"review_id": "ow3qAg6zxmT9ZP1Za0DJMQ", "user_id": "5E-8yeYr8TA0FuBfXBEJ3g", "user_name": "Mic H.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my third week of serious climbing and I've had nothing but great experiences.  From the belay class that was well taught to the great staff that has helped me solve some fun wall problems to the new friends I've made just hanging out and blundering.  Both facilities are fun and have some great challenges and this company runs a great shop.  Can't wait to get better and better.  Thanks guys!!", "date": "12/19/2016"}
{"review_id": "R72gVxT9Sw2wcGyMmyl7ag", "user_id": "zw8XG0NFvuQ8QSpnQp2eoQ", "user_name": "Nyte K.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter wanted to get started on rock climbing. I arranged for the up rope class 2 days after her 13th birthday. The staff was fantastic. We've been back several times to do the belay test, and after the kid failed, the staff worked with her for 30 mins to make sure she understood what she did wrong. We're going about every week now, first on 10 pass punch cards and now a monthly membership. There is a small boulder area, a lot of top rope courses, starting with easy 5.3 routes (for me), all the way up to harder 5.10+ routes. There is even a crack climbing tower. Everyone, staff and patrons, have been supportive and non-judgmental. I don't know what staff was on duty for the two negative reviews, but I have not had a bad experience to date.", "date": "9/21/2016"}
{"review_id": "uOrkQBFcZxXP3NT0aFp_Pw", "user_id": "7pKxlnt6sh6cOrzMOQgOmw", "user_name": "Charlie H.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is so awesome. Staff members are super friendly and chill and the gym itself is very well taken care of. Very affordable membership price too. I am now officially one of those obsessed climbing nerds and this place accepts us whackos with open arms.", "date": "7/7/2016"}
{"review_id": "JTVrCt_NrjMk2EV3xq8RZQ", "user_id": "l7So1gvh5MrSNicLuHze9w", "user_name": "Robyn H.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It's as good as it gets!  First time here and one of the employees was so informative.  Different levels of difficulty.  The ability to rent different equipment was nice too!", "date": "4/10/2016"}
{"review_id": "Lr_CpzvP5fukwaqgIRpbxA", "user_id": "gxrpJSKLN6FsDfq4sLd8qQ", "user_name": "Kronic S.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This review is for the bouldering area and staff. Very fun and challenging experience, great for anybody looking to get a workout in or just see how far you can push yourself. Staff was helpful and friendly. Would defiantly go back and recommend to friends.", "date": "3/3/2016"}
{"review_id": "4VYosxrAY3SQI5KbQdeKUw", "user_id": "Kcgw4uHX5aAQc6WkUehSEw", "user_name": "David A.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 1, "useful": 1, "funny": 2, "cool": 1, "text": "Don't waste your time or your money go to Stoney point this is a good place for kids and inexperienced climbers", "date": "9/22/2015"}
{"review_id": "C6x2xwgk7SdDTDdmGeQxQA", "user_id": "I-oS88L5VaggPToxUdZwUQ", "user_name": "Adam Z.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great instructors and the atmosphere is very encouraging. The walls are high and the equipment is new. I hope to be a better climber", "date": "2/7/2017"}
{"review_id": "elV49UCpIJO1tlusYzO2sg", "user_id": "gt7nwOmJWuOnbxaFL3h9uA", "user_name": "Kevin R.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This place is awesome! Bunch of really cool and fun puzzles, big boulder that you can get on top of, and some unique roofs and walls that are exciting and challenging. I think I might like this one better than the Westlake location. There's more bouldering available and plenty of top roap and lead climbing. You'll still see the nice staff that you know from the other place too, who will take you on a tour if you ask 'em.real nice. Really do go, I can't recommend it highly enough.", "date": "8/17/2015"}
{"review_id": "PKggGfXXyfqm-yEtkmdNFA", "user_id": "kwjUNs9BAwB8D2GcEy4pXQ", "user_name": "Dave R.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had a great experience there tonight. It was all due to the very helpful, friendly, positive and encouraging staff there. Took a beginners class and can't say how satisfied and fun it was. Will be back for sure.", "date": "4/18/2017"}
{"review_id": "1_KrEXEw6LsoUY494XAY7A", "user_id": "HueLX2hUYU98VNRsa_Z_gA", "user_name": "Carla S.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I rarely climb indoors, until it started raining a lot and really had no choice. So happy that I did because being gun shy about taking the lead test, which I did not pass on the first go, I did the second time the following week. Andrea was so encouraging and her positive energy helped me to get through my fear of taking a fall and passing that test. Now I have been leading often and feeling more confident each time. This confidence has also transferred itself to my doing single tracks on my mountain bike which I ride everyday in the Santa Monica mountains, but always avoid the single tracks. Now when I go down a single track I just think to myself what Andrea would say and that is \"You got This\".  Thanks Andrea! and thanks Boulderdash!", "date": "2/8/2017"}
{"review_id": "vTG2GTCVofb_NT2Be7ueXA", "user_id": "yC26GaXL6tp_fz_RQgkGFQ", "user_name": "Lindsay S.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This place is awesome! As someone who needs to be tricked into exercising, I can't wait to get back to this gym. I signed up for a class with the intention of joining to be a member in a few months, and basically had a staff member to myself to get really familiar with the ins and outs of how everything works here. The staff at this gym couldn't be anymore warm, welcoming and knowledgeable. I will definitely be back to enjoy my workouts, climbing and the awesome atmosphere.", "date": "12/22/2015"}
{"review_id": "PDdEiH1w8HA_v4ptCBc0KQ", "user_id": "RTAHWqF4rXU0NVQL-r436g", "user_name": "David J.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Would definitely come back. Highly recommended. It was my first time climbing indoors and the staff were very knowledgeable and helpful.", "date": "7/30/2016"}
{"review_id": "-6vlnbwdTtvAffm1sAEm1A", "user_id": "-EPd-2L4bb7CrOCJ5FA_8Q", "user_name": "Kali C.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "When I was living in the area, I used to be a regular at the Westlake Boulderdash location, when I was visiting friends back home, I was excited by the opportunity to climb at their new location in SFV, and I was not let down! I actually think I like it better than Westlake, and now I'm wishing I still lived in the area! The climbing space is plentiful, and I love that there are so many top rope options. The other location has an area with few, if any, top ropes which is intended as a lead climb area. This gym has top ropes alongside lead climbs, which gives so many more climbing options. I used to go climbing when the gym was super climbing and grew a little frustrated by having to wait for a rope to be freed up, but I don't imagine that being as big of an issue at this place. What most impressed me, however, was the free-standing tower in the middle that offers FOUR different crack climbs! I have never seen that anywhere, and I would come back just to give that a try. If you are into bouldering (I, personally, am not), the bouldering area is quite large as well. Definitely give this gym a try!", "date": "1/4/2016"}
{"review_id": "L1tr8t9g1BWFZ5RwFWe6QQ", "user_id": "oSRi-4VeNVB8tVzwGAXmhA", "user_name": "Rola H.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place! We had so much fun for our first time. All the staff were so nice and helpful. KJ taught us our class and we loved her. Great time and price! Well worth it", "date": "11/20/2015"}
{"review_id": "en-AAoxgxE2WSm9ChulbBg", "user_id": "R113791qjpthuK4yLWqRgA", "user_name": "Sean G.", "business_id": "NFpwj4hwofLrE8KSxghucQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had the opportunity to visit their 2nd gym a few weeks ago and it was beautiful.  The layout, location, and massiveness were impressive.  They have added a wealth of experience to the climbing community and it shows with this gym.  Good job!", "date": "9/22/2015"}
