{"review_id": "ejMAXZqxwFM85mX1QT5ZYw", "user_id": "QtW4RvmEts6jIvl6eXX8FA", "user_name": "Jorge T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My wife took me to go rock climbing for the 1st time and we had a blast.  We took the beginner class and they taught us everything we need to get ready to be let lose on the walls. Ended up spend the whole day their until our arms were to tired to continue climbing. Definitely going back soon.", "date": "3/3/2019"}
{"review_id": "tA9muCjhOV2J_1lR5y8pvQ", "user_id": "Ld0HLICQ0GisBQ-P7YO0lw", "user_name": "Elizabeth R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I love the staff here and the rock climbing is great. Prob is the gym is antiquated and poorly stocked. They dont have the most basic equipment most gyms have..Except in the crossfit area, which costs an additional $20 a month on top of the very high member fee. I can understand paying extra for CLASSES but I can't use the unused space for open gym? How asinine when the reg gym isn't properly stocked. At 24 hr fitness i get all the equipment i need AND classes for half the price. Step it up diablo rock. Here's the issue they don't seem to understand. Crossfit hoards most of the equipment. You can't get realllyyy basic things in the regular gym. Like, a medicine ball/sand ball. We're rationed one. I hope you wanted 10lbs! Want a kettle bell? Well you get exactly 5 to choose from, hope you wanted super light or mega heavy! Want dumbells? Sure! We've got these awkward wide plate ones that are rusting from the 70's! Oh wait, did you want dumb bells lighter than 10lbs? Oh well go dig in that dusty old bucket, im sure youll find one random 8 lb and one 5lb. Hell, sometimes I can't even access the rowing machine because guess what? Crossfit takes that too sometimes! It's fine to say that this isn't a 24hr fitness, sure. But I'm constantly having to improvise my workouts here due to lack of equipment and to see the adequate equipment available but not accessible when membership is already $100+/month is completely uncalled for. They need to either properly stock the reg gym or let paying members access the equipment that, lets be real here, our memberships definitely paid for.", "date": "4/27/2019"}
{"review_id": "jYdGr4dLU5N_AYM3HO1Yng", "user_id": "sHDozyifQXMu_0Xu9vojuQ", "user_name": "Daniel R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 0, "cool": 2, "text": "DRG is a clean gym with a friendly staff. Keep in mind that it has a very small bouldering area (the smallest of all the Touchstone gyms) and can get quite crowded during peak hours. They also rely on crash mats for climber safety, as opposed to the fat pad flooring that they have at Dogpatch and Ironworks. This can make falling or jumping down a little more hazardous for those used to the other gyms (I know one climber who recently missed the mat when coming down and suffered a slight ankle sprain). If you want to go bouldering, don't be afraid to move the mats around! There are a lot of routes for those looking to top rope.The workout area is pretty spacious and has a pool on site. The weights and machines are a little dated, but often free for those looking to get in a quick workout. Biggest downside is the parking, which can be quite difficult for those coming in the afternoon.", "date": "3/26/2019"}
{"review_id": "ntdu4eMr4Knakgb3TtfYSQ", "user_id": "tLQraDeMnxDJ-5z0j0Msdg", "user_name": "Beverly W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place!! CrossFit classes are fun and the instructors know what they're doing. Most affordable CrossFit around - especially considering everything else you get with your membership. Coco's definitely worth the extra $20. Commendable staff and a recherché facility!", "date": "4/26/2019"}
{"review_id": "SKogKLiHq_eb-jz-5zsdmQ", "user_id": "cuJ3t1EV2YSao6MiM3B1wA", "user_name": "Evita B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "Had purchased this community program pass from work to go to this gym. I've done some rock climbing in the past but nothing like what this gym has to offer. Went to use the day pass and expected to be given some kind of tour of the gym, but we got our shoes and were set free to find the bouldering wall. Luckily my boyfriend had been here before so he knew where to go. I haven't really bouldered before but really enjoyed how they write the difficultly level or each route. I'm totally going to come back and give this bouldering thing another try!", "date": "12/10/2018"}
{"review_id": "aSceF45fVTJdVkesLcErpg", "user_id": "ISYQNaFs3Y9IVWX885KPGQ", "user_name": "E E M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best vibe and management of all the locations I frequent (here, GWPC, and Ironworks). Bouldering area is small, but you can find it empty during off hours. This is hands-down my favorite gym in the Bay. Keep up the good work!", "date": "4/21/2019"}
{"review_id": "wW8OPW2WdAk15Nk_rm0doQ", "user_id": "eBxUsR4bE-IVcIEvTrrdUw", "user_name": "Melissa M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "My new favorite gym! All the staff  are very friendly and informative. Overall the gym was extremely clean. I've never experience a steam room until this gym and they have a dry sauna as well. Definitely feeling great after a good workout and post sweat. Can't wait to bring all my friends.", "date": "12/10/2018"}
{"review_id": "zjlRVyeus4-jMm8BGlzkaw", "user_id": "OPsI52JQ7YLsyhzC8UwJiA", "user_name": "James B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 7, "funny": 0, "cool": 3, "text": "Dropped in for the parenting and kids belay class this Sunday. $35 for the parent + $10 (Kid #1) + $20 (Kid #2). Kids are 5 & 7 and they had a blast. Will be hosting a birthday party here soon.Welcoming and laid back environment. Conveniently located by the freeway with plenty of parking. If it were closer, we'd be regulars. Tips:Bring a snack and a water bottle. No need to buy your own gear. Rental prices are reasonable. Between climbs feel free to drop into the open gym to get some squats or pull ups in.The perfect excuse to cross Willow Pass Road to drop in to some of my favorites: Dos Coyotes, Road Runner, Eureka, and REI.", "date": "8/6/2017"}
{"review_id": "o0iFSD6Lp1yvXS9K1q0O_Q", "user_id": "IsByGKw_zdOdH9yDLFcGeA", "user_name": "Yee W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We came in to check this place out due to curiosity. The woman who was behind the desk was very informative and helpful. She explained everything to us and we got to walk around to take a look. There's exercises machines, two different climbing walls.. beginner and advance.. bathrooms were clean. The vibe I got from this place was cool. Everyone do their own thang. Discounts for first responders. Not too expensive, you can also go to other gyms as well.We're still not sure, debating on their membership, but I wouldn't mind joining!", "date": "10/11/2018"}
{"review_id": "HEtjbqzCLPSrsz2st21f-Q", "user_id": "UC0u8rQOI1VjNTcLapXnsw", "user_name": "Elizabete Maria T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had a great time over here. We came since we couldn't play outside. The staff is friendly, classes are great. Restrooms are clean. They have a 10 foot wall and 30 feet walls. My kid enjoyed the experience. We are cool back in a few.", "date": "11/11/2018"}
{"review_id": "MsZOZ0PsGOkNJvv_Y10Dag", "user_id": "cAUocrfoPyXcUUfRSGdDkg", "user_name": "Jessica F.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Hubs and I finally got to check this place out for a date night. We took the beginners class to belay. It was well explained how to properly tie your rope to climb and well as how to hook up to support your climbing partner. After a practice climb up the wall you get a yellow card to day climb. You can drop in anytime to belay but you have to test to get your card each time. The gym membership itself is too pricy for me but to drop in once in awhile is perfect. Can't wait to come back again.", "date": "10/24/2018"}
{"review_id": "qvXkdsMIw9TTxHZzxD-RtQ", "user_id": "PiBA8dz-OwdnmodpbwIoPQ", "user_name": "J. N.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "What a great place for kids (and adults)! We had a party here for 6 kids aged 7-9 and the staff was great and I feel the prices are reasonable.  The facility is fantastic, with lots of options - belay, bouldering, slack lines, etc.  This is also a great place to bring kids on a weekend or for a play date. Gets them active, away from screens, video games, etc. and challenges them physically and mentally.", "date": "7/9/2018"}
{"review_id": "qM4_DXcTo2mO_1jmTIUDvw", "user_id": "SgIGk0iCYFnHzc3lLjbz9Q", "user_name": "Marcie I.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a gem. It is a great place to go for the whole family. We can all get exercise and everyone is challenged at their own level. The community is supportive and the people who work there are passionate and helpful. This has become a home away from home for our oldest daughter. We can now drop her off for an hour of climbing and she loves it. Highly recommend joining!", "date": "12/31/2018"}
{"review_id": "IdwrShwFbwsk7WW4Rud8Uw", "user_id": "NjfSkOTtpNzZrQzo8i4Zcg", "user_name": "Gab R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Such a gem within the Touchstone community, seriously!  DRG certainly has a mom and pop feel, which makes it a stand out in the corporate gym network.  The staff are welcoming and the gym has a great selection of routes, both for bouldering and rope, a slack line, an indo board, campus board, weight room, and a pool (available for day or membership use?).DRG deserves more attention of Touchstone, however. We noticed that many routes have been around for 10+ weeks.  The politics of business are at work here, I am sure, but it seems unfair to have DRG not receive the same attention as Ironworks, Great Western Power and San Jose regarding route setting.  This gym is stellar and is in need of more TLC from its corp.  There is a great community here and I look forward to continue supporting DRG when I look for rope time as Bridges is my home gym.", "date": "11/13/2017"}
{"review_id": "Cpfju2dT09TLDXcQV2pTKw", "user_id": "6X68M-UVJN7m0Ssc1hMtOQ", "user_name": "Mary G.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Great place to wall climb. Lots of different walls for different levels. They also have a small bouldering area and a small gym as well. Staff were friendly, parking was ok but it was a little difficult to find a spot. The first time you go you have to take a really short course to know the basics, also for safety. It was a little more expensive compared to other wall climbing places but its a one time expense.", "date": "5/8/2017"}
{"review_id": "vgXITaQ2uK28PMET91KuVg", "user_id": "8dpqRMuHRnPwJPzyUp1nwA", "user_name": "Kristina S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I really loved this place!! We came here to celebrate my cousin's birthday. What better way to celebrate a birthday than to climb some rocks. Lol. Anyway, parking was no problem, and it's pretty easy to find. We checked in, signed some waivers then took our beginner course with Jonny, since we are all noobs. He was very nice and helpful. Everything made sense and in 30 minutes or so, my group and I were confident to take on the rocks!If you're looking to have some fun and also to challenge yourself (because rock climbing isn't easy), you should check this place out. I'd love to come back.Deducted a star because some of the ropes are a little smelly. I feel like they should clean more often? or replace more often. Just a suggestion for management. Other than that, this place would've been a solid 5 stars.", "date": "3/18/2017"}
{"review_id": "jz7aNggE1rPsxG_RODlXDA", "user_id": "_O8ipVq6qy1sDhD5z7s0Ag", "user_name": "Angelina D.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I have been a Diablo Rock member for a few years. I like the installations and class offerings. Routes change often to keep things interesting and new. The staff is very friendly and helpful. There is a sense of community that I have not felt in other gyms, even other Touchstone gyms.", "date": "2/6/2018"}
{"review_id": "qe8_fzQRpyFrIlSwg0ZUUg", "user_id": "KRYQGA74lf-HMqHNayfISQ", "user_name": "Claudia C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 2, "cool": 3, "text": "Relatively large gym with friendly staff and tons of courses with varying degrees of difficulty.We're not regulars yet, but hope to frequent this gym more going forward. We signed up for the intro to rock climbing class to learn the basics. The first time around I made a scheduling faux pas (got the time wrong and arrived for the class an hour late). The folks working here were super forgiving/understanding and let me reschedule for the following week.During the second attempt (which was a success!), we had a great experience learning the ropes. The instructor was attentive and went at a pace that enabled everyone to follow along. Afterwards, we got to climb as many walls for as long as we wanted.Prices are a little steep (about $20 for a day pass on the weekends), but it's what you'd expect to pay for any single session at a yoga parlor or cycle place.My only qualm is that it kind of smells here, but it's expected with any gym.Other than that, this will most likely become our go-to gym for rock climbing.", "date": "9/21/2016"}
{"review_id": "-jNauAYbSviuFlhs7gBQQw", "user_id": "noPnGMkmbrrkWPc_05e5zQ", "user_name": "Avigdor G.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Really not worth going to, poor sanitary conditions, I'd go anywhere else. Unfortunately not a lot of other options", "date": "9/9/2018"}
{"review_id": "CJxIJ6h9JWnyGuWuG35sZg", "user_id": "Hi0T4tXQWU48EweYwbpWcg", "user_name": "Anjelica C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I have officially been a member here for a year now.  All of the workers are really laid back and friendly.  I have never felt intimidated and always felt welcome.  Theres a good mix of routes here.  I'm still a beginner so there are still really challenging routes for me.  I can't lead climb, so no opinion there, but I love taking a break and watching the pros go at it.  The gym gets pretty crowded on weekdays and the parking lot is NUTS.  They share a lot with the swim school next door and it can get busy on a week night.  The bouldering area is nice but also gets pretty crowded.  It's smaller compared to some other Touchstone gyms.  They have a slack line set up every once in a while.  The gym equipment is also decent.  My husband and I tried out a swing class.  It unfortunately didn't work out with our schedules, but it was cool they offered it.", "date": "1/19/2017"}
{"review_id": "gVbCW9u3Jsm0rxgW_d05Kg", "user_id": "51Wt6Sqp0HG2zv8tZ_VGeg", "user_name": "Blaine J.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "Been coming here for years. You get what you pay for. Has so many activities and I love how down to earth the place is. It does have some downfalls as any business does but to me it's minor. Sometimes it's short staffed or the front desk dude seems high or something but eh. Everyone has always given me what I needed and has always been knowledgeable while helpful even if they're busy and can't get around to everything at once. I recommend visiting when it's not busy for your first experience to not get impatient or overwhelmed. For the price tho it's worth it and it's mainly about having a good time with good people while maintaining a healthy life style. Just chill and don't act like a princess or prince or whatever. You'll be aight.", "date": "3/9/2017"}
{"review_id": "gx9MeUD1q2R-klG-Z2b4qg", "user_id": "8SwvVc04xxk98SlXRfs66A", "user_name": "Julia L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Awesome climbing gym for the kids. I'd love to try myself one day. On weekends they have kids' belay, and one of their staff will expertly work with your child. We've also booked a birthday party here and it's loads of fun. Both Steve and Elizabeth were great with the kids, encouraging and patient. They have a dedicated small party room so you can do food and cake.I had to change the number of our party several times (and even after the fact), and each time the staff member assisting was friendly and helpful.We'll be back for the parents' training class!", "date": "4/21/2017"}
{"review_id": "wlSg2TVdGF9ByDfU9wb8gQ", "user_id": "B3cOX_VmahpCGvZzyVIEig", "user_name": "Richard N.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place is awesome, so awesome in fact that we decided to join here as our normal gym. The lead climbing routes are challenging, although they aren't too high, but they have a good amount of routes.  The staff here is pretty good about switching it up and updating the routes often.  There's a bouldering section in here as well but is pretty small compared to other places that we've been.The gym area itself is small as well, but they have everything that you need equipment wise.  Diablo Rock also offers a good variety of different classes for its members.  Crossfit is also available for those into that.  To top it off, the staff here is awesome.  They're always friendly and helpful and all appear to love their jobs and this gym!", "date": "1/25/2017"}
{"review_id": "2YG1sg3b85NSEf9f6WBh8Q", "user_id": "g5_MHfgZyY6PQSQqSE2REA", "user_name": "Kim P.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I really liked this place!! It's like a fun playhouse for adults and kids! My sister & I did a class. We were grouped with two others. Our teacher was very patient and knowledgeable. She had us go through the motions a bunch of times until we were comfortable. I really liked how she would show us step by step, we would do the steps together, and then we would do it on our own a few times & she'd check each one of us! The lesson is like 30 minutes and then you get to climb. The teacher watched us and helped us when needed. She watched probably 2-3 climbs and then the class was over. After the class is over, you get a full day pass where you get to climb all day if you want. You can try all different levels, same levels in different locations, watch people, take breaks, etc. There's even other fun things to do like walk on a rope (whatever that's called), and other fun balance things. I really liked this place! It's for all ages. Little kids were there and older adults were there. All ages were having a blast. I got REALLY tired. My arms and body couldn't handle more than 4 hours lol but I'm sure others can. I definitely recommend this place! My sister and I really enjoyed it. We're definitely coming back with other people to share the experience!", "date": "7/23/2017"}
{"review_id": "ZWF8Fx9mevHX0m1K8raGpg", "user_id": "WKIW7tWyMq7_XN0V2ouo0A", "user_name": "Rebecca W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "This was such a cool place and a great place to learn how to climb for beginners, like myself! If you live in the Bay Area and haven't been here yet, shame on you! These indoor rock climbing gyms are such a treat to have. They are yet to come in Baton Rouge, LA so I was excited to visit this one. It was our first time there and I have never done rock climbing without the use of an auto-belay device. Unfortunately, since we did not receive any prior training we could not clime the higher walls here without doing a formal belay session. So, they gave us the option of bouldering, which was also really neat to do! My 7-year old daughter is obsessed with rock climbing and I enjoy it, too, but wish I had more upper body strength. It is hard! Bouldering was fun and has no belay, so you climb and either have to jump from the top or climb back down. I was exhausted and super sore afterwards. My daughter was into trying all the difficulty levels and enjoyed jumping off of the wall. For the record, I was super sore for a couple days, but totally worth it. Now, I am looking forward to the one opening up here in Baton Rouge! #climb", "date": "9/23/2016"}
{"review_id": "tCxxAzvU4vgmjiOB8ZAvng", "user_id": "OIZkIV3wKzYUt3qCZiedyw", "user_name": "Kristina L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A fun spot. Great for a day adventure. I often climb with my brother for two hours, get some food and climb a bit more. There are saunas, steam rooms and showers in the restroom area. Classes for climbing as well as various other activities. The staff is helpful and generous.  Sometimes there is no one behind the desk though. Looks like they are busy. Worth checking out. Especially for hosting birthday parties.", "date": "4/22/2016"}
{"review_id": "ZyGTN8M5b_j9bT3h0MgyIA", "user_id": "W70ZbP1PYFo2pNkGJaONPQ", "user_name": "Ruth R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! My husband and I booked and paid for an intro class and weren't able to make it but they let us reschedule to another date even after we didn't notify them ahead of time. That's beyond customer service-- that's just very accommodating. Lots of choices for rock climbing. They also have spin, yoga, and crossfit along with standard gym equipment (treadmills, weights, etc.). It can get very busy and isn't the newest/cleanest gym but the vibe is very inviting and encouraging. It can be pricey so either get a membership or go for a treat.", "date": "4/16/2017"}
{"review_id": "8ubT1q9VNX141gu5xxFROw", "user_id": "H5EY1CeIx4m_pNChKZkq7A", "user_name": "Kathy V.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 19, "funny": 16, "cool": 18, "text": "Who would of thought BOULDERING is a real work out? My first time experience was a fun aspect but also tough. A lot of upper body strength using your core and mind boggling trying to figure out which spot to use as leverage. Came here and made it a mother daughter day with the mini and had a fabulous time. Glad this gym actually had a lot of  weight equipment, treadmills, ellipticals, and a swimming pool because I needed to get in some cardio before climbing. Diablo gym has friendly staff & a spotless gym. Will I be back? YES!!!", "date": "6/14/2013"}
{"review_id": "sDZHN35x-ONYLSoR9AHsAQ", "user_id": "klimqE5wcyla2-XFp0EZ5w", "user_name": "Ryan F.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My favorite gym!! Great place to do whatever workout you like. I love the atmosphere and the staff is always helpful and accommodating. Also, I met my wife there! So it'll always hold a special place in my heart!", "date": "10/11/2017"}
{"review_id": "yQg1OlYGvWTSVTJViXcfdQ", "user_id": "NCAO2KuKuOeMUM7kvXl7Fw", "user_name": "Sasan S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Only been here a few times with friends who are members... Very dope place. On top of the rock walls and bouldering area there's weight equipment, locker rooms equipped with showers steam room & sauna, yoga classes offered, I think cross fit too? Not sure what the deal is with these guys and Diablo cross fit but I'd assume if you're a member of either you probably get some sort of deal if you want to use the other? Clean place, cool people, friendly employees. It is a little steep for a student like myself I think a monthly membership runs something around $67 but considering all the stuff you can use that's not bad at all.", "date": "12/10/2016"}
{"review_id": "UkH8AsDk9YYKKVKIiNjMeA", "user_id": "hrJJTeIsTGwbI6opklqxQA", "user_name": "Kelly B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went once and johnny helped me out at the front. I had never been before and he was helpful and set me up with a good pair of shoes! It was great to have such a friendly guy working there. The gym was pretty cool, too. I mostly hung in the freestyle area (I'm not sure what the actual name of the area is but it doesn't have rope) and that rock climbing is harder than it looks!!", "date": "11/21/2016"}
{"review_id": "uNvlTv_EbT19ypCp-tRP-w", "user_id": "syXbU628RijMfq41To7RzQ", "user_name": "Adele Y.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My husband and I went here today with some coupons for a free full day. It's a pretty big gym with many walls to climb and countless routes. There's also bouldering as well as a fully equipped workout gym, though we did not use it. The staff members were all a delight and knew their stuff. It was easy to get belay certified but we still felt safe and well trained. My only negative is that it closes pretty early. Overall, we were both well challenged and both had a lot of fun!", "date": "8/5/2017"}
{"review_id": "m2d6Osr0bszJZ2y9p1jruw", "user_id": "1JXiOwNGkJsPLz7eE1CKxw", "user_name": "Lillian T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 5, "funny": 0, "cool": 0, "text": "I came here a few months ago with my boyfriend. It was our first time at this rock gym. We bought tickets online for the beginners class + day pass package. It came out to be around $30 a person. The last time I had been rock climbing (not here) was about 3 years ago and I remember the class being very informative and slow paced...I mean you could really mess up in this sport so it should be. We started out with the class (this is what brought down the stars): A guy with a cap came over and gave us our harnesses, belay, and carabiner. He then proceeded to show us how to tie everything...super fast like we just needed a refresher. Uh, we are noobs, can you slow down? We were with another couple at the time who were first timers as well and we all had trouble keeping up. He acted very impatient every time we were slightly confused. After asking many questions and getting the same \"you should already know this\" attitude, we finally suited up and were ready to climb. The rest of the trip wasn't that bad. They had many levels from easy to extremely difficult climbs. We tried all the easy to medium ones with the latter being good challenges for us. They also had a tightrope for you to try if you were feeling adventurous, which we were. Although, there are other gyms that are much bigger in comparison, this one was a decent size and you could easily spent 3 hours here.All in all, if we were there to just climb without the lessons, I could go again. I have to just keep practicing in the air with how to tie the ropes so I don't forget and can pass the test. Not having to deal with the people who work there every time would be best. Otherwise, I'd definitely pick somewhere else if you were just starting.", "date": "10/21/2015"}
{"review_id": "fy1Pm9VQBZJnGDJx2Sy-5w", "user_id": "Va-je-EVdeY7rkwOFYJM_A", "user_name": "Jennifer S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "I'm in charge of organizing our boy scout troops climbing merit badge event at Diablo Rock Gym & yesterday was the second time we've attended this location in 2 years. Theo, William & Stephan did an outstanding job! Their love of the sport combined with the understanding & patience as instructors, really fit the scouting spirit of \"fun with a purpose\". We even had a few scouts who were afraid of heights & unsure if they could complete the course but Stephan was at the top of the rock wall encouraging while Theo and William stood at the bottom ensuring them they were right there to make sure everything was safe & secure. Thanks to our 3 instructors; every scout finished the course with a smile, sense of accomplishment & earned merit badge!I'd highly recommend every local boy scout troop come check out Diablo Rock Gym's Merit Badge Class. It's an amazing deal at $40 per scout for 4 hours of learning, practicing & instructors dedicated to making sure each boy succeeds! It's truly an amazing deal & good time had by all.", "date": "4/17/2016"}
{"review_id": "Gwi-oXNIzqCa_bdp-F5Hmg", "user_id": "Ls8HPGKQGgIuEhaZKCKJLA", "user_name": "Jordan B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "It's the spot! Great environment; friendly people and staff. For $70 a month full workout gym, rock climbing, and crossfit classes! Best deal in town. The have both top rope and bouldering as well. Awesome spot for the adventurous!", "date": "10/9/2015"}
{"review_id": "J2ghsHCadrgm0CFCqVD61Q", "user_id": "tPMXArPWmfUtpsw_uQSYsg", "user_name": "Andy A.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I love this place. Had been climbing here since late 2008 and had to cancel and rejoin a couple of times. I will say the 2017 prices seem a little out of control. I was in last week with a friend and noticed the prices that had been posted and the day rate is going from $20 to $25. Seriously a 25% increase in a daily rate, which does not include shoes or any gear. Thankfully I have my own gear otherwise I would be about $30 bucks just to climb for a little while.. Also, the monthly rate seems to go up 2 bucks a year, so I guess that is to be expected. I have always had my gripes with gyms and their initiation fees. Really a $100 for someone to plug in some data entry? Outside of my nickel and diming complaints the gym is very well equipped. More than adequate climbing areas and a solid workout room. Lots of classes and workout styles that are accommodated. In the last almost decade here I have met so many good friends and made so many memories. The service is amazing with super friendly and helpful staff and solid amenities I will keep it a 4 and ding it the one star for the shortsighted pricing policy though.Update:Hans from the gym let me know that the day rate had not changed in like 5 years and that the initiation fee is waived during the month of January.", "date": "1/5/2017"}
{"review_id": "GFOBYy-EdaxGiWDAUYrLKw", "user_id": "6k_GT_Ssn8llBzN3kQaQcQ", "user_name": "Bryten P.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "I had only been to DRG one other time years ago. My friend that I went with and I are both very new to climbing. Even though we didn't come on a new class night, Kyle still took the time to show us how to belay and tie the rope correctly. The staff were all very helpful, especially Kyle going out of his way to make sure we were very competent and safe. I have already gone back again since the first time we went last week and I plan on going more because it was such a great experience.", "date": "7/31/2015"}
{"review_id": "p_PSjUT_r6vpMx0dOGZL9Q", "user_id": "PPiYZDUh_gFDIuq9b3r1cQ", "user_name": "Krissy L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 7, "funny": 6, "cool": 7, "text": "Not bad! Diablo Rock gym is definitely baby-sized compared to its other sister sites, but it definitely does NOT lack dynamics. They still provide great routes that is challenging for all levels! It can get a bit crowded though, especially in the evenings and weekends, but it's not that bad. I also love the staff members here, they're all very chill and very helpful. Feels a bit on the slow side, but for some reason, it doesn't bother me. Probably because the music is so hypnotizing and the general atmosphere is super relaxed. The bathrooms here are very nice and clean and VERY EMPTY. I'm pretty sure I could go butt naked in here for a good hour and nobody would know. They also provide nice smelling shampoo, conditioner and body wash as well as blow dryers and brushes (pretty dirty though). I think they also provide towels, but I always bring my own anyway so who knows.", "date": "6/25/2015"}
{"review_id": "m0jgFdp5CTyH9KpJ7t0b_Q", "user_id": "9VIqYPRgaNUhcrYE4q39lg", "user_name": "Michael W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "The positivesBig place with lots of walls to climb and a decent bouldering area.Amenities include steam room, hot tub, and towel service.Awesome classes include yoga, crossfit, stretching, and much more...They hold holiday parties and competitions regularly for members.Membership is fair at $72 a monthThe staff is very friendlyThe negatives Parking can be torturous during peak timesthey do a lot of parties and so kids can get in your way while you're climbing (though not a huge problem)The place is pretty popular and it can be crowded at time, but really only too crowded during peak hours.Occasionally I will come in and they will be resetting a large portion of the walls which gets in the way of my planned routine. This can be very frustrating and I wish they'd do this during their off hours.If it wasn't for the large amounts of kids running around at times, and the resetting of the gym during climbing hours I would give this place 5 stars.", "date": "9/12/2015"}
{"review_id": "tRpXSQJLFSDEiy6mEiTA-g", "user_id": "RlXfOTtpgTfcisRmukrGbw", "user_name": "Jenn C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "Just had my first visit to the Diablo gym today and I had fun - it was nice that it wasn't crazy crowded at 10am.  The main down-side is that the walls are only about 30' high.  I think that the routesetters make up for that by doing more unique things for shorter routes with the starts and mix it up - a 10c/d was a lot more pumpy than I expected.   I found 11a and 11b routes to be more challenging which makes me think that the route setters partly rate based on endurance (not so much an issue with shorter walls) so there are more technical moves required on some of the routes, and a lot more different grades of overhangs at this gym.I just wish they had more lap swimming hours for members at nearby SwimTech - I would have stayed all afternoon!  Looking forward to climbing here again.", "date": "10/26/2013"}
{"review_id": "Wm9vil-oqYx-2_LIuY4_mQ", "user_id": "6mSczadyhSs6d6V2AS_x7g", "user_name": "Jon S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've been a Touchstone member for a bit now, but most of my time is spent at GWPC or Ironworks with the occasional jaunt over to Mission Cliffs or Dogpatch. I checked out Diablo for the first time and I was pleasantly surprised. Definitely a fan!From the outside, I was skeptical. The building didn't look very big, and while the walls aren't as tall as some of the other gyms, the number of routes for both bouldering and top-roping are actually pretty substantial. The gym also packs in a decent weight room/cardio equipment, a pool (!!), a dry and a wet sauna, plus exercise classes + a Crossfit gym as well. This is definitely one of the more all-inclusive gyms of the Touchstone family. The staff members here are great too. I didn't get a sort of pretentious/arrogant vibe that I've felt at a couple of the other gyms. My guest had shoes but needed a harness. The woman at the front desk comped the harness which I definitely appreciated. His belay test went smoothly as well and she was great about giving him some pointers. Overall, a super positive experience. If I'm ever back in the area, I'll definitely be back.", "date": "8/1/2015"}
{"review_id": "G5gfgW5T_BsHAcD6O1Jd5w", "user_id": "7edHxOKYn5UwGXafHGRlAw", "user_name": "Robert R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 5, "funny": 2, "cool": 4, "text": "I had been here a couple times for a tour but never got a chance to get my \"rock\" on. My lil ones were interested in trying the place out and we went in a couple of times. It costs $15.00 for an hour with one instructor. We went 2 separate times and the instructor had about 3 other kids along my lil ones.They harness the kiddos and belay them to their hearts content. The staff is great with kids and are literally encouraging them to go higher and higher. They make you fill out the waiver on 1st visit, but once you complete it; your already in the system.", "date": "2/23/2013"}
{"review_id": "GKBc6QDc44IgV-ixhSzGaw", "user_id": "1rwLFIEzMDjXggQFwii7wQ", "user_name": "Annie M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I would give this place 5 stars for the staff alone!  But since I've climbed several other gyms - it gets only 4 just because they are not nearly as huge-a-mungeous as Planet Granite in Sunnyvale where I first learned to climb.  But it's very close!!!  I think PG is only bigger than DRG because they have a fully enclosed gym area including a spin class etc.  DRG also has a complete gym, but it doesn't have a tread climber and some of the other crazy contraptions I've seen elsewhere.   They have weights, treadmills, versa climbers, row machines.... full locker rooms with saunas and showers.The bouldering area is challenging as it has both cave climbs and all sorts of pitch complete with a climb up cliff and jump off (6' off the floor).  Great variations for V0 all the way up to V9's for the pro's that also come to climb here.  Hans Florine runs this place so it always has something for the advanced climber :-)  They have the DRG Challenge board that allows anyone to compete throughout the year.Rope climbs are outstanding.  They change the routes up every 6 weeks or so and make sure that there is ongoing variation throughout the gym.  Everything from 5.2 (for kids and birthday parties, speed climbs for teens, and beginners alike) all the way up to 5.13d.Bring your own belay device.  You can buy a gri-gri at the front desk, but you can rent a harness with an ATC.It's in a great location within a stone's throw of REI, Any Mountain, Lazy Dog, Elephant Bar, Panera, Fuddruckers... etc.  So after you work up an appetite - you can finish off your day any way you'd like.  Parking is no problem and everyone in the gym is very friendly and helpful.  We love DRG!", "date": "2/22/2015"}
{"review_id": "Lzl3Kydy82Irw4WPT5gNWw", "user_id": "7TkojMG64NyzCcc1scJkfw", "user_name": "Ryan C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "A great gym with super helpful and friendly staff make this place the best.  You get free guest passes each month, they do not roll over, and on the last Friday of the month you get an extra pass.  The routes change often enough to make it fresh.  I will let you in on a little secret, come at 6am and there is only a handful of people in the weight room or on the walls.  I am a huge fan!", "date": "5/6/2013"}
{"review_id": "r8WyU2WtNGw5CG0MwtvpCQ", "user_id": "zp-s59oGptp9uvzgjj5W9A", "user_name": "Gerald C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love going here not only for climbing, but for lifting weights too! And if you like Crossfit, they have that as well!", "date": "8/21/2016"}
{"review_id": "Cfam1Bnb6noDQO9Mb9H8Vw", "user_id": "HFECrzYDpgbS5EmTBtj2zQ", "user_name": "Eric B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 8, "funny": 2, "cool": 4, "text": "Diablo Rock Gym is the far East Bay alternative to Ironworks. You have to really look to find it as it's tucked way back in this Industrial Park and right next to Aquatech Swim School. In fact, they connect inside and using the pool is possible after climbing up the wall of your personal and physical choice. Diablo Rock Gym is a nice facility, with manageable crowds and nice folks. And if rock climbing isn't your end all, there's also free weights, weight machines, and cardio equipment. The locker room is large clean with a saunas, and shower. There's also group classes in such things as indoor cycling, yoga, or the other classes that we offer. In other words, it's a gym option in its own right.", "date": "6/12/2012"}
{"review_id": "f1TXP8E2hAGMLyJ-fUEvIQ", "user_id": "Xm1OFHbp5XHV0ibzl4R-lQ", "user_name": "Jana R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 2, "useful": 1, "funny": 1, "cool": 0, "text": "I was in town for a business trip so I was by myself and had no belayer.  There are no auto-belays and one of the tiniest bouldering areas that I've ever seen--plus the bouldering area was completely packed so there would have been a lot of waiting around for an open space.  This place is probably 90% top-rope, which is great if you have a belayer.  The price is $25 for a day pass and they refused to give me any sort of discount for only bouldering--it was obvious that I was by myself.  If you have a partner, this is probably a fine gym but don't bother going if you're by yourself.", "date": "2/22/2017"}
{"review_id": "O7Fj2YdmlqvCsGY1gpmy4g", "user_id": "f0o054MKssU3HuaSagej7A", "user_name": "Kristine Y.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 11, "funny": 5, "cool": 0, "text": "My daughter was interested in rock climbing for her Bday, I was very excited to have found somewhere near that we can go to. I looked at your website & saw good reviews. We are all new to rock climbing and your facility, so we even went to check the gym before booking the party. And that's when I actually first noticed the poor customer service at your front desk. I had questions with the prices and how things worked if I wanted a party. Basically, left your gym that night saying to one of your front desk people: \"Should I just look at your website?\" Because honestly, he made me feel that he did not have time to answer my questions. A few days passed, since my daughter really wanted to rock climb for her Bday, I went ahead & called to book the party over the phone. I had a few questions first, coz again we are new to your facility & are not sure on how things work. Well, this is how it ended..I said: \"You know what, I'll just book the party on line.\" Why? Because as I was trying to ask & talk to this someone on the phone, he was talking to someone else! I almost did not want to book the party there anymore at this point.Today...today was the day of the party. I already had an idea of what may go wrong, but I was hoping it would be different. Unfortunately, it was not. Our party was 4-6pm..I was told we are able to use the party room at this slot even though you don't offer it at this time on Sunday's. I came a little early @ 3:45pm to check in. We were checked in by JP or PJ. I asked if we are able to set up in the party room & he said there's a party that is still there & to check back in about 10 minutes. We check back at 3:55pm & asked someone else if the room was ready...JP or PJ annoyingly shouts \"I already checked them in!\" I had to step away because I did not want to loose it in front of my children and her guests. My husband finally spoke to an older gentleman & we were told that the room is being cleaned, but for the meantime the girls could start climbing. Katie was the girls instructor and if it weren't for her, my daughter's experience would've been really awful. Katie was awesome! (She is the the reason for the 1 star) Thanks to Katie or else it would've gotten really bad. The whole time that the girls were climbing, guess what happened to the party room? No one ever bothered to come up to me or my husband to follow up on it. We had our cooler, snacks & decorations for the room by the sofa waiting. I just told my husband to take everything to the car & forget it! If it weren't for one of your other staff over hearing me complain to my older sister about talking to the manager that someone finally talked to us. This was already probably 5:45pm! JP or PJ came out to apologize to my husband, but for what?! It was already done!!Improve your customer service at your front desk. Teach them just simple common courtesy. Teach them that they can't assume that not every person that walks in your gym is supposed to know what to do! I asked for climbing shoes for one of my daughter's guests & I get a snarky comment that her shoes is as good to use. I know that! She preferred climbing shoes! JP or PJ rolls his eyes and basically drops the shoes like he did not want to give it to us! Ask him if he heard anything from me?! I'm a very patient person, but I could've really lost it there at that point. I'm an adult & your staff are all kids! They are hanging out there in front, flipping their hairs & acting like they can't be bothered! Please.. my daughter loved the experience climbing with Katie. I am really considering signing up so she is able to do more climbing. But if your front desk staff is not going to improve, I'll take my business somewhere else & soon other people would too. For the record, I am not complaining so that we can get free classes or a refund. Ask PJ or JP(whatever his name was!), because he did offer that to my husband. Unfortunately, this experience earned you this review.", "date": "10/5/2015"}
{"review_id": "IvbZ6HYuMg__5P1Pkz2xSg", "user_id": "XdYVYdHCsY26eMZbWko-sw", "user_name": "Rylah L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "I love this place! Diablo Rock Gym is amazing. Such a positive and fun environment for learning to rock climb! The staff and other members are so nice and helpful.", "date": "4/23/2014"}
{"review_id": "7z0K7pgK19032G7FEKqSVg", "user_id": "zpmePsBBwth_2G6jL1VTeg", "user_name": "El C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 5, "funny": 2, "cool": 0, "text": "Took our 8 year old twin daughters there after school one day a few weeks ago.  We were met by a young woman at the front desk who seemed disinterested in the fact that it was their first visit there, made no eye contact with us as she ran down the prices to climb.  Basically, it was going to cost $15 per child to \"free climb\" for the day.  I thought $30 for two kids climbing was steep, knowing they wouldn't be there for very long, surely not ALL DAY!  Long story short, the front desk employee wasn't going to let the girls try it without taking the full $30.  I shelled it out and they climbed, for about 20 minutes....then we left.  Rip-off!  Just go to Mt. Diablo and hike instead.  Way less money and attitude!", "date": "1/30/2014"}
{"review_id": "UG6YpD3_xm9vUTTpUrLzfA", "user_id": "0V5yhrkOS68ciPfgWxvAHA", "user_name": "James M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to climb. Staff is ALWAYS extremely friendly and welcoming. DRG is always clean, staff are great and good climbing too.", "date": "3/15/2015"}
{"review_id": "dVyl-IynyOnTCxI4Sk3nxQ", "user_id": "F3F9weuqIWB3fBzqf5jwwA", "user_name": "Tyler H.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Reviewer has no previous climbing experience. Writing as a pure beginner.My SO and I came on a Sunday midday for an introductory climbing class and hung around after to play around. We were really happy with our experience. The intro class is effectively $5 on top of admission and gear rental, which signified to us that the gym puts value on safety. The class was small (5 people) and the instructor made sure everyone was competent by the end.The climbing itself was fun and challenging, but approachable and addicting. There is a bouldering pit, top rope area, and lead climbing area. My guess is that this is a rather small gym, but from a beginner's perspective, it was plenty big. They advertise that the routes are changed up at least every twelve weeks.After the experience, we are definitely looking forward to going back and strongly considering a membership.", "date": "9/14/2015"}
{"review_id": "bNFbvIuldt1C98wfXwJmtg", "user_id": "vwLc4TBs3SCXV_K4SpoTDg", "user_name": "Derek T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We have a Boy Scout event here each year. Very impressed with the staff as they were very helpful and welcoming. Lots of good climbing happened.", "date": "11/9/2015"}
{"review_id": "wMETlIPNmtbynaDEe5Rf2A", "user_id": "YCQnB36zOiuk3wbpH5yaWQ", "user_name": "Hannah M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 5, "funny": 0, "cool": 0, "text": "Very unhelpful staff, and rude staff. I went there for the first time last week and I have never been so disappointed.  The staff member if you can call.him that,.helping us was not helpful, rude,  and left us to go play on his cell phone. No other staff member offered to help us and when I asked if there was a manager they said no with a huge rude smile. When climbing the staff also dropped me quickly to the ground even though I told him to go slow and I twisted my ankle. I would not recommend this rock climbing gym to anyone. I will be finding somewhere else to climb.  The managers are obviously not interested in obtaining new clients.", "date": "6/15/2015"}
{"review_id": "1s9-NHArj2jntFcNMAQQRg", "user_id": "JFt7m1ZtnWhX2dQNZGmvQw", "user_name": "Emma S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "3.7 StarsFirst of all-don't complain that blah blah there was nothing to do for your toddler blah blah. Lets get things straight-this place is NOT for kids. I'd recommend this place for ages 8 and up (depending how confident and how afraid of heights they are).My first visit here was ok. The parking lot is pretty small, but there's usually spaces available. (Tip; Sky High is around the corner). When you 1st enter, there are leather couches to sit in. If you are a 1st timer, pop a squat (Big Brother Season 14xD) and fill out your application. I would NOT recommend this place for people who do not have medical insurance. The place itself is pretty small too. There are about 4 rock walls, a gym (for 18 years of age or older NO KIDS ALLOWED, and a bouldering wall section (climbing without harnesses). The rock walls itself are based on levels. The higher the level, the higher it is. New rock climbers should start off on an lower level so they can get more confident.The place is really nice, but it's not that much for me. You see, I'm a tiny bit afraid of heights and I can't climb high so this place doesn't get me a lot of hours of exercise. At the front, there is a counter where you can buy (energy) snacks & soda. I had a cookie there which was ok. The food is on display and sits there, so obviously it's not fresh.  Next to it is a tiny gift shop wear you can buy gear and stuff. I haven't been in here so I don't know much about the prices and what they sell.:)", "date": "10/26/2012"}
{"review_id": "nIbmUnc-J7gqo58zrp-zzA", "user_id": "WeVKDguBgqcNJ31fjI1aLw", "user_name": "Pouneh M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym. It's a huge community filled with friendly people just trying to better their athleism. For those of you complaining about the \"customer service\" take into consideration that this is not that large of a gym but is always crowded. The front desk is always crowded with new climbers with questions. The front desk is really meant to check people in and out and the beginners class is meant to answer your questions. There's only so many people they can  serve to at once.", "date": "4/5/2016"}
{"review_id": "7I2nPvx8Z2AJoBC7ev2grQ", "user_id": "ER92GT5IO5QXN6LX52fCTw", "user_name": "Megan G.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "Bouldering was an extreme mental and physical workout! I have never tried climbing before and must say its kind of addicting. My raw strength and determination to conquer each set was exhilarating. Though my hands and toes felt like they were bleeding afterwards I want to go back and try the harder levels. For a beginner, I held my own but had great support from other members. Everyone there was very nice and eager to assist. If you want to get away from being an autopilot drone with headphones on a treadmill you can also try cross fit, yoga, cardio and free weights besides climbing. The neighboring aquatic club partners with Diablo for their members to come and swim or take classes. Truly and an all inclusion workout center. Can't wait to go back!", "date": "12/16/2013"}
{"review_id": "Ksod8KuqlafojXfUWUUuww", "user_id": "yJG0nhd06KV2lQlbu-7giw", "user_name": "Patrick B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 21, "funny": 2, "cool": 0, "text": "It is difficult to rate this Gym using yelps star system   Let me explain. I used this gym for 3 months and it started out being everything I wanted/needed.I would get to the gym at 6:am and all the machines were always available, the atmosphere was relatively quite, the music was good and watching people do the various activities, like rock climbing and cross fit, just added a sense of community to the gym.    The staff is friendly and over all, things were just fine.   I had been thinking about getting my kids to come with me and do some of the rock climbing courses the gym offers.   I'm glad we never made it to that point. My bad experience begins one day when I start to notice people peeling calloused skin off their palms after they rock climb.  Hey, its a rock climbing gym, it's going to happen right?   However, I never really thought of that being an issue until I noticed some people doing it.    I began to realize that \"duh\"  people are going to blister from time to time while climbing these rock walls, but then what happens.    Well, over the course of a week or so,  I noticed some of these rock climbers who are peeling their palms were using the free weights after their morning climbing.    This made me question how clean the bars and weights were.    It just so happened that one morning, during my workout, I went to grab a barbell from the barbell stand and there it was....two chalky palm prints on the bar, the left one with sticky darkened red ooze covering exactly where the index and middle finger would join the palm.   And the barbell below it, the same thing.    I started looking at all the barbells there.   All of them have traces of chalk on them, and all of them have dark spotted areas on them similar to what the bloodied one looked like it was drying into.   I decided in those brief moments that I was done at this gym and later that day I came back to sign my notice to quit.   I did not give my true reason for leaving them then, I just did not want to hear an excuse or a sales pitch on their part trying to get me to stay.   I was disgusted and just wanted to leave.  I reviewed their website afterwords and on the bottom left hand corner of their site there was a gallery with a picture of two calloused hands slightly bleeding.  That picture is not there as of this writing, but only a few short months ago it was.     Which should have set off an alarm to me earlier if I had more thoroughly check their website before I signed up. So, to finish this off, again my 3 star review is complicated.  I give the place 5 stars for the type of gym that it is.5 stars on amenities, 4 stars on friendliness4 stars on my overall experience minus the callous picking and blood incident.And what can the Gym do to prevent people from lifting weights with blistered hands?     I don't know.   I suspect blistering hands are just part  of the rock climbing culture both on real rock and fake rock.    It's gonna happen,   but somehow people need to be accountable for their own hygiene when handling the equipment.   And I left because I don't believe this is something that the gym can ever completely control. I think it falls under the idea that everything a customer does there, is done at their own risk.      And I choose to not take part in that risk.    Good Luck.", "date": "4/7/2013"}
{"review_id": "WbPEqpIxxAMe1-YBpmFQfQ", "user_id": "Vo-5-SD5lPVwNthI5Z2w8Q", "user_name": "Kelly X.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I started climbing in Austria where I learned belaying and techniques. The gym I used to go to in Austria has much higher walls (about 3-4x the height of Diablo's) so the lower walls at Diablo are extremely disappointing. I don't feel as though I'm getting endurance training at all. My main issue however is that the staff at Diablo have an air about them like they're better than everyone. The one female staff member I've encountered has been very nice, but the male staff is intolerable. They need an attitude adjustment. Also, I don't know how familiar the staff is with climbing itself. It seems as though they are well trained in the Touchstone style of climbing but have no idea what other belaying devices are. At Touchstone they seem to only use GriGris and they expect people to treat other belaying devices the exact same way. I am confident in my belaying as I have been doing it many many times as well as fall training...NEVER have I ever let my partner fall to the ground. Touchstone gym members, however, are extremely bad at belaying. I'm sorry to say but your rigorous testings prove nothing; my belaying partner has complained that while belaying me, some other people fell on him. This is unacceptable. And I do think this is the gym's fault, since they've been teaching people how to belay. I've never seen this happen in the gym I go to in Austria, because the staff actually knows proper techniques and how to properly teach. So while I am an excellent belayer, because I don't use the same belaying technique, I have not been given a belay card (rather I get the 1-day passes) because the staff doesn't know what they're doing. It is extremely annoying. I will still go to the gym because it is the only one in the area but only because I'm desperate to climb.", "date": "1/26/2016"}
{"review_id": "d4-mTD6dWZ14xXDiRPjOIA", "user_id": "468RR2VMR3heLnluoy8TZQ", "user_name": "Henry H.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "Switched memberships from fitness 19 and I couldn't be happier. I've been a member for a year and a half now and my only regret is that I didn't know about this place sooner. Weight \"room\" isn't the most complete, but it gets the job done. Other than climbing you have access to Crossfit classes, spin, trx, yoga, and access to the other touchstone gyms. For ~70 bucks a month, it's a great deal. I used to only do weightlifting until my friend introduced me to bouldering. I learned quick that climbing took more than just brute strength and I was hooked from then on. Now I supplement weights with spin and climbing. I practically live here.", "date": "6/27/2013"}
{"review_id": "7oHFwJPO2IKFdE8Zazdy3g", "user_id": "pAwFxIu2_eQmDJaT3JB7Ew", "user_name": "Phuck U.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time here. Katie is the best ever :) thank you again for showing my sister and I how to rock climb. We shall be back", "date": "11/23/2016"}
{"review_id": "QrEOjDG8Ki6ReYS6cBXo4Q", "user_id": "X5DPPZxxFZjy_tYCFXTRAA", "user_name": "E. D.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 1, "funny": 1, "cool": 0, "text": "We had a terrible first time experience here! The young ass idiot that helped us here was not informative at all. Being first timers we were unprepared and didn't know what to expect. The employee did not explain how anything works and told us to just go on the website and read it for ourselves. It seemed as though new comers weren't welcome and it made our time there very uncomfortable. The only thing I enjoyed was that the gym section of the building to a degree. Although all the equipment there was covered in fucken hand chalk, that part wasn't busy so it was cool to be able to use the equipment without having to wait for someone to get off. But even still I think because of the lack of knowledge or even a sense of care from the employee this experience wasn't pleasant at all", "date": "6/6/2016"}
{"review_id": "8LXx-_qO1xrM_lStl1Q8xA", "user_id": "82dCHyU-ANOgdhxUgZsUeg", "user_name": "Marlon T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, great staff. The place is spacious and clean.If I still lived around here I would get a membership.Parking is not bad since this location is tucked away from the main road.It's $12 for a day pass on a weekday before 3:00PM.The only thing I wish they had was a platform to crawl onto at the top of a Bouldering climb.", "date": "12/29/2011"}
{"review_id": "ibSr1UCIY9rgXIAze0MVOA", "user_id": "N0hmoGwvz7LZyn_PZtZ90w", "user_name": "Julie J.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the BEST place to spend a morning or an afternoon. The staff (Dennis is our fav!!) are super welcoming and supportive. This place is great for the whole family, first dates, or a fun way to celebrate your 80th birthday (discounts for the seniors!)Thanks, again, Dennis!  We had a blast", "date": "8/10/2014"}
{"review_id": "EEhQPzAv06WQnIrSQaxKXA", "user_id": "yzxkPDe1YcwwNLFjyl1Dmw", "user_name": "Mark S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great spot for indoor climbing/bouldering and the staff is friendly!  I have been going to Diablo since it was Touchstone.They offer a good variety of classes: yoga, trx, boxing, and cycling.  I am not into Crossfit but the have a substantial outdoor area devoted to it!The locker rooms offer steam and sauna.", "date": "2/7/2014"}
{"review_id": "xJeCOVl3ET54pE4CklQKoA", "user_id": "DJP074yoTYTLE0MT_T2bSw", "user_name": "Allyson R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My cousin had her 30th birthday here and we had a great time! My favorite thing about this place is that it was kid-friendly and the staff was cool. I want to try bouldering next!", "date": "8/23/2015"}
{"review_id": "jpghczTarHyplAZbpiV2-A", "user_id": "mQvEi0wy07pcDg-_kpSt0g", "user_name": "Darrell D.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This is probably my favorite gym out of all the touchstones: it has a pool , has a lot of weight equipments, there is space compared to others which leads to decreased wait times during busy hours for your routes. Family friendly crowds that go there and it's just chill no frills. Plus the owner is Hans Florine.....you should look him up. My favorite thing about this gym is that they have indoor adventure races periodically which me and my gf absolutely enjoy. Its just a good all around laid back gym. See ya around.", "date": "4/15/2013"}
{"review_id": "1DeLFxfMwITWhIHXKWdXWg", "user_id": "5ABkfRy1Mhltcaa44UlsuQ", "user_name": "Theodore P.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is the whole package. Good members, great staff, and impeccable climbing. In addition, their sauna and seam rooms are luxurious and they have showers. The staff is really helpful and have helped challenge me.All in all, a very good gym to have fun and climb hard", "date": "8/30/2015"}
{"review_id": "-rFLo5sywNoVEZ2BR9guXA", "user_id": "iAevEfcmtCr2cpd6IRqnTA", "user_name": "Holly C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Good climbing gym.  The routes tend to be set fairly easy here compared to other Touchstone gyms.  Whatever you climb in this gym, knock it down two grades and that is probably what you would climb outside.All the routes and boulder problems set by Dude are fabulous.  Look out for his problems and routes - they are brilliant.  Also, the bouldering area has a top out portion that is actually pretty tough and replicates a pretty hard mantle move outside.  Great place to practice if you have trouble with mantle top outs.They provide towel service and internet like the other Touchstone locations.  They have a lap pool now, which is a nice feature that the other Touchstones don't have.  The equipment in the gym is pretty old so I wouldn't recommend working out here.  Plus sucking up chalk dust from the nearby climbing area is probably not the best idea.", "date": "12/30/2010"}
{"review_id": "8NLPNTTX4xuYYM9qh9rh1A", "user_id": "vot9t3MXp92Mvi_BrttPdQ", "user_name": "Justin M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 2, "funny": 2, "cool": 0, "text": "Just wanted to check the place out with my sister & girlfriend. The atmosphere walking in seemed chill however the lady in the front was rude and most definitely looked as if we were out of place. Did not receive any help ended up walking out. TOO MANY WHITE PEOPLE!", "date": "8/3/2014"}
{"review_id": "giXySZiv3Qpxv4mltC4ISA", "user_id": "9Ovg0KhySEtuUnCL31AiOQ", "user_name": "Jason W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I went climbing here today with my brother for some bouldering and it was awesome. Really impressed with this gym. Great bouldering area, weights and treadmills, top-roped climbs, and they even have a sauna in the locker room. I was like \"what!?!?\"  Really cool place you'll totally enjoy it. Just $15 to climb before 3pm and only $20 I think for an entire day pass. Worth your cash!", "date": "4/17/2015"}
{"review_id": "HRZaBTgsrVOqgb15XluKvw", "user_id": "2sK7fPYDnxECAXF7JC5qdA", "user_name": "Sean O.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 5, "funny": 11, "cool": 6, "text": "Did I really read another review about Christians not liking naked people in gym lockerroms?  Well you know what?  I don't like christians that think the world revolves around them.  What the hell does that have to do with anything?!Some people's children.  Anyways.  DRG is a great little gym.  I've tried the intro to climbing class in the past and I was intrigued enough to check this place out again once I was due for a new gym membership.  Glad I did, because 1 month in, I'm very pleased.I've been a member at other gyms where meat-heads follow you around asking if you \"need a spot\" everywhere from the bench press to the water fountain.  Those same gyms usually have ladies who look to have spent a good hour putting their makeup on just so they can go half-ass it on the treadmill for 20 minutes.  You all know they types.  You won't find any of that at DRG.  Sure its predominantly for rock climbing, but their weight room is surprisingly pretty comprehensive.  I'm old school, so all I really need are the dumb bells, bar bells, and kettles, but they also have a good assortment of well-maintained machines.  Plenty of treadmills and bikes, too.  Plus, I've never really had to wait for weights.  Pool seems adequate for me - I imagine Michael Phelps might have some complaints, but it's Diablo ROCK Gym, not Diablo HUGE AWESOME POOL THAT EVERYONE WILL LIKE Gym.  So, to me, DRG isn't professing to be anything they are not.  In a nutshell, its a simple gym, with good people, great assortment of activities/equipment for individuals of any fitness level at decent price.  Seems like a cool little community of people who appreciate being fit and doing so in unorthodox ways.  I'll definitely keep going.", "date": "3/2/2012"}
{"review_id": "Ghuo8zLfMgq2JGs7vNyX3A", "user_id": "SxfYHAjK_gU69WP3xEhuUQ", "user_name": "Nicole R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 4, "funny": 7, "cool": 3, "text": "Rupaul said, \"You better work!\" and she was right.I was looking for a place where I felt weak. Where everywhere I looked, I was like, \"Damn, I thought I was in shape.\" (This is the place) Just yesterday I watched a woman with one foot in a wrap, climb a wall. No joke, I had a lady crush on her for like 3.2 seconds. The week before I watched a man climb one handed. Next time, you are listening to Kanye West's \"Work it out\" and you think you are really working it out, Go to Diablo Rock Gym! At this gym, people are REALLY working it out! Like for real, for real!", "date": "2/20/2012"}
{"review_id": "-Hi54HSkIlS2MMAqjoYCcQ", "user_id": "apd-cUxcnC5lA0DRIowDqw", "user_name": "Wade M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "While I'm not a rock climber, I like this gym because it has the weights and cardio AND swimming pool. The staff and regulars are very chill, and I've never seen or heard weightroom drama, which is more than I can say for the other gyms I've been to. At those other places, someone's always grunting for attention or hogging machines. At DRG, there's none of that.Bonus that your membership gets you into all the gyms in their system, which is a really good deal.", "date": "4/29/2013"}
{"review_id": "qweswBGsocfZkZfcWenIYw", "user_id": "Jk3-Z6Kjb0wUUnXxOI2iNw", "user_name": "Charlene K.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Lots of different types of climbs and various routes. Lots of amenities. A gym. Gift shop with snacks for purchase.Understaffed! People don't seem to be getting enough help and are waiting around a lot. Slow service. Too many unsupervised small children. Parents, this is not a playground.", "date": "2/20/2013"}
{"review_id": "8D1SykzTRXQhvwTXJOUkhg", "user_id": "S2xFYP8M7AxzxLacDIMgZg", "user_name": "Ryan L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Just signed up and honestly I'm addicted. I went to the Berkeley Ironworks gym (another Touchstone Climbing Gym) and enjoyed it very much; however, I found it to be somewhat crowded. I was told to check out Diablo Rock Gym because it is usually less crowded. Ever since I walked in, I haven't been to any other of the gyms. Staff is friendly, pretty empty in the weight room and bouldering wall. Complete with a sauna, steam room, showers, pool, bouldering, top roping and classes. I'd also recommend checking out the yoga! Haven't had any issues with finding parking either.I'd definitely recommend this rock climbing gym.", "date": "3/17/2012"}
{"review_id": "WcK0at50UNZo6yueb6jtMA", "user_id": "NlaVc01wDWrKPZ8aSv1c8A", "user_name": "J G.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Yea I liked it here.  Some friends said it was smaller, and thats true but it was less crowded and parking is easy here compared to the other touchstone locations.  So I like this one too.", "date": "12/31/2014"}
{"review_id": "5soOy3fxYaL1qAhPRTt8ow", "user_id": "8RTQer1aq-UilDW7Pec18w", "user_name": "Amber B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "This is my local climbing gym, I have climbed at 5/9 of the Touchstone gyms, and while this isn't my #1 favorite (the climbs aren't as tall as they are at other locations due to the lower ceiling) it is definitely a great place for daily climbing and exercising. There is also a pool that members can use if that's your thing. The staff is great, super friendly and helpful. If you're having trouble with a climb you can ask any of the staff members for help and they'll critique your method and/or give you advice on getting past a difficult part. Love these guys!", "date": "7/31/2014"}
{"review_id": "WmSGZo-kb0dFEC-qRsWk0A", "user_id": "GzldsP2mzxtdpLVRWIVjhw", "user_name": "Chris P.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "After moving to Concord, I was more or less forced to go to this gym as I love climbing and have been doing so for 10+ years.  However, I have been extremely impressed by Diablo Rock Gym and the Touchstone family of gyms, and I would choose to work out here regardless of my love for climbing!  When you are a member at 1, you are a member of all the Touchstone gyms.  The variety of these gyms is unsurpassed; you have the option to go to Yoga, CrossFit, TRX, lift weights, swim, cardio machines, boulder, sport climb, spinning, and many many more!  If you live in the East Bay, you can easily go to Iron Works or Great Western Power Company to mix up your climbing, or if just want a quick change of scenery.", "date": "3/24/2013"}
{"review_id": "yDgMaRJJ1dO3oAncaAZ50A", "user_id": "XEj1gAe8wNJccfDyM0aOXw", "user_name": "Aber M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very intimidated walking in at first but was greeted by friendly staff. Came in for an intro course taught by Josh. Learned how to use the equipment properly then started climbing right away. WOW is all I have to say. I will definitely be back for more! I have so much respect for climbers. They make it look a lot easier than what it really is. I plan on trying out the Crossfit class and gym in the future also. Give this place a try!!", "date": "10/26/2014"}
{"review_id": "r5V0lMtHyUI2swL6SElNKQ", "user_id": "6hJfoe_Z0V48i-3SvQC3yQ", "user_name": "John R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. This is probably the friendliest gym in the Bay Area. I have met lots of friends here and have been climbing here since it opened, around 10 years ago. The staff is really friendly and professional and Hans Florine does an amazing job at the helm. This gym also has my favorite feature of any gym I've been to, called The Prow. It is a super-steep lead wall that has both moderate and hard climbs on it. This is a great gym to learn how to climb at, or to simply train at for your next big outing.", "date": "1/7/2013"}
{"review_id": "r7VnGf-H2MS0neVmgDH-zA", "user_id": "KKIgeZ6yplpgThj1vdrMbA", "user_name": "Tim M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great gym! The climbing is fun and the routes are updated regularly. The staff is very nice and helpful. They'll step in if something unsafe is happening but they aren't overbearing.", "date": "3/4/2015"}
{"review_id": "vwZkK1TlP3-7RKbXpOh_1g", "user_id": "OrRM4uCk-xNyDCa4tjYDfA", "user_name": "Jasmine F.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 2, "funny": 1, "cool": 0, "text": "the people who work behind the counter are the least attentive and worst customer service ever.  I will probably not bring my family back here again.  the facilities are great, though.", "date": "11/27/2011"}
{"review_id": "0TFFguu1qLC_CeTaBVM0Kg", "user_id": "0GHsxjCk-Ynzx4Ihj8tjPQ", "user_name": "Debbie C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love all the Touchstone Gyms. Diablo Rock is no exception and is pretty great in terms of variety of features and the levels of climbing. The bouldering area is a bit tight and can get crowded but the routes are still solid.", "date": "4/25/2012"}
{"review_id": "KjNR12jT3GScZtQr4iQgSQ", "user_id": "fx_oas0OGcUWsAF_jOCx0Q", "user_name": "Paul A.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "This place is awesome. Truly Awesome. The Prow is vicious Motherfather, waiting to eat you up and split you out. Bring your Dragons and your best footwork, because you are going to need'em. This gym might have the shortest walls of any of the Touchstone Gyms and bcause of that the routes, here are significantly tougher. Oh and Hans Florine manages this gym. Awesome.Fuck Pain. One More Lap- The Wide Boyz", "date": "3/21/2012"}
{"review_id": "E53VktK7piZZRYCOkzy6kQ", "user_id": "VEs0kwfD8-QZM0jVgmz9yg", "user_name": "Stacey B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "This place is so much better than Berkeley Ironworks!!  They still have a bunch of exercise equipment facing the climbing wall to encourage voyeurism and make climbers self-conscious, BUT, it's not done as badly as at ironworks, AND, the wall curves around such that only a handful of routes and in direct view.  The curvy wall is one of the best parts of this place, because you feel less exposed.  The staff are much nicer than Ironworks, and more helpful.  The atmosphere is friendlier and lower-key.  The very coolest thing is the strap they fasten between two walls, like a moving tiny balance beam, and you can play on it trying to balance and walk and stuff.  They also have a locker room with showers and a sauna.  I live in Oakland, and I'd much rather drive all the way out to Concord to climb than go just down the road to ironworks, even though they have the same owners.  Sorry my review is completely in comparison to ironworks.", "date": "2/20/2007"}
{"review_id": "4GjXk3wj1djCH_ZX1etbHw", "user_id": "oti8h9QtIpgtPEqyCPkXTA", "user_name": "Steven P.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is excellent for both indoor rock climbing and your typical gym session.  The atmosphere is great, everyone is friendly and really makes it feel like a place you can call home.  Currently I am not a gym member but visit every now and then to climb or exercise with friends.  If I were to sign up for a gym membership this would be it.", "date": "7/13/2014"}
{"review_id": "515rqaDjmOwlOEIeR9TPlQ", "user_id": "F6C7xhZi4DbvDZrg3Ifskg", "user_name": "Rula T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I really like Diablo Rock Gym. My daughters really like rock climbing and we found it a great place to go in the Concord-Walnut Creek-Pleasant Hill Area. Very friendly staff, helpful and supportive to any skill level.My children don't feel discouraged by strict rules and feel really at home.  Last March my daughter had her birthday party there and the staff were very accommodating even when our party went a bit past our time slot. I strongly recommend Diablo Rock for a birthday party or even just spending an hour with your child for a one on one quality time.Affordable prices and not too crowded.", "date": "8/13/2012"}
{"review_id": "YRFyd2tGPMmFTaYWw0qvvA", "user_id": "bwl5VL_F3YSB4PNySsgflw", "user_name": "Allen B.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 2, "funny": 1, "cool": 0, "text": "So Disappointing.This review is based on the overall experience. Our 11 year old son, after a previous visit to this gym, requested his birthday party be kept at this place. We called the Gym in advance to reserve, and were told that the reservation can only be done online and assured us it is easy, safe and secured (questionable). Setup the reservation online paying the deposit, and when we called the day before the event to ask questions regarding bringing in the pizza and cake, we were told \"There is NO reservation!\", and that there is nothing that can be done at this time. We had invited 16 kids to come from Lafayette and had no place to go. After calling back, the reservation was found, however made at Fresno Gym. We never inquired about any other locations and made the reservation on their site without getting any options to choose a different location. Now that the reservation was found, we are told that we still cannot come because they do not have staff. We offered to do ropes and we were told to come late that day for training. Once the staff part was resolved, we were told that they do not have a room to do the party in. After insisting for awhile, they offered their yoga classroom. Once we saw it we understood their hesitation... The room was smelling terrible and felt dirty and the chairs they provided looked like they were retrieved from a garbage bin as well as not enough of them. Dirty, ugly looking, or even smaller size. We had to ask for someone to do something about that smell so that we can bring the kids and have them fed. The check in process was slow, unpleasant and disorganized. We were embarrassed in front of the parents dropping of their children but for the staff it seemed normal. Most kids in our party within the hour and a half provided, they did the claim once or twice due to the overcrowding and long wait times. We were not at ease with the instructors that told 8-10 year old kids to claim the big boulders without the ropes. Three instructors were supposed to be assigned to our group, however we only saw one active and assumed that two other ones were talking to each other by the smaller boulders intended for the younger kids. Most staff was unpleasant to talk to or was talking to the kids in a \"somewhat rude\" and inpatient manner without explaining what was that they did wrong.The amount of stress that this particular part of our son's birthday celebration put on us was not worth the little fun the Gym provides. We believe it may be a great place to work out or claim but by no means they are ready or willing to host and welcome a group of kids coming all at once.", "date": "1/25/2015"}
{"review_id": "P7Wz-mCEmYzzagiH2aBlEQ", "user_id": "6xl9EVLg1MTwq4gw21e4Nw", "user_name": "Grace L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 11, "funny": 6, "cool": 8, "text": "This is our closest indoor rock climbing (IRC) gym to Antioch. I perused the website before I went, and somehow I found it comforting to know that the place is associated with Mission Cliffs in SF, the mecca of IRC in the bay. It was Sunday morning. Lovie and I decided to try it together, though I've been once before. As newbies, we opted for the intro course just so lovie can learn how to tie the knots and belay me so neither of us would fall 50 feet down. The class was longer than usual, but necessary. The place itself is super clean....from the layout of the area down to their restrooms. It wasn't too crowded in the morning, but as the day wore on, people started to fill in. They have an awesome bouldering area as well where you can pull up a mat and start climbing like Spiderman without a rope. It is significantly smaller than Mission Cliffs, but I guess the size is sufficient for the area they're serving.I had a really good experience here. If ever I get a hankering to rock climb again in the future, I'll be heading to this place.Rock solid!", "date": "7/7/2010"}
{"review_id": "S9wYuZfr4DMh2K7D1jRb5A", "user_id": "GLkS4XPJleFct8QbK_CN_g", "user_name": "Jay C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "love this place! people are chill and wall routes are enough challenge for even the advanced climber!", "date": "8/8/2015"}
{"review_id": "E8oDw3OVIWws2InyMavASw", "user_id": "MjBYg_yA1uX9RooTHW8aKg", "user_name": "A J.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I just started going here and I think it's such a great gym. My brother and I went here for the first time a few weeks ago and they were so helpful with getting us started. We took the beginner's class to learn the ropes (no pun intended). We had Shannon teach us how to belay, safety rules, and how to get started. She was so nice! They have something for beginners all the way up to advanced. When I go by myself the crowd is always friendly and social and I've met some great people. They have weights, cardio equipment and fitness classes all included with the membership and the instructors really show dedication to the members. I love love love that they have a sauna and steam room! And an indoor pool, what's not to like?I'd say all in all this is a great gym with a warm and friendly atmosphere.Tips: I usually go at night after classes, which seems to get busy especially near the weekend. I haven't been on a weekend but I'm sure it gets busy with lots of kids. If you don't like crowds I'd recommend going earlier in the day and on weekdays- which is cheaper as well if you get a day pass!", "date": "4/8/2011"}
{"review_id": "TZv2k_8-ePcdl_zt_zfQoA", "user_id": "sihIyukUb7TLMBG57OFMBw", "user_name": "Angelica G.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Went with my cousin and took their intro class. It was my second time rock climbing, so i was familiar with the terms and rules. The place was easy to find, tucked away in the corner, but it was small. I was expecting a lot more wall coverage, but there was a gym area which i wasn't expecting. I wanted more wall space- because i'm a beginner there was only a small section for kids+. Of course my cousin and I stayed only in the easy section, but I wish they had more variety.I gave this place 4 starts because it was easy to find, and the staff and other climbers were very friendly. I really did enjoy myself. Climbed to the top twice, yay! So proud!! Come try it if you haven't. It's a little scary at first, but so fun!", "date": "3/12/2011"}
{"review_id": "HnIcq6tvjPEvB4-VNb7cVQ", "user_id": "ua68DyFyju22juCFvM1BrQ", "user_name": "Nancy P.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "We recently checked out Diablo Rock Gym for our first climbing experience with 2 children, ages 5 and 8.  Right from the outset, the (young) guy seemed disinterested and inattentive.  He barely talked to or looked at my kids while putting on their harnesses and then brought us over to the first easy wall.  He didn't give ANY instructions or reassurances or safety tips to either us as parents or my kids even though I'd made it clear it was my kids very first time ever anywhere climbing - not a single tip or suggestion.  He also didn't have any suggestions other than an occasional \"good job buddy\" or \"you're almost there\" when my daughter got stuck halfway up.  Despite the large signs on the wall \"Belayers must be attentive to their climbers at all times\", he spent about 20% of the time actually looking at my children and the rest of the time chit chatting with co-workers, looking at a cell phone, etc.  The reason I didn't give it a 1 star is because and I didn't feel it was actually that unsafe.  Although he rarely looked at them to see where there were on the wall, he didn't let the line go slack and seemed to know what he was doing when it came to fastening knots, putting on the harness, etc.  And, my kids did have a great time.  It was more an issue of clear lack of professionalism and/or inexperience at working with young children and their families.  Definitely NOT a place to foster a lifelong love of climbing and/or a sense of the importance of safety in a sport like climbing.  I would not recommend it as a place to bring young children for their first climbing experience.", "date": "8/5/2014"}
{"review_id": "rkEuR4ezzYjKLPplEeXyXQ", "user_id": "j763s4nxDBg_uNLk3N2WtA", "user_name": "Bill W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Concord is extremely lucky to have a good indoor climbing gym.  This is a great place to work out, and the staff is friendly enough that even first timers should not feel intimidated.The lead routes are good, and there is plenty of top roping.  The bouldering is a bit smaller than some of the other gyms, but it still holds enough routes to keep me busy.Touchstone grades their routes a bit softer than some other gyms, so if you haven't climbed at Touchstone you may want to try routes a few notches up from what you normally climb.Of the Touchstone gyms, I would say this is #3 on my list.  Of course, of the climbing gyms in the area, this is #1.  One BIG bonus though, is that you have free access to a lap pool at the place next door.", "date": "9/13/2010"}
{"review_id": "UBBgnaw4eEAAtaWT5ZhDUg", "user_id": "kE3NCbetyG5AnsgBGLCp9w", "user_name": "John A.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my two kids (8,11) there today for a birthday party.  It was my first time ever climbing.  The staff (Lilly) was very helpful and friendly for a beginner.  Both the kids and I had a lot of fun.  Recommended if you are a beginner because it's very easy to get going and the staff is very helpful.", "date": "9/7/2015"}
{"review_id": "OO-1O7--K2x0Ibi7UVg4nA", "user_id": "Rqwc1f03RU3wBT55bnrXcA", "user_name": "Paul T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "DRG is a great place to climb for every level of climber. As far as indoor climbing gyms go, this is one of the best I've been to.If you go with zero knowledge on how to belay or tie in, don't fret - you can get a lesson from one of the DRG Staff members for a charge. Bonus - they'll stay with you and watch you work until they're comfortable with your skill level.For the intermediate to advanced climber, the multi-pitched routes and lead routes are awesome, insane, and physically demanding. Your forearms will hate you for it. These routes are set by a professional team of route setters whose only job is to - you guessed it - set routes.It's been described as \"thinky\" and \"interesting\" by climbing enthusiasts the world around, so you really can't go wrong with this joint. For the beginner, it's all good for you, too. There's an entire wall that is just jam-packed with beginner routes, but these tend to get a bit crowded when there are large groups of people present.DRG is also a great place to bring kids and have a party, as they provide services where DRG Staff members will belay for all of your little rugrats as they scurry up the walls like little monkeys.Finally, if you're a loner, the bouldering area is just rife with crazy routes that'll make you hate yourself in the morning.", "date": "9/9/2010"}
{"review_id": "C0QR07cbJI9_Vm8FpPZBgg", "user_id": "1at_NifUXCuirDcGhw8qhg", "user_name": "Natalie N.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My 8 years old son had a birthday party. It was easy to reserve a day and time over the phone.  The blurbs came in email, including the participant agreement that can be done online, so I forwarded it to others to invite their kids.  On the day of the birthday party, my birthday child wanted to climb for 2 hours.... They accommodated him without any fuss.  They let us use the party room after the 2 contracted hours, because there was no other party happening right after us.  Super.  They also kept our drinks and some food in their fridge.  On top of that, they let us add more kids.  How flexible was that!All the staff members were kind, caring and professional.  Definitely the best birthday party ever for kids (for fun) and adults (for ease and flexibility).  I recommend this place to parents of boys and girls for the venue of birthday parties.", "date": "8/22/2012"}
{"review_id": "xx24PabLyKwDhCCc9EZaRQ", "user_id": "WsaSB3Mn4AkxEKoLmrGZyw", "user_name": "Travis N.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "My wife and I are aggressively seeking new experiences and discovered the Diablo Rock Gym. We both absolutely loved it. Being newbies, we took the intro class. (The instructor was great and made the experience fun.) After the class we were left to explore and spent a couple of hours trying different levels of \"paths to the top.\" We'll definitely be back and plan to make rock climbing (maybe even outdoor) a regular \"thing we do\" to replace long-passive nights of crappy TV.", "date": "1/28/2013"}
{"review_id": "m2TMUx7UjbcEdR76nojyFQ", "user_id": "_SVfoi3YUFNHswsfZUO9mg", "user_name": "Mikey U.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 6, "funny": 4, "cool": 4, "text": "The first two days I was in my walking boot (after being in a cast and crutches for 6 weeks), I was stubbornly determined to get some climbs in, even if one-legged.  The first night, with a bevy of supportive friends around, I attempted a bunch at PG Sunnyvale to get the rust out. The next night, Esco and Heather, who'd missed the night before, took me to Diablo Rock - their \"home\" gym - so I was very excited.This is a really nice Touchstone gym, probably just a little smaller in size than Sacramento Pipeworks, and not as tall from what I can tell, but the same close and cozy atmosphere and style. The route setting here makes up for a lack in altitude with attitude; climbs are sequenced laterally as much as vertically, exercising traversal movement that isn't often tested in more vertical routes.The same care and attention to safety can be found here; I tested for my belay and THANKFULLY finally earned my permanent belay card!So we climbed.  I finished a 35-foot 5.8, \"Buenos Aires\", and ascended most of a 5.9, \"Porto Novo\"; as with its other gyms, Touchstone setters name its routes, sometimes thematically - a series of car names, engineering terms, tropical getaways, etc.. While being a smaller gym, the place was relatively empty for 8pm on a Wednesday evening, giving us our pick and choose of all the available routes.  And the quiet is peaceful.  So whether it was me lurching about one-legged, Esco fluidly flowing upward in focus'd silence, or Heather weightlessly bounding skyward while talking to us below about her day, its a comfortable environment.The bouldering area is particularly compact, but with enough features, overhangs, pitches that it looks engaging.  And I've always found Touchstone boulder problems intense, especially for their brevity (they looks shorter than the bouldering walls at PG).Definitely coming back here!  Especially when it means being/visiting nearby familia and loved ones!_______________________________Climbers are very supportive and endearing towards their injured fellows. When I reached the top of my first route, air-boot'd leg dangling aside, a nearby couple said \"Duuude, you're crazy, but that's awesome!\"", "date": "12/7/2009"}
{"review_id": "UVRPhauGupR9rFMd7HrJJQ", "user_id": "l1GCFh_OioLai8RXU8cK_g", "user_name": "S T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 2, "useful": 1, "funny": 37, "cool": 0, "text": "Is there any gym here in SF area where people do not get naked in the locker rooms? Please people if you are reading this review, please I beg you cover yourself. That is very offensive in some cultures and to Christians especially. And the music, why can't gym people ever play something pure...classical for example. Don't they know that kids do better on tests when listening to Mozart and that cows give more milk when listening to Beethoven and that plants grow better when not exposed to rock music. Doesn't that tell you something? Why do you have to push your music choice on others? Playing nothing is better then what people keep playing at gyms around here. Most of us have iPods and can listen to what we want but the problem is we can't because you play your rock too loud. I am just asking you to consider others too.1-25-12 I am giving five stars to people who work here--really really nice.", "date": "11/1/2011"}
{"review_id": "-5xYhMdutiM7srIAZ-bEgQ", "user_id": "QZHjH4KFDbo_LaFfW-Z3XA", "user_name": "Susan M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to take the kids on a rainy day- $15 an hour for kid's belay and you can actually get a quick workout in while the kids climb and climb some more.  Definitely go during non-peak times, it is the different between 10 climbs vs. 3 for the kids.The exercise equipment is pretty basic, this is not a posh gym.  It's basic but it works.", "date": "4/18/2011"}
{"review_id": "3pIohfo9dZ5JCUuPM7QQaw", "user_id": "ijWQ0R9ra0KF1IGNbhkODQ", "user_name": "Kelly H.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I frequented this place when I was taking classes at Diablo Valley College. Diablo Rock Gym is owned by Touchstone, which also owns Berkeley Ironworks and Mission Cliffs in San Francisco. Touchstone is known for having a more difficult belay test and is generally more stringent than Planet Granite, which made it less customer friendly. If the staff were more friendly I would give this place a higher rating.There are a mix of children, teens and adults that frequent this place that make it a fun place to go and I really like the routes here. My climbing partner and I were always able to find new challenging routes! There are enough different level routes in different areas of the gym that kept me interested in coming back to climb!", "date": "11/5/2010"}
{"review_id": "HDamZiuYWNFU_elsscpo2g", "user_id": "SWUFwrSxth9QYTOMTA3xQQ", "user_name": "Pp R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome fun, lots of great top rope routes. Went to the competition there last week and had a great time, also there was free pizza and beer and a T-shirt for a $10 competition fee, not a bad deal. There's a good mount if bouldering and exercise machines too.", "date": "4/4/2015"}
{"review_id": "ztS8KxmeNdGTKvvfTRRhXA", "user_id": "fjtjcBJyMomt8iNulJZHPw", "user_name": "Alex L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This place is decent. It has enough climbing to get a quick workout in, but don't expect to find quality routes or boulder problems here. The lead area is full of short routes that are basically all focused on power (as opposed to balance, technique or thoughtful beta). The bouldering area is on the small side and has a few gems among many bad problems. The quality really falls off in the lower grades as the V0-V3 are completely unimaginative. Intermediate problems are set with a bit more care, but make no mistake, this is not a bouldering gym. The fitness area is extensive, but not very climbing specific. There's no campus board, and the only hangboard is gross/dirty and has to be manually hung over a bar to use it (sounds weird but it's actually quite stable). I'm also not sure who implemented the no-shirt policy at this place, but the shirtless bouldering bro stereotype is ubiquitous at this gym.", "date": "5/17/2013"}
{"review_id": "nF0CYggjuJkJiPIX9zueew", "user_id": "mkxCw6GsMZDu-44_aCQTHw", "user_name": "Vanessa W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "I love Touchstone Gyms.  I came here regularly after work because it was convenient and I wouldn't have to sit in traffic.  There are some fun walls and it's a smaller gym than their other gyms (BIW, MC) so they definitely aren't as high and there aren't as many climbs, but they change the walls often enough that even if you don't progress quickly to higher levels the climbs don't get boring.  It's generally not very crowded here on weekdays either which is also a great benefit from this place.The spinning classes offered are great, I've liked the instructors and they have a nice sound system so make the 50 minutes of pain at least rhythmic pain.  The room is tiny but well ventilated plus they provide towels.  Be sure to take water.The yoga classes are also very nice.  For the $60/month it's a good deal.  Their other equipment (treadmills and weights) are usually not all being used and are in good condition.  They also have a sauna!", "date": "5/11/2010"}
{"review_id": "Zg27epHS6ZFMHgcAs3NJ6A", "user_id": "hF22CpEdCxDaT6A0LVCmxA", "user_name": "Stanley F.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my home gym. I have been climbing here for 7 yr's. Why? The staff are friendly and safety is important here and I like that. I like that the routs change and that keeps it fresh. Most of the people that climb here are good people that jest wont to climb in a friendly place. They have good routs for all levels and the bouldering pit is small but there is a lot to climb. They also jest opened a indoor pool. So with the class there is a lot to do here.", "date": "1/26/2011"}
{"review_id": "br09berMjBme-Bl67S3smg", "user_id": "YFDQNnPD5_oPF5JVIf8U2A", "user_name": "Jen O.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here to get a change of scenery and was pleasantly surprised. The sapce is small for sure, but the climbing is pretty great. I usually climb at Ironworks so was super impressed by the routes the yhave set up. I usually come here a few days a week so I can climb with some buds.The staff was extremely friendly and knowledgable..It was almost empty which was great for me.  I've been climbing for about 6 months and absolutely love this gym. I am here about 2 days a week for a change of pace, and just love it.You guys rock!", "date": "3/13/2011"}
{"review_id": "_NmxAbgWd2Em3A_T80J4IA", "user_id": "R4GCub-Hf5j8Pz4SmI35Ow", "user_name": "Laura M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I really love this gym. It's so much more than a rock gym. They have lots of great classes, a full gym with plenty of weight and cardio machines, and they have a pool! My fiance and I joined together and received a discount which is great! The memberships gives us full access to all their classes and use of the gym, pool and of course the rock walls. I'm new to climbing, but it is so much fun. The walls can get a little crowded after school lets out so we go in the late morning and practically have the place to ourselves. I'm so glad we joined this gym.", "date": "3/20/2012"}
{"review_id": "fjl-t5DAxlyV8-7XnwHDNw", "user_id": "aOtyMG2DsYlT2z41Hfr2xQ", "user_name": "Heidi S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I went to this gym the day after Christmas, thinking it might be super crowded....but it actually wasn't.  Lots of routes and space inside.  Did a couple routes next to someone else, and I never felt like we were right on top of each other.  The first-time sign in process was easy and straight forward.  Facilities seemed really nice and clean.  Staff behind the counter was OK, not the most helpful, but not bad.  I would definitely go back to this place.  Seems like they offer a lot of services, both rock climbing and general fitness related...rare for a rock gym.", "date": "12/27/2011"}
{"review_id": "9tmgXySk5AoW1Wt00GxuCQ", "user_id": "XlNuBkMine9K1uietJVlRA", "user_name": "Sara C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 5, "funny": 1, "cool": 3, "text": "LOVE LOVE LOVE this place!!! Seriously. What a great gym. The rock climbing is obviously AMAZING and it's so much fun you work out for hours without even noticing you're \"working out.\" You realize once your hands and arms give out though ; ) The bouldering area is amazing and such a great option too if you either don't have your partner with you or if you just feel like über challenging yourself.As for the other equipment, it's excellent variety in that you can rock climb any day, or just work out on days you don't have a partner with you. People are super friendly too; my boyfriend has met some guys who are cool and swap tips and they belay each other when I'm not there with him to do it. Really, really cool environment. They offer fitness classes, which is obviously awesome, and you can use the pool as well (which technically belongs to the swim place next door). So much variety! Everyone on the staff is totally friendly and down to earth. The feeling you get from rock climbing is incomparable; you feel so accomplished and strong after you climb a wall you didn't think you could reach the top of, it's wonderful. And the soreness afterwards! You really know you worked your body well. Last but not least: there's lotion in the ladies bathroom. I know it sounds silly, but I'm a hand lotion addict. Especially after all that climbing and chalk and bouldering...it's so nice to get a nice pump of hand lotion complimentary :) considering this economy, places that offer such extras are A+ in my book! It's the little things in life ; )", "date": "5/5/2011"}
{"review_id": "MhKCPuKznRREWx6fdmp-Ig", "user_id": "U1Y3a1CTm4bolElJ7HRgLQ", "user_name": "Cynthia T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I recently moved and I miss DRG so much! This place is amazing. Well worth the membership pricing (you get unlimited climbing, unlimited group fitness classes, and unlimited Crossfit classes - can't beat that). It's kid and family friendly, you rarely have to wait for equipment in the weight area (because most people are climbing) and the staff is super friendly and helpful. New routes go up all the time so you'll never get bored and, of all the touchstone gyms, DRG has the best overall layout and variety of routes and pitches.", "date": "10/22/2014"}
{"review_id": "iGN58VVsaUe-F4P-RwOVTQ", "user_id": "ZlHYLvDicWmAPrv51TppNA", "user_name": "Rob C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "My first experience at Diablo Rock was with a bunch of 10 year old kids.  My daughter's good friend had a birthday party there.  I was amazed at the courage of all those whippersnappers scooting up the wall.  More amazing was the incredibly courteous, helpful and friendly staff.  They were very attentive to keeping the kids engaged and most importantly; safe.My daughter and I loved it so much, we (and her sister) went back a couple of weeks later.  I took a belay class (that's the person holding the \"security rope\"), while my kids had an hour long kids climbing session.  I am now certified to belay for my kids - we can show up, drop $10 bucks each and they can scurry up and down the walls like spiderman - all they want.  It is an awesome way to spend a day with the kids, and a great way to peel their butts off the computer or TV.It is also great for adults.  What a great way to spend some time getting fit, having fun and being able to talk to friends while you are climbing.  It is really cool that the vibe in Diablo Rock can support a bunch of kids, 20 yr olds, and an 40 year old fart like me scaling the same wall, and everyone is having a blast - there is no generational tension in the gym at all.  I can't imagine that happening at any other gym around here.Try it - you'll love it!!!!Rob", "date": "12/29/2009"}
{"review_id": "8fvETbZQMosUbW4ANlJtbw", "user_id": "XSE7XBAqcEuCpnWlC3dJ2Q", "user_name": "robert b.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you have never belayed before  and want a solid place to learn it, this is it!The staff here will ensure that they go over all the basics with you and stay with you until they feel you are solid in all basic safety.Go here and learn the right way, the only way!", "date": "6/8/2010"}
{"review_id": "oqOGvKUkLqjqzw19c58XUA", "user_id": "ZnBTVsQMCuHdp4qmwrZNeQ", "user_name": "J A.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "Yesterday was fun!Free admission. check.Free food. double check.There were also good routes and it wasn't super crowded, which is why I have been staying away from Mission Cliffs. It's a little intimidating as a newbie. So I did this one 5.8...It was hard, but Doug had me hanging up there like a marionette until I finished it. I'm glad he did.", "date": "10/28/2007"}
{"review_id": "liamfPvCFMS1-tpjT22tQA", "user_id": "L0SfJhRPHtCNr_CgM6DCHA", "user_name": "John V.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Sunday Afternoon with the kids and I don't want them watching TV or playing video games...So Rock Climbing it is...They have a great deal, at least on Sundays, between 11-3 where the kids get to climb a different type of wall with instructor for an hour, all for $15 bucks! The instructors are great and the kids really dug it...You might need to have the kids wait a bit as kids will rotate out after there hour and it is drop in.Decent staff and a great hobby for the family.", "date": "2/1/2010"}
{"review_id": "Yp2knjuBXxfaE91Rmg5v6Q", "user_id": "2ewsQtQiRqICUdA3mGKE2w", "user_name": "Shannon M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Touchstone is by far my favourite climbing gym, probably because when I got started climbing there just over 3 years ago, I got to know everyone in the place really well.It's more family oriented than Berkeley's Ironworks and Mission Cliffs in the city, and I do enjoy having those climber kids around.  I don't know, it's just less pretentious or something.  I guess I like kids!My favourite part of the gym?  The SLACKLINE.  Oh, man, it's kind of unCANNY how much I miss it.  There's a certain balance 'knack' you have to get when you first start out on it, and one day I just spent hours on it, perfecting my 'knack,' attempting to walk forward and backward all the way across.  Gah, I love it.  I wish I could afford a gym membership again...and the CLIMBING!  I LOVE CLIMBING!  Except, it's been over a year since the last time I climbed.  I moved the city and started taking more classes (plus working), thus, I cannot afford a membership anymore.  But when I was really into it, in the days of Touchstone Concord, I went to the gym religiously.  Before work.  After work.  After hours?  I could not be stopped. The walls are high, and some of the routes are challenging, I think I got up to the the high 5.11's.  Maybe 5.11abc or d.  I can't remember.  Maybe even some 5.12's on a good day.  Plus, after getting to know everyone, I felt like I had my own coaches, everyone supported everyone else, always cheering me on.Not to mention the classes.  I used to take an ABs class a few times a week.  And even yoga sometimes!   Plus, there's all kinds of regular gym equipment and weights and stuff.Oh, I miss Touchstone and I miss climbing.  *sigh*  I still have all my gear, so if you need a climbing partner and you have a buddy pass... hit me up!!", "date": "9/17/2007"}
{"review_id": "7TlOHa5fImCv3TBMfdKVNw", "user_id": "oP-Ejs_x6e1OfDmQ4n6Nmg", "user_name": "Keri L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Joined this gym in February... and I LOVE it! I don't climb, yet. I took their intro and basic classes, had a lot of fun with it and hope to explore climbing more soon. However, I do know that they change up the climbing routes frequently, because I have seen them doing so on several occasions.I joined this gym because it does not have the 'meat market' mentality of other gyms in the area. I was impressed by the distinct lack of 'gym bunnies' and 'muscle heads' who seem to do little more than take up space and waste everybody's time. It has a great selection of cardio equipment, exercise machines and free weights. The yoga classes are fantastic! I also try to take advantage of the steam room every chance I get. Definitely worth the money, and what was the final selling point was the fact that they don't lock you in to a 'contract' like so many other places do.", "date": "3/16/2009"}
{"review_id": "2xyEO0-kT02efASTY7mXcA", "user_id": "VuiwyPdrPgA2_P-rXH12xw", "user_name": "Terry S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "In spite of its relationship to Berkeley Ironworks, I find this gym fun.  The primary difference is in the staff (who are much nicer) and the fact that more of the patrons seem to climb.  I also like their routes -- the walls are varied in angle and features, and the routes sometimes take you up pillars and across rooves and then up again to the ceiling; or along slabby sections to a round arete and up.  The lead routes are way overhung, though.  I took one look and opted out of the lead test.", "date": "2/5/2007"}
{"review_id": "M4O2oL0ndvK33iTeBfGFsQ", "user_id": "cfdglEQwDNigOycYf2_GhQ", "user_name": "Mimi T.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is huge compared to Berkeley Ironworks and Great Western Power Company. There are lots and lots of routes to choose from. I definetly recommend this place if you live nearby.Unfortunately for me, this gym is out in Concord. I went once for a party, but can't see myself trekking out to Concord on BART to go here normally. It's probably a good thing. I've heard this gym gets overrun with children on the weekends since it is in the suburbs.", "date": "5/14/2010"}
{"review_id": "3QnrJqp-fkfqFipNc8wUWQ", "user_id": "35AuwJ6ByVyyVt5ooMUWhw", "user_name": "Consumer S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I am a fan of the yoga program here, and appreciate that the gym isn't a warehouse full of machines machines machines and obnoxious gym rats/bunnies. I often see kids with their families trying out the equipment, and there are always people with smiles on their faces so you know they're having a good time. The locker room is clean and quiet, soap and such provided in the showers so you don't have to carry messy bottles with you. Nice!I haven't climbed a wall yet (I've only been for the yoga so far and still working on healing a shoulder injury), but I'm looking forward to it!", "date": "12/16/2009"}
{"review_id": "PU1RjjqLbHoSjeKMJLK_LQ", "user_id": "RNKPqFL_6YVinH9PvWX3MQ", "user_name": "Ben M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Best gym in the area, hands down. A bit pricey, but if you take advantage of all that they have to offer, (and I am amazed on how much has been added in the last year) you will feel like its $ well spent. The staff is super friendly, very helpful, and not as judgemental as other climbing gyms I have been to. The people that go there are super-cool, and you will have no d-baggy Affliction-roided out types here. Come during a comp and enjoy good music, beer, pizza, and strangers cheering each other on in every level. Sit under the \"Prow\" and be amazed by kids and adults making climbing look easy. The ONLY gym I would support in the area!", "date": "6/29/2011"}
{"review_id": "z2xzKIYRls70DTwHaUPBzg", "user_id": "fphGS3iCLn_BaYjqWSzVuQ", "user_name": "Gerry G.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I consider myself lucky to have stumbled upon Diablo Rock Gym and to have such an amazing climbing facility relatively nearby. I have visited DRG a handful of times now and have not had a single bad experience. Each visit turns out to be a great workout and overall fun experience. After every visit I feel physically challenged, mentally sharp and have an overall sense of fulfillment. I'll be bringing friends and family members here to share my newfound passion and excitement for climbing with them in a good environment. Sidenote: Bouldering is WAY harder then it looks!", "date": "9/8/2011"}
{"review_id": "Y4BHl0Z9BuIaaNDOvhgn4Q", "user_id": "XnRs0pcBX5mhYGN9doC1Lw", "user_name": "Becky G.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Yes, yet another awesome Touchstone gym.  Great staff.  Perfect bouldering area with lots of problems.  Love how the bouldering surface is distinct from the other Touchstone gyms.  Great top rope routes - lots of slabs/balance routes and overhangs.  BIW and GWPC are my home base.  I'll definitely visit DRG when I can.  Can't wait to check out the new crack.  Also love the cardio area for interval training.  Yay climbing and Touchstone!", "date": "2/11/2012"}
{"review_id": "H0PQ7meYnJqhBHIINDU09w", "user_id": "ddpCr6rcZFRTThdFSKqN5A", "user_name": "Brianne S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I am in the area for a while visiting family and decided to hit up a local rock gym, this one was the closest to my family home. I will definitely be driving a little further to visit a better gym next time, as my experience here was like none other I've had at any rock gym. The woman with the accent working the front desk was horribly rude. She told us we needed to pass a belay test to climb so we had to wait about 15 minutes as she tested someone else then went back to sitting at the front desk and didn't even acknowledge us at the testing ropes. No \"be right with you\" or anything. So she finally comes to test us and was Shockley rude and condescending and was treating us as if we are completely dumb. Which is funny because we are definitely seasoned climbers so it's pretty frustrating to have to test for this anyways. So after \"testing\" (talking down to us) one of us on belay she mumbles something, leaves and goes back to talking on the phone. We stood for another five minutes before I was just ready to hop on a rope and forget about this stupid test when finally another one of the staff just gave us our test passed cards and agreed that his coworker was \"kind of dumb\" so definitely warning all my climb friends in the Bay Area to not waste their time or money with this one.", "date": "4/26/2015"}
{"review_id": "WHmjF8x-pNbb8t0QYmVyXQ", "user_id": "IXr4wLkMl6ER0VY34kwqRg", "user_name": "Jenni D.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My new favorite past time is climbing a wall... I was so inspired by my experience that I purchased gear and a membership to Diablo Rock Gym after my very first climbing experience two weeks ago!  I am also embarrased enough to say that I even blogged about the experience.  But enough about me...There are really great routes to choose from here, and plenty of different levels for the novice and professional climbers to choose from.  The staff is very friendly, and tried to give me the best discount they could for being a student, etc.  You get a $50 discount off the Initiation Fee if you have a valid Student ID.  The monthly membership is great because there is no contract, and no additional fees.All yoga, spin, and other classes are included in membership.  The locker rooms are super clean, and they even had a hair dryer for use.  There are also plenty of day lockers for storing your stuff.  If you are just thinking about a membership, or don't want the commitment - it's only $10 to climb before 3:00pm, or $16 after.  The classes are only $12 if you are not a member.  It's nice to know that you can still get a yoga class for under $15 somewhere in the East Bay!", "date": "7/30/2009"}
{"review_id": "1fDZC2vCCavkpTA5NQFgBw", "user_id": "frqvKa2r5nFvDty8pyOzYA", "user_name": "Jenny M.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "my home away from home ...this place has a monster good vibe.  It is so...not the \"gym rat\" energy.  The ages range from 14ish to 64ish (trust me I know) and all levels of rock climbing are appreciated and encouraged.  There is nice bouldering area but, for that, i recommend mission cliffs!  Andrew, Dustin, Eric, Paul...the main guys at the counter are fabulously helpful...not to mention easy on the eyes!  bummer fact: it closes early 10pm ...not good for all you 24 hour folks.", "date": "7/19/2006"}
{"review_id": "kCtm4-Ay2rfVNq6mPybgZQ", "user_id": "fZBrj7X27VSNhfweEollCA", "user_name": "Eva L.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "My son and niece now outgrew the rock climbing wall in the park so we went to try Diablo Rock Gym a month ago.  I was going to see if this is a place for our son's birthday party next year.We walked to the front desk and saw an employee behind the counter who didn't seem to care for our business.  After we filled out the release forms, we returned to the front desk and the same guy led us to another employee who just looked at us, didn't say a word and looked up to another child who was half way on the wall.  At this point,  I didn't want to be rude but had no choice and asked what we were supposed to do next.  The employee then told us there were three kids who he was assigned to.  After 10 mins, it was our turn.  My son and niece enjoyed the climb but this employee kept chatting with his co-worker and didn't hear the children when they wanted to come down.  This whole experience with Diablo Rock Gym was disastrous.", "date": "10/19/2013"}
{"review_id": "xXFI8Wk6xEKUdbAeltazrQ", "user_id": "FpQEIFAoKRkh57F-ADQp2Q", "user_name": "Catherine D.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great Staff ! Very clean facilities and stafff are cleaning and polishing daily, no odors. Pool is very clean without that strong chlorine odor.  Lots of classes including Zumba, Yoga, Water Aerobics, Water Splash, Cycling. Great Rock Climbing training and practice.. Excellent Personal Trainers  and Swim Instructors.  Highly RecommendTo the Owners :  PLEASE Offer a Daytime Water Aerobics class , lots of us from SSM want a class  so much that my friends in Concord and Walnut Creek and Pleasant Hill drive all the way to Livermore three times a week for a daytime water aerobics class at another gym, you will definitely fill the classes :-))", "date": "8/22/2011"}
{"review_id": "jUY_rx-r4Ux3Mtm9hX8VtQ", "user_id": "gf4tyQgQOtVMkOdvveRHVA", "user_name": "Henry S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here a couple months ago to hang out with some friends who are recreational rock climbers.  I had to the chance to check out what they all keep talking about.  Although rocking climbing isn't something  im into, this gym features a huge work out area with a bunch of cardio machines, spin classes and big ass rocks to climb on.  Staff was friendly and the changing rooms were clean.", "date": "6/6/2011"}
{"review_id": "3mG_uF-7omIkYzyHvzRajw", "user_id": "OaRk-RwFEzfOtc45ff0fGA", "user_name": "Jenn C.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Rates are comparable to Planet Granite (referring to the one in San Francisco), but I'd probably say the most notable difference was the fact that Diablo Rock Gym uses the older model of harnesses and ATC devices instead of the Grigri, so the belay test is slightly different.  Aside from that, the ropes seemed a bit stiff and worn on the ends but the staff were nice (when you're finally able to flag one down).", "date": "4/9/2011"}
{"review_id": "1wqMOBjEURypkZtNOqm8vA", "user_id": "OT3D55achPotu9QERZcCNQ", "user_name": "marcella r.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I come to concord the most out of all the gyms but it is still the nearest and dearest to my heart. generally good slab routes ftw! the staff is all really nice and am now buddybuddy with a few. and the absolute best thing about this plcace? THE MUTHAFIN STEAM ROOM! oh man, my love of steam rooms is ridiculous. there is also one of the trainers there, Rubin, who is very nice and open to talk to whenever he is there.", "date": "5/23/2009"}
{"review_id": "RMIYjbCAIuKv9mSzOf-ISQ", "user_id": "KoRmFHTVPjOlO_dG0WXnpw", "user_name": "Matt H.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Fantastic! This gym has more classes than any other gym I've been to: cycling, TRX, Crossfit, yoga, core, and others. In addition to being a great general gym, it also stands out as a wonderful climbing gym. The route setters do a great job putting up routes/problems for people of all levels. Also, there is access to an indoor pool. The front desk staff are friendly and helpful. The overall feel is laid-back. I don't feel judged here. I have nothing but positive things to say about this gym.", "date": "1/5/2012"}
{"review_id": "Nrx2o_C-U3WlOy94fryKDA", "user_id": "AZtDj1WfNkkb78uBYRtaoQ", "user_name": "Stefani P.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Diablo Rock Gym is the place I call home for my fitness needs, so deep down I love it - but this is an unbiased view from a relatively new climber - I've been a member of Touchstone for 3 months now. First off 90% of the time this place is pretty peaceful. There are a lot of route options for belay, lead and bouldering, with ranges in difficulty that will suit any level climber (5.2 is the lowest I've seen). The walls are shorter than the other Touchstone locations, but personally I like that because I'm still building muscle. The staff is great about regularly cycling the routes to keep things new and exciting. Great overhang on both the lead wall and the bouldering wall, even though I'm still too novice to touch them. Overall it's a fantastic gym - very open and inviting. I've never had a problem getting a weight/cardio machine even at peak hours of the day. Never have to wait for belay routes. Never have to wait for boulder routes. They offer classes every day (Yoga, Cycle, & Zumba) though I haven't checked any of them out yet (not big on classes). It's just a great place to get in, do your thing, shower, and go home. The staff are all very friendly and helpful. Bonus for me that it's 5 minutes from my house.Now the cons, because every place has them... Luckily there are only two, both of which I consider tolerable. The biggest \"meh\" I have with DRG is that it seems like they run a babysitting service from at least 4:45pm (when I usually arrive) until about 7-ish. During the week there's quite often a group of kids running around with one or two young guys monitoring them - MOST of the time. I've honestly had kids from that group climb up bouldering routes that criss-cross with mine first being below me and then above me (they're so quick!) to the  point where I have to pause my course because I don't want to have one of them fall/jump on me or vice versa. They often socialize at the bottom of belay climbs just swinging on the ropes (not climbing), or tear around the gym at high speeds. I understand it's the suburbs, but I'm there to work out, not to dodge children. There should be a level of maturity in these kids, otherwise they shouldn't be in a gym in the first place.The only other issue I've had is that the showers don't seem to get very hot. I don't need scalding, but something that is above lukewarm would be nice. I've been in the shower with it on as hot as it will go and still had goosebumps, and that's no good when all I want to do is wash the sweat out of my hair - I should have enough heat for a 7 minute shower that won't leave me shivering.Other than those two small issues, Concord is great, and even if these situations remain the same I will continue to go there because the pros of diverse and mostly available climbs/machines, relative tranquility, and proximity to my house definitely outweigh the random unruly children and less than hot showers.", "date": "5/26/2010"}
{"review_id": "tgLaCHXg0-v2Yi2bDYX7Ig", "user_id": "GeDVfLDCXYdClMLSWBGs-A", "user_name": "Carol S.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been a member here for over a year now, and I love it. Friendly staff, good yoga classes and very social crowd, for the most part. I've been able to pick up random climbing buddies after hanging out in the bouldering pit a while, but on days when I don't want to talk to anyone and just want to climb, I can do that too. Towel service, steam room, sauna, pro shop (SNACKS!! need more calories to burn!), and plenty of folks around to help give tips and suggestions make this a good place to learn to climb. Seems like there's always a group of Boy Scouts, a birthday party, or multi-generational family group there in the afternoons and evenings, but the mornings are pretty quiet and calm if you prefer that. As of March 2011 they just got in new rental shoes, which is nice. Better to get your own if you want to stick to the walls on a regular basis, though. Oh yeah... REI is practically across the street (Willow Pass Road), so you can do that pretty easily. Check out their rope and bouldering competitions throughout the year, and get a membership so you can check out all the other Touchstone gyms. Totally worth it. I started out as a rookie last year, and between all the climbing and yoga I've done there, I feel fantastic.", "date": "3/16/2011"}
{"review_id": "rSB0QBn9t7Zd6TsbLLtpIA", "user_id": "g8oRkV4UoHA2hpl8eWxXPQ", "user_name": "Christine D.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 4, "funny": 3, "cool": 2, "text": "A couple of my friends and I decided to try this place out.  Fortunately, we found this spot.  Would definetly go again.", "date": "5/25/2008"}
{"review_id": "1BvEkwBa0GDcAv4X4yNXHA", "user_id": "pme-jvQybv0I-zYjGCxROg", "user_name": "Cindy Lou K.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "3 and 1/2 really.  But only because I go for the yoga. World Yoga in WC closed suddenly and left the yoga community orphaned.  Sarah P. from Diablo Rock invited me to try 2 free classes.  Since I'd only practiced @ WY, I'd say my bar is probably set a little high for my yoga experience.  The class was great but I was distracted by the music from the spin class in the next room.  I am not used to conversations outside the door.  But the class was challenging and free.  For future yoga classes, it $10 to drop in.  A bargain considering the usual $15/$16 rate.  Maybe I'll get used to the noise?", "date": "6/29/2008"}
{"review_id": "1_CqMrp_aYpQnK23dXckgA", "user_id": "siaEE64_5sOtd_3OQpFirw", "user_name": "Audis V.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to get a great workout. It is a gym, but unlike any other. The fact that you can come in, get your rock climbing shoes if you don't have any, and either boulder or rock climb  all you want is something that is great about this gym. You can work on the machines (elliptical, treadmill, etc.) of course, but just the environment is nice. Small, isolated gym, but worth traveling to. I'm not a fan of gyms because of the many kinds of people that go there who are very vain. Here? You don't get that vibe. Everybody is doing their thing and not worried about what you do which is nice when you sometimes want to try something new without you having that feeling that others may be judging you.", "date": "12/11/2009"}
{"review_id": "6t89eAXSfPAlPcRb3egsnQ", "user_id": "du1glKsorOEyfr3NCodcZw", "user_name": "Jaden V.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 1, "useful": 4, "funny": 2, "cool": 0, "text": "Let me be clear about what I'm writing about: the claim that they have a POOL... that you can swim in.  I wanted to give them a try because they offered a pool.... well if you can call it a pool.  No doubt the rock climbing part of the gym looks fantastic, but if you want to swim - you are better off in your bathtub.  The locker rooms that have the steam / sauna / showers and lockers are NOT attached to the \"pool\".  In order to get to the locker rooms where you can change before going to the \"pool\" you have to walk through the entirety of the gym - around the weights section, through some doors, around the \"pool\" - then into a hallway that has a men's restroom sign.  At first I couldn't believe that this was the locker room for the pool.  Upon entering it turns out I was half right.  It was the place where the gym owners expect you to change and shower if you are using the pool, but it was NO locker room.  The List:  the lights half work and then turn off on you after 5 minutes (only way to get them to turn back on it to go back to the door and wave your hand at the sensor), even with the lights on the toilet had NO light, the VAST majority of the lockers are broken with no way to actually lock them, the few lockers that work are on the bottom and in the corner, the \"shower\" is a hole in the wall with no curtain (looked as though it had one of those shower heads that spray ice cold water at you with speeds that could pierce skin or that it would just trickle out), the whole hole smelt like mold and a homeless persons dirty socks. Now lets move onto the main event... the \"pool\".  If you are a swimmer and by swimmer I mean someone who swims... not someone who swims a lap or two and then lallygags for one end to the other - this \"pool\" is NOT for You!  It is perhaps the dingiest thing I have seen in a great while.  The entire \"pool\" is 3 ft-ish deep.  I'm 6'2\" and when I swim I don't like my fingers hitting the bottom, and although I am flexible and can get pretty compact during a flip turn, the water level is such that it is not sufficient enough for me to do one. To sum up the whole experience including the entire look of the \"pool\" SAD SAD & SAD!! Probably the WORST pool I've swam in since moving to CA. I'm sorry I wasted the money on the month of unlimited swimming.", "date": "2/1/2012"}
{"review_id": "-cDUwEm6UWgjhJI4ibfpyQ", "user_id": "BhLv1A3wCynI1i_fgJxDNA", "user_name": "Sam O.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "great crowd, great staff, great routes, and now a pool being put it too?? screw 24 hour fitness, this place is worth every penny, now if they only rented lofts next door so i didnt have to drive there every day my life would be perfect.", "date": "8/27/2010"}
{"review_id": "l3ew5U94ZRvtCmFUmeVG4w", "user_id": "NpGXAgdQfMBwg0ijaitq3A", "user_name": "Andy Y.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "this is my local gym.  i usually boulder.  they have a full fitness center and decent locker rooms.  the staff is friendly and down to earth.  and the other members there are cool too.  i always end up talking to people while i climb.  to help them with a problem or be helped.  i became a member back in june of 07 and i have learned a lot from this place considering how small their bouldering area is.  its not as large as ironworks in berkeley but it gets the job done and it doesnt get as busy as them.  and the physical trainer there is a former nfl player named ruben.  everything you need to do to train is here except for a pool and track but whatever.  i love this place.  not only do you get a membership to other good gyms, you also get a free subscription to Rock and Ice, a magazine that goes for $5.99 an issue.", "date": "3/12/2008"}
{"review_id": "g9FabY6daY8yk3vBurO72g", "user_id": "ZeIWoBsxfw8AW_Uomp5C0Q", "user_name": "Joel W.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "totally rockin'!  smaller than berkeley ironworks and sf mission cliffs, but plenty of quality routes (same route setters) and far fewer people.  and it costs less to be a member here.  nice lead routes on the prow, which is fantastically overhung.  i dig it.", "date": "2/2/2006"}
{"review_id": "lUSAupdaVSoEaUO63RdPZA", "user_id": "0AWvfDGseHq54UlFCLAh8g", "user_name": "Peter R.", "business_id": "ImFFWa6UEu_fhfODG1yBiQ", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place. The place is really clean and organized. I went their with my youth group and everyone loved it. The people are nice and the price isn't bad. You get the most bang for the buck and I can guarantee and awesome time. The place is filled with options and it's an adventure.", "date": "3/11/2009"}
