{"review_id": "s3mP0IlBFQaqLVDQhPH_YQ", "user_id": "fB4iB8F3yh04i35KFedLww", "user_name": "Thomas H.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Groupon brought me here because the deal was too good to pass up. You get two all-day access passes, intro class to auto/manual belay, and bouldering for about $30. Pros: -Cheap AF...a yearly membership is something like $300 via Groupon-Friendly staff-Beginner friendly gym Cons: -Small gym-Gets packed with people and gets can really hot-Older facility-No locker room, shower room, or steam room -Not enough staff working at one time so if you have a question you'll need to wait your turn Overall, I think this gym is 5-star deserving, namely due to the price. This is a really barebones climbing gym that just has the essentials.", "date": "4/6/2019"}
{"review_id": "Fjc-H5wF0SEyE6KYbgGuqw", "user_id": "QgRdThGcZhkhNl7AyFIsKA", "user_name": "Jessica T.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Groupon convinced me to get the 2 first class passes for $30. Aaaand then the staff at Hangar 18 convinced my boyfriend and I to get a membership. They're good. Staff is so friendly here! We were greeted by Gaston, who unfortunately doesn't work there anymore, and I'm sad about. But he made our first experience fun and safe, which made us want to continue. We ended up going 3 times within the first week, which is not recommended. Couldn't quite hold my phone or move my arms for the following week. With the membership, you can also bring a guest per month! Weekends are usually packed with people, and lots of children with parents from what I've seen so far so it's best to go during weekdays! There's also a sort of smell when entering... I'm guessing from the sweat and chalk and just natural ventilation from the wind, but it's not terrible that I have to plug my nose. I compare it to the odor of a gym, but with chalk mixed in. Okay, I'm making it sounds worse than it is, but it's that bad!I like that they switch up the routes every few weeks/month, it makes it less monotonous, especially for people who go quite often! Also the people who go are super friendly, and supportive in giving tips on how to master the route. It's great, love it, go try it, you won't regret it.", "date": "3/14/2019"}
{"review_id": "v-wn7z0y5XOVmXbXkYmYNA", "user_id": "a45sUFByv86nZGuBbP7KoQ", "user_name": "Bekah Cow ..", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "First of all: kristen is awesome ! She was super chill, funny and made it fun to learn and enjoy this experience  for the first time. Tried this place out with a groupon.  Came with a mini lesson , shoe rental, and all day climb pass. I learned that Tuesdays come out to like 12$  per person. So I def want to come back and do it. I'm afraid of heights but went all the way up to the top anyway. It's not that high so it's good for kids and beginners like me !  It took a lot of energy- a good workout! So I enjoyed it a lot!", "date": "3/10/2019"}
{"review_id": "jFsslKclaeY4KM-zpz7O4A", "user_id": "7RX1yL5SaVALrOJ3bOnOgw", "user_name": "Eric T.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 7, "funny": 4, "cool": 5, "text": "Over my winter break, I wanted to try my hand at rock climbing. I decided to stop by on a Tuesday for their 2 for 1 deal ($36 total, 18 per person) which is a great value compared to any other bouldering gyms in the area. The membership includes access to any of their other Hangar 18 locations and 1 guest pass every month. I've been to the Mission Viejo location, Long Beach location, and Upland location and while this location may not be the biggest, I would say it's more beginner friendly and great for bouldering. They change up the routes every Wednesday which keeps things interesting. However, if you're looking for top-roping and auto-belays, you may be better off at the upland or long beach location. My only issue with this place is it gets ridiculously hot in the summer which quickly becomes a sauna due to the lack of ventilation going on aside from a fan in the back.  The nice thing about hangar 18 is they offer free top rope lessons/certification every hour and have some of the most friendly staff. Arie (sorry if I spelled the name wrong) the manager is super cool and friendly. She is more than happy to help any new climbers get started.", "date": "12/31/2018"}
{"review_id": "u3bpQXn5RWQSAuzWMcFR6A", "user_id": "5WNpVilRzHWPky9uZNsQtw", "user_name": "Coleen J.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 3, "useful": 4, "funny": 0, "cool": 0, "text": "PROS: - friendly staff- check online for their weekly/holiday day-pass/membership specials!- autobelays (on a few top-roping problems) - really technical routes that make you focus a lot on your foundational climbing skills - a decent range of routes for both beginner and advanced climbers - Hanger membership is VERY affordable, especially compared to places like Sender One, Touchstone and Stronghold - right next to REI so if you forget anything you can just go buy something haha Cons:- can be very hot during warm days, because no A/C. - climbing walls are a bit old- sometimes difficult to down-climb, wish there were down-climbing holds because the floor is a bit hard. - top-roping walls not very tall or exciting for experienced climbers, more suited for kids and first-timers - gym is a bit small and dingy", "date": "12/27/2018"}
{"review_id": "JPDKvNO5gzVYFdnHmoiXVA", "user_id": "JYrIDNpTylP7sXPJLNi9Mw", "user_name": "Gemini N.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "I am glad that the \"arc, \" now known as Hanger 18, is back. The staff is very nice and friendly and willing to help you if you have any questions you may have. I like the problems that they set. They set a new wall every Wednesday. The people who go there are usually very friendly and helpful. I am shorter than most people so it's nice having someone help you with a possible beta. The gym is also a lot cleaner than it was before and I am so glad you no longer have to drag a mat over every time you climb. If you're interested in climbing and you don't like it crowded go before 5:30 on a Tuesday or a Thursday. Monday and Wednesday are usually busier than Tuesday and Thursday.", "date": "11/30/2018"}
{"review_id": "vlSl5OffU6MwchYS3SL5xQ", "user_id": "h9u0SS7Dpgeb68Gn0IFgwA", "user_name": "Devora O.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This place is okay.  It's probably really great if you are an extremely advanced climber, but there are very few options for beginner-to-intermediate climbers.  The staff are friendly and helpful.  The locker room smells particularly bad, even for a locker room. The price is pretty good, but your first climb is $30, not the regular $18 day pass.  You can use the Groupon to get 2 for $30, but just make sure you're prepared for that if it's your first time.", "date": "5/4/2019"}
{"review_id": "o71av33niYNmTjX20N-q0Q", "user_id": "EFqih-bu7EVkWMW-ENhiQA", "user_name": "Amy K.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 4, "funny": 1, "cool": 3, "text": "Today was my first time climbing (ok, since back in 2001??). The staff is really nice and happy to answer questions. If you say it's your first time, there will be a quick lesson on bouldering to prevent injuries. I did not get to top rope today.This gym is clean and bright. The only other Hangar 18's I have only seen is Upland and Hawthorne Hangar 18's. This one is a little smaller than Upland, but it is bigger than Hawthorne. The thing that scared me about Hawthorne was it reeked of stinky shoes and made me want to puke when I worked in El Segundo. I thought all climbing gyms smell bad...a pleasant surprise, it was clean and I didn't smell any shoes at all in Arcadia.It was busy on Sunday afternoon, but not as bad as I thought. The people who come here are friendly and encouraging. (1 month update...the people help alot with great tips and rooting for you)I didn't expect much from myself since I do not regularly work out, except for hiking. I attempted 4 different V0 routes. I was able to do 3 of them to the top. It is somewhat of a mental challenge to figure out how to attempt a route. I fell off alot from lack of strength. I figured this is a sport that takes time to develop skill and strength. The thing I am most proud of today is I got to the top of some routes, and made some jump grabs, which I didn't know I could do. It is fun to surprise yourself. You can do it! :)1 month update (i come once or twice a week), hands are much stronger, I was able to do V1 and V2s. So fun!!", "date": "9/17/2018"}
{"review_id": "n17eMfHcpcFhoAHyPiHTSw", "user_id": "1kpZCyL5xAD0STCizhvnuA", "user_name": "Angie K.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "Came here with a bunch of co-workers.  It was a lot of fun!  It's much more of a workout than I thought it would be.  There is plenty of street parking and plenty of members coming in and out to climb.  I even saw a little 4 year old put me to shame.  The climbing is really fun and it uses a lot of upper building strength.  There is no air conditioning just fans.  The restrooms are clean, you just can't go in with your climbing shoes (the rentals they own).", "date": "9/14/2018"}
{"review_id": "29HAiy_w7afMZRJlf1rr7A", "user_id": "A-R7a39eJEpI4kkMgW8elw", "user_name": "Bradley J.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I've climbed at Gyms all over Los Angeles County and Orange County. My wife and I also climb outside, weather permitting. It's important to find a convenient home gym in order to keep in shape and push your self to the next level. We moved from Long Beach to the San Gabriel Valley, and there wasn't anything out here until now. We had tried Stronghold, LA Boulders, and Hangar Upland. The first two are incredibly overpriced. It's like they think they have Sender One level gyms, and they simply don't. Hangar Upland was fine, but the drive didn't make sense for us. This gym just opened, so they're still getting things in line. They took over the old \"Arc Climbing gym\", and made it their own. It's right across the street from REI, so if you forget something, then you won't have to walk far ;)I'm sure they plan to make improvements along the way. It is mostly a bouldering gym. There are some top ropes at the entry to the gym, but the walls are only about 15-16' tall. There are 3 auto belay devices (it allows you to climb on rope without a partner). There is no lead climbing, and they don't plan to add it in the immediate future. All the holds are brand new, and the routes have a pretty good range (v0 - v7). For those in the LA area who are new to Hangar Gyms, they tend to be smaller than the \"big name\" gyms, but the level of climbing is usually great and so is the community. They have seasonal specials (and currently a grand opening special), but the regular monthly rate is only $36 a month and there is no initiation fee. We had fun, and will be back soon.  I will update my review as time passes. Update:They've made improvements! The new industrial ceiling fan is great!! All walls are now full of holds, and they're re-setting on a regular basis. The range of climbing is now v0 - v10. I think they could use at least one or two VB climbs for the beginners. The new signage on the outside looks great!Overall, I am very happy with the improvements and I hope they keep it up!", "date": "9/19/2018"}
{"review_id": "otw-Pa3ia9lRmp0oCasEPw", "user_id": "rQHUIfvxZUBp5zgVcxmjMg", "user_name": "TJ S.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Pros:- Price- Location- Improvement from the old ARC.Cons:- Mainly bouldering, minimal top-rope. Top-rope area is claustrophobic- Extremely small gym, can quickly get crowded- No AC, no locker rooms, no water fountain- Dirty, dingy feelCan't wait for Touchstone's new gym to open in Pasadena.", "date": "4/7/2019"}
{"review_id": "oSL5KQnFOmWg9AFCyk7Z0A", "user_id": "AdACVwMxJeeiv9mLVcbTIA", "user_name": "May A.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Nice climbing spot, hang out place. Bathrooms are a hot mess. Needs a little sprucing up.", "date": "3/31/2019"}
{"review_id": "dYuT1EtkWvWHAjxOq4dPzA", "user_id": "c619P7Twqw-oj6hgnFOYPA", "user_name": "Nam L.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The re opened place is much more challenging. The beginning process is some what of a pain. They make you sit through the whole orientation process and charge you an initiation fee. But it a lot better than before.", "date": "4/7/2019"}
{"review_id": "hnTiMvDb6Qqwpu2rjSkmAg", "user_id": "eDGMuSMhGFpII7SX1NI50Q", "user_name": "Nthn T.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "It's not my first time climbing and yet they treated me like I was. I was prepared to pay $18 for the entrance fee but that price jumped almost $20 just because it was my first time there, saying that it was for a pair of rental shoes, a harness and classes. I understand that paying that much as a policy is good for actual first time climbers but it's a real turn off and a big fuck you for those that have experience.", "date": "4/13/2019"}
{"review_id": "2S8c24JGX3rh0hc1m-FqTA", "user_id": "bFygnUmkuqHDdCdDXAEsOg", "user_name": "CANDY R.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Brought my 12 year old and friends for a birthday party and it was off the chart!  Great options for the girls to climb for all levels.  The employees were interactive and very helpful.  We can't wait to go back!", "date": "10/24/2018"}
{"review_id": "VC9xNrHFdZJi3QuERRr8AA", "user_id": "FKp1fiam2XUJeCCDEkz0Ow", "user_name": "kungfuwife P.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "My child (13 yrs) and I had a great time here!  Joe was the staff at front desk and he was very helpful, attentive, and informative despite being the only person to help receiving all customers.  He also showed us how to use the boulders, auto belay and showed us how to top rope.  We used a Groupon and it was our FIRST TIME, mind you, at a climbing gym.  My child loved it and we are seriously considering a membership or repeat visits in the future.  A lot more fun than we could have imagined.  A good place to literally \"hang\" and spend time with a friend/family while being challenged with the courses, working together and being proud of your achievements.  There were little kids there and I believe kids of all ages can have a great time and experience.  But it's not the staff's job to control the children (not a play room for toddlers), so if families can keep that in mind, it can be a fun and safe time for everyone.  They also do have re coursing or rearranging some of the handles every Wednesday and Thursday mornings/day time, so keep that in mind. But otherwise a great place.  Can't wait to try some other locations, too.", "date": "4/4/2019"}
{"review_id": "TIuO0OsCE_bQD91kDpsGHw", "user_id": "4_ZfbtKxJZN7alRw0fUyIw", "user_name": "Michael H.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbing gym with friendly & welcoming staff. They have various bouldering routes that make it fun & challenging for all levels.", "date": "2/2/2019"}
{"review_id": "Qu2Kmv6YpStWeai6AUD6Zw", "user_id": "AH85P-EbcI2wEWhJdbKK7Q", "user_name": "Stan L.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 6, "funny": 0, "cool": 0, "text": "This used to be the Arcadia Rock Climbing (ARC).  Some of the staff here are still from ARC.  If you look up ARC on yelp, it was rated 4 stars.  Hangar 18 comes in and improves the whole place, puts a mat under all the walls to make it safer, lowers the prices drastically (from $70 to $36 a month), extends the hours it is opened, and then give you membership to all the Hangar 18's.  That is the reason I rated it a 5 star because Hangar 18 did everything to improve this place.However, if you are a Hangar 18 customer and you visited the many other Hangar 18, then you will find this one disappointing.  It's just that the other Hangar 18 are so much nicer.  This one is has the best location since its near all the action in Arcadia, but it is smaller than the other ones.  However, I'm NOT disappointed because the rent in Arcadia must be crazy high so I understand.  I'm still totally thrilled that they put this Hangar 18 in this area.  My biggest concern is if they can make this place profitable for such a low membership price.", "date": "5/6/2018"}
{"review_id": "Zf_qZkAk4uF_oK-AIxzWaA", "user_id": "i-tJ_Kr92RznguTyKSjNIQ", "user_name": "Kaylyn S.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Staff is professional and thorough,  while being polite at the same time.  Agree with some of the previous posters that the walls can get boring quickly.   Only got a day pass to check it out.  Will probably visit on occasion,  but not enough to get a membership.", "date": "12/28/2018"}
{"review_id": "QKMZsC5ywzja2ZaeAr37og", "user_id": "uwT6fPOrglGKFYpPa7yDsQ", "user_name": "Irene Y.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I tried indoor rock climbing in May and June this year up North with my son. Since I enjoyed both times so much,  I decided to join a rock climbing gym. I like this place a lot because it's close to my house, clean, and staffs are so helpful.My only complain is that they have too few beginner's walls to solve and they have the TARGETS way too high for newbies - same height for all levels.  Since they had that Father's Day Special,  a lot of people of all ages signed up.  My humble  suggestion is that they should set up more VBs and VOs to keep their new members motivated to renew their membership.  A lot of people are easy to give up and not to have that gruesome 48 hours delay soreness (PAIN for some if you don't ever work out).  If I am not a stubborn person and enjoyed my accomplishments when I climbed twice successfully, I will not renew my membership once my one month is over.  I know it was totally my fault.  I felt down 5 times at a V1 when I was close to the top and can't climb myself down and felt hard.  Thank God I practice martial arts and know how to fall.  I do have to take 8 days off from climbing because I twisted my  ankle but I am going tonight.Never give up.", "date": "7/6/2018"}
{"review_id": "XOSMXcTst5qkVJHqVEhHaQ", "user_id": "2-e4kRO6WqV591N6pQrT1g", "user_name": "Sofia M.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amazing place and worker or trainer Ari was very nice and helpful showed all the steps how to climb and keep safety", "date": "3/12/2019"}
{"review_id": "1NmqsEEgOVTg3C4E_xAasA", "user_id": "15c7aghXhymUv5y11KJQGQ", "user_name": "Kang-Lin C.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It's a bit small compared to the other Hangar 18's I've been to, but that's pretty much the only minor complaint I have.This is a new gym location, and it's very clean in comparison to the one in Upland and Rancho (those are the ones I regularly go to). The location is great too (although I'm a bit far from Arcadia, I still make the drive to this place on the weekends just because I enjoy it. The other two places I've mentioned are kind of hidden).", "date": "6/13/2018"}
{"review_id": "ShgONg7SaZgJNkOMT0HLZg", "user_id": "BO7fnIg4itXDrqnWasI-nw", "user_name": "Hin C.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Here's The Video I Took That Day: [Roping Tips]youtube.com/watch?v=XnCI…Came here for the $10.00 deal, but I didn't like the idea of signing up for a membership with my cc.  I ended up canceling the membership afterward, otherwise, my cc will automatic be charged for each month.  I'm worry that I was going to get a runaround trying to cancel my membership. Good thing that I'm able to cancel my membership no problem.  I figured I won't be coming here every month, so signing up for one month is good enough for me.The staffs here are very helpful as you could see in the video. I asked, if I could bring a guest to hang around and not climb.  They said yes.  My guest just need to sign a waiver.  If you decided to bring a guest, it is always better to ask first. The reason for one star off has nothing to do with the staff.  It would be nice to have more flexible options to admit in.  In my case, I would like to just pay for one month and try it out for a month. I would like to have a short term membership without having to bind my cc with it.  Sadly, I took the $10 for one month deal, but because I canceled early, I don't get to climb for a month. Another reason for one star off; the climb is not as high as their other location. First time here, the gears for climbing is free.  You can bring your own gears.  I don't know if this offer is still good, should ask anyway. Parking is ok.  It could get full or plenty of space.  Seem like they have their own parking lot.  Enjoy!", "date": "5/17/2018"}
{"review_id": "KQbST4vx4WoRufq7vrnH_Q", "user_id": "0cq2yGrSV4iGkaiN5QjS2Q", "user_name": "Luis B.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This rock climbing place is a nice spot to get a good workout .  Everyone is very friendly and helpful . Kristen especially is really cool, and she is a good climber .  Everyone should come to Hangar 18 to Hang :).", "date": "5/21/2018"}
{"review_id": "CHBHnGM6bYhUIYFQ1cyWew", "user_id": "nYU8fWqlcxhADEeRLdiAtg", "user_name": "Jackie C.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Absolutely awesome place for a birthday party! Had 10 kids there today and the staff was incredibly nice and helpful...encouraging all the kids to climb and making them feel safe! All the kids had fun and are looking forward to coming back again.", "date": "9/8/2018"}
{"review_id": "HcDWwAqFmjXVzuGVlTjUKg", "user_id": "MwnTnw1n1KFk_jc4nLBJjw", "user_name": "Robin F.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 2, "useful": 2, "funny": 0, "cool": 1, "text": "Bought the membership for the summer and have to say I'm not that satisfied. Biggest complaint: where is the water fountain? It really sucks not having accessible water without having to pay every time. there is also no gym or weights which makes it difficult and inconvenient for many people who also want to lift/run/work out + climbing. Today, I had brought a friend in with a guest pass and as he was climbing and holding onto a volume, IT COMPLETELY FELL OFF THE WALL. Is that his fault? No. I would blame the gym for not screwing in the volume tightly. But I understand that mistakes happen. But I was more upset about how the staff handled the situation. They asked once or twice if he was alright, but none of them ever said sorry for it happening. Felt like it was more of a burden for them to take care of the accident. There was also no sense of compensating him for the incident. Pretty sure my friend asked if they had water after his fall from about 6ft from a loose enough volume and they still wanted to charge him for the water. Like just give it to him! No sense of wanting to repay for what happened but maybe that's just me. Definitely not the biggest fan of this gym but the walls get the job done because of ease of location for me so they get 2 stars.", "date": "7/3/2018"}
{"review_id": "KElb170hbVRplj9G9gx26w", "user_id": "3HtSRNx9ioCA5kc9Cjgxsw", "user_name": "Andrew C.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hangar 18 is very cool! My buddy and I went earlier today because of an awesome Groupon deal. The manager, Ari was amazing. Very friendly and knowledgeable in the art of climbing. Honestly I probably won't be climbing again, just not my thing but the manager was amazing and the facilities were great if you are looking to climb!Thanks again :)", "date": "8/26/2018"}
{"review_id": "iZb67NWJReV7Ui1jEkwCyg", "user_id": "EGDJGbE6CV7GxQ44TOMFKQ", "user_name": "Michelle H.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 2, "funny": 1, "cool": 0, "text": "My friend introduced me to rock climbing and bouldering and took me to this place and I fell in love. He used his guess pass on me so I didn't have to pay for anything which is really nice because that's a great way for people to bring their friends in to try something new. You could also upgrade from a guess pass to a membership for only $5 which is like practically free LOL. You do need to pay to rent shoes if you want them but it's only $3. I didn't upgrade cause my friend didn't tell me about it so I just came another day with another friend and we both got the one month membership for $36. I believe one day is $18 so you only need to go twice to get your money's worth haha. I've already been there four times this month and I'm planning on going a lot more.The staff is all very nice and friendly but there was this one short Asian girl with a high voice and a baby face who was a little rude when the place was about to close for the night. The way she said that we had to start leaving could have been nicer. A simple \"hey guys just to let you know there's only 30 more minutes left\" would have been fine. But the rest of the staff's kindness compensated for her.", "date": "8/14/2018"}
{"review_id": "uxqsKgwhaEQ5VKiltTR8oQ", "user_id": "XvbSAfxXurpXo-hFmp4dqg", "user_name": "Eric B.", "business_id": "i6mMCSWxbbm_b94-Lc_atg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Got a good workout enjoyed the new routes.  Got a couple of V4s.  Body is resetting itself from the injuries I have.  Feeling stronger and more comfortable on the walls.", "date": "10/13/2018"}
