{"review_id": "M4A9NNuGkr0FKRA3v7dz6g", "user_id": "KCzZLRn--AFSO2F7VlHygQ", "user_name": "Julee M.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my home away from home. I even go there when I'm not working out or climbing. They have the usual findings in gyms - cardio equipment, free weights, etc. And they have amazing yoga classes which they're always adding classes to. And of course, their climbing is amazing. Their climbing staff is always setting up new routes. The gym is spacious enough that it never feels like we're waiting very long for routes to open up. They also have a sauna! Great for post-workout or on a cold winter day when you just need to warm up. It is co-ed so come prepared with a swimsuit or just go in your yoga clothes. They have free wifi (weeee!!!) and chairs and tables upstairs so you can do your work. The balcony lets you spy on your friends or little ones. Perfect setup for parents who are bringing their kids to climb or for climbing lessons.", "date": "5/23/2019"}
{"review_id": "DJ0jHBBdrm0WcxWZGG0EjA", "user_id": "pR6eKukquLqlRCB7l30w4A", "user_name": "Joanna B.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Let me just start by.... I LOVE MESA RIM!I didn't really get into climbing until I used a buddy pass at Mesa, and it completely changed my attitude from \"once in a while\" to \"I want to be good now\". Mesa is a beautiful gym. It's massive and has a huge variety of both ropes and bouldering. Plus the routes change frequently so you're never bored!Mesa Rim also offers a weight lifting gym, yoga classes, cardio machines, and other less common events such as woman's bouldering, competitions and more! They have a suggestions box, and they share peoples comments and concerns and take a real effort to address these which is great. The staff is super friendly and actually gets to know you. This is something that I find dire in a gym. Many people get discouraged from going and working out at a gym, but being greeted and remembered makes it a lot easier to keep up on your fitness. There are also showers and a sauna which are nice to use after a good workout.  Only downside for me is the shorter hours on the weekends, but it makes sense considering people probably do not come late on those days.", "date": "4/10/2019"}
{"review_id": "o3LMeGTDOtUjaOCBSEmUDg", "user_id": "4ywoghefRTsbi1SzkR-fcA", "user_name": "Yinny L.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 19, "funny": 4, "cool": 20, "text": "A day pass at Mesa Rim costs a bit more than the other climbing facilities around town, but it's not hard to understand why. This place is huge and has so much to offer!I came here last night with a student discount. This place was packed all night until closing! I just did bouldering and did not attempt the ropes courses although those are extensive. The bouldering is labeled with difficulty level like other places, but the entry level routes here seem a tad harder than some I have tried at another place in town. It was a satisfying challenge to complete!Thursday was also leg day for me and our workout buddy, and the resistance area of the gym here had enough equipment for us to do our whole workout in. I've attach some pictures of the workout area with this review since I don't see any on here. There's also cardio equipment up on the second floorWe ended our workout with ten minutes in the sauna, and it felt better than a stretch. Perfect way to end our night!", "date": "3/1/2019"}
{"review_id": "hzRP9QpoFfRHAsRuxlEMmw", "user_id": "BHcPaG4X220bQsqORhMFkA", "user_name": "Kelsi D.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "DISCLAIMER: I am not a rock climber, I know close to nothing about rock climbing, I just climb for fun from time to time! THIS PLACE IS MASSIVE. And a little bit intimidating to a novice climber. Their belay walls are extremely tall and there are probably over a hundred different courses. Their boulder wall is a little taller than I'm used to but I really appreciated how many different types of courses there were, all clearly labeled with the difficulty. The gym was PACKED when we came on a Thursday night but it was surprisingly easy to find a wall to climb although we had to park on the street. This being a fairly newer gym, everything was beautiful and in top shape. Definitely a higher end climbing gym! They also offer Groupons from time to time which include a belay certification, beginner climbing class, and unlimited yoga and sauna access! There's also a full weight room and upstairs workout area here. It's truly an awesome climbing gym in my opinion!", "date": "2/16/2019"}
{"review_id": "I6M1nX6VD5epkKBvbD6BNA", "user_id": "56igibRHPWdSBA2HysZd4w", "user_name": "Mary F.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I must say I love this place. It's my Monday night home for climbing and becoming my Tuesday night home for yoga and after ski season back to yoga on the weekend as well. I've been a member now since it opened.  I am not much of a boulder gal but love top top and there is tons of it available.  He vibe there is cool, all ages. The gym equipment is minimal but still a perk compared to other gyms, and the yoga! That is my icing!  Lots of class times and awesome instructors.  Nice staff, all into climbing and helpful.  I'll be sticking around for sure!", "date": "2/28/2019"}
{"review_id": "G3LSWcbyaBDe6tiQmFZAEg", "user_id": "f_P3rjvnK03l1sA4Wk1NvQ", "user_name": "Tyson W.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm surprised to not find more reviews from experienced climbers on here! I was skeptical of the place at first. One part nostalgia for good 'ol Rocksport, and one part for, \"Did we really need a third gym?\"The more and more I climb here though, the more it seems like the ONLY gym in Reno. The route setting is really good. Like really really good.  I'm sure the insane selection of new, high-end holds and the badass volumes on brand new walls is helping the cause, but they are creative setters without a doubt as well. I noticed they have a construction boom lift in their arsenal for setting their walls. This tool is paying dividends in route quality. The setters are clearly getting to focus on putting up awesome routes, instead of the logistics of getting holds on tall, overhanging walls.Many of the routes do not give my very short girlfriend trouble either.  For example there is a blue .11+ in their tallest dihederal right now that might be one of the most outdoor feeling, creative, flowing routes I've ever climbed in a gym.  Both me (6'1\") and her (5'1\") loved it. That only happens with thoughtful, creative setting. At any given time there are usually about 10-12 standout routes like this that push the creative envelope. The routes have never gotten stale to me, going about 2 times a week. Seems like their cycle is around 2 months per route, which is pretty fast when you consider the sheer volume of climbing available here at any given time.The facility is massive, well lit and laid out. Music selection is generally to my liking, staff is super friendly. This is a climbing facility that is triple the gym for nearly the same cost as the competition.  I think this form of fitness will only continue to grow as non-climbers discover high quality places like this.", "date": "1/4/2019"}
{"review_id": "4jGxpF5j8PGT2Xdl9UQVMw", "user_id": "t-nB38eHbeFuabXBdJMwvg", "user_name": "Katharine S.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 8, "funny": 1, "cool": 4, "text": "This new climbing gym is amazing, hands down. It improves in so many ways on Rocksport and on Basecamp, Reno's two existing climbing gyms. Don't get me wrong: I've enjoyed climbing at both of those other gyms, and I'm just finishing my second year of being a member at Rocksport ($420 a year or $45 a month). But when my fiancé and I learnt in April 2017 that yearly memberships to Mesa Rim were available ($630 a year, initiation fee waived), it took us about 15 minutes to look at the websites for the Mesa Rim San Diego gyms and to realize that whatever was going to be built over the summer was going to be worth signing up for. Why is Mesa Rim so fabulous? First, it's new and clean! Second, it is HUGE. There are so many tall walls for top roping and lead climbing, and so many walls for bouldering. And there's even a top out bouldering wall, which means that one hasn't finishing climbing the route until one gets one's legs and body over the top. Even though I've been climbing for over two years, I started as a super duper beginner, so I'm still learning how to do things like top out. My fiancé and I primarily boulder, and there are so many VB to V2 routes for me and more advanced routes for him. Members get a varying number of guest passes (unlimited in July before their grand opening in August!), and I've bought three of my girlfriends on my guest passes to try climbing. Shoe rental is $5. If one wants to climb the tall walls, taking a belay lesson is required. Reserving a lesson online or in person is required. If a climber has the knowledge to pass their belay test, he or she can test at any time, which is what my fiancé did. I, on the other hand, am not confident in my knowledge (and Rocksport made it super easy with its auto-belays and already-attached gri-gris), so I still need to take their lesson to use an ATC belay device. Mesa Rim double loops the ropes at the top whereas Rocksport only single loops the ropes, and I'm excited to come down the wall much more smoothly as a result. That is, if I make it to the top of the tall walls: they are hella tall!Other reasons for awesomeness: there's a yoga studio, four cardio machines, two rowing machines, comfortable fancy chairs for relaxing and chatting upstairs, a ton of free weight equipment and a big area in which to use them, and a steam room (clothes required!). Oh, and clean bathrooms!!! (Rocksport, maybe this will inspire you to clean your nasty bathrooms!) The people who work here are friendly, and the vibe is excellent. Best of all, the staff is actively taking suggestions for improvement via anonymous cards in a drop off bin! In the two weeks that I've been climbing, they've already made many of the improvements and posted the suggestion cards with their responses. SO COOL! I'm so glad that Mesa Rim is part of our community: it's a fantastic place to climb.", "date": "8/7/2017"}
{"review_id": "RCeHnjtigLTu1mx3TFjJ_Q", "user_id": "e_eO7KM8XjFlFK3SmE71gA", "user_name": "Joshua M.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I am not a very experienced climber but I have been to other climbing Gyms. It seems Mesa Rim has much more to offer than any of the other Gyms. Everything was nice and new and clean. The staff was very helpful too and they had multiple people at the front desk, so getting in and out was fast. There was a nice crowd of people there but still plenty of ropes to accommodate everyone. I had a great time and experience there.", "date": "1/13/2019"}
{"review_id": "Pdm-kGEvfB2E-k1snM2k5Q", "user_id": "932D_yeOO_E3eiIqzOlRZg", "user_name": "Dorota L.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What a breath of fresh air! I've climbed at many gyms and finally made my way to Mesa Rim (i live in Tahoe). I was delighted to see tall walls resembling something you'd actually climb outdoors, great bouldering problems, and a great mix of cardio/weight machines. The staff was super friendly, very helpful, and efficient. Absolutely worth the $20 day pass & i cannot wait to return here again!", "date": "1/29/2019"}
{"review_id": "C8kLAxVG6wMfF-OcrjM37w", "user_id": "nVS0uPVn1yYt9BFgwQo88Q", "user_name": "Rhona G.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Took my teen nephew indoor climbing while I was in town visiting. Since they used a different belay device, I joined my nephew in the class.  Bill was clear and communicated well in his instruction.  My nephew picked up and learned how to belay without difficulty.  Practice was only needed.  Their routes are well labeled. Nice to see a clean dressing room and they even have a sauna.  We had a great time!", "date": "3/12/2018"}
{"review_id": "aqcQhnxKi31pIVqTR_5TDg", "user_id": "dMD0Zd9ddkEJJ-nUlgxnpQ", "user_name": "Kim L.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Waste of time if you're a solo climber. No auto belays and stupid rules made up in fear of being sued and with no customer service in mind. Went for a day and got a refund. Go to BaseCamp or hope that Vertical Hold opens a location in Reno", "date": "4/19/2019"}
{"review_id": "u7HQd31g7Y-um0ZeD5YoOg", "user_id": "dUIs5UeqN3Tgv0oClqo4eg", "user_name": "Amanda V.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Signed up for a membership at Mesa a couple months ago and absolutely love it! My friend and I are beginners at rock climbing and find it to be a fun way to get active. I love that Mesa had a huge variety of climbing walls at all different types of skill levels so you can gradually work your way up to harder walls as you get better. I've also started taking their yoga classes and Loren is amazing! As a beginner I was a bit nervous going into a yoga class but her instructions and modifications made it much less daunting and a lot of fun. Overall great gym with a lot of variety to keep things fun and interesting!", "date": "1/9/2019"}
{"review_id": "6pvuzbdfyDn7DR6Jn8Au3Q", "user_id": "8HkU-mqIe-9KAhhIjBiaXQ", "user_name": "Daniel E.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 6, "funny": 2, "cool": 5, "text": "Where can a middle age man go to comfortably take up rock climbing in Reno?  Probably at any of the existing rock climbing gyms in the area, but Mesa Rim just opened and is super convenient for me (and probably most Reno residents, since it's right off the freeway), and it offers more than climbing.Get the facts about the place from their website, everything they say is true.  Rates are competitive and they offer discounts to veterans (yay!).  Their spectating platform is great for my wife to hang out and watch from (hopefully, I can get to join in someday...or at least do the yoga...).  Also, the ample space is great for groups to meet at.  The gym has plenty of room to spread out in even when they are busy.This place definitely enhances the outdoor sport offerings of the region.\"Just move up!\"How to be a Rock Climber youtu.be/FpZIT_I2_Oo", "date": "9/24/2017"}
{"review_id": "m_Zv9bvq5S_X87jwk_HC-Q", "user_id": "1cvHek57wGceg2MJr4eF4A", "user_name": "Amanda F.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Today was my first Tim to this facility. The staff were amazing and so helpful. Started with bouldering, took the top rope belay class... there is so much room that no matter where we went in the gym there were a multitude of lines available with courses that are wicked easy to so challenging it is entertaining to watch people try to tackle them. The facility is so clean and well lit. The patrons are great too, friendly and offering advice, chatting about indoor and oh climbing. I had so much fun, I can't wait to go back. I think this is totally worth the money to have a membership. $70 a month, or $63 with discounts for military, first responders, and students.", "date": "3/18/2018"}
{"review_id": "vew_j98G4rajJTuiSthXxw", "user_id": "XeP5WpoulJ9yMpQ2bh9i6g", "user_name": "Kayla M.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 3, "funny": 0, "cool": 3, "text": "The first review was very detailed and basically covered all the important information. But my boyfriend and I recently tried out this location since it was new, and we usually go to Basecamp. Honestly, I was just amazed with the high-quality and care that was put into this place. The workers really care about your experience and were some of the nicest people I have encountered. There are many activities to do such as the bouldering, top rope, sauna, gym equipment, etc. It was so clean and while we were there, employees were constantly walking around and maintaining the area. They even have a suggestion board where they give thoughtful, and meaningful responses. If you are an experienced climber or if you are new to climbing, please go to this location. You won't regret it!", "date": "8/19/2017"}
{"review_id": "egNimD89tz2h1JylH_s7EA", "user_id": "oQnOzIdz5eh6C3wLzgXGdg", "user_name": "Marni S.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I highly recommend the Mesa Rim kids camp as an option for summer or winter break. My son begs me to come to this camp every break due to the great coaching, positive reinforcement, activities, and unique experience. The coaches are professional and it's obvious they enjoy working with kids. The facility is top notch as well.", "date": "7/17/2018"}
{"review_id": "prAKvai9mNxqv-DdwqXNFQ", "user_id": "GSigk1wYtBAi-57mB44kzg", "user_name": "Nicole E.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Thank you for bringing this incredible facility to Reno! I have finally found something that my daughter is passionate about. My daughter is currently taking the twelve week adventure series kids camp. We have also taken some of the Rock Monsters semi private lessons. My daughter love coach Jen. She is motivating and makes a connection with the kids. The Mesa Rim facility is very clean and spacious. Even though the facility is full of people you never feel like it is over crowded. I highly recommend Mesa Rim!", "date": "2/25/2018"}
{"review_id": "NoFLN3fgYLh-382mVZxqjg", "user_id": "9bH657OGbHetPpYcXJlzKA", "user_name": "evan s.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Me: Climbing for 10yrs ~2-4x/wkAbove average setting, clean new holds with lots of different grips and wall angles.Bottom line is the facility is excellent but there are some weird policies. No discounts for local gym staff, and my god, $5 for a towel. Every other gym on the planet has towels, you're really going to make me bring a towel from home? How are you supposed to wipe down gym equipment? Anyway, we'll be back but next time with a towel, don't forget to bring a towel.", "date": "7/3/2018"}
{"review_id": "zdsCiA3CQJlbFfI_DlFHYg", "user_id": "ABmzo9oUGCbe_3Tf10qPHw", "user_name": "Mark S.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I had a chance to check out the new gym. Coming from the Bay Area I had a few hours to kill.   This gym is amazing.  I only had time to boulder and some of the grades were pretty stiff when you start getting on V4 and upI think they should add more cardio machines.  But I think space would be tight.   I didn't have a chance to lead it it looked amazing.   Especially there crack systemsMesa rim.  Your got your groove going on. Thanks", "date": "2/10/2018"}
{"review_id": "1i1ynJPozjaD2E7IkkPKaQ", "user_id": "op8JZLRgzFDwnjbbO0FC3w", "user_name": "gaius g.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The facility is really nice.   The employees are also very nice and helpful.   However, as experienced climbers, we are disappointed in the substandard route-setting.   Beginning climbers don't know the difference, usually, but as you progress as a climber you want the routes to be interesting.   They should be puzzles to solve.    The way Mesa Rim in Reno makes routes harder is to merely make the holds smaller and farther apart.    This is equivalent to making a ladder harder to climb by just making the rungs smaller and farther apart.    Boring.Hopefully they will get some better route setters in the future, because it does not matter how fantastic your facility is if your route-setting stinks.[To be fair, the bouldering section has better routes, on the whole, than the roped climbing areas.]", "date": "7/2/2018"}
{"review_id": "U8wRxYmxJQYaay84yMNKrg", "user_id": "mtXc6R8HmHTdfSDDXHjYNA", "user_name": "Bill H.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Belay instructor was awesome and very knowledgeable. The walls were amazing and challenging. Lots of friendly people and the staff was great.", "date": "3/26/2018"}
{"review_id": "8Q3lEhMJ1nKNsbIlFU0mQA", "user_id": "E4ghKoPlAGgm4C1oeQiFKQ", "user_name": "Chad P.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I go here every Thursday for yoga. climbing  and to lift. All three in one place. Great gym, and great staff", "date": "8/5/2018"}
{"review_id": "C3kQsNLPR7g1JBAOQ7otGw", "user_id": "wpICvGRO8OWZniK_br2xHw", "user_name": "Sam M.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 2, "useful": 5, "funny": 4, "cool": 0, "text": "No autobelay means you either have a partner with you (so there's no last minute deciding to drop by) or take your chances on recruiting a stranger to belay you and hope he or she doesn't accidentally let you auger into the floor.  I was under the impression based on advertising Mesa Rim would be a fusion of a traditional gym offering a full complement of machines, weights, and cardio equipment and a climbing gym.  This is not the case, they offer very nice climbing opportunities but very little in the way of cardio machines and weights.  With Mesa Rim membership prices approaching twice that of other climbing gyms and with a $50.00 initiation fee, I can pay for both a fully equipped traditional gym and climbing gym memberships and still spend less than I would for Mesa Rim alone.", "date": "9/3/2017"}
{"review_id": "dfRoxjwncykVV-IoWcwWeg", "user_id": "k9dFXYwSTG6Nw0WKWHl-Vw", "user_name": "John E.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "It was nice to see a clean, well maintained climbing gym in the Reno area. We visit from the Bay Area (CA) relatively frequently and its good to see a gym of the quality that we would expect. Ratings were flexible and amenities were good.", "date": "9/23/2017"}
{"review_id": "etycHqU_jfsGBHhzRnFeMg", "user_id": "kaCq4xYG0gnlSZ-ejE0bSw", "user_name": "Barb C.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place!!  Enthusiastic and super helpful staff.  Super encouraging for newbies.  This was a new experience for me and I loved it.  It was great to see such a wide age range - toddlers to mature adults - all having a great time.  I will definitely return!!", "date": "2/9/2018"}
{"review_id": "lxn9rB4q0Yq2xYXcDZn_bA", "user_id": "i9JsuIF3tojx7vyrR3NWFQ", "user_name": "K L.", "business_id": "QiNYgFrT6ySPok_6ePFRqw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is amazing!! It's a beautiful facility, the staff is incredibly friendly and attentive. You can tell people are just genuinely happy to be there. The walls are BIG, however, there is a shorter wall that newbies, children, and climbers looking to warm up, can find fun routes on. There are no auto belays, which is ok with me! The walls are tall and there are so many routes, I, personally, think it's safer to be on a rope. I've seen people \"forget\" to clip in to auto belay in other gyms resulting in major injuries. It happens..They do have a sign up sheet at the desk for solo climbers needing a belayer. It's not a 24 Hr Fitness, its a climbing specific gym. They offer yoga classes, a small cardio area upstairs, campus boards, free weights, several \"Crossfit\" type lifting stations, rowing machines, pull up bars, and exercise bands. The bouldering section is BIG too, lots of climbs for all abilities. I joined in February, in addition to my other gym membership. It's FUN, it's social, it's challenging, and I LOVE it!", "date": "3/27/2018"}
