{"review_id": "z-_6-NW1FQEeiAnCXYS_iw", "user_id": "XphBdRaMldLjZWL4qioM-A", "user_name": "Lo F.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great new bouldering walls. It's cute how special  some of the employees think they are because they work there.. but great new walls and rogue fitness center! Really fun place!", "date": "4/6/2019"}
{"review_id": "0eG01BAeiD8Rjvu5i3InDA", "user_id": "BAHD4bxymZ92S6xvcWo22w", "user_name": "Jessica B.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "If I could give this place a minus -8 I would. Even after returning here to be with my friends for a fun day out, the staff is still extremely rude and horrible to be around on the sheer lack of respect the show towards there customers. The guy was half talking to his other staff member as I did the test for being able to climb. And I was showing him how I knew it but he wasn't EVEN PAYING ATTENTION. DO NOT GO HERE. YOU CAN GET HURT. Literally if I didn't do my test right I could've died. Btw update Marie G. NEVER sent me any private message inquiring my experience at the gym. So that's bull****", "date": "5/17/2019"}
{"review_id": "6UuFXBg24nM57cI8nNZvZQ", "user_id": "iK3yVXMWp2yIXkbCLYA8og", "user_name": "Natalie C.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 2, "useful": 2, "funny": 1, "cool": 0, "text": "Very packed with kids running around everywhere. The price for a day pass was horrendous considering the facilities. Their routes were very inconsistently rated, and their bouldering area was definitely more of an after thought. It was definitely frustrating as the kids from their top rope class were all sitting on the bouldering pads making it difficult to even try some of the routes. This place succeeds at being the only climbing gym in Fresno.", "date": "2/9/2019"}
{"review_id": "k9Xo4v6j4YlQnFesd2QxGw", "user_id": "JPR6dFnLkBNLh0jrB-l--w", "user_name": "Kayleigh B.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "This is my home gym, and I have been a member for just about five years now. I LOVE THIS PLACE. I climb regularly, am a part of their running club, have attended several of their yoga classes, and attended many of their extra events like monthly nutrition clinics, holiday parties, and climbing competitions. Whether you want to boulder, top rope, lead climb, take a fitness class, or just use their workout equipment, this gym has it all. There's no reason to have any other gym membership, even though at first blush you may think the membership cost is a little high. Trust me, it's worth it.The staff is always very friendly and know you by name. They maintain a safe environment for everyone, and even choose to host adaptive sports programs once a month in Spring and Fall. All the other members at the gym are friendly - it's a climbing thing - so the environment is super chill. I love bringing friends here for the first time because everyone ends up falling in love with this gym just as I have.", "date": "10/19/2018"}
{"review_id": "gOOFmOznFeeACk0yEK28qw", "user_id": "1p7Utssy7O_SkGMTQCbYPw", "user_name": "Clarissa L.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Fun indoor climbing! They have lead climbing with a rope and bouldering! They also have a gym with some fitness classes. The walls have different challenge levels that are labeled making it easy to decide what you want to try. The workers were friendly and helpful in telling us about different shoes they sell.", "date": "10/5/2018"}
{"review_id": "rzDO5n0T8zLlo_LhQJZ9KQ", "user_id": "Zu-4r5sR3CGizi1iIzWAAQ", "user_name": "Aurelio B.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 5, "funny": 0, "cool": 3, "text": "I'm a big believer in working out to ENJOY your life and I'm sooooo glad I found this place thanks to Yelp. Seriously so much fun and definitely beat the daily and ordinary gym routine. Small day fee of $20 is worth it. Maybe call ahead to get the class schedule if you want to climb the big walls. But what an amazing challenge and again great fun. Plus the gal at the front desk, who was super helpful and informative, let me borrow climbing shoes. I'll have to visit again next time I'm in town.", "date": "2/11/2017"}
{"review_id": "qhFI6zLGBVvsCUB6to6Ibg", "user_id": "d-8HjrqeC58WrjApsGQLaQ", "user_name": "Ryan W.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Love this place.  Constantly creating new routes for all skill levels (except maybe experts? I don't know I'm an amateur) keep me coming back.  The bouldering area has the most technical challenges.  Great staff, great classes.  Just a very well run, fun place.  Photo from nightclimb.", "date": "1/27/2018"}
{"review_id": "71VmvN2a20b6gMjg1My8zQ", "user_id": "a6DaSdDHPpmM6polTiSAIQ", "user_name": "E P.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "One of the best gyms that i have been to. Very nice staff, clean facility, lots if amenities including a legit workout section with kettlebells, squat rack, etc. This is a great place for beginners and parties as well, as I noticed there was no shortage of lower level routes. This is a place for everyone!", "date": "11/19/2017"}
{"review_id": "EE-jkULvaeCPDcaDxqzLHA", "user_id": "opdbggrufvUGH8gP9wHL8w", "user_name": "Brian S.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 5, "funny": 0, "cool": 0, "text": "While MetalMark is one of the smallese Touchstone gyms in California, it still has a great mix of options for getting your workout/climb on. Here's what I like and don't like about the gym...Like:1) AMPLE parking. The area where this gym is located was planned to have many more businesses than it does, so there is a ton of parking. The lot might get more crowded as more businesses move in, but for now, there is no problem finding a space at any time of the day, something I can't say for any other Touchstone gym I've been to.2) Large weight room. Despite being a smaller gym than Cliffs of Id, Metalmark has a much larger weight area, including a squat rack with a large selection of bumper plates, a few plyo boxes, free weights, kettlebells, all sorts of different exercise balls (including wallballs), and a few machines. There are also rowers, stair steppers, and treadmills.3) Ample classes. There's no CrossFit, but there *are* a ton of classes throughout the day.4) Large, clean locker rooms. Lots of showers, and more than enough lockers (I'm pretty sure they could be at capacity and everyone could still have their own locker).5) Medium sized climbing and bouldering area. Dislike: 1) As I said above, no CrossFit.2) Snack selections aren't as good as some of the other touchstone gyms.All in all, this is one of the better gyms in Fresno for overall fitness, and the perk of being able to go to their locations in the Bay Area and SoCal add a lot of value if you travel frequently.", "date": "12/6/2016"}
{"review_id": "d_5iYytgA2BCCbScx-S86w", "user_id": "hPc4uHbZywln98ght_VT-g", "user_name": "Terese N.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Yep, went rock climbing and the shoes reminded me of pump shoe toes. But it was a lot of fun with friends!!!", "date": "5/27/2018"}
{"review_id": "GuBtHo0ZaOQo4tVZzc_E9A", "user_id": "h035TDmb1rnVGmcPQ6LA_Q", "user_name": "Ana B.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The one time I have gone it was blast! I plan on doing this again for sure..the instructor was patient with my knot making skills, later another instructor made sure I had the hang of things! Fun making it to the top", "date": "10/19/2017"}
{"review_id": "t8WblnS-je1UTDAZd5TGyQ", "user_id": "KjELM5Ki5xjnk-s5sRuVnQ", "user_name": "Talor B.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "I'm in love with this place! I can't even afford it but it is amazing and well worth the price though! The walls are the perfect mix of beginner/expert and were spaced out well! It's nice to have a gym that doesn't feel like it's a gym! Instead it feels like a big kids play ground! It has a great variation of different classes and activities that no ordinary gym offers! They are very accommodating and nice to newbies and everyone seems to know everyone there which makes it seem like a great business! The weight section has everything you need and doesn't get over packed like other gyms! It is a great environment to be in for a healthy lifestyle! And the climbing is such a thrill! Great experience to at least try once!", "date": "8/29/2018"}
{"review_id": "gQF7ukY1wg1gu9DXFuCvUg", "user_id": "KHOVasINV1DbuxJq-W16FA", "user_name": "Abbie S.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 2, "useful": 10, "funny": 4, "cool": 1, "text": "Went here for a class and I've got to at least admit - I had fun . I learned new things , made good memories and made new friends . The rock climbing itself was alright , some of the levels should've been graded differently , because of the easy ones - WERE not easy . The hard levels were NOT hard at all . Chalk everywhere ; on the ground , on the climbing walls , everywhere.The only reason why I could not give this place 4-5 stars or even bother to return to the place is the staff . One of the instructors was horribly rude. If you're going to address an issue to your customers, don't make them feel stupid for their mistakes. As he was teaching us, he made rude comments about how their learning of the rope tying and belaying shouldn't be as hard as the customers make it be. We aren't professionals like the staff there, there's a reason why we are paying a fee to learn and experience. Oh and be sure to dress properly , especially during winter . They leave the doors open and it's super freezing inside . I can't imagine how summer is like .", "date": "12/1/2016"}
{"review_id": "C4V16tszPN1hue3F_J518Q", "user_id": "hWCZQbMWKg-8cI_YNS9MPQ", "user_name": "ルービー", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 2, "funny": 0, "cool": 2, "text": "Me and my husand came here on my bday. We did the wall climbing / belay + lesson, which we think has reasonable price, considering that you pay for the whole day. So basically u can climb, and get out to hav lunch or smthing, then come back (on the same day) without having to pay again.Me and my husband came there and after the lesson i got so hungry so my husband just went out to buy us panda express and they let us eat on the couch area.Anyways, i think this place is really nice. The staff is also friendly. During the lesson, the instructor makes sure that you get it, and memorize the steps on how to put the ropes, and what to do, and all that stuff", "date": "9/22/2015"}
{"review_id": "C2flGE26s63ApaDU2i-j0A", "user_id": "O1ookEv8Vj_1J6PGTALMLA", "user_name": "HippoSushi ..", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "$34 for a full day of fun with the kids. I'm not someone who thinks we are all going to hell because an increasing number of people are overweight, but it's great when we can get out and be physical doing something that's actually fun, and this is a great place to do it. There is a gym with workout equipment, a small bouldering area, some miscellaneous things like rings, a climbing rope, and then there are quite a few big climbs for which you'll need someone to belay. The overall vibe here is very relaxed and I like that. If it were closer to my house this is probably where I would work out. They always have coffee brewing and mugs you can use. The employees/instructors are all really friendly. And rock climbing is just tons of fun when it's not real so there's no threat of imminent death. A day pass for a kid is $14 and to rent a harness is $2 each. If you want to wear the most uncomfortable shoes on the planet you can rent them for $4. We opted to just use the shoes we were wearing. My kids had a blast. I would belay one and the other would play in the bouldering area while they waited for their turn.  It was a great workout for my kids and they had so much fun doing it. We went for a few hours until the kids wore out. Then we went to Me n Eds Victory Grill for lunch, and then back for more rock climbing until everyone's hands finally gave out. I'm pretty good at overstating, but I don't think I could overstate how great of a time we had here. I'm glad that Fresno has a place like this, and that it is run the way it is.", "date": "8/13/2016"}
{"review_id": "jD57fUGXTdmeJo5VKbttSg", "user_id": "VmHllWdwNPcp3oShRVsnyw", "user_name": "Jared M.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is really good. I'm here in Fresno for work for a month or two and have been spending all of my off time from work at this gym. The staff is great. And the facilities are amazing. Everything you want from a climbing gym!!", "date": "10/12/2017"}
{"review_id": "eRvl_5HxS4E3Z5YNyKt6lg", "user_id": "i697rrFvZZIg7_OOQYgsaQ", "user_name": "Tim G.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What a great place and great people as well.  I'm quitting my regular gym to go here.  Safety is a number one priority for Metalmark as well and I was only able to get my belay card after successfully mastering belaying.  Even the members are a cut above the rest.  The atmosphere is laid back and friendly.  There are even fun after hours parties and games nights and bands that come to play.", "date": "10/12/2017"}
{"review_id": "uTWPyiXv5duW1f22YhzZ6A", "user_id": "vE3-q_GdBoc6ikp3JMpAtg", "user_name": "Kristi S.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 1, "funny": 2, "cool": 3, "text": "Little man wanted to come here tonight. We signed a quick waver and rented some shoes. The place was packed at 6pm on a Monday but not overcrowded. We free climbed the novice walls for a few hours - much harder than it looks! It was a great workout too. The best part was how helpful and friendly all the other climbers were. They cheered my 11 year old on and gave him tips. He was smiling ear to ear. Totally worth it, we're hooked.", "date": "5/22/2017"}
{"review_id": "Z8QgqH2Ju4BiwVl1EU5MaQ", "user_id": "KPyFxs8JjC2CbSXfi2f8gQ", "user_name": "María C.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 2, "funny": 0, "cool": 6, "text": "Came here with my daughter and she absolutely loved it. It was her first time rock climbing and even though she was tired she did not want to stop. I was able to belay her, even though I am super pregnant, not an issue at all. The rock climbing is great, they have different routes and levels are catered to everyone from beginners to super advanced professional climbers. Lol. The staff is very friendly and always happy to answer questions and offer assistance when needed. The day pass is very reasonably priced and I love that you can rent the equipment, convenient for people who will only visit once, which I doubt anyone wouldn't want to come back. Rock climbing is the best coping skill for stress and a lot of other things. I definitely recommend this gym to anyone and everyone! I'm even considering getting a membership, well I've kinda decided I'm getting it because they have gym equipment and child care, oh and of course rock climbing is a big plus.", "date": "2/13/2017"}
{"review_id": "6Gw-qbU9OO2fm2UGkFXbDA", "user_id": "5LypDVOKyHz_9yHoyByi8w", "user_name": "Mari S.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My best friend, who has recently picked up climbing as a hobby in LA, suggested we go here while visiting.  The atmosphere is very laid back. The employees are super friendly.  Everyone is more than willing to \"show you the ropes\" (pun intended).  We got our belay cards and hit the top rope climbing walls.  There are plenty of levels to challenge even the most experienced climber.  We made it up to a 5.7 (which I'm proud of for my first time ever).  There are also boulder walls and a fitness gym area for members who want to get in a good workout without the walls. If you go in before 3 you can get the early bird special ($18 for all-day pass and rental equipment). There're beverages available for purchase as well as a coffee station for use.  All in all it was an epic experience. I feel like spaghetti and probably won't be able to move my arms for a few days, but I loved it!!", "date": "5/3/2016"}
{"review_id": "BQObBLGSdH7mlfxjESNdcg", "user_id": "EUIT7csXRm0k8AAgkJQAuw", "user_name": "David A.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "What a great facility. We took my 5 year old daughter Miss #Danger... her middle name... true story... to the Sunday Funday kids belay. It is 15$ gear included and she can climb for an hour with someone on the staff belaying. We have gone twice now and both times the staff was amazing. Both friendly and just the right amount of encouragement. They didn't just let her quit when she wanted to they encouraged her to continue. Also when she couldn't compete a climb they were not annoyed. She loved both of the members that were belaying.The facility has a gym as well as several climbing and workout areas. We will definitely be back! Go #Danger Go!", "date": "4/26/2015"}
{"review_id": "w3O2fmJSM889Ie9OUZAZMg", "user_id": "OvO4GnQ82MUZQOUpYucegw", "user_name": "Zann S.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "We just went this morning as a birthday gift to our 11yo that loves to climb but has no rock climbing experience. We just did an hour of the kids climb and had a blast. We had Angie and Becca as our Belayers and they were so great with our kids. Cannot wait to go back! But seriously, those girls were great with the kids and were always answering our \"beginner\" questions and didn't snub us away cos we weren't experienced. Such a great first experience. You guys have a great gym and we can't wait to come back and do the ICC so we can belay our kids anytime. Thanks guys!!!", "date": "4/10/2016"}
{"review_id": "X6TwUxIs_4tHrXMScPSQXg", "user_id": "7fok758lACRr06asgNR_BA", "user_name": "Paul B.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 4, "funny": 0, "cool": 1, "text": "I've been a member going three days a week for close to 18 months now, and MetalMark has essentially become a second home to me. The gym is spacious and well kept, the staff are excellent, and there's so many cool perks make the pricey initiation and monthly membership fees worth every dollar.Now before you consider joining, it's handy to know that you're in for quite a few startup fees. First off, there's a $100 initiation fee for new members, but if you come with the person that referred you, or if you're a student, that fee is cut in half, so it's not way too bad. Then there's the first month payment for your membership, which is $55/mo. normally, and $45/mo. if you're a student. Those are the basic startup costs, and then for gear, it's up to you to see if you'd rather buy or rent. Renting is only about five dollars per visit if you rent both shoes and a harness, though I'd recommend buying, since it'll save you a lot if you're consistent with your climbing. Now the main drawback to buying your gear at the gym is the fact that they don't have a return policy, which is kind've lame, so I'd recommend going to REI in RiverPark (quite a few of the staff at REI happen to be rock climbers who are also members of MetalMark, so there's a major plus). Buying your gear will cost anywhere between $60-$150 for shoes (depending on what kind've shoes you get), around $80 for the harness, and $15-$20 for a chalk bag, plus $2 for a block of chalk (you can just buy your chalk at the gym).It's up to you to decide if all of that is worth the hefty startup investment. To me, it seriously was. I just bought all of my gear right when I started up and it was worth every penny. The members here are the most friendly people you'll find in the city of Fresno who are so encouraging and will help you to achieve your fitness goals and improve your climbing technique, the staff are very knowledgeable, they have all kinds of classes that are free for members such as yoga classes, fitness classes, climbing classes, 6am climbing boot camp (if 6am and boot camp are your jam), the climbing workout and climbing equipment are well maintained, and I just need to mention one more time, the members of this gym are seriously the best people you will find in the entire city of Fresno. I am not kidding. You will meet all of your new best friends if you come here regularly.I have no idea how to describe it, but this gym has an uncanny ability to create such a friendly and encouraging atmosphere between all kinds of people. Everybody is so laid back, and cool to talk to. You can just walk up to anybody to ask about anything and forge an instant friendship within just a few minutes. You won't find this level of friendliness anywhere else in Fresno.Anyways, I hope this review was helpful. I've been here for a fairly long time and it has been worth every dollar I've spent here.", "date": "9/14/2016"}
{"review_id": "TFDnLroGqXTlbvMzjb0PjA", "user_id": "cxFlPD8T1awUdr2aCZU4Mw", "user_name": "Mari H.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "So fun! I actually didn't realize how Afraid of heights I was until I got there! Still fun nonetheless though! Everyone was so nice and helpful as well! Can't wait to go back!", "date": "3/6/2016"}
{"review_id": "TGmGIfUN1dYsXSk1_EXn9w", "user_id": "MCaxmaEVZHTbncxAv-VNsg", "user_name": "Kyle C.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "One of the best walls I've climbed on. out of the gyms in Rhode island, Washington, and California this definately ranks top 2 only downfall is there are no autobelay lines but most people there are friendly enough to belay you if needed", "date": "9/16/2015"}
{"review_id": "MDGnkDqqGqPp5dDutJYTAw", "user_id": "m9laIOve-n28ygZOQGQW7w", "user_name": "Theodore C.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 3, "useful": 1, "funny": 2, "cool": 0, "text": "Was in Fresno for a few days so I figured I would go check out the climbing gym here.  The staff is nice nothing really stood out in customer service, but overall they answered my questions I had and assisted me with w.e else I was looking for.  Has to be one of the most up kept gyms that I have been to.  Locker rooms are clean, the mats are clean, and you don't have random chalk dust floating around throughout the gym.  You can also rent out a locker to store your belongings in, which I thought was pretty handy.   Came here by myself so you're kind of only limited to bouldering.  The routes itself are neatly layed out and are easily identified and distinguished between other climbs.  The problems seemed to be fair in grading and the holds all seemed to be maintained and still gritty.  However, I thought the bouldering section was small especially when everyone is crowding and sitting around in the bouldering area.  Not a big fan of how they do their padding.  You have a base layer of padding and then bouldering mats across the area to further assist you with your falls.No auto-belays.  If you're like me and coming in by yourself and on a day-pass then you really don't get much out of the gym.Overall, clean gym but there's a lot to be wanted if you are spending $20 for a day-pass.", "date": "4/8/2016"}
{"review_id": "Tnlcxfa6LmJC5NsLuRY9-A", "user_id": "pDoktMlrM0Ek8ePH-phsRQ", "user_name": "butch g.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "Love this place. My wife and I have a great time every time we go there. Friendly staff ready to assist even the beginner climber. We will be going back on a regular basis.", "date": "5/23/2015"}
{"review_id": "HY5kHNqfoOmw-mtdDyyM7A", "user_id": "949QEWiICcLkhjTAmeaCjA", "user_name": "Galen H.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 3, "useful": 2, "funny": 0, "cool": 2, "text": "Overall a pretty good gym, with positive nice people. I have been climbing there for a couple of years now and have a good feel for the place:Positives:-Route turnaround is very fast-Not too crowded-Good mixture of route styles: face, stemming,overhangs, cracks-For the most part friendly and helpful staff-Exercise equipment and fitness classes come with membership-Not my cup of tea, but lots of social events: partner finder, BBQ, etc. -Opens early and closes late.Negatives:-Occasional unprofessional behaviour from some staff, i.e. sleeping on the couch, walking around without a shirt, hanging out with friends, loud and disruptive, playing inappropriate music (gagster rap-swearing, - kids in the gym!)-Grades are hyper-inflated. A 5.11a at metalmark is a 5.10a/b in reality, 5.12a more like a 5.11a/b. -Slackline, cratestacking and acro yoga can get in the way of people climbing.", "date": "12/1/2015"}
{"review_id": "K_YkXbi-PnR55W_JxMQ1Tg", "user_id": "PdW27k57NFeUwKA8ChLKBQ", "user_name": "Darleen H.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Probably the best thing in the whole city of Fresno!...however I was slightly disappointed with the amount of bouldering problems because there isn't a large selection. I will say however, the top roping selection is great and that's a plus considering that Yosemite is super close. The people I met there were friendly and making friends while passing through the town was an added bonus.", "date": "7/19/2016"}
{"review_id": "l-Ih-R5RR3GOZDJkSrWpjA", "user_id": "RkSj0Sr9Sqf4I-5ZeC3_dw", "user_name": "Scott O.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "I just moved to Fresno and have been a member for a few months now. I've been a climber for about 6 years, and I needed a place in town to pull on plastic and stay strong. As far as commercial climbing gyms go, MetalMark is really good. The routes change frequently enough that you don't feel as though you're just climbing the same thing over and over, but they also stay up long enough that you can work your sick gym project for a few weeks. I really like the fitness options on the side, the weight area, and the general atmosphere in the gym. It's laid back and friendly. The couch, magazine selection, and free coffee encourage you to hang out and spend the day. The one thing I wish they had is auto belays so that you could come work on longer stuff as an individual rather than just boulder. Also realize that the route grades are absurdly inflated. Most gyms will inflate by a grade or two to make you feel good about yourself, but MetalMark's grades are so ridiculously inflated that I don't even know what to expect myself to climb when I get out to the crag. There's just no basis for comparison. All in all, though, this really is one of the better commercial gyms I've climbed at. It doesn't have the circus-like constant birthday party atmosphere of some, and it isn't a constant parade of blowhards constantly trying to establish a pecking order. It's a great, laid-back place to work out and meet other climbers in town.", "date": "8/26/2013"}
{"review_id": "00kYg3c86yqkMEph_TtbOA", "user_id": "Qb-vi9SOgGNVLhCG-QaxXw", "user_name": "Lisa L.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I've been going here off and on almost a year now and officially joined over four months ago. Gym offers a variety of things beyond climbing but the climbing is so addictive and fun I am suprised how infrequently I use the equipment. Enjoyed all fitness classes I've tried. Great atmosphere, friendly crowd and they do great occasional nevents like breakfast and themed-parties.  All in all, very glad to have this option for climbi g in Fresno.", "date": "6/22/2015"}
{"review_id": "rz-cFpG6T4UoeUh9W8eLRQ", "user_id": "AQw5VjrDsON_P-v5bqCYyg", "user_name": "Jeanette G.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time the day after Thanksgiving, I was instantly hooked. I have already gone 5 times and  became a member yesterday, Christmas present to myself. Staff is great and the people here are amazing. I was initially scared to become a member because I wouldn't always have a belay partner. But when I was there this past Sunday, the front desk announced that a climber needed a belay partner, I offered and so did another gentleman.  The members and people here are amazing and approachable. They even cheer each other on. They give advise and share techniques. I look forward to using all the other options this gym has to offer. I am anxious to learn some techniques and meet some new friends.", "date": "12/23/2016"}
{"review_id": "oJaF7qjgzKGq5BBVMnHprA", "user_id": "hMD0a5h0EcRZJ4K3-wIQJw", "user_name": "Francisco M.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 3, "useful": 5, "funny": 2, "cool": 0, "text": "If this is your first climbing gym and you are a Fresno local, you'll probably love it.  I mean you don't know what you don't know.  If you are a semi experienced indoor climber, you will find the gym small and lacking in fitness equipment.  My biggest gripe was that this gym has has NO AUTO-BELAYS.  Sometimes you don't wanna boulder and can't bring someone.  Sometimes you want to speed train.  Sometimes you wanna throw your kids on one.- please get auto-belays.  Then 4 stars :)", "date": "5/28/2014"}
{"review_id": "ISkSPExU0MH3oy3S9WDBFQ", "user_id": "OSLm3CH9W36Wkmg-zIMvPQ", "user_name": "Adam C.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Another excellent installment of the Touchstone climbing gym family.  Metalmark is staffed with super friendly folks, has spacious facilities and reasonable prices.  The bouldering area is moderately sized, with a few bulges and prows and problems up to V10 or so.  The lead walls are really impressive, and there are a ton of top ropes.  There is also a full weight lifting area, a studio for classes and cardio machines.  It never seemed too busy or crowded when I was there in the evenings.  Did I mention friendly people?!", "date": "2/25/2015"}
{"review_id": "5R4227hdUTIFmNx_lAGB9w", "user_id": "LWEaTYOpyNBOcqTYQsS1dw", "user_name": "John D.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been going here for over a year now. The staff are absolutely excellent! The overall atmosphere is one of comradery and support. The gym is kept clean and there are new routes up frequently. (Just don't change em to fast. Nothing worse then being about to conquer a difficult route and it's gone the next time you come in.)  The routes are a blast and the walls are high. It has a nice bouldering area also. Metal Mark also has enough weights to satisfy anyone with some cardio machines also. The staff was even nice enough to switch the tunes from rap to metal after a polite request. I travel all around the nation for my job and I have climbed in many indoor gyms. This is one of the best I have ever climbed in.", "date": "6/18/2016"}
{"review_id": "76EX8jOkhnEasCQXMmp4xw", "user_id": "TxAtywdkCqjp5FAF0djjog", "user_name": "Jenn- E.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 4, "useful": 0, "funny": 1, "cool": 1, "text": "Great environment, helpful staff.  I was chaperoning a group of 5th graders and I found that the staff was very patient and supportive with our group.  I also like the fact that they have various levels of rock climbing and for the individuals who were not as athletic they were still able to participate.  Overall the kids had a great time!", "date": "5/13/2014"}
{"review_id": "Qo8kvlcak7O1nTlKkPpsKg", "user_id": "31vkWpJgYq9vox5txJRTCg", "user_name": "William M.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I started climbing about a month before MetalMark opened, and immediately went down and signed up even before opening day.  My 4 year old daughter joined with me (only $0.01/month).  We have been regulars ever since.The gym is excellent.  The cardio and weight training equipment is top notch.  The locker rooms, etc are extremely clean and nice looking.  They also have numerous classes (Zumba, etc) but I have never taken one.  The obvious focus of the gym are the climbing walls.  The routes aren't just straight up, they curve, arch, jut out and back in.  There are adjustable cracks, permanent cracks, etc.  The routes are changed regularly to keep the climbing interesting and new. The true shining gem though is the staff.  They are extremely friendly and professional.  They greet you by name when you come in.  One of the staff members even sat with my daughter and drew pictures so I could climb.The membership rates are a bit expensive compared to traditional gyms, but that is to be expected in a climbing gym.   Ropes wear out considerably faster than a dumbbell does.  I highly recommend this gym.", "date": "1/5/2012"}
{"review_id": "0POpccpCEX6W6NmxNGu27A", "user_id": "3bjTlYVXae-Of7Jv35Pzwg", "user_name": "Cici C.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 2, "cool": 0, "text": "Prices are steep. Pretty great place to hang. I did rock climbing for a couple hours and then finished the evening with their yoga class, the room was packed, but overall great. I will be back again.", "date": "2/26/2014"}
{"review_id": "io8rZnIaiS5qzqJhj7zLvg", "user_id": "PnJHDNouognmLXLVkIrI_Q", "user_name": "James E.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 3, "funny": 1, "cool": 0, "text": "Without a doubt the best rock climbing gym in the central valley.  The staff and members here are great and super friendly.  Only negative I would say is the dues and fees are fairly pricey, but I'm kind of new to the sport, and I think the costs of climbing at this gym are very competitive compared to other gyms.", "date": "5/1/2013"}
{"review_id": "6W_5sFY7jBEuF003bMxY8w", "user_id": "BthiZ8JVUORMxIfsx_iRrA", "user_name": "Mike E.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Tried it for the first time about 2 weeks ago for their intro course (bought a livingsocial deal). Haven't been faux rock climbing in a couple of years and remembered how fun it is after we came here. My wife loved it so much (her first time too) I got the 10-visit punch cards. Friendly helpful staff, made learning the \"ropes\" easy and fun. They clearly love their jobs (I'm jealous - wish I liked mine as much). Cool that the punchcards are good at all the locations since we visit Sacramento and San Jose fairly often and their gym locations are nice.", "date": "11/25/2012"}
{"review_id": "JBykoYUbuFMVBzZlMzlyig", "user_id": "jlGvpWoFPLlZmFvwSzvx_A", "user_name": "Grant P.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hands down, the best indoor rock climbing in the valley.", "date": "4/20/2013"}
{"review_id": "0Mddaw4AjyCYZRNtkkZRQw", "user_id": "e00s5Yfjb7kYzB9daujnTA", "user_name": "S O.", "business_id": "7n-LZwcoUizVGH5lDgMpVA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I've been a member for about a month.  When a friend invited me to a film festival hosted at the facility, I was immediately drawn in.  I like that I, as someone who CrossFits predominantly, I can go in once a week, play on the rings, lift some weights, do a few intervals on the rower, and climb.  I'll also say that, after years of martial arts and now CrossFit, the monthly price is extremely attractive.", "date": "1/6/2012"}
