{"review_id": "Z01IatrhYs2nf6xiRbIMFg", "user_id": "x-byOLPGWucqAIRaBOgwJQ", "user_name": "Sonja T.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I give this place 5 stars because they were basically one of the original climbing places, and they have been providing a good (even if small by todays standards) experience for decades.I first climbed here in about 1992, and really enjoyed it.  They inspired me to take it outdoors, and do more than rock scrambling.  I still enjoy a trip back here now and then.  Great vibe.", "date": "10/14/2016"}
{"review_id": "E4Mk-l0djUbMR_yjqJG-yQ", "user_id": "us1QZNEl5a96iFeNRC6BXA", "user_name": "Addison M.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "This is a rather small rock climbing gym. They have bouldering combined with top rope as well as lead climbing. Just keep an eye out for children when you are lowering yourself especially on lead climbing in bouldering! It was $13 to climb today and good all day. When you get there you have to fill out a liability waiver so you can't blame the company for your wrongdoing. They have auto belays around the gym also just so you don't have to take the class. With that being said you'd be limited to just a few climbs and bouldering. Don't forget to check in to get a $5 coupon for yoga and fitness classes. The gym itself is rather compact but the place has lots of climbing routes ranging in difficultly. I've been here a couple times and Kevin always helps me out and is very knowledgeable about climbing and is super friendly every time I come in. The place is great for children or even adults wanting to try a new hobby I'm just make sure you are paying attention when you belay.", "date": "1/12/2019"}
{"review_id": "WPgoFWZ3yhMzRKW8bqdmAg", "user_id": "FfSJimwOurRO0tnNVOShag", "user_name": "Carolyn B.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Nice spot in convenient location, but unfortunately they rarely reset and there's always a bunch of kids running around because of after school camps. Reasonable price, but very confusing process to cancel a membership. Nice space to have a gym but poor organization", "date": "4/22/2019"}
{"review_id": "EYk0JoU6r64Nm7PPN2_I6Q", "user_id": "2sKfipB-l7NdL-xp94KX_A", "user_name": "Janice C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 3, "useful": 4, "funny": 2, "cool": 1, "text": "I've been to Rocknasium a few times and I find their prices reasonable and their climbing routes extensive and challenging. I think I usually pay $12 for a day pass + $7 for gear rental, which isn't too bad!I think it's just a little too disorganized though, sometimes you have to wait awhile to get help and when you are assisted the employees can be a little rude. And the amount of chalk on the walls just seems to have accumulated for a LONG while, I was coughing up a storm after an hour of climbing. I think it's a good option if you're in Davis, I came here a couple times during school, but I wouldn't go out of my way to come here since there are other options in Sacramento.", "date": "2/27/2017"}
{"review_id": "PW3yErspXkBY7ZAGWM2YYA", "user_id": "bZtpUkAfRKzil16SwBCyoQ", "user_name": "Alex S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Try to find a coupon online, I found one that let me check out gear for free if I paid for a day pass! This gym is very nice, on the edge of Davis along highway 80, kind of tucked away by itself. Because of that, the crowds never got really big, the biggest group I saw was maybe 6 people together for a class. There is plenty of wall space for you and your friends to climb along, and all the paths are marked very clearly. I was stuck on a path for awhile with my girlfriend, and one of the staff was friendly enough to come over and offer us some advice. Of course, his advice included some maneuver that I was incapable of, but thanks! Nice try!", "date": "9/27/2017"}
{"review_id": "CNyrkn8vhJAZZ5fUyXK5qg", "user_id": "Sdx8ec2eMEO64wNEs1xMCA", "user_name": "Ivy N.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 3, "useful": 5, "funny": 1, "cool": 0, "text": "Went here for my first rock climbing experience ever! Coming from the Bay Area where we have places like Planet Granite, this place is very small in comparison. However, I felt it was a great place for my friend and I's first time.We got the $15 all day pass deal on Yelp which includes gear and a belay lesson. $15 for the whole day is totally worth! I personally don't know if I would really come back without some kind of discount deal tbh. They also have camps for kids where a bunch of 3 ft tall munchkins show you up on the wall.Brady(?) was the guide that helped us and she taught us how to belay each other and how to do it safely. At first it was pretty nerve wracking being so high up and trusting your partner to not drop your 100+lb body to the floor. But after a few runs up and down the wall, I was definitely more at ease. Brady also checked up on us as well throughout the day to make sure all was well.There's a good amount of wall space for you to explore on. I will say I feel their bouldering height limit on the wall seems a bit short, but then their floors didn't seem super cushioned to safely catch you if you went up any higher. I will say my friend had a problem with the height of the walls. He's over 6ft, so he literally got up the wall in about 5 strokes. A great first time experience, and Brady made us feel super comfortable and not super noob.", "date": "2/7/2015"}
{"review_id": "z0HYmKsRFep2NnfYdp_mOA", "user_id": "dTZFpOJtqfU1nkclrMraeQ", "user_name": "Jenn V.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here 3 times now, and am a beginner at climbing. The prices are very reasonable. The staff here is always friendly and so willing to help. It took me awhile to figure out the right shoe size for me because I was between sizes. The employee was patient and even gave me different brands to try to see if the fit was better. I paid the $10 for a belay class and it wasn't busy so I actually got a 1-on-1 lesson. The only downside is that UCD Climbing Club comes there mon/wed/thurs at 8pm so if you are there during that time, it's almost impossible finding a place to climb without waiting 15+ mins for a space. Other than that, it's a great place to climb!", "date": "10/24/2017"}
{"review_id": "STanXQVdE0zNSiLdtvhNwQ", "user_id": "q57yOu2K2BLEsLpbTPaWjw", "user_name": "Winnie T.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "My bf took me here after work on Monday around 5pm. The place was pretty busy and it got harder to climb with more people. It was my first time at a rock climbing facility so I don't really have any to compare it. But this place seems well-kept and the employees are friendly.Since my bf is a member, I was able to get in with his guest pass which waived the day pass fee of $14. We did end up paying $6 for my rental shoes (they are smaller than your street shoes in size number).There's a Yelp deal for $15 that includes a training and entrance fee (good idea if you want to try it out and isn't going with someone that knows how to rock climb).There are 3 automatic belays. One wall dedicated for bouldering. And different levels of difficulties for belay.Overall, I would come again with his guest pass. My arms were sore the following day. :p I think it's a cute date place too. Definitely family friendly since that was what I saw most the time there.", "date": "12/5/2013"}
{"review_id": "uZfLFBj7k809gazsNQFP6A", "user_id": "7GVcxbhW2GAiSydbXT20Zg", "user_name": "Lizette R.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I absolutely love this place!!! Was feeling a little scared to try out rock climbing but I was finally persuaded to do it and I'm so glad I did! Staff members are really welcoming. There are plenty of walls but I do think this gym is on the smaller end for rock climbing gyms. Depending on level their routes are challenging and really work you physically and mentally. You will definitely have routes to boulder! There are a few auto belays which are extremely fun and convenient if you don't go with a partner! I recommend going with a group and getting trained to belay other climbers! It makes it more fun and engaging to practice team work! Highly recommend!", "date": "7/7/2014"}
{"review_id": "SYYFy0xjeGjVn56bUYIuoQ", "user_id": "V2jfGKQGu4Y9nB6gi21_uA", "user_name": "Joey B.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was our very first time at a rock climbing  gym and man was it a great experience here at Rocknasium! We were very pleased with the help we received from the staff. Very clean and safe gym, the staff is always walking around watching and answering any questions anyone had. Major props to the guy that helped us from the beginning! (I'm sorry I forgot your name!!)", "date": "5/21/2016"}
{"review_id": "Ns9Ku0L500xrGCURKlcKZA", "user_id": "QA7IaX81E4lAR7D60zObQg", "user_name": "Carolyn N.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "My boyfriend purchased a Living Social deal for us a long time ago but never got around to using it. He saw that the expiration date is Dec 31st and was like, oh man we better use it now! The voucher consisted of a belay lesson, rental shoes and day pass. Great offer! (I saw that yelp offers a similar deal for $15) We came on a Friday afternoon and it wasn't that busy. There were only a few other climbers there but they were on different parts of the gym so it didn't effect our experience much. I can see this place getting really crowded and how that can pose as a 'problem'. Climbing is harder than it looks. Rita was the one that gave us our belay lesson and she was very thorough. I was able to belay my boyfriend as he was climbing and vice versa. I climbed the wall about 4-5 times and I was tired afterwards. A great workout! We are actually really digging this and regretted not using the vouchers earlier. He was talking about signing up for membership but we shall see ;)", "date": "12/7/2013"}
{"review_id": "DTM75TrAtE66vH1IxFFXVQ", "user_id": "H5qSLPvQO988UX8qbAIzag", "user_name": "Ryan C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "There are horrible dates where you just feel like you're \"talking to a brick wall\". And then there's Rocknasium. This wall keeps you wanting more--a second, third, fourth date. It's got a bunch of nice routes for bouldering too. For a day pass, it can be pretty expensive, especially with shoe rentals. This place is definitely much more worth it to become a member, especially if you're gonna come even just once a week. What's great about this place is that if you become a member here, you get hella nice perks: extra member-only hours, potluck dinners and free lessons, like aerial yoga. It is a bit hidden though. You have to drive past Dutch Bros. in South Davis and to the very end of the street where there's a parking lot for the building. 5 for walls that make you fall for 'em.", "date": "8/19/2015"}
{"review_id": "sT5H_wxK8vgmmU9ikSzp1A", "user_id": "wWZocoDFjsIsksZNkisvcA", "user_name": "Liz M.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "I guess this place is a good deal for monthly members. However, I was a daypass walk-in (just wanted to boulder a bit), and they've raised prices so they're as expensive as Pipeworks for way less facilities. For the same price, I don't know why you would ever go here over Pipeworks for bouldering, given the amount of wall-space and angles, but I was in town and had been ok climbing here in the past, so I thought I'd drop by...The place was full of like 40 kids in a daycamp, since it was a weekday afternoon. Which would be fine, but in addition to covering most of the easy walls, the kids were using the only overhung bouldering section to practice rappelling. I started warming up on a v0 there and was halfway up when the girl running the camp was like, excuse me, xxxx is about to rappel, as if I was being rude (not true, he was waiting for her to set up first so he could rappel. They could have waiting the extra 60 seconds for me to finish the boulder at the very least).This continued every 2 minutes or so so the wall was pretty much useless. I got my daypass refunded and on the plus side the staff were pretty cool and nice about it, WHEN they showed up. However, they are clearly understaffed to deal with walk-ins during the day, so it took like 20 minutes for the desk guy to finish his belay class and help me out. During that time, 3 dudes showed up to climb, waited, and then gave up and left lol. I guess they don't need the revenue but seriously if you can't hire enough staff to handle visitors or keep wallspace open, dont say you're open to the public, it's kind of a rip-off to charge people the 15 dollars to climb on the one open (vertical) bouldering wall...", "date": "7/31/2015"}
{"review_id": "bNXlHZ0Y7GcYYzsrh1KFsA", "user_id": "a4qL4H_Jlwdc6hk_KZ0FMw", "user_name": "Alex W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great local rock gym!The Staff is very helpful and friendly.  Everyone that climbs here is willing to give a quick spot on the bouldering wall or jump on your belay. Definitely a community vibe here, and you will start to recognize the people who climb regularly. Come on Tuesdays for the potluck!", "date": "4/8/2016"}
{"review_id": "qDV0SUltILObSdWEjOXfVA", "user_id": "bNrX9563lEilgEjkTahk6Q", "user_name": "Arda S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 5, "funny": 0, "cool": 1, "text": "After climbing here for almost a year now, the place is consistent with my previous review. However, I dropped a star because of the kids. I do not mind that Rocknasium offers birthday parties and etc but they need to work on their supervision. I have witnessed many times where kids were under people who are bouldering, where they can get trampled on or crushed. Also, when kids randomly climb the wall while someone is in the middle of their route. I'm not blaming the kids because they do not know any better but the staff needs to be able to watch and supervise. Rocknasium needs improvement on staff and designated duties.", "date": "2/18/2015"}
{"review_id": "zMfg3jz0PDQHDiMVB60r-w", "user_id": "JggphOM7FIbvUyPcsfcNTw", "user_name": "Michelle L.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Returned again with a Livingsocial deal, $14 for an intro to rock-climbing package (a $32 value which included an adult day pass, rental harness, shoes, belay device, and the safety lesson), this time with the bf. Nice that Yelp also has the similar offer for $15. Came in midday on a Thursday so it was pretty quiet and not busy at all. Waiver was easy to fill out on the iPads, clean bathrooms, lockers for member and cubbies to stash your personals as well by the weights and system wall.  Props to staff member Chris who gave us the belay lesson (auto/self belay and with partners). Remember, P-BUS! This time I even tried more than just toprope -- actual bouldering and even really made it to the top (was it really 20 feet high?) of three different routes, ranging from class 5-6. Attempted a 7, but didn't make it all the way up, even rainbowing. Much improved once I put faith in the rope and got the idea out of my head that I had to climb back all the way down.  Also had to remember to use my legs more than my arms. I also learned that I am not the best belay partner for the bf -- even with a 50-lb sandbag attached to my harness, I still got lifted off the ground when lowering him back down to the ground, haha. Maybe I needed a second 50-lb sandbag! Overall it was a very fun several hours that afternoon with only about 5 or 6 other climbers using the gym. I definitely was sore for a few days afterward but would love to try climbing again soon!", "date": "4/20/2015"}
{"review_id": "qsmYN8Pp-5P1dn4Dy7PaKg", "user_id": "p3VRiatrT9F6GTLOnYmSUQ", "user_name": "Jocelyn W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "I went to Rocknasium on a Saturday afternoon for the very first time and it was amaaaaazing!Pros:-Incredibly friendly, informative, and helpful staff! I never got the name of the guy who helped me and my pal out, but he was super patient with us and made sure we understood how everything worked.-Wonderfully squishy floor that was really fun to walk on. I felt pretty darn safe jumping off the walls.-Fun, non-crowded routes! As a wee beginner, I found the beginning bouldering problems kinda difficult, but they were really enjoyable- it was basically a puzzle you have to solve with your body.-Sweet spot to people watch: it was really motivating to watch other patrons do all sorts of neat tricks while resting upCons:Literally none that I can think of. It smelled vaguely of feet upon walking in, but it's not a big deal at all. My only regret is that I never came here as an undergrad and missed out! 10/10, would climb again.", "date": "3/23/2015"}
{"review_id": "VT3K16m0zIoGUCAxrglU4w", "user_id": "V8DFe4dTILtAewmJVrEyJg", "user_name": "Mandi K.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "Went here for the first time with my friend. And her son and let me tell you, it is hidden in some scary looking area in Davis. Okay granted I went when it was the evening and it was pouring rain and luckily my friend had gone before but this place is nestled in the back section of buildings and honestly, I would have never found it.    So walking in, all you see are walls of wonderful sections of rock climbing. They even have a small work out area I guess to prep yourself? Any ways, my friend and I got a literal 5minute lesson on how to belay each other. Seemed pretty easy but also nerve wracking because your partner has to trust that you don't make a mistake and drop you on your head. So I got to go first, and for my first time I was nervous and thinking it would be terribly hard. Nope...got up that wall in 1min. All of them were pretty super easy. I didn't try the slanted wall because although I can lift myself up with my arm strength with a parallel wall, lifting my entire weight with my arms were NEVER going to happen.     I also tried the belay rope that you use on your own. Basically you let go of the wall and it catches your weight and lowers you. Have to say I lost a few years of my life on that thing. So when you get to the top, you are suppose to trust the rope and just drop. Well I tugged a bit and it did not take my weight. So as a newb, I panicked. I got about most of the way down and then tried, lol. Second try, climbed down again. Finally my third, I let go, seriously lost the ability to breathe for a second out of pure fear that it was going to malfunction and drop me completely.        Overall experience, excellent. Also make sure to wear work out clothes. I just got off work and was completely out of place in jeans and a nice sweater. Lol", "date": "1/1/2015"}
{"review_id": "lB0FtIZmYPsYfOB58ONMQg", "user_id": "qiqr4txS9zQwAp4PVMPCFA", "user_name": "Kevan B.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great place for my kids to spend the day! Helpful, courteous staff. reasonable price and easy access.", "date": "3/30/2017"}
{"review_id": "32t_B5OzROrl6SWy5nDPyQ", "user_id": "8J2LPOQ04MQ5QJKcT6qmeA", "user_name": "Elody L.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this gym. You walk in and you're greeted by genuinely pleasant staff. I feel like they treat their customers more like young climbing padawans rather than no0b money pits. I never got the salesman vibe from anyone there. Even though there are people of all abilities climbing around throughout the gym, they are very kid-friendly and offer group parties, classes, private lessons, workshops, summer camps for kids, special discounts for members, first timer start up packages...the list goes on. There are other gyms that may be larger with other amenities, but this gym has the chill, climbing community-oriented atmosphere that's totally inclusive and inviting, and you can feel yourself just being emersed into the spirit of climbing culture.", "date": "7/2/2017"}
{"review_id": "BrdoxNRHwEltUK4v8TaToQ", "user_id": "FmoHNtcIw6reY7IX5eV97g", "user_name": "Cathy N.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 2, "funny": 1, "cool": 2, "text": "This place is fantastic! My sister booked a reservation here for my niece's 10th birthday party, and we (kids AND adults) had a great time!We had a table area reserved for the eating and gift opening, which provided great space for storage of all party supplies and personal belongings. Plus, it was nice for the kids and adults to sit and chill for a bit while taking breaks from climbing/billeting. BTW, they allow you to bring your own food or have food delivered. If you want pizza, they actually have a discount deal with Woodstocks Pizza! Unfortunately we didn't know this beforehand, but it's good to spread the word!I think the guy's name was Kevin, who provided instructions for billeting and climbing for the adults and kids in our party. He was GREAT. We received detailed instructions, and he was very patient with everyone. I now know how to billet! (You'll learn, that's the term used for providing support and rope slack for a person climbing).The kids were all over the place, climbing this wall and that wall. They couldn't get enough of it. The price of booking the party allowed the kids to roam freely, and also were given special shoe and harness rentals. This was a great alternative birthday celebration to making a mess at your own home or going to the park. Can't wait to have my own kids' b-day party like this someday!", "date": "5/13/2014"}
{"review_id": "jhSxlPA3qSzaS0p_XDA0Xg", "user_id": "E6OQCxtMPLvxcHIxMU_BOA", "user_name": "Annie H.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super friendly staff and the belay class was short and easy. We had 2 free day passes, so the total price including belay class was a great price. This rockclimbing gym is smaller than another one I've been to, but it has way more beginner routes which was perfect for my partner and I. We went on the weekend and although there were a good amount of people and a kids birthday party, there was lots of room to climb and wasn't noisy at all. Looks like the kids there had a blast too and they really enjoyed the automatic belay. They have a secluded tabling area and climbing paths for the kids birthday party so they weren't getting in the way or being noisy. There is also a small gym and workout area. I'll definitely come again!", "date": "4/18/2016"}
{"review_id": "Y85l8gGwJ8AW6dWMydCV8w", "user_id": "tdfKdI3XJVbR9aawyYVlFQ", "user_name": "Trish A.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Earlier this year, Rocknasium closed the doors on their twenty-year old gym. Not to worry though, they re-opened a brand new climbing environment just a few doors down! The team at Rocknasium outdid themselves, taking great care at crafting the perfect new gym. Just look at these progress updates on their blog: blog.rocknasium.com/cate…And since the grand re-opening, they not only upped their routes & facilities, they've gone above and beyond by hosting weekly seminars on advanced training topics, and continuing their always enjoyable Tuesday night themed potlucks. In addition, they've been having great (and FREE) sponsor demos out the wazoo, including Scarpa, Evolv, Black Diamond, and everyone else!The new gym still has the great \"old gym\" feel of a climbing community built around friends & family. This probably sounds cheesy, but it's so true, and definitely matches the small town vibe of Davis at large. Rock on, guys!", "date": "8/15/2012"}
{"review_id": "IQ0svIyFgKbM9ZMKDgD3nQ", "user_id": "jOS1glZS0cgk0Gr0YdRnDg", "user_name": "Grant R.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Rocknasium has some of the best culture I have seen at any business. While it is a fantastic place to climb and get in shape, it is the atmosphere that keeps me coming back for more. Rocknasium offers it's members a friendly environment with plenty of extra social events.The rating system tends to be tough (sandbagged), so you will 'crush' when you go to other gyms.Also, membership is super-cheap especially for students so you may even save money vs a regular gym.", "date": "4/29/2015"}
{"review_id": "QQaOJb92xae5kIeBcUuoAQ", "user_id": "SUH_sygsnNkceQMefns2ZQ", "user_name": "Gloria P.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 1, "funny": 2, "cool": 1, "text": "I am 20 years old and I am (slightly) afraid of heights.So maybe coming here wasn't such a great idea... but I fell under college-level peer pressure and succumbed to my friends' goading. Let me tell you... I was shaking and sweating and freaking out when I was just barely 2 feet off the ground. But honestly, all of the employees there really do a great job instructing you and encouraging you, no matter what age you are. My fear reduced me to a whimpering 5 year old but with their reassurance and thorough guidance, I felt much more at ease.I still think I'm not quite made out for this kind of stuff... but I think it's a pretty fun and interesting experience! I wish though, that their premises was a little cleaner and more organized, and maybe not as expensive, but otherwise it was fun. I think I'll go again if I can find a really nice groupon deal or something.", "date": "2/22/2014"}
{"review_id": "Lhl-1uHzz2WZewWkofv_3g", "user_id": "W--gOkyr_5sXMImYM-fDGQ", "user_name": "Michelle S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "My daughter and I visited this rock climbing gym and we both felt that it had a very negative atmosphere. The employee who was working was very pushy and overbearing. They had boulder problems set up under the top rope area which led to the area feeling very crowded and disorganized. Definitely not going back. We will be looking out for another gym with friendlier employees who are not so pushy and a better organized gym. Huge disappointment.", "date": "11/26/2016"}
{"review_id": "tirq2IRNgl7DB5bPt5eKvQ", "user_id": "OvRquXmAgsg5pufcYACZLw", "user_name": "Jamie S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Loooooove this place. I didn't realize how much I appreciated Rocknasium and it's staff until I moved away from Davis. I know that padded floors are more expensive and harder to maintain, but my local gym now has rocks down and it really sucks have to fight over pads while bouldering. The staff are very nice and informative, Boz and Jay were especially awesome, reteaching us how to use an ATC when we went back up for Picnic Day (my current gym is all grigris). And the open environment gives you a nice relaxed feel. I would sleep there when I visit if they would let me.", "date": "8/26/2013"}
{"review_id": "YkfvcDQck_n1rrSMEWqxwg", "user_id": "z7Lzy8EgkAFvTs9rr4KyXw", "user_name": "Trevor L.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Had a Groupon for this place so I got a great deal. It included a Beginner Belay class, shoes, and harness. Boz was super nice and explained how to belay and climbing etiquette very clearly. He was very approachable and was very encouraging to my friend who was kind of scared of climbing. Definitely will return.", "date": "10/6/2013"}
{"review_id": "9u7g25Ql-EeJGWCltdKDEg", "user_id": "HDoMnqWbdZjHPrG9g7SmVg", "user_name": "Elizabeth N.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I go here sometimes on Aggie Wednesdays, where UCD students only have to pay $5. It's a SUUUUPER chill rock climbing gym. They don't make you take belay tests to let you climb, although I'd advise you know how to LOL. I think they might actually let you lead climb without any kind of test either... My friend says that it's more of a small community gym where everyone looks out for each other, that's why they're not so strict. The walls aren't too high like some bigger gyms. They also have auto belay devices so you can climb without having a partner.", "date": "10/23/2013"}
{"review_id": "Vx-KSEA1Ui2Jxj3Jui1H7Q", "user_id": "2MbWGk_Q06kxWM3VSd4dYw", "user_name": "Kaori M.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 1, "funny": 1, "cool": 2, "text": "We did the yelp deal here about last month, and it came with a short lesson on how to rock climb and how to use equipment. The staff were very informative and willing to help if needed! There are about 10-14 places around the rock climbing areas to start your climb, where 3 of them are ones where you do not need a partner to hold your rope! It was $30 for both of us, which fit our tight budget as poor undergrads. :)The only glitch here was the location, but thank goodness, I made my boyfriend ride my bike to look for the place, which was in a location where it was a bit difficult to find.Anyway, very cool place to start if you have not tried rock climbing. My boyfriend came up north to visit me from socal and wanted to try something interesting, so I suggested rock climbing since he's never tried it. He was so exhausted after participating, lol.", "date": "6/20/2013"}
{"review_id": "5pmn4Rge1gB--eAbKE7G5A", "user_id": "wHI4kBjaAZWg-SYaRU-j3Q", "user_name": "Nathalie N.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Great place - Great Walls - Great customer service!I'm a huge fan of indoor rock climbing. Although the place is not that big, the routes are challenging and can provide hours of entertainment. The prices are cheap and parking seems adequate.Thanks to I believe her name is Dianne? Diana? I'm sorry if we forgot your name. You were really nice and patient with us in going over the techniques of climbing and belaying. Awesome customer service! The place is really clean too! We'll be back! We had a lot of fun.", "date": "2/26/2013"}
{"review_id": "5jn-TsLF2ar_6lVXcMVFDg", "user_id": "0Nwt0xORMN45IW7yVRc8eQ", "user_name": "Bistro33 D.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Truly wish I could remember some names, but a few Rocknasium folks stopped by to see me and suggested myself and a few others come out to their spot and try some rock climbing. I can't believe I hadn't stopped by before because this was way too much fun! It was a great way for us to get out and do something active right here in Davis. The staff was SO friendly, you can tell they really like what they do. Will definitely back to do some more bouldering.", "date": "1/4/2016"}
{"review_id": "5LL3m7mulM0R2QgmJWTuAg", "user_id": "f4JITBXK517mXfopMTDS1g", "user_name": "Henry R.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Staff was very accomodating, I brought with me a party of 5 which included 1 clingy baby and 1 emo child. They were able to help with everything.", "date": "6/30/2015"}
{"review_id": "mVB1oRnmQSRTGeqVVqU-TQ", "user_id": "jGz0C7TXgqx42HmhSbvtVQ", "user_name": "Gordon Z.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was my first visit to RNI had a great time , the staff was friendly and on point. Be prepared to workout lol", "date": "10/29/2013"}
{"review_id": "73bKfOr21wXLymVtUH7Ivw", "user_id": "bIN--wo5ipr-IJvr04XJrQ", "user_name": "Tim T.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I love this place and I would definitely come back. Its not super crowded and it have plenty of places to climb. Some you can climb without a rope, of course its not that tall but you get to climb upside down.What I really enjoyed about this place is that it is friendly to new climbers as well as experienced climbers. The walls can be as easy or as difficult as you want them to be as long as you follow the color tape, which indicates which route is the hardest.The place is clean and well ventilated. Two huge points when you have sweaty people climbing rocks. They have a small gym (which they let me and my friends use and mess around with), a water fountain, and some benches (which seems they would use if there were a small birthday party present).", "date": "12/17/2012"}
{"review_id": "orLGkjRwRew447JVZ9l9lQ", "user_id": "llfJvpkN55XGXDe_uORY6Q", "user_name": "Dan L.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my happy place in Davis! They've got:-Excellent, varied route setting. -Bouldering, top rope, and lead routes. -They provide you with ropes for lead! -Knowledgeable, friendly, staff. All around excellent.Student memberships are incredibly affordable. The gym's on the smaller side, but there's always a new route or problem to work on. As a grad student, I work unpredictable hours and it's awesome that the gym is open until 11pm. When I move away, the Rocknasium will definitely be what I miss the most.", "date": "7/9/2015"}
{"review_id": "duwpXHhJj38ZZT7L1M_0BQ", "user_id": "cRMngGNCd7vVYhCXD7UXRQ", "user_name": "Daphne P.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "Not liking the new management.  Rocknasium used to let my 4-year-old climb at a reduced rate, but the new management starting charging her like an adult.Cancelling her membership was difficult.  They had me come in, in person, 5 days before the end of the month I wanted to cancel.  Three months later I realized they were still charging me.  They insisted that I had never actually cancelled my membership.  They asked me three times if I was sure I filled out the form.  They refused to refund me my $162.  They offered me a credit which is funny because A) I was cancelling my membership B) I am moving out of the area.My daughter is a little monkey with amazing upper body strength to size ratio. In other words, she is a great climber.  I bet lots of little kids are.  The problem is, Rocknasium doesn't have classes for kids her age (older kids like 6 -year-olds are fine, I think), so I have to take her climbing, but I can't climb while I am belaying/watching her, so a family membership isn't really appropriate.", "date": "9/16/2015"}
{"review_id": "UKANn6U1QITdIF2jOi4r-g", "user_id": "93yK4mOmLXwE1aFXlQGAVw", "user_name": "Crystal H.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I brought my son and his friend for the first time today. When we arrived, everyone there was helpful, friendly, and knowledgeable. The boys were having a blast until one of them accidentally released the retractable rope. Long story short, I was at first disappointed by the way a staff member responded to the boys when they informed him about the rope. However, when I explained my feelings to another staff member, I felt vindicated and to my surprise was even awarded a pass to return. And if that wasn't enough, the other staff member who I was upset with even let the boys help with some of the other ropes, making them feel more included. Which to me was very encouraging to see that they were not just seen as annoying children, but as people with the potential to grow and love the sport. Overall, it was a great experience and my son and I cannot wait to go back.", "date": "8/6/2015"}
{"review_id": "JVeQH40aZQWF62vNrkw89w", "user_id": "A3EZXhbNouCSGGubr75kpw", "user_name": "Shelley W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "I heard of a lot of good things about this place, but I was a little bit disappointed. My friend and I waited for a good 5-10 minutes to be helped when we first got there.. when there was only like 5 people climbing in the gym that day, the staff members were just talking to themselves. The ratings are a lot different from other gyms I have been too, which made it harder for me to solve bouldering problems. BUT that can also be a good thing, so it makes you try any of them! I just wasn't really into it that much because I prefer to know what level I'm at.Oh yeah and the routes aren't as tall as other gyms.", "date": "11/27/2012"}
{"review_id": "83-5skgdScYqhDXOYNLM3Q", "user_id": "9KiBIOk1saBHAWIihb_OQg", "user_name": "Erin W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great first time climbing experience and deal.I recommend this place. To avoid damn filter I also would like to add that the belay instruction was detailed and set us up for a great climbing experience.", "date": "3/30/2013"}
{"review_id": "aY__PL_EGi3uUPSdu_rltw", "user_id": "aAyi19osT3hWdFu-L-PW6g", "user_name": "Lily S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a really fun alternative to working out in a regular gym. They do provide weights, yoga equipment, and one of the managers told me they're expanding soon to have some workout machines.But the real magic of course is the walls! And the super squishy foam floor. They change the routes pretty regularly so you won't get bored.Also- free massage on Tuesday nights during their weekly potluck!", "date": "1/21/2013"}
{"review_id": "eKfuOlwyV7BJa-x0WlF_qA", "user_id": "i3AabnjjwS5iqxZcHs8qnw", "user_name": "Jake J.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I really enjoyed my time here. Got a screaming deal through Yelp and decided to take a date here. The staff was super helpful and patient. It isn't the biggest rock climbing gym, but I thought it was challenging enough.", "date": "4/7/2015"}
{"review_id": "yG5JkiVtjlrG6g2x3Fw84w", "user_id": "Aot6O6837fjxb9X6U948BA", "user_name": "Julia S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome place had fun but AC may be having issues here , on hot day door was open for ventilation as overwise it would  have been even stuffier. Dusty surfaces a bit, also, away from areas where chalk is around.", "date": "4/22/2016"}
{"review_id": "Ofp3qJaHTPGRqpYrC2rIlA", "user_id": "5nDEG7vLBf16QKscBgViEA", "user_name": "Sabrina R.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 3, "funny": 1, "cool": 3, "text": "\"The gym that took me in...\"I haven't been climbing for very long (about 4.5 months) and had started at another gym in the area, however I needed a place that was more affordable and had a more laid back atmosphere - enter Rocknasium.I came in right as the new gym opened, but it wasn't the brand new, clean facility that impressed me; it was the staff. Honestly, I walked in told the person at the counter that I was looking for a new gym and if it would be okay for me to wander around and talk to other climbers. She did one better and said if I had my climbing shoes I could jump on the wall...WOW! Super friendly...and it's not just the staff, the climbers there are also very friendly and laid back.I resolved to start climbing here at the beginning of December (2011) and haven't regreted it at all. The bouldering area is a great mix of easy to very challenging (gotta love overhangs). The circuits are great too! As for TR and lead climbing, \"yes\" the rating system is different (but climbing is climbing and as another yelper pointed out; the YDS can be subjective), and \"yes\" the routes aren't as tall as another gym, but it's still challenging and you can always do laps.Another great feature is that the staff is willing to belay you if you don't have a partner, so you're not just relegated to the bouldering area.Oh! Can't believe I almost forgot about the Tuesday night potluck! Every Tuesday is like a party with food, lots of climbers, and fun! If you're looking for a good night to get introduced to the awesome-ness that is Rocknasium, I highly recommend Tuesday.LOVELOVELOVE ROCKNASIUM!!", "date": "1/7/2012"}
{"review_id": "6bOTUIw3mxidydzS4IqcRQ", "user_id": "eX3Gp_h5naN0GtwpDcQ89A", "user_name": "Stella J.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was so fun. I enjoyed climbing those mountains and I lost weight thanks to that and got skinnier. It was fun too. I touched the ceiling 5 times!", "date": "2/17/2015"}
{"review_id": "2STf_9bTO3QVMi1l2UnuTg", "user_id": "iO7x9hb4sNtW_raOEkr1bw", "user_name": "Teresa C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This was the gym I learned to climb in. I was a member for about 6 months before I graduated and moved back to the bay. My boyfriend and I went to this gym 4-5 times a week just to hang out. We were both 5th years and most of our friends had graduated. Rocknasium had become our new family.The Tuesday potlucks were more about eating and chatting than climbing. It was a great way to build the community. The regulars are all really nice and a couple of them took us under their wing. We were still newbies so watching people climb the ceiling was awe inspiring.Yes, the gym is small and the walls are short, but I think they make do with what they have very well. Their routes are challenging and interesting. I'm a member at PG now and I find that a lot of the routes are ladder routes and I miss some of the complexity that Rocknasium puts in on the easier routes. Also, I find that the routes at Rocknasium are rated harder than PG, but that varies gym to gym.I really miss Rocknasium now that I've left. It was really my family away from home. If you join, I would definitely introduce yourself to the staff and the regulars. It'll be worth it.", "date": "8/15/2012"}
{"review_id": "z4XVH51xO-nHP2yuG4emCQ", "user_id": "ngqJlKljTdqV8SmIOPnt5g", "user_name": "Jennifer C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was my first time rock climbing and was honestly a little scared. Lol we got the $15 deal and the instructor was awesome! Made everything clear and funny. Once we were set... On we climbed! I must say... Rock climbing was pretty fun although I came out of it looking/ feeling like a t-Rex... Lol there are constantly new routes on the walls if you want a challenge. Great place to chill and have fun!", "date": "7/6/2014"}
{"review_id": "a1QH9R1ECskvVyW5Ugbmug", "user_id": "jKBq2FGhVv7uTaJIlSErTQ", "user_name": "Bruce W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "So I paid for a day pass so I could boulder and then was told from the manager that I'm not allowed to boulder due to the competition. I said I want interested in any competition and he accused me of trying to \"game the system\" and cheat for the comp. Then another chick said I would grease up their holds. WTF.", "date": "11/14/2014"}
{"review_id": "vSpzwSOFjb4G_wlnhcj11g", "user_id": "j5ezF5mEGpnDwdTmAHci7Q", "user_name": "Albert W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 4, "funny": 0, "cool": 4, "text": "Went to a beginning class here yesterday (the classes are ad hoc, just call them and they'll make one for you).  Instructor was the kind of teacher that wanted to make sure you had a good time as opposed to giving you lectures.    There's pros and cons with that method (I was concerned that I was going to miss something important).   He made sure that our group was okay and took the time to explain things.   As far as the climbing goes, it was awesome.  My first time up the wall was pretty scary and you have to \"trust\" your partner not to drop you (which is also pretty scary).   After I got used to it, I went exploring.  There are a lot of walls and a lot of ways to go up the wall.   I think many people with different skill levels can find something here.     If you haven't tried indoor rock climbing, why not?  Just go!Famous for: College oriented, sporty vibe, indoor rock climbing", "date": "8/4/2008"}
{"review_id": "dI8y7ndmlyH9c11NKse2dQ", "user_id": "cvDtIGzpEkuoP8BTNS7mNw", "user_name": "Erwin N.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The staff here is great. They have Tuesday night potlucks! They also have a unique route system that is structured  to give you a great workout.", "date": "2/3/2012"}
{"review_id": "DNfldYdb1XsVLrxLMmWu0g", "user_id": "yj5FjkrlwGsTQiJlxMn2HA", "user_name": "Alex Y.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "WOW! I lived in Davis for half my life and have been to Rocknasium a few times while living there. The walls are great, and they have a visible board updating patrons about the new routes. I go/went to boulder, and the variety is good. It's a bit hot during the summer, but that is the joy of being in Davis during the summer -- unbearably hot and dry summers.The reason why I'm WOWed though is that I was back in Davis for about 5 days and wanted to climb (basically each day). I didn't have a membership with the gym but decided that the most cost-effective option was just to buy a membership for a month. My decision didn't matter though, because the dude there (Charlie I believe) decided that it was ludicrous that I'd have to pay for a whole month when I'd only be in Davis for five days. He spoke with the manager?/owner? and they gave me a better offer for the five days. Great customer service.And now I can't believe that I didn't take advantage of the Rocknasium more when I was living in Davis.", "date": "7/21/2011"}
{"review_id": "j8FPeDK_Nk3GIJZnnf3t1A", "user_id": "ujRVt32kNa_6_Khph46ftw", "user_name": "Amanda R.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had my son's 11th Birthday party here.  This is the first time I've sent out party invitations and gotten immediate RSVPs  - FROM DADS.  I scheduled the party in person to check the place out.  Staff was great explaining the set up, etc to me.  Got to bring in our own food, decor etc.  Was assigned two picnic tables in a little nook.  They also have a fridge & freezer on premises to store ice cream, etc.Party started with getting the kids set up (ages 11-7).  They got a safety brief from the the staff & were released to boulder (free climb) or use the auto belays.  Willing parents were then given Belay instruction.  We had 4 belay adults to 8 climbing kids, which was a good balance for our group.  Adults took turns belaying each other too.  All in all, I think we had a great time.  Majority of the families talked about going back or just getting together for another party there in the future.  Be aware, all climbers have to be present to start the party, so late arrivals can cause delays for everyone.The gym was busier then I expected.  However, it seemed like a good mix of regulars and families and everyone \"played\" well together.The staff was good at keep an eye on all belayers and nicely enforcing safety rules.  Thanks for a great time Rocknasium!PS  Based on comments from some of the moms, I should mention that regular climbing appears to do fantastic things to your physique.", "date": "11/30/2014"}
{"review_id": "AU_GKDtTKWEiArxgDyCO1g", "user_id": "VJ2WtiPCNetzM37G2dNvpw", "user_name": "Dustin S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is my first and only rock climbing gym, but it was such a different activity with plenty of potential to keep my body on new p's and q's. Relaxed & straight-forward with great staff!", "date": "1/30/2015"}
{"review_id": "zvFdBi9eRpcqFfdMzUmlfg", "user_id": "nbBGFGuDY_GqD_P2ihXDGQ", "user_name": "Elliot M.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "So many good things to the gym including:Friendly staffThey make 3 bouldering circuits that encompass the gym every few weeksFree sunday workshopsTuesday potlucks rockrandom dance parties/dodgeball gamesThe only reason I don't give it 5 stars is due to it's size.  It's a bit on the small size and doesn't have as large of a bouldering 'cave' as I'd like.", "date": "6/26/2012"}
{"review_id": "v_mLinAe1M81UuvEjZfwFA", "user_id": "-HjKt6bgqsTA5Ctu9RvNRw", "user_name": "Sharon O.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Having been climbing at the Rock for a year or so now, I can say it's a fantastic climbing gym with a familial atmosphere! There is a real sense of community at this gym, which is no surprise since the owners Carter & Marko are regularly around, especially on Tuesday night pot-luck nights!Did I mention they have a BRAND NEW GYM?!Seriously. Fantastic look, HUGE boulder wall, and some ridiculous lead climbing!They also hold Climbing Competitions - The Crankin' Series - every year and have summer camps and other group programs available.Prices are incredibly reasonable -- $34/month for students -- or come on Wednesdays for $5 Aggie nights.There are now Yoga classes offered in the Yoga studio on site, too!I cannot say enough good things about this place. Love! Love! Love!", "date": "11/27/2011"}
{"review_id": "Z8fc2ULT3peYLp4vTXuc1A", "user_id": "JiZaqFNWMG2uyaNSqsv7GA", "user_name": "Kev C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Our family has been coming to the gym for years, and I must begin this review my saying how exceptional and supportive the staff has always been, especially to the kids. We've attended birthday parties, saw the summer camps in action, and watched the junior and youth teams train and I knew early on that I'd love to have my kids grow up in that environment. I consider myself an avid climber, and here is where I got my start. There is a wide selection of routes and relatively steady rotation in of new ones. It is smaller than some of the more recent gyms to crop up in the area, so some boulder problems will cross the lead and top-rope areas to make the best use of space. At some places this would be a huge drawback, but you will not find as large a population of friendly, helpful climbers as you will here. The regulars here will be happy to hold off while you start your climb, and I've never felt uncomfortable asking the person working the same problem as me for a little beta.BBQs most Tuesday nights, an awesome series of comps near the end of the year, and as family-friendly as you're going to get in town: the place can't be beat!", "date": "7/2/2011"}
{"review_id": "IPsYDtszDxaH8iPLKjaAPQ", "user_id": "IWf9EA5lQ70pIJZRjRx4gg", "user_name": "Jessica V.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "My friend and I bought the Yelp deal that only applies to new customers ($15 for a Day Pass, Rental Equipment, and Belay Safety Class).  When we entered the place, we were immediately greeted by a staff member named Boz.  After verifying our vouchers, Boz was quick to provide the waivers and equipment.  While we were reading and filling out the waiver, another staff member came to greet us.  He was very enthusiastic to know that we were first-timers (unfortunately forgot his name, so I'll just address him here as \"the enthusiastic greeter\" xP). Once we had the gear on, we went right into our belay safety class with Boz.  With the enthusiastic greeter observing the class (made up of just my friend and me), Boz provided clear and concise demonstrations on the basics.  I was impressed that he even remembered and used our names, as he helped us out.  Before we knew it, we were ready to go.  Despite climbing for only about two hours, I had a great time and definitely got a workout out of it.  The only things that I would be nit-picky about is the slight difficulty of finding the place, and how it would've been awesome if it were more spacious with more walls.  Like I said, that's only me being nit-picky and it actually isn't that big of a deal overall.  With the staff making us feel comfortable being in a new environment, providing personal assistance, and consistently making sure we were doing fine even after the safety class, the minor cons are overridden.  That is why I ultimately rate Rocknasium five stars.", "date": "1/10/2013"}
{"review_id": "1YI3_LZp0YgSPwn-J8rOfw", "user_id": "tQ24XUgk_Ck8xqBejzGKgQ", "user_name": "Zandra T.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Rocknasium is a cubicle in comparison to Planet Granite and City Beach. Nevertheless, I had a blast bouldering here! This place also offers a great deal on belay lessons. I went with a friend using the deal and found the instructor to be very friendly and supportive. The staff was very helpful as well. Be on the lookout for this place though because it's real easy to pass by if you're driving. Could easily miss it if you're not careful! I think they also remodeled the place so I'm looking forward to coming back real soon!", "date": "8/11/2013"}
{"review_id": "U5qC1P9wExiwmAs2c-UY7Q", "user_id": "F262q88zc7zsdEeNCzcA0A", "user_name": "Siobhan S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hey! Rocknasium is awesome. I've definitely only been here as a supervisor with the family I nanny with, but the girls always have so much fun and the employees are super helpful and patient when it comes to explaining safety and proper etiquette to the kids. I'm not much a climber myself... (Although I wish I was I'm a little nervous to just show up on my lonesome) But I'd almost get over that to climb here. It's has a small community feel and you see lots of people helping each other out. Definitely a good place to go if you're looking for a different workout.", "date": "2/7/2011"}
{"review_id": "oDOxbcrE4qBfc3zpUo6wJA", "user_id": "Uz6m99elNkHUFtu-Eu7bfg", "user_name": "Yasmin K.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "It's pretty pricy for the small size. Should be cheaper but I guess it's not too surprising for somewhere in Davis. Many times there are no employees at the front desk and we have to wait a while for assistance.", "date": "12/7/2014"}
{"review_id": "NA1BJzggpzanppF8uWJl0w", "user_id": "MUJ44YhlZ69KjiLZfYt6Lg", "user_name": "JonCasey I.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The rating system for this place is an eye sore and I feel in consistent. There's so many different routes that it can be pretty confusing trying to stay on your own. A little on the pricey side for a rock climbing gym. In my opinion. The belaying mounting system isnt my favorite. They use a single loop, which provides somewhat of a rough decent. But. Overall a pretty fun place.", "date": "4/1/2013"}
{"review_id": "5Fz86kMMykKx4z6m6hjsWw", "user_id": "ybaIs6A3RuKzxtd_WQf6Pw", "user_name": "Christine H.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place. It's fairly compact as rock climbing gyms go, but there are enough routes to keep you busy for a good three hours. On nice days, they'll open up the big warehouse door so you can climb in natural lighting. Do beware the mosquitoes, though. On weekends, multiple kids' birthday parties can make the space pretty crowded. And very loud.Don't forget to bring your student IDs (UC Davis or not) to get some nice discounts. Aggies climb for $5 on Wednesdays and Fridays!Also: the water fountain is hidden in a corner behind the bouldering wall. Very cold and refreshing.", "date": "1/22/2011"}
{"review_id": "VTkXGK4_DC3Btt3f4AjrLA", "user_id": "7uqChNaXXMassBSOfIk8nQ", "user_name": "marie c.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "went there recently for a birthday party.  Not so sure they are equipped to handle large parties.  They had very little staff on hand.  The staff are great-very nice and helpful but it's not a place where you can have a large party.  I saw other smaller groups and they were having a great time.   there is plenty of space inside to accommodate all the people, but they did not provide much room for all the party guests who were there at the time.  2 sets of long picnic tables for over 20 kids and their parents is just not enough.  I think that it's a great place for small groups and individuals, but not for large parties.", "date": "3/23/2015"}
{"review_id": "ToKf6HEbvE0o7nlb_VHHqw", "user_id": "Av2NnBARZOB-tcupdJOiIQ", "user_name": "ST D.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I used to go here as a kid, and it's always been fantasticthis was one of the first if not the first climbing gyms in Cali, and it's a staple of Davis life", "date": "8/6/2011"}
{"review_id": "Fiyv--dmXvWMOeQBai38yg", "user_id": "s-7mD0a29ffPpoWWjABYzA", "user_name": "Michael H.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I go in just about every day. The staff here is super friendly and always willing to dish out advice on the routes.", "date": "8/15/2012"}
{"review_id": "EFwPy61XwvXy0ydZj5JF1w", "user_id": "-46YrKu6PceCUcHcnN02KQ", "user_name": "Mark W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "Of course it's nothing compared to bay area gyms like Planet Granite, but Rocknasium has a bit of charm.  The routes are reasonably good and pretty fun, and the four autobelays are really nice.  They have a weird rating system for their topropes, but even the YDS isn't the most objective of ratings, so it doesn't really matter.  Overall the climbing is pretty good given the size of the gym.  The employees are very friendly as well.The reason I am giving it two stars is because of the kids.  I have been three times, and two of these times, little kids were running around unsupervised everywhere.  I understand that Davis is a family town and that a gym like this needs to be family friendly, but it's distracting trying to boulder and having to look underneath you to make sure you're not going to fall on any little kids.  While this can mostly be attributed to bad parenting, the employees need to enforce and implement a policy for dealing with all these kids - maybe make each kid have an over 18 supervisor.  If parents want to take their kids to a place to run around, let them go to a playground.  This is a gym for a sport that can be really dangerous if the proper precautions are taken.Bottom line, this place is 4 stars without kids but 1 star when there's a bday party or summer camp - not a fun place to climb if you're a serious climber. I hope the employees here become stricter with children or someone is going to get seriously hurt.", "date": "8/29/2011"}
{"review_id": "0yeFvP9jZiKaZXG_Bh1ctw", "user_id": "nxMC4BxL8juf9MLkcvO1Yw", "user_name": "Jonathan A.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "I'll be honest, during my tenure at UCD there were very very few places in Davis that I enjoyed. The Rocknasium was my salvation.Sure it's small and it doesn't *look* like much, but the employees are nice (unlike the frigid non-climbers behind the counters at most Touchstone gyms), the routes are fun and well thought out, and the cheap monthly membership made the place a second home. Also there's (or at least there was last time I was there in February) a strong sense of community there, which you can't force or simulate. A resounding five stars for my favorite climbing gym of all time!", "date": "9/18/2008"}
{"review_id": "ogeWlGzb-RpwdGwVMjUa7Q", "user_id": "xlrUX_n5xsLjeW-3Uuw6Dw", "user_name": "Colin H.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "Went here the other day, good alternative to the ARC. They charge a $10 fee for a belaying lesson, which in my opinion is not worth it. It took all of 5 minutes, and they didn't even tell us to check our partner's knots/equipment before we started climbing! But maybe it was our instructor, it was her first time teaching it - but I would still say 10 dollars is a little too much for the amount of information offered.I've taken the rock climbing class at the ARC and these walls are more challenging mainly because there are more walls. They have a room specifically for bouldering and it looked like a tiny cave, which was pretty awesome. There are slanted walls for beginners ( I bouldered across these walls simply by walking across, it was funny).And of course they have more advanced routes, there was one that looked like an archway covered with climbing points, it looked tough to climb. $12 all day entrance$3 for shoes, $3 for harness$1 for chalk bag-The people behind the counter were very nice and friendly-Plenty of different walls for a lot of people, and for people of varying skill level-Fun & good exercise!Overall 4 stars (only because of the 10$ belaying lesson, and the fact that the ARC offers rock climbing)", "date": "5/28/2008"}
{"review_id": "_U7OSM0z4h8jnZKX8FFkSQ", "user_id": "z0dQunkr8Ykg_46lUVD7cQ", "user_name": "Chene P.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We got the ticket for only 15 bucks from yelp. The kids really enjoyed it and even us adults too. The trainors was so good and well knowledged. I really recommended it.", "date": "8/6/2014"}
{"review_id": "aw1W9qhpTgpE5EGhtHDOcQ", "user_id": "rlI_hDtDv9vrMsK2NPDq9A", "user_name": "John F.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great for the casual climber, and has everything you need if you really enjoy climbing. The staff is friendly, and the people that go there are social. Really fun place to climb...", "date": "3/10/2014"}
{"review_id": "jaDcl70UbJLrbDiZ6FbEIw", "user_id": "tcETlzsHTfctwCvSBlez6g", "user_name": "Katie J.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went rock climbing for the first time here and loved it. It's a bit smaller than I expected but the staff are friendly and I fully enjoyed the two hours I spent there.This gym has three autobelays, so you can rope climb even if you go alone. The belay class is brief but helpful if you and your climbing partner are both beginners. Also available are some exercise bikes, weights, and other gym supplies.", "date": "5/26/2012"}
{"review_id": "hBmxyKXTzeLItkI71mdnxw", "user_id": "RwRR4S6Q_FFW9bdnfUbYNQ", "user_name": "Edin L.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "wonderful ppl and great facility! boyfriend and i definitely approve of the music too :)", "date": "8/4/2013"}
{"review_id": "BDV9kAaFPOdIjhCBmoODeQ", "user_id": "4Dh6bsNNLVmztj1rFc3dTw", "user_name": "Chelsea C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went in with my bf and we both had a blast. We had never been rock climbing before and the staff was super helpful and informative. When they taught us to belay, they made it super easy to understand and even gave me a 50 lb sandbag to help hold me down so I could partner with my bf. We will definitely be going back soon.", "date": "4/26/2014"}
{"review_id": "IihvF60jQ4IRn3dYIySNpQ", "user_id": "9mwRVNVj6VsS_hgOhuiSSA", "user_name": "Erica B.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Friendly instruction. Welcoming atmosphere. It was our first time indoor rock climbing and it was a great experience for newbies.", "date": "10/26/2013"}
{"review_id": "zgz_bMKx6ffl9q-SdiaIhA", "user_id": "8ca5ICYUzIEM8v0O1T1MLQ", "user_name": "Leo C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time climbing and had fun. They teach you the basics and set you off on your own. It may not be as big as other gyms, but it isn't as crowded and is clean.", "date": "5/28/2013"}
{"review_id": "Nx7qE-n945h2qKPZKITQ9A", "user_id": "SaLLBWOqxomnAoivv5YwqA", "user_name": "Heather C.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Nice place to get some good, fun exercise in a cool setting. My kids loved it. I really only recommend for those kids over 6 years old. The workers were helpful but a bit idiomatic. A little on the unclean side. Cool place but can get very busy so call ahead.", "date": "4/8/2011"}
{"review_id": "iPpDFhA7qzo5lxgF5p-PMQ", "user_id": "I4tBnQUdTDHIIppyxY7JSg", "user_name": "S W.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super friendly, knowledgeable and helpful staff for beginning climbers, like myself.  Fellow climbers were also very friendly and welcoming.  Learned a lot and felt good.  Definitely worth the trip.", "date": "9/30/2013"}
{"review_id": "U1J2a0jIxJc54YOV8QPxNA", "user_id": "XTAjLG1-BfFzCXKSEcyDHw", "user_name": "Graham F.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Rocknasium rocks!  The owners are great, the walls pose various levels of challenge for people of various levels of skill, the equipment is plentiful and in good condition, the pricing is reasonable, the hours are long, and the people are friendly.  I'm not a dedicated climber, so maybe other climbing gyms are better, but this place does it for me.", "date": "12/14/2005"}
{"review_id": "EDWVdUXRU1WjEYE4l8CK8A", "user_id": "7nlO4U5n4Jc7Y26_tcM1DQ", "user_name": "Jennifer F.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place ROCKS! pun intended. We've gone to rocknasium aboud a half a dozen times so far and are now members. My kids LOVE the place. The staff are helpful, super nice, and ready to show you the ropes if needed. Highly recommended!", "date": "9/18/2011"}
{"review_id": "ykFSO6BmA33FTLJvloAZsw", "user_id": "GdsiHQs2PITlDu5BnklKdw", "user_name": "Liesl S.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Okay, it has taken me some time to get to this review.  Most in part to the fact that I cannot find enough wonderful words in my thesaurus to properly compliment the owners Mark and Carter and their fantastic staff (forgive me if I don't mention everyone here) starting with my son's Climbing Coaches Charlie, Amaya and Fish, as well as Steve, Boz, Peter, Hunter, Alex, (ARGH, I know I am forgetting so many names here!) and everyone else on the staff.  And what a truly sensational job they did on the design of the new gym. Obviously the work of many people who live and love the sport of climbing.  The Rocknasium community has been so welcoming and inspiring to our 11 year old son that I find myself wishing there were more days in the week and less homework to be completed so that he could spend more time building the skills he needs to move ahead in his new found passion.  The Jr. team is a great addition to youth sports in Davis and the Tuesday night member potlucks as well as the Sunday clinics are benefits that really extend the value of your monthly membership.  Bellisimo!  Fantastico!  5 stars all the way :o)", "date": "3/14/2012"}
{"review_id": "xARrD64Z3GlzSxISzYxUHw", "user_id": "3AOS0-dhOaKKfzEAaGhtnA", "user_name": "Chelsea B.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 4, "useful": 1, "funny": 7, "cool": 0, "text": "its a good place to climb.  people are friendly, especially Farris!  the place does have an unpleasent odor, not just a sweaty people odor, and it is a bit dirty.  its been a few months since i've been but i always think they need some more beginner routes, not enough 8's and 9's.", "date": "8/16/2011"}
{"review_id": "DbEgFOkK2C_hu2URk-fsJw", "user_id": "dMtxJayURAS43kTaJO_pmA", "user_name": "chris c.", "business_id": "oHUJu2Z6uw3mfSTY_uOpuA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym. Friendly, helpful staff. Close-knit community. FUN ROUTES. This place is great for kids as well. Overall, worth double the price.", "date": "1/21/2011"}
