{"review_id": "IxsUAuvI3P1i7NgQ5E6BUA", "user_id": "Px5tok68QTDcrI3EZaq4PQ", "user_name": "Ashely S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went here with my friend to learn indoor climbing. I bought one hour climbing session on groupon and it was really reasonable price. There are gym, sauna, climbing place and place for kids so, I could do various things in one place. Today, I learned rope climbing for one hour and I completely knew how to do climbing. It was really fun and I loved it.I recommend you here if you like climbing or exercise.", "date": "3/2/2019"}
{"review_id": "UHxHNZ0SxHY4akI-1tH8kA", "user_id": "_-8hl8y5ReDQE5aEEv3IYQ", "user_name": "Claudia C.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "4 stars because it's a great facility with friendly staff and great climbing walls! I came here initially for a Yelp Elite event, and came back because I had such a great time! They have a \"Sender City\" area that's full of auto belays and is great for kids AND adults (population: me) to practice on. There's a huge, spacious area for belaying and bouldering* which is kept pretty clean. Shoe rentals aren't bad either. Dropped it one star because it's a bit pricey and the whole facility smells like feet when you walk in, but the intro offer is good (basically comes out to like $10 a session or so), so definitely try it out! There's a sauna and a decent locker and shower area with lotion as well. Belaying = with the cord thingBouldering = without, so walls are shorter", "date": "4/25/2019"}
{"review_id": "P-tJ2r3m6GeYkHKtGqWGIw", "user_id": "hsN1HU_tpXttsfz30Ji6Wg", "user_name": "Sher V.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Finally got to cross this off my bucket list. Although I may have found a new hobby. Took the hour session Intro to climbing class. I would recommend everyone do so before starting out on the floor. I thought I could get away without taking this beginning class. Like how hard could it be to climb, but no, spend the money. They sometimes have a Groupon if you're tight on cash. The instructor will show you how to properly tie an 8/ fishermen's knot, how to belay and other tips you will need to be safe while climbing. These are all life saving safety precautions, so please don't try to skip this session. After, the hour beginning session, they will allow you to climb with a partner at no time frame. Went with a friend and we took the hour session then stayed 3 hours more to climb. We had so much fun and tried some of the other levels. Other tips, I would suggest to get there 15/20 minutes early, as I went during a busy time, so it took about 5 minutes to find parking. There is parking located all around the building and on the street. You will also need time to sign a waiver and put on climbing shoes that they provided as part of that fee. One more thing, loved the staff and the instructor. All very nice! The instructor was very attentive, upbeat and made sure we properly were retaining the material before he let us climb on our own. Would recommend this class to all and can't wait to go back and climb!", "date": "2/2/2019"}
{"review_id": "jTv35JBn1Y5l1N6UCUPJPA", "user_id": "IdFl0SfIdZ52L3sdfA9k_g", "user_name": "Charles P.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Fantastic gym. The first thing you'll notice when you walk in is how giant the facility is. The roped climbing area is what stands out the most (the walls are TALL) but there is also ample bouldering and training spaces (hang boards, campus boards, weights, you name it, it's there!). The route setting is good. Whether it's your first time climbing or if you're a seasoned pro, you'll find something fun and challenging to climb here.Staff was very helpful and friendly during my visit. As a visitor from San Diego, getting top rope and lead certified was a fairly quick and easy process. Of note, if you're planning on doing top rope, all the ropes come with a GriGri attached, so you won't be able to use your own belay device. You have the choice of using a GriGri or tube style device if you're doing lead though! Sender One has their own parking lot but we warned that it can get fairly busy (but hey, it's LA, what else is new?). Sender One is my gym of choice when I visit LA; if I lived in the area it would for sure be my home gym!", "date": "12/21/2018"}
{"review_id": "uh9WNpYDSDHHP9E1Nrh5ng", "user_id": "zk-C0Z2i6Zr3uWRLFo-kWw", "user_name": "Malibu Q.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best rock climbing gym in WLA! We have a membership and best way to spend time w my family and get a workout in! We have also booked the whole Sender City (kids side) for a bday party and the whole class loved it! All the kids had a blast and talked about it for days! Sure positive vibes everytime we go! Staff are so helpful and super tentative at our private party. My ONLY complaint is sometimes its hard to pinpoint who are staff members. Is there any way that ALL staff wears a brighter/ more noticeable shirt? The grey shirts just blend in too much. Just for safety and general help I know who to ask and can determine staff out of a crowd when needed?! Thank you, Sender, for the endless fun and healthy bonding time you've given to my family and I!", "date": "4/28/2019"}
{"review_id": "pi3-1N8MVabgGf8dRt_WSA", "user_id": "M9JDlUWudvrGkLX7AkJ3Fw", "user_name": "Kory A.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 1, "useful": 7, "funny": 2, "cool": 4, "text": "My daughter was attending a birthday party here, and I was extremely hesitant because of my last experience here and the negative comment I received from the establishment.Well, nothing has changed, the kids section was not managed properly,  kids running around all over, crying from getting hurt.  It was a complete disaster.  I am surprised they've been open this long.", "date": "12/18/2018"}
{"review_id": "nvcQHlY4O6VDGk4j3S1Iag", "user_id": "Thc2zV-K-KLcvJn3fMPdqQ", "user_name": "Carol S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 6, "funny": 4, "cool": 4, "text": "The biggest indoor climbing place I've been to. They have so many walls to climb and a section that you can auto belay. If the cost wasn't so expensive, I would be a member. I would love if they offered a daily or weekly rate. The price is the only thing holding me back from joining.", "date": "12/17/2018"}
{"review_id": "vlHR1Db_Kar3vZ3VVkPqGg", "user_id": "TjbzFbntdD2l-WxuWHTAGA", "user_name": "Brian T.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is one of my favourite rock gyms that I've visited.  If I lived in LA, I would definitely have a membership.  The walls are visually appealing, the routes are great, there is plenty of space with separate areas for roping and bouldering, and a fitness area.  I love that there are short and long climbs that offer a variety of ways to train or play with.Come climb and have fun!", "date": "9/19/2018"}
{"review_id": "-KYpRR3C9-kj4MijP8LD0A", "user_id": "rXD_DQwPLnltPSfy620wyg", "user_name": "Lisa B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love the variety of climbs! It is nice to have a fair amount of top rope climbs that double as lead climbs. I appreciate the mix of grades and overhanging climbs. The community is super friendly with a fun mix of boulders, top ropers and lead climbers.", "date": "5/14/2019"}
{"review_id": "FWHLLKn9300k412xRKukbQ", "user_id": "C8YOser4MCSfRREiCMviWw", "user_name": "Er3yn G.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "This is the coolest place I've been in a long time! Was lucky enough to come here for an Elite event. The staff was friendly and felt safe without being over bearing. We got to experience Center City. Which I don't know why it's for the kids, dozens of adults has the time of their lives jumping off things in here for two hours! And then they did a little 101 class with us on terminology, safety, and tying in. The atmosphere here is just the perfect place to work out and bond with friends or make new ones. We finished off the night inThe party room eating snacks. If you haven't been- go. If you have, like me, most likely you'll be coming back!", "date": "12/6/2018"}
{"review_id": "6ukKH92g4QmlxDHaclUB3g", "user_id": "UC-2H6iGfjoySOr2khX4AA", "user_name": "Tim R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for a kids birthday party with my daughter and it's pretty amazing. Crazy climbing walls that were safe for my 4 year old and then hardcore walls for even the pros. I'm pretty sure that dude from Free Solo was living in his van in the parking lot too.", "date": "5/11/2019"}
{"review_id": "ZW4fO5uqhp_NSGc3qnHt_w", "user_id": "XY3EYqtx3qP7wesNNGRiTg", "user_name": "Andrea S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "LOVED this rock climbing gym! I've been to others and this one blew me away. It's humongous and has so much to do. I came on a rainy day and it was a Sunday so it was packed with people. Even then it didn't feel crowded because there are so many levels at this gym that offer all the bouldering & top-rope routes you need. I actually took the intro class to refresh my memory on climbing & my husband and I were the only ones in the class which was a nice surprise. The staff was very nice and knowledgeable. My instructor, I think his name was Josh..? (Horrible with names), was excellent at re-teaching us the basics & made me feel comfortable when he saw I was hesitant to heights when we were ready to climb. Also he didn't make me feel stupid for doing something wrong like others have done in the past.. I've had a bad experience at another gym which made me take a long break from this potential new hobby. I am now looking forward to going back and possibly start buying my own gear! I absolutely love this gym, feels like a safe space for me to explore my abilities. Probably want to take the other classes such as Intro Part 2 or Movement & Technique! Btw I am super sore, my arms felt like noodles the next day.", "date": "2/12/2019"}
{"review_id": "4ydcjvRStJzRR5ByDWhJrw", "user_id": "SL3LVQVIXuO3PYuZSjdESQ", "user_name": "Eriko N.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I went to a birthday party here and my kids loved it! It's clean, fun and my friends put their kids in the summer camp program and love it. I didn't give a 5 star because I see the 1 star reviews about safety... I did see a child trying to put on his own harness clip and he was like 5 years old and some kids just DO not listen when they want to climb they don't know the consequences of not listening to rules. I helped a few kids throughout the party, clipping the rope to their harness safely. There wasn't enough staff to watch the all the kids. Perhaps it would be safer if there were staff at designated walls and they make sure for each kid they actually touch and check the clip before allowing them to climb. The kids are not going to wait around to find an available staff after doing a couple of walls they may feel overly confident and think they can just do it themselves. No no no! They need to wait and get the staff to hook them up!!! But they are little kids! I hope there are no accidents that would be my concern. I know they are doing the best they can but having so many kids running from wall to wall made me a bit nervous. Like I said I think they need staff in their spots in charge of a wall or 2, and check each and every kid themselves. Not even the grownups should really be hooking and unhooking these kids like I did. Other than that this place is really cute, they have a great variety of walls, the kids had a blast and they want to go again! Please keep up the safely and don't make us parents nervous. I loved this place and would hate for anything bad to happen. Thanks for a great time!!!", "date": "4/25/2019"}
{"review_id": "dfHB_F3Khz69pCvDxfL26g", "user_id": "YiJQSKn5BrtWwRhSLBlw8A", "user_name": "B K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Discover. Connect. AND SEND ITDespite my boisterous personality, poor hygiene, and lack of a social life (which results in a majority of my free time spent at Sender)...the team there has genuinely welcomed me with open arms The community at a gym is just as important as the amenities. Creative/inspired routes don't mean squat if you've got a bunch of jerks (myself included) climbing all over em. S1's got the secret sauce that brings awesome folks together and lets em roam free on the most badass training ground known to MAN(& woman). And even more important--gives us a meeting spot to gameplan the next outdoor adventure. Can't tell you how many amazing trips all started at Sender. It all comes back to their mission statement: Discover & ConnectAnd if you don't even like to climb outdoor. That's coo too. They got fresh weights, yoga and a sauna! But no amount of sweat or ohming makes up for the fact that team is some awesome fuggin folk. So get your ass off yelp and go send SOME SHIT", "date": "11/14/2018"}
{"review_id": "KFHw5epnZAifEO4xGI4LIQ", "user_id": "am_iPNcs2Rdbx6hP1opjXQ", "user_name": "Moran L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 5, "funny": 4, "cool": 5, "text": "This place was pretty fun for the whole fam. The friendly and helpful staff is expected at a place like this. I liked the the variety of walls to climb in the kids area, and also the openness of the adults climbing area. They are great about safety here, and the cushioning provided is a nice touch to keeping things safe for everyone. I'd definitely consider coming back sometime, maybe just for the fun of it! Our experience was a good one, and I can only review off of that! They also had some things for purchase at the entrance, like  snacks and drinks, climbing accessories and gear. The place is well air conditioned and pretty cool inside, just in case you get cold easily bring something to keep yourself warm. Located near Manhattan Beach, this place is in a quiet and sort of secluded area of LA.", "date": "3/4/2018"}
{"review_id": "Lvhrm_T_43UpPOK3rKs8Kw", "user_id": "He4byaOwuw0qrIct45LAxw", "user_name": "Heide S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "So after taking our introductory climbing class at Stronghold Gym in Los Angeles, the hubs and I decided we wanted to take indoor rock climbing up as another activity.  We went all out and got all our own gear! I was telling a friend at Crossfit about how much we enjoyed our rock climbing session at Stronghold Gym and then he mentioned an indoor rock climbing facility with a 60ft climbing wall! When I mentioned this to the hubs, he was like NO WAY! We have got to go check it out. So we did! And the hubs and I are in love with this place! Stronghold Gym is a great gym as well but this gym offers many types of different routes such as different inclines and etc.  They also use the Grigri system for belaying which is AWESOME! It sure does help a lot when there is such a big weight discrepancy between the hubs and I, LOL.  Looking forwards to our many climbing adventures here :)", "date": "4/11/2018"}
{"review_id": "N86vcfPYXiCbYhsXnLF9IQ", "user_id": "VpsQEWLeXm5VPJUtY58CaQ", "user_name": "Alex W.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is nice and clean, has a lot of space (high ceilings) and there are plenty of places to boulder or rope climb.  There is a kids area (sender city) to climb with supervision, as well as workout area and machines, and yoga classes for members.  Highly recommended.  It does get crowded in the parking lot on weekdays after 5pm so you might have to park on the street.  Usually is pretty empty if you go early in the morning or before 12pm.", "date": "4/4/2019"}
{"review_id": "SU9hGOvhf8xwbtMrEgeCkw", "user_id": "jQ_UGNZ1ZgtlYVg53QEP0w", "user_name": "Julia T.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 5, "funny": 1, "cool": 4, "text": "My 2nd time bouldering!! Very nice and beautiful gym with a sauna and a very good women's bathroom as well. I came in with a guest pass from my friend's membership.  I paid $5 for shoe rental and brought my own socks.  Large well lit venue with many different options. I liked how each level was marked.  Everybody was very friendly and there are many options available for kids classes and adult classes.", "date": "6/30/2018"}
{"review_id": "gbTNZ-Y9Pq95CX6hbQkwGQ", "user_id": "FZZx1-v3Na7r6ntWrFGLCA", "user_name": "Cisco B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Okay let me just say that this place is life. I've been coming here about 4 times a week for the past six months, and it has everything you could ask for from a gym. First of all, the workout area is great. They have rubber weights and space, so if you want to do Olympic lifts it's totally possible. Given that this is a climbing gym, it's actually a really great place to work out. This is because they have high quality work out equipment, and most people go there to climb, which leaves the workout areas open for me to utilize. Second, they have a sauna, which is the bomb. Honestly I love saunas so much. Wow they are amazing. Third, the climbing here is great. It's very open, and doesn't feel cluttered and crammed in like other climbing gyms. There are bouldering areas and top roping and lead climbing. Overall, this is an amazing climbing gym for sure. I would definitely recommend it to anyone and everyone.", "date": "7/14/2018"}
{"review_id": "zDkCxnRuZrDAZ8ltNAm4xA", "user_id": "F1r12ajD4Ycq4Bth0W3c8w", "user_name": "Christina K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kids loved it here. There was lots of different areas to Climb with different difficulty levels. My kids ages are 7,5,4,2. The staff was helpful and I will come here again.", "date": "3/10/2019"}
{"review_id": "T9BKCmrye7RshY578itjyA", "user_id": "fVILhIglx6RNOXQba5t4kQ", "user_name": "Corabelle G.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 8, "funny": 3, "cool": 8, "text": "Great place for family fun. There are tons of climbing activities for all ages. Its a great facility. Has cardio/workout equipment, a yoga area and an even more difficult rock climbing area. The area for the kids is fairly large and has different degree of difficulties in climbing. Theres also a slide that pulls you up to the top and then you let go and down you go!! It was fun and challenging. Definitely recommend checking this place out. They do book sessions during certain times so call ahead of time and dress comfortably!", "date": "4/5/2018"}
{"review_id": "TLdqBQ7dFTcId4mUce4x7A", "user_id": "LniV8mGWGuWLoJ96dhNVIw", "user_name": "Edwin R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 6, "funny": 3, "cool": 5, "text": "Bought a Groupon for two for an intro climbing course. Our instructor was very helpful and patient. I struggled with some of the knots, but he was kind enough to walk me through it a few times. The Groupon included a 1-hour lesson, gear, and access to the gym. I was very sore afterward, but this really opened up my mind to possibly coming back and doing some more climbs. I can see why people would enjoy it. It's a fun way to exercise. I don't know much about indoor climbings, but this place was quite large. Plenty of climbs at varying levels. On a Sunday evening, there was plenty of room to do your thing. Enjoy!", "date": "9/18/2018"}
{"review_id": "auiw8inM9PanLgiain2HRg", "user_id": "LTxR-lotSWE5JykgdwemSA", "user_name": "Sarah C.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I've climbed here for over 2 years now. I've climbed at multiple other gyms in Los Angeles and this is the best one!", "date": "1/20/2019"}
{"review_id": "kv-RUiOsSFb4XO8oKmNDuw", "user_id": "GmN6Qwo9aK803f7PLH6dVw", "user_name": "Ali B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "Holy cow Sender-Love the quick certs that they do so that you can top rope and lead climb on the best indoor faces in the South Bay. Top rope/Lead:Nice height on the top rope and lead routes. A solid amount of routes ranging from 7-13 or so. Fewer 7-9. More 10-11. \"Turkey leg\" structure is a fun height and had plenty of routes that push solid technique. The best part is that the surface area for these routes is massive and so you are never in a crowded area. There is plenty of space for all!Boulders:There are two separate levels of bouldering routes that are spread out so that you never in too crowded of an area. Plenty of routes for all levels.Training boards:Sender knocks it out of the park with the training boards. You can't even compare Sender to Hangar 18. These are almost always empty too! Can't believe it. Events:They have weekly evening socials so that you can get to know other climbers. They also have classes for lead climbing and bouldering competitions. Screenings of documentary films and other awesome gatherings.Parking:One con is the limited parking, especially during yoga class hours. Wish there was a bigger lot. The parking on the south side of the building is basically impossible for low clearance sedans as you will bottom out before fitting in the spot. Gym:The gym is somewhat limited. A little bummed they don't have schwinn indoor bikes for my triathlon training. Plenty of free weights, TRX, ellipticals, standard stationary bikes, ergometers (rowing machines), and some weight machines. They could add to this area in order to justify the membership price.", "date": "8/7/2017"}
{"review_id": "9bA184LRYqDZr3-SHQdUQQ", "user_id": "7G8TGBxwZUm1nWXnPCsxQA", "user_name": "Mynor S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place. The walls are tall, the features are rad, and the amenities are all top notch. The only thing that keeps this from being a five star review is that the grades are incredibly soft. I understand that keeping the stoke high for noobs is important, but it's also misleading to call a 5.9 climb a 5.10c, or even worse, calling a 5.10c climb a 5.12a. As an experienced climber, I know how to translate the Sender grades into what their outdoor equivalents would be, but if I was a new climber pulling 11s in Sender and tried getting on an 11 outside, I would get in trouble. Sometimes getting out of trouble is easy. Sometimes getting out of trouble requires a SAR Team. For perspective, Sender climbs are basically jug fests until you start getting into the 11s. Outside, jug fests go away at around 5.7. So my advice to management is to please start adjusting grades to be more realistic. At every other gym I've ever climbed at, the setter sets the grade and then climbers take a sharpie and either agree to that grade or check a box that goes two grades in either direction. This keeps things honest.", "date": "4/8/2019"}
{"review_id": "Ua_yE5sgZTObIdZJs4LD9g", "user_id": "iQEvDDuO4GExBmgeviM54A", "user_name": "Bong B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Large facility with a crazy amount of amenities. I'm not too much of a fan of the type of material the padding has in the bouldering area. It makes the holds super dirty and greasy. I felt like members here aren't accustomed to brushing much either so they're pretty disgusting.For sure has the best selection for climbing shoes on sale in the area. The sport climbing section and training section is for sure the best too.", "date": "10/19/2018"}
{"review_id": "bpXO5dcvUoz2vK3vhN76nQ", "user_id": "23GyP9cEACA2yC2qWaV4hA", "user_name": "Fred M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Even here few times on private birthday events. This place is awesome for climbing and other activities. Has lots of options for kids of shy age and cares about safety, which is important! But when it comes to private parties, their service is lacking. So if you're planning a birthday party of any other private event, make sure you are staging on top of them.", "date": "1/5/2019"}
{"review_id": "7ovhyvQ7aihFbCteWMGoRw", "user_id": "e8NNFTLTTwLv4Kkuv2vffw", "user_name": "Suzi S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. There's bouldering, top roping and lead climbing areas. They have showers, sauna, and free towels. Also, the membership pass comes with a fitness area and yoga classes. Recommend to anyone who either loves climbing or wants to give it a shot.", "date": "1/29/2019"}
{"review_id": "5M4tjJ31-SpxvJBztj-6Tg", "user_id": "jshJbfwgGfz440gvc3zFNg", "user_name": "Tsahi A.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 1, "useful": 3, "funny": 2, "cool": 2, "text": "Very disappointed!!I called they said its 29$ for a day, and that we can come, (family of 5)When we get there the price was changed for 29$ per hour!!!!And they said that we need to wait for an hour and a half because they closed for a private party, I ask over the phone if we can come..Not recommended at all!!", "date": "5/27/2018"}
{"review_id": "G09PGZwIBcQ1BRrH2D1bbg", "user_id": "bx9yQ0RBEr03S1hvV271Jg", "user_name": "Amy A.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place ! To practice climbing, very nice staff I really enjoyed my first time here .", "date": "8/18/2018"}
{"review_id": "v2y7VHZ8S2YWA09pbW3G3A", "user_id": "BIigoyHX-W2Y7m0ePiYPBA", "user_name": "Anna-Marie T.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "Amazing climbing gym!! Everything is brand new and there are TONS of routes to choose from. I am strictly a bouldering climber but the massive rope climbing walls make me want to try it out. The work out room is also an awesome set up with a variety of new equipment. The staff here are just as friendly as SNA. Note: if you have a Sender One SNA membership, it works for LAX location as well!!", "date": "4/23/2017"}
{"review_id": "UlJd-JrTnD4IgFGVdCZDrw", "user_id": "yeXNJ8nE9FHaDetDNuA3jQ", "user_name": "Steve N.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "First time visiting yesterday as I thought I would give their 5 punch deal day a go. The gym was quite nice with lots of walls and upstairs section for more climbing needs, along with a moderate sized fitness area. The staff itself seemed a bit uninterested and one particular staff seemed bothered with my question about the \"introductory to climbing\" class. What should have been a simple question and answer on how to sign up for it turned into a difficult exchange and, he appeared to keep his answer short so to get back to whatever he was doing with his co-workers. Didn't get the best first impression as a first time visiter...", "date": "3/27/2019"}
{"review_id": "Ftuwnu8LiuW_EMIvDoX4tQ", "user_id": "q1ZHMpAk69JS6FlMAk6RVw", "user_name": "Lia W.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Wow!! I've never done indoor rock climbing but it's always something I've wanted to try. All of the instruction was a lot to take in in an hour! We went in and we were instructed on how to knot the rope. Once everyone caught on they explained how to remove slack, how to bring someone down and in case of someone falling, to prevent falling further than what is possible.After that you're off to climb the walls! The first time definitely is scary but you get used to it. I can't wait to come back and try the longer wall!", "date": "12/7/2017"}
{"review_id": "ivITDz3ByLkcUVSo8fV_nw", "user_id": "aIOjzTQewV-do6ALIFNAkA", "user_name": "Jane L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Absolutely amazing, massive, tall walls for you to climb to your heart's content!  There are 2 separate memberships -- (1) Sender City is the back side with colorful walls, jumping obstacles and tall slide, which are great for group activities.   (2) There's the climbing side, Sender One, which also comes with yoga and fitness gym (treadmill, etc).   They opened their doors around January, so it's brand spankin' new and so clean, and it doesn't stink like sweat like many of those climbing gyms!  And did I mention it's absolutely massive?!!  60 ft main wall with 85 ft of climbing...  It hurts your neck just staring at it.  With 25,000 sq ft of floor space, you're not gonna be waiting your turn to climb. Their lead climbing workshops are offered at additional fee, if you want to advance in your climbing (workshop offered once a week).   I've been to several climbing gyms around LA, and this one is my favorite by far!", "date": "3/9/2017"}
{"review_id": "a705xxy6yaUNMzzQV4gJcQ", "user_id": "frB9FvxMBWYxrBVs7uhVHg", "user_name": "Philip M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've climbed here at Sender One since last May and it's a great gym.The route-setting is closer to how difficult outdoor climbs are compared to some other gyms in the area, which feels good and will create a more realistic expectation for new climbers who head out into nature to climb.Clean facility, nice walls and fun routes.", "date": "5/4/2018"}
{"review_id": "c8jX5Xp5ehnC9r8G4aZqGA", "user_id": "wKzS1jxCKl_iE7SgB4uBXQ", "user_name": "Stephan P.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 1, "useful": 6, "funny": 2, "cool": 2, "text": "Quick Summary: The Rock Gym is one of the best nation wide,  but due to the lack of awareness and supervision from staff this gym is a very dangerous place for guest.SenderOne is one of the best climbing gyms in the nation. However due to the complete lack of on the floor supervision from staff there was constantly, at all times, members engaging in dangerous and disruptive behavior the entire 3-4 hours I was climbing. I shall provide a few examples.The least disruptive but by the far the most dangerous thing I witnessed was a couple lead climbing where the belayer had a baby strapped to her back. This lady was lead climbing someone up a 12.c route with a baby on her back in a cloth carrier. Any common lead fall from the climber would have jolted her forward possibly into the wall. Minimum she would be 5-10 feet in the air with a 6month infant unsecured on her back. Worse case she could have slammed into a wall and injured the infant. The fact that no staff saw this and didn't immediately kick them out is outlandish. In addition to this parents seem to let their children run around the gym like a jungle gym unsupervised. The only time I saw a parent actively watching her children was in the upstairs bouldering area. She was watching 5 kids all running around like maniacs and screaming like it was a playground. Making that area pretty much useless to anyone wanting to climb there. In addition she also had a small little dog she was holding. Not a support animal or anything... just a little prissy rich spoiled dog she was holding, not on a leash or anything. That way if anything bad happened she would be useless to helping out any kids cause she had a dog she also needed to hold. Other parents were belaying kids with no certification. By some miracle a staff member seemed to notice and told him to go get his cert to put it on his harness. At that moment his kid was climbing a 25ft wall with NO SAFETY KNOT!  I guess belaying young children with no training and certification is allowed , because they didn't stop him, didn't make the kid come down. Just told him to go get it when he was done. Spoiler alert... he did not and continued to climb with his misbehaved child (can't blame the child since the father was completely inept and was allowed to act as such per the staff) I don't know how this place has a operating business license. I'm gonna write to the city or someone who deals with such things. This is dangerous. Just full stop dangerous. How are they allowing guest to climb with infants strapped to them!?", "date": "8/19/2018"}
{"review_id": "fWT2aMP8VWWGYfv6Kku19g", "user_id": "6JTu2hcy-pm8X3jtqQi5qg", "user_name": "Sean W.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym, tons of routes for all skill levels.  Nice clean bathrooms.  Amazing kids area!", "date": "11/9/2018"}
{"review_id": "ymqL36F3-82ioK-GC-jObQ", "user_id": "703E1kuAN7we3Eubx7BUEw", "user_name": "Vicki D.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 2, "funny": 2, "cool": 1, "text": "I took my kids here to play over summer break. They had a really fun time, it was one of the most fun things they said they have done. You can book a 1-hour session online for $25, and also sign your waiver at that time as well. You arrive 15 minutes before your session and get your gear on with a staff member assisting, and then they provide a briefing before you can begin climbing. The kids are not to clip themselves in and out, the parents will do this. When we went, I was with another family and the staff were also helping the kids with this. The climbing area that looks like a bunch of city buildings is definitely a crowd pleaser!You should definitely give this place a try, it's very fun, especially for the elementary aged and up crowd.They have a gym and yoga classes as well...", "date": "8/29/2017"}
{"review_id": "g6784doVcpOqL2I_I3z3Cw", "user_id": "UwnDzkmn1P4b8YjhqI7pgw", "user_name": "Ben L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 1, "cool": 0, "text": "Being a member at the SenderOne in Santa Ana I felt a compelling need to visit the Sender LAX to see what all the hub-bub was all about.At the time of this writing the gym wasn't really publicly open yet except to members such as yours truly so the crowds were small. Admittedly the entire place wasn't completely finished, but it was super duper impressive.  The rope walls are incredible! If you wanna get some crazy endurance runs in then you will not be disappointed. The bouldering areas (both floors) had a variety of problems and although not completely populated with problems yet will keep you busy.The difficulty of the bouldering settings were similar to Sender (SNA) but overall is softer than you would encounter at the Factory. However the various wall varieties more than make up for the grading.Their training area for casual exercises (although not set up at the time) looks like it will be pretty spacious and promising.Membership will be pretty pricey, but considering that being a member will allow you access to both gyms is pretty sweet. Sweet like the chocolaty nectar you would find in a Nutella container.  Hey what is the deal with Nutella by the way?  I've had it, it's good, but I don't think I need it in everything. Some of my friends (usually the gals) want nutella in their crepes, nutella ice cream, nutella on their pancakes, nutella flavored toothpaste, nutella on pizza......enough with the nutella obsession!", "date": "11/28/2016"}
{"review_id": "B_P3QNRcRVJ7TUNcvWgFdw", "user_id": "eenrchK55WPCa9_OtKzQPg", "user_name": "Payam Ali K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is absolutely amazing and a huge surprise when you walk in . At first I was expecting a simple rock climbing place like ones I have seen but this place is not even close . The best way to describe this place is a rock climbing amusement park that is filled with different areas including spots for children and parties . One of the more awesome things that I couldn't believe is the bathroom/locker room and the soon to be sauna once they get the permits . They also have like a mini gym which they said they were adding a lot more stuff . Overall this place is truly something special and definitely a work out . Don't worry if you are a beginner as I was to but instantly got the hang of it after a few rounds . Everyone is friendly and the customer service really is special . Come here asap even for dates . You won't regret it.", "date": "3/8/2017"}
{"review_id": "l7pT_YJ9bgbKemDITFL6GA", "user_id": "YQjEbZpRC6DZ-b9UwEj0yA", "user_name": "Diana N.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I visited Sender One when I was in town for the 3-day weekend. I love Sender One so much part of me wants to move back home with my parents! The pricing plan is excellent. Hangar 18 prices for 1 day passes are extortionary ($30 for one day or $35 for one month). I shared the 10 pass deal between my sister and partner. This was perfect for us because we are in town every few months and now we can regularly go to a gym that won't rip us off! The facility was spacious and well laid out. Upon entry you are greeted by the highest wall for leading that serves as an aspirational, one day I will climb that wall. I love love how there are separate spaces for children and parties. I am a member at Planet Granite in Sunnyvale and one of the most frustrating aspects of it is little children running under everything without supervision. Also, the problems I encountered were fun puzzles. Often times the climbs include a variety of holds such as slopers, pinches, and crimps. I also encountered an interesting crux on every problem. I can't wait to be back and see how much I've grown!", "date": "2/18/2018"}
{"review_id": "iSNIOBVQE15oNX8U_p0nnQ", "user_id": "-tBmZ9RA5-LWX6sARd-OdQ", "user_name": "Larry C.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Expensive for this small place or I would rate it higher. On the positive it's a more unique alternative to jumpy houses. My daughter enjoyed it. We went at a time that wasn't too busy but a friend cautioned against going when very hectic as the kids then have to wait to use equipment and it's a timed activity", "date": "2/17/2019"}
{"review_id": "qzVERrAJf2gINcDcx092nQ", "user_id": "lLbbyBfWuWofWoAFK5hD1Q", "user_name": "Vivien L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Just came home from a birthday party here and the staff was great. They're very kid friendly and very helpful. My 5 year old didn't climb but the staff played with him and he had just as much fun as everyone else even though he didn't climb. He wants his bday there next year just so he can run around with the staff!! Everything ran super smooth and everyone had a great time. Get there early if you're arriving to the party cause the consent form takes forever lol. Overall great experience and great staff!", "date": "10/13/2018"}
{"review_id": "IZwt79wt2anAcL7Tgx4t9w", "user_id": "xPVeaPptTK3z4gcWxCcPBw", "user_name": "All A.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've had a really good experience with management and it seems like they are making a lot of efforts to make sure customers are happy. I really like the people at this gym and the top rope routes are really great and fun. I think this is the best gym for getting a pro workout and best lead climbing in SoCal. Also highest walls. I am thinking of finding a place to live around here even though I got a job not in the area just to keep climbing here. Thanks Sender!", "date": "1/23/2019"}
{"review_id": "KGz8ci41HZ0AhaNn-sYIhA", "user_id": "6UHvlXXCtPesyaiClSJmlA", "user_name": "Kelsey R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My 8 & 5.5 year old loved this place..!!! Sweaty exhausted after an hour of play.. it's kind of pricey -- i guess that's where the membership would potentially come in handy.  It's heavily parent involved. Wear tennis shoes. Parking is hit or miss .. & it was LOUD in there. A lot of renovations. Sender City was a perfect outing for the kiddos.", "date": "4/8/2018"}
{"review_id": "NA-dZc6vFkA1tQSuZNin2Q", "user_id": "JDZXpik7r-sGSEwQRYnFfw", "user_name": "Paul B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Truly epic climbing gym. I usually climb at SNA location but occasionally brave the LA traffic to come here and it's well worth the drive. The larger walls, bigger bouldering area and top out section (on the second floor) are amazing. Great route setters, exercise equipment in the gym and training area (campus boards, hang board area).", "date": "11/6/2018"}
{"review_id": "4tRUVdweeY_S9FTa0NUItA", "user_id": "FXgJTjdVotlVSIJQmmhhHg", "user_name": "Rico T.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I really like this gym , great facilities. Great route setting and bouldering.  Free towels and a sauna.  Much better than the Santa Ana location in my opinion. I wish it's closer to me instead of 1+ hours of driving away.", "date": "7/30/2018"}
{"review_id": "bq15rTtnkcuwXEqDv1cAHg", "user_id": "OyCH9aK2iw3_1ko3HWV9KQ", "user_name": "George G.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic place to get a few climbs in before work! The routes get changed often enough to keep it challenging and interesting. Plus the morning staff always have on an eclectic playlist that motivates my partner and I to send any route!", "date": "2/1/2019"}
{"review_id": "XeCz2Gu35j0o45Svr_Mrdw", "user_id": "7cEqFBWOybd34Gi7n1kygA", "user_name": "Stephen L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My 5-star review is based on what I use this gym for: endurance and strength training for alpine, trad, and sport. The height of the walls and vast selection of routes are what I value in a climbing gym. Personally I could care less about bouldering but they have that in spades too. - Kind and personable staff. No pretentious stuffiness here. - Quality route setting with tall walls. The second best route setting I've experienced indoors! And they keep everything fresh. Did I mention tall walls?!- Substantial weight training and cardio area. - Clean Showers/locker rooms. I've only been to one Yoga class, it was very pleasant. Note: You need a 50m rope to lead the longest walls in the gym. Which is awesome. I wish there was more of a variety of class selections. I think it's mostly just yoga. But that's small potatoes; I'm a happy member. So long as the vibes stay good and the routes stay quality I'll be there indefinitely. My only criticisms/wish-list would be better cracks. Mesa Rim has these amazing textured cracks, not sure if that's something that could ever be wheelhouse for Sender but, hey, a guy can dream. Yay Sender! Climb on.", "date": "1/16/2018"}
{"review_id": "SrL9N42Z_9Sf-NfnWvYJ8w", "user_id": "moWDYsnF8SiJCsiszQ7rgQ", "user_name": "Linda L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 5, "funny": 2, "cool": 3, "text": "This place is amazing. I went for a yelp elite event but aside from the snacks upstairs that were provided, I believe my experience there reflects their work and the atmosphere on a daily basis.I've only been rock climbing once and it was a small obstacle at my university so nothing compared to how great sender one is. As soon as I entered, my jaw literally dropped. It's huge, colorful, and there are so many different great things in this facility! Yoga, cardio machines, resistance set ups, boulder climbing, rock climbing, and they even said that they are in the progress of getting a sauna/steam room. My bf and I were tied in and assisted by Sadie most of the time (but others were extremely helpful as well). Sadie is amazing! She was super accommodating, supportive from beginning to end (while you're climbing), and also very sociable and personable. We really enjoyed our time at sender one and would recommend it to anyone looking to pick up a new hobby!", "date": "3/13/2017"}
{"review_id": "ezHEki41WNaLynIqbp5e5g", "user_id": "QXwKeHbkjnw1pfiW5tZm9A", "user_name": "Sarah R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 2, "cool": 4, "text": "This gym beats any other rock climbing gym in the South Bay! I absolutely loved my visits here, and wish I could've made it to the Yelp Elite event this past week... gah! Nonetheless, I will be back, bringing more family and friends.Tips:+ You can fill out the waiver forms online, prior coming to the gym. That will save you TONS of time once you arrive.+ If you don't have your own gear, you can rent it here for $7. (climbing shoes, harness, chalk bag)+ You will then fill out another yet shorter waiver on their tablets.+ Orientation lasts fairly short, 10-15 mins, of a brief introduction to the new gym.+ There are TWO water fountain stations -- bring your own water bottle! Refill refill refill!+ Bring snacks, such as granola bars -- this will help in between your climbing (trrrust me, your body will strain after awhile.)+ Less people on rainy days or weekday morningsHighlights include their own showers, sauna, yoga classes AND training equipment. There's a work out station as well, which you can take advantage of in your membership. Sender City, recently completed, looks splendid for parties. Take a peek while you're there!The highest walls extend to 85 feet *gasp* and the three various types are top rope, bouldering and lead climbing. Personally, I prefer top rope to bouldering, and haven't tried lead climbing yet. The climbing community is intimate, friendly and down-to-earth. I've always had positive encounters with fellow climbers, staff and faculty members. The staff here in particular are so upbeat; you can tell they're really passionate about climbing & thus spread positive energy!Lastly, Sender One hosts awesome, cool events that you MUST check out, such as Sender Nights (you climb with a headlamp; the lights are off) and the Sender Games (Olympic-like competitions, food and beer; how awesome is that!?). I really appreciate the time the staff and management spent to create such events.The culture of a business ranges depending on each staff member, and I've rarely witnessed such a dynamic, unique atmosphere as Sender One. Do yourself a favor, and swing by!", "date": "3/14/2017"}
{"review_id": "q9by745dkSzgyHmXvC65dg", "user_id": "VgxrAw1z0vzn21VgyhrM_g", "user_name": "Amanda Marc S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We went as a large group of 14 and took the Intro to Climbing 2 hour class. We learned how to climb, tie rope, and act as a belayer. My school aged son was also able to climb and my toddler hung out with us on the nearby benches. The check in process was easy and the instructors were firm (for safety) but friendly. Although I didn't catch the gentleman's name who led my group, he was genuinely interested in getting everyone in the group up on the wall. He was patient and yet had the ability to read a climber and encourage them. He communicated well from the ground as we were climbing the wall. It was our first time ever trying this. It was crowded in the kid city because of birthday parties so we weren't able to go in there. The mats were also dusty with chalk but not unbearable. You are in a rock climbing gym so I mean, it's bound to happen. Overall, we'd go again.", "date": "11/20/2017"}
{"review_id": "_23pBz6np4GCyip_R-OZRw", "user_id": "LO5Y_n5SHGwdWpe6XBaFzg", "user_name": "Alex P.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Loved Sender One LAX. I was in town for the holidays and wanted to get a day of climbing in. Sender One answered the call. The gym is huge, clean, boasts amenities (training wall, kids zone, sauna, boulder, lead, workout area, etc., etc), but above all else I have to commend Sender One on their friendly staff. We worked with Ken a bit and he was a real joy to interact with. Not something that I have experienced in other gyms as a visiting climber. Usually, the opposite actually. Ken on the other hand was tremendous. He toured us around the facility, hooked us up with gear, tested us and set us on our way all with a smile. Thank you Ken. The gym is expensive (like many). I believe that it's $24 for a day pass, $7 more for gear OR $85 per month. But still a great experience.", "date": "1/3/2018"}
{"review_id": "1RyEoNB1QB_b0JNPpVQyIA", "user_id": "UwmtWzBdbi4AAJiuBrXrQA", "user_name": "Jennifer J.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 2, "cool": 4, "text": "My first impression is that Sender One is massive! The sheer size and height of the facilities blew me away. Sender One LAX is THE largest indoor climbing gym west of the Mississippi. After a quick tour of the top rope climbing (n00b), lead climbing (pr0), and bouldering (Haxz0r) areas, we started top rop climbing. There were moments I almost quit and let go, but in the end I conquered a level 5, 7, and 9 (just barely). My typical workout is a 10 -15 minute kettlebell routine, so I'm not the fittest person out there so the sense of accomplishment from not falling is surreal. The mental and physical challenge is beyond thrilling. This would be a fun date, team building, or even a family friendly activity. Anyone over 45 pounds is welcome!Beginner tips: Use the bathroom BEFORE putting on your harness and rental shoes. You may not wanna wear black...because....chalk! Short trimmed fingernails and toenails are key. There are water fountains and water filling stations so feel free to BYOB (B is for bottle.) The most helpful advice was to remember that legs are stronger than arms, so focus on higher foot and leg placement while keeping arms straight. This soft opening was my first Yelp Elite Event in LA West. As sad as I was to leave LA East, getting my rock climbing on in the Wesside makes it a little easier to say, \"Bye, Girl!\"", "date": "3/8/2017"}
{"review_id": "uC1kd6hf3etxeBe-RKo7Ow", "user_id": "RSYQFwanogpeWezcl-AR9Q", "user_name": "Steve L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Wow, I wish this place was closer.  Well set up with lots of little nooks for you to do your thing, without feeling like everyone's watching you do your thing.  Wish there were some more easy bouldering walls, similar to the Sender City alphabet wall.  Yes you can have your kids go to Sender city, but it's pricey, and you're limited to an hour at a time...Friendly employees, and clean facilities.  We'll be back!", "date": "5/26/2017"}
{"review_id": "zbgBI60uYOkLYBYrSOYWoQ", "user_id": "Jlb7PWOVvHwZZYXMgCZbpQ", "user_name": "Ashley S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Coolest place ever. My 6 yr old had the best time here! Adults accompany their kiddos (you have to buckle them in and out) so it's not chaotic. You have to reserve your time slot online and fill out the waiver. Do this before you arrive so it doesn't cut in to your climbing time. My son scaled each of the walls in about a minute, but it takes time to buckle them in and out so we had plenty to do for the hour. The staff is really friendly and so happy to help. I can't wait to take my 4 yr old next time! Everything is super clean and new since they just opened. What a cool find!", "date": "5/2/2017"}
{"review_id": "A-2pYd4u4oHQMAkW3adoCA", "user_id": "h2CGWY4awGJyQ7p9mvCVuA", "user_name": "Megan R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I visited Sender One last night and had so much fun! It had been awhile since I had last climbed-- at least 10 years-- so upon entering the MASSIVE gym I was a little nervous since the walls are to the warehouse ceiling (after reading other reviews this is up to 80')! Though the gym is new and still preparing for their grand opening later this month, and it was a Tuesday night, it was filled with climbers bouldering, top rope climbing, and lead climbing. There are even two areas to boulder on the first and second floor-- upstairs, they encourage you to climb all the way over the top before coming down! After a quick tour by Peter, we were fitted in our gear and able to try our hand at climbing. There were many different routes for us to try, each numbered by difficulty and coded with different colored paths. I started with the lowest intensity (pink) and ended up doing 3 different climbs throughout the night. The staff was incredibly friendly, helpful, and encouraging to us beginners, and they belayed us as many times as we wanted throughout the night. I had forgotten how tiring climbing is and how much of an adrenaline rush it is looking down when you're at the top!During the tour, we got to peek at Sender City, an autobelay interactive climbing/activity room for adults and kids alike. After checking out the room (and watching some videos online) I can't wait to come back and try this area out. The gym also offers a cardio/fitness area and yoga classes open to members as well as those who purchase a day pass. It was awesome being able to get out of my comfort zone and try something I would not usually do, but now I will definitely be coming back!", "date": "3/8/2017"}
{"review_id": "W5DZY1t6OtxuH-gEXfaecw", "user_id": "qR2jRU8MCcNxns_bZpjELw", "user_name": "Steph F.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "What I appreciate most about this gym is everything. Thoughtful route-setting, super tidy locker rooms, and gym, well-equipped cross training area, and super friendly staff. The members are all very cool too-- it's easy to find partners through Sender's community page on Facebook. They also make an effort to host events to connect the community. Very psyched to be living near this amazing training facility!", "date": "8/6/2018"}
{"review_id": "9hBKl3mW5UNhuz8WHDAsjw", "user_id": "3JIAXV7P7-NSMPuWjo7iNg", "user_name": "Ray N.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was really cool! They have a lot of options for rock climbing and have many walls. However the prices are kind of high. For a day pass it was $24 and Ive been to places where it's $15. They didn't have a student discount. But the utilities and ambiance was fantastic.", "date": "5/19/2018"}
{"review_id": "I4EgpKNj1gX6akNq-P8sLQ", "user_id": "Iec0Qou1MH6zk7I4y_4nrA", "user_name": "Tyler T.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 0, "cool": 2, "text": "My friends and I usually climb at the Sender One Santa Ana location, so when they offered climbing previews for us at the LAX location, we had to come and check it out! And this place is amazing!!! It was currently still under construction when we went, so parking was limited, and you had to go pee out in the porta pottys, and not all the routes were set yet and some boulder areas were not finished, but we still had a blast checking out what was available.One of the coolest things for lead climbers is that there is now this area called the Torch, which is like a super upgraded version of the ice cream cone. There was a section that felt like you were climbing past 45 degrees, which was intense and a lot of fun! The lead climbing walls here are also higher than the Santa Ana location, needing a 50m rope to climb.There's also a bunch of walls of varying heights, so if you're tired there is a shorter wall to try on. The routes are much more interesting too, there was one that went completely horizontal, there are more interesting corner routes, and there were routes with like mini-ledges too. Overall it was pretty awesome, it was like they took all the things they learned from making the Santa Ana location and applied to the LAX location.", "date": "11/21/2016"}
{"review_id": "b0JJZYAHxKMipPhqGTwSZw", "user_id": "44qRZ_jXE0ZAXUx-7nd7lQ", "user_name": "Jason Q.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Great climb poor parking. Expect to to find parking during popular times or the day or at any given time. Parking spaces can be too small. Aside from that and the expensive price..the climbing is good", "date": "2/6/2018"}
{"review_id": "ZRA4usHcUo7A8jruya333w", "user_id": "7z50dr2py6G8YyFHIn4KFQ", "user_name": "Matt H.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Wow! Members preview climbing day and the place is huge. By far the tallest gym I have climbed. Very cool features.  Plenty of variety as well. The bouldering area was not open for climbing, but there are going to be some serious overhanging boulder routes.", "date": "10/15/2016"}
{"review_id": "jlf9DX2ZSg5oXcr8o0c4DA", "user_id": "tk9O-CtU5I74zBV9EruTcw", "user_name": "Sandie B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 0, "cool": 4, "text": "I've climbed a few times, but never really learned how to belay. I bought a Groupon to this place and took the introductory class. It was truly excellent. Within an hour I felt really comfortable belaying other people. The gym is nice and clean, and it has lots of good climbing options, though I wish there were at least one or two more easier options on the bouldering wall. They also have a super cute room for kids/kid parties. If I were a kid, I'd want to have my birthday party here every year.", "date": "7/5/2017"}
{"review_id": "DoPCXjkZjZ76gDmx4O-4yQ", "user_id": "87Bw-9pVazcUjRwaVAVePw", "user_name": "James G.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Sender One is awesome! There is always a good rotation/turn over of problems so that you aren't bored. Always new stuff to tackle. There are a lot of events that are nice, like the Tommy Caldwell night, climbing in the dark ( with headlamps), and the amenities are excellent. Showers, sauna and bathrooms are always clean and inviting. Friends are always impressed when they see the height of the walls and the overall quality of the gym.Overall, in my opinion the grades are a little soft as compared to other gyms like mesa rim,  but it seems to vary. Sometimes the boulder grades are very soft (ie. I can do a v6/v7), then they are pretty rough, almost outdoor like (ie. I can barely get through a v4).Prices seem to be on par with other high quality gyms, and this is a top notch gym.The staff is always awesome. Super chill and willing to help.", "date": "5/23/2018"}
{"review_id": "9n6L8ZcLQlTy_V7sOndycw", "user_id": "B7aUWTgaoya1_49tiuCVVw", "user_name": "Stanislaw W.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Loved climbing there you should check it out.The routes are so fun and the walls are crazy tall.Can't wait to go back!!!!", "date": "10/18/2016"}
{"review_id": "7lGMPHu_B6YQ44_EJE2zgg", "user_id": "oyolyHIaF03Y-faNlPcxng", "user_name": "Faye N.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The best place to climb in the area. Clean, spacious, and friendly staff. Small gym area, yoga area, practice walls, boulder area, and ever-changing routes. Even during peak times, it never feels crowded and there are always routes to try. There's also a cool kids area with autobelays and all kinds of fun stuff that I want to try out even myself. I was a somewhat reluctant climbing newbie but am hooked - largely due to this facility (Hangar 18, which does have some amazing deals, simply can't compare).Now, you're gonna pay for this place and it's not exactly cheap. But they have great first-time deals (also check out Groupon) along with a variety of upfront pricing schemes (no used car salesperson \"let's tour the gym and then sit down to discuss my best deals\" sales pressure) that will allow you to find something to fit your budget. Another minor annoyance is the parking situation - not enough spaces due to the popularity of the place, and the spaces they do have are small. But there's usually street parking available depending on time. All in all, a great place to spend a fun and challenging afternoon.", "date": "2/18/2018"}
{"review_id": "F67P9bm6M1azxQ-fEyWcSQ", "user_id": "wlOm4oCKOdf-YA35gXUH2w", "user_name": "Giantpanda M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We visited the gym for the first time during our trip to L.A.  My boyfriend and I are both experienced climbers.  The facility is amazing and the problems are well set.  However, during my less than 3-hr session, at least two kids ran directly underneath me when I was working on problems.  One time, I was making a move that that could result in me falling when the kid ran right underneath me and stood there for a bit.  I had to yell to get the parents' attention.  It could have been disastrous if I had fallen.  The second time, the kid dashed underneath me while I was on an overhung V6 problem.  Then, the mother made the bouldering area her kid's playground and they were playing games on one side of the bouldering wall, making it difficult for climbers to do any of the problems on the wall.  The mother and father both look like regulars and apparently these are just acceptable behaviors at the gym. While taking my rest, my boyfriend and I looked around the top rope area and he identified several belayers that were standing very far from the climber, which could result in bad falls.    We will most likely go back to the gym because the gym itself is amazing.  I have visited many gyms in Seattle, Portland, Las Vegas & D.C. and this is definitely one of the best facility wise. But I am hoping that the gym staff can do a better job at enforcing safety rules and educating the climbers.", "date": "10/22/2018"}
{"review_id": "VtKwT0RNMNNRnZvek6Lokw", "user_id": "6SK_vCkbIFC8xQ-vSSoK4A", "user_name": "Jon T.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 13, "funny": 13, "cool": 13, "text": "This place is really cool! they have your typical rock climbing walls and also a section with a variety of different types of \"climbs\" it ranges from a spider web to climbing up fake buildings.. it also has a GIANT SLIDE! if you dare... very cool idea and the staff here is super helpful and friendly. If you want to get your adrenaline pumping a bit I highly recommend it.. could also be a great place to have a birthday party (not for young kids though) instead of a typical sit around and get fat type of party", "date": "4/17/2017"}
{"review_id": "pk3fbYpVVggoUoOMsuVtnA", "user_id": "G9TdG0_MYRoWJX1DRoVD1g", "user_name": "John S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I just signed up for their $169.00 intro special, looking forward to the classes.I have a mixed background of experience, High Adventure Camps with BSA and sierra club outings as well as climbing with my 19 year old son..........so I am starting over from the beginning.In terms of \"safety\" I believe strongly in personal responsibility and ownership.", "date": "9/28/2017"}
{"review_id": "G9GHYyC9gVx_c5_bGjGx5A", "user_id": "g1n77kt0lH2r6X11nEIVDg", "user_name": "Kalika Y.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Wow! What an incredible space! Alice Kao the owner was amazing in arranging our Entrepreneurs Organization (EO) Mentorship program and team building event there! Thank you for opening your outstanding climbing gym to our entrepreneurs, arranging for the boxes lunch and making our event memorable!", "date": "12/17/2017"}
{"review_id": "FbaPSiixgYhxUByo_9O4kQ", "user_id": "1oBa2eODu4_ZKjpGSZj5bg", "user_name": "Travis S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is a quality gym. The staff is Extremely friendly and helpful. Climbing here was wonderful as the routes are not only long but of nice variety. A bit soft on the grades IMHO but that is relative. The day pass price is a bit steep hence the 4 stars $15-$19 would be much better. The restrooms/showers/Sanaa's are wonderful and clean if this place were closer to home and had a less expensive annual pass I would defiantly be a member here.", "date": "3/8/2018"}
{"review_id": "IyHGwlkRoFbSAXxKp2vsdw", "user_id": "yNwAy7HAUX74skikfZiKmQ", "user_name": "Elizabeth N.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I ended up getting a year pass because I loved this place so much. It's clean, spacious, and there are many amenities. I'm glad it's close to home.Not a lot of people come here but I prefer it over the other rock climbing gyms that I've been too.", "date": "6/22/2017"}
{"review_id": "3-5_Q8etzKprwmkTzooRfg", "user_id": "YDuFY8SwpCCOZbLuhU99qg", "user_name": "Meggie M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I love Sender One. There are so many routes and you can get some serious endurance climbing in with the 100ft+ walls. The bouldering areas are great too. If you're flying solo like I was, you'll quickly meet other rock enthusiasts and feel like you've found a community to belong to. This is my happy place. :)", "date": "11/16/2017"}
{"review_id": "zycxoUO09W6D_GJ7qA1oDg", "user_id": "RJj3XZSBwB1sPiHq0VnPdw", "user_name": "Le C.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to several gyms. Have had several passes and this place has thee most creative routes. They offer an array of walls with so much character that really allow you to use all the techniques you need. Endless fun and an amazing gym. I just feel bad lifting cause the yoga studio is right next to the weights", "date": "1/6/2018"}
{"review_id": "NQ8TLylnyG-m0WiIYRndMg", "user_id": "r_Xp6BXa_dpp4xLtBn-bfg", "user_name": "Jillian N.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I found out about Sender One through Groupon's climbing class offer.  The class itself is for beginners learning to belay, and it was overall pretty interesting.  The best part of the Groupon was that it included a day pass to the center - and the center is pretty awesome.  I went solo, so I mostly stuck to the bouldering section, but that in itself was a good deal of fun.  The climbs are color-coordinated and labeled by level, so it was easy to stick climbs within my capabilities.  The fact that they also offer yoga and other general gym facilities is impressive as well.  The whole place has a fun atmosphere.  I would have loved to get the 5 visit pass they offered, but I bought the Groupon a month before I moved, and it's now too far for me to visit that often in the time span covered.  If you are lucky enough to live nearby, I definitely recommend it.", "date": "4/28/2017"}
{"review_id": "sHPeacgyJCI5_iD72cwp2A", "user_id": "Xlwue4QcZXSPLhhEwnH5Pw", "user_name": "Frans L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "IF you can get in.Our 4 year old was so happy all week to go and climb on Saturday. Ahm sorry we have a private birthday party and you can get in at 11.30. It's 9. That sucks!On the website there's no Todays! Menu, so calling in is a MUST.", "date": "12/16/2017"}
{"review_id": "4wFLLbcWRZw27uFBJMPvDg", "user_id": "BEtS0hnkj3p45Mhwj4zx-w", "user_name": "Nichole S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 2, "useful": 2, "funny": 0, "cool": 0, "text": "Let's start with for being open two weeks there are plenty of amazing climbs and interesting two stories of bouldering. The second story had a nice short top out section where you could even climb down. Surprisingly there was a good friendly amount of sets for new climbers to play and work on. Also appreciated the training area you can practice gripping as well as campusing. Huge variety to be shown and showcased at such a short time.Also pluses they stock yerba matte and some electro cubes to replenish at the front desk much like sender Santa Ana. Also restrooms will include a sauna in progress and lots of lockers. Okay so the slight mishap that made the experience unpleasant  on my part. Please understand that totally open to learning and getting corrected and was expecting to fail getting cert. So tips don't ask questions and just climb the way you do and don't listen to the instructors they don't tolerate hesitation. (I've heard sender does a few things differently such as the x/= knot at the end of the figure 8 so I asked if there was a certain way you had to hold the GRI GRI to lead here too) after asking that it just went downhill he already said he wasn't comfortable passing me which okay that's fine he's willing to teach regardless but maybe it was the way he communicated but never have I felt so degraded in my life or felt stupid climbing. The communication was so jumbled and rushed couldn't understand what he tried to correct or what even was correct, it was a mess. Moral wish there was better communication when teaching. Instead of getting a shunned vibe that you didn't belong at the gym. Just thankful got the certs at sender Santa Ana where they gave you the chance to explain how to safely belay and climb in your own way unrushed.", "date": "1/29/2017"}
{"review_id": "jfZVIu8YiNRYpZS8ZXLKkA", "user_id": "mqMeo-UenRzZQLyXuH-PFQ", "user_name": "Ana S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Great place. Staff was very welcoming and helpful. Got to learn the basics on rope tying and belaying. Definitely recommend this place. I would suggest going with a friend so you can learn together and practice. They are currently in soft opening mode, but plan a grand opening on March 18th. Does not take that long to get there if you're coming from Mar Vista or Culver City. Only took me about 20 minutes during rush hour traffic.", "date": "3/7/2017"}
{"review_id": "wb1i64EgEIhIyStVJcH6Kg", "user_id": "CDfdRJ7BycFwiptsv72PjQ", "user_name": "steph h.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We had our son's 5 year old birthday party there a couple of weeks ago and was overall impressed with the space. The space itself is so much fun for kids and set up in a way that is completely DIY. (No need for certified spotters for the little ones - any parent or older sibling could clip on the kids). It's a beautiful, clean and modern space.I'm docking 1 star for the following: We paid for a Party Attendant who showed up late and, due to miscommunication, did not have our designated decor items. They had apparently left the Ninja decor set in their Santa Ana location. The attendant spent the first hour decorating the space, which means that there's really no one around to help guide the kids as to what to do. Our kids were roaming around the facility until someone told them they weren't allowed to. Finally the trainers showed up and started the warm up games.We're told to show up 15 minutes early, but it was clear no one was going to help us until 10 minutes after the start time. We were told that the first 30 minutes was setting up, which seems a little too much time. None of the \"schedule\" of activities was communicated to us prior. We were just told 1 hour climbing and 1 hour eating/cake, etc. But it was 15 minutes set up/harnessing and 15 minutes of warm up \"games\" - then just free climbing for another hour.  So you really don't need to arrive 15 minutes prior to the start time. So total party time was 2.5 hours vs. 2. During the party, the alternate attendant (our main attendant had by then disappeared) was lovely and helpful but was not experienced with facilitating a party. None of the dishes had serving utensils, and we had to ask for forks for the cake. The main party attendant ended up giving us $130 and 2 free adult passes for not having the decor, so we were pleased overall.But as a former event planner, it was hard for me to see the lack of organization. Despite the mishaps, two of our friends will be booking the space as a result of experiencing our party. I still highly recommend this place, because the kids could care less that the decor was \"super hero\" instead of ninja, and that there were no serving spoons or forks.", "date": "4/26/2017"}
{"review_id": "k84Vo3dqjDLMPqWB5FLuMQ", "user_id": "AiQL1INckKUk1Bx2WD8ozw", "user_name": "starrynight c.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The climbing walls are great.  Lots to choose from for top roping, bouldering, and even for lead.  The facilities are new, so that's a huge plus of this gym right now.  However, I wouldn't recommend making this your normal gym just yet - there's no towel service for a gym with both a sauna and showers!  And, there's no hot water anyhow (apparently takes 4 minutes to heat up, but without towels and having to wait that long, why bother).  The sauna's also out of commission for now.  Wish they wouldn't charge full price for those day passes if not everything is up and running.Added a star for solid customer service (would be 2 stars otherwise) - they were great at listening to my annoyances.  So, perhaps when everything is fixed, we'll be back.", "date": "4/6/2017"}
{"review_id": "5_ewykbucehLzQGbJl5pMQ", "user_id": "6V0U7sHjBYWVPsF-0yYo-A", "user_name": "Karolina L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had the best time here! So I found a Groupon for a class to attend here and because I got it for a Sunday, we were the only two to attend! Which is amazing. It was our own private class! The instructor was extremely nice! And very helpful, he taught us exactly how to do the rope thing and etc, we are pros now. The facility is clean and the people are welcoming! Can't wait to be back! Oh yeah, prices are expensive so I would use a Groupon if I were you.", "date": "5/28/2017"}
{"review_id": "hkGGkgwQTh4mIRwcQvOf1g", "user_id": "iumsoA6-_MR_XBIoFwMoUg", "user_name": "Evana L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The facility is beautiful and perfect for any type of climber. There's plenty of room for everybody and the building is very well ventilated. It didn't feel like chalk was in the air and you can breathe easily. One of the coolest things about this climbing facility is they have a fun activity space for parties or team building events. I am definitely keeping this place in mind for future events. Not to mention, they have huge locker rooms with showers and a changing area. This is across from the gym equipment that you're able to use with a membership. Yup, this place sounds huge and IT IS!The reason this place deserves 5 stars is widely contributed by the employees. Each employee we interacted with was friendly, knowledgable and passionate about climbing, and so willing to make you feel welcome. Definitely come here for a date, for funs, for team building, to try something new, etc. Make an excuse to come out and check out this amazing space that will make you excited about climbing!", "date": "3/13/2017"}
{"review_id": "Pr0cc2v1soVS3V9gtrShGA", "user_id": "rCKnkuP6QkhhRbb8FC9CxA", "user_name": "Rose D.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Sender One is so dope!! My roommate and I wanted to do some rock climbing and knew the locations in Santa Monica/West LA would be packed so we came here - it was perfect.  The intro class training was thorough but quick and the place is so huge you don't have to wait to use the walls.  Make sure you trust the person who's belaying you with your life because it can be a little terrifying on the higher walls.", "date": "3/6/2018"}
{"review_id": "5SJiIReQyU_wpAaEqzZ9RA", "user_id": "NFpxkGAan-qUmI9kiEHLyw", "user_name": "Janice L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 6, "funny": 2, "cool": 3, "text": "I cannot wait for this location to be open! We came for the open house today and we were in awe as to how extremely big and spacious it will be! They have 60 ft walls to climb and it will have a bouldering area both upstairs and downstairs. It will have so many routes to be climbed! They estimate to be open around November. The only thing I am not sure about is parking.. But we shall see because this location is going to be epic!", "date": "8/27/2016"}
{"review_id": "O2yZ-V5GxFkYyWHABdV6cA", "user_id": "g4vA6SyNUr5SX-xeCaeadA", "user_name": "Caroline K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went for the first time recently and had a blast! This is a really top-notch place that I would recommend to anyone interested in climbing.There are multiple different sections for bouldering, top-roping,and this super cool kids area called Sender City where they host birthday parties (can I have my party there?!) Everything was clean and even though it was a really busy day, I felt like there was plenty of space to move around.There was also plenty of cubbies to put your stuff while you climb which was nice.There is also a yoga area and a traditional gym area with cardio equipment and I think some weights (I didn't use that part so I can't speak to that!)When I move closer to the area I definitely plan to return!", "date": "6/7/2017"}
{"review_id": "tp7NMr8qnC0Skqrue7Qq6Q", "user_id": "cMLznhQAWjHrD_jg1GwOww", "user_name": "Jennifer R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We wen't climbing for the first time last weekend with my brother who is a member.  It was a terrific experience, the gym is really clean, they have a yoga studio, and small work out gym.  If I lived closer, a membership would be something to consider.", "date": "6/3/2018"}
{"review_id": "2sRGOBcffQb0scBD6LIJzQ", "user_id": "vwepYce5AgKvCnAsXcrkug", "user_name": "MICHAEL L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been to the gym a couple of times now, including a couple of times with my kids.  The Sender City area is really awesome for kids and both of them had a blast with both the kids bouldering area and the auto-belay climbs.  For the adults, I think this is the premier climbing destination in L.A.  The bouldering routes are great, the top rope routes are creative, long and challenging and the lead routes are really fun.  There are so many problems and the route-setters are doing a great job mixing it up with different styles of climbs.  Can't wait to get back to Sender One!", "date": "2/28/2017"}
{"review_id": "U1--qWxPFhGLT8g9R86hcA", "user_id": "7oQeR5ttXM3jhwmo802WpQ", "user_name": "J B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'd like to vote Sender One for president.. They've pretty much perfected everything about a climbing gym; time to take it to the next level..", "date": "4/26/2018"}
{"review_id": "3JQJ4grB9GGJApe-2ypQMg", "user_id": "wjWx9f8yGe4lToODTJ_7Ag", "user_name": "Jerod P.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Top notch climbing gym with all the amenities you would desire. The place rocks! I love the tall routes and challenging lead routes.", "date": "11/30/2017"}
{"review_id": "wYneQ8MEvLpB02PH3oKIBg", "user_id": "aJRBSw5Z9HFGqth-lZD5Mw", "user_name": "Neil X.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is a whole lot of fun for the whole family. Interactive area is great with younger kids. The employees are very friendly, and helpful as well. Love it!", "date": "5/26/2018"}
{"review_id": "iXuVisTP8xKOQ_SuD4h2pA", "user_id": "HD5EBPQcaPuUqnBhbDUG9g", "user_name": "TJ T.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A Fantastic place to hold a birthday party! Interactive play for both children and adults alike.  The staff are friendly, efficient and attentive.  I highly recommend.", "date": "11/6/2017"}
{"review_id": "Tjs_iS2I7zZyKKZbwh49CQ", "user_id": "_E1aAQ0Yrf0QHGkiG5oqlQ", "user_name": "Quinn V.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So much better rope climbing than cliffs. Better setters. Bring your outdoor rope though. Walls are much higher than the other sender so your 30-35 meter indoor rope won't cut it", "date": "11/20/2016"}
{"review_id": "CwBom-A5BeLZnVQ9YCrjjg", "user_id": "K5gwOEGC_y1QhHKRUc7gmA", "user_name": "J M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My kids had a blast here today. We came to check it out and they climbed for an hour in the kids area. I will definitely be signing them up for lessons and a pass. The staff were SO awesome and friendly. They gave us a little tour and were so informative. Usually when you go to these places the staff seems burned out dealing with the kids. Every staff member were cheering the kids on. So much fun.", "date": "3/31/2018"}
{"review_id": "LIeNipzeTF22nJt7GozH6Q", "user_id": "6sD6kILvJZ_P-xQzqDYfxw", "user_name": "Mike D.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome. If you like to climb on all kinds of stuff this is for you. Kids too! Staff is nice and facility is clean!", "date": "7/21/2017"}
{"review_id": "LF6gIU_iMG_o_y5_-ol7DA", "user_id": "y1gjryCJjM8QtDYRm8lklA", "user_name": "Ashley W.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "Came here for the intro class with my fiancé through a Groupon deal.  Overall awesome facility and instructors.  Had so much fun here!!", "date": "4/3/2017"}
{"review_id": "WskT4ElnqyTo-T72ygtq5w", "user_id": "nVxYIjL8hBYGvrAtSILz0Q", "user_name": "Anthony M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This will be one of the best climbing gyms in the United States, if not the best. I went for the preview and it blew me away, even though it's still under construction. There are quite a number of routes up in the lead and top rope area. The setting crew excellent. You better eat your Wheaties for this one.  The routes are long, and if you climb on the roof\\overhang area you need to have some power.  You'll need a 50m rope - your 35m isn't going to work there.   Don't hesitate.  Just join.  I've climbed at a lot of gyms.  It's worth it.  Run, don't walk.", "date": "10/24/2016"}
{"review_id": "tLfpT7Wm8Wr25JkWkW625w", "user_id": "2EmMOl-Uc4J3YuMoI__wsg", "user_name": "Michelle K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I had my daughter's birthday party here in March and I have to say it was a big hit not only with my daughter but with all of her friends. The facility is very clean and spacious and there were enough Sender One people helping the almost 30 climbers. I think they truly understand the necessary adult to climber ratio, which was a big plus, as some of the climbers did need extra assistance. Although I was busy being the host for most of the party, I did notice in the climbing area, the Sender One staff that were there to help, were very friendly and upbeat. Meaning no one was being assertive and forceful (yelling) as some of the climbers did get nervous on the higher climb areas and had trouble getting down.I think one of the great things about having our party here was the communication between myself and staff. In the beginning, I was very worried about having a party in March because it coincided with the soft and grand openings for Sender One. Once it was closer to the party date, I spoke with staff  quite frequently (sorry, I know I called a lot, but blame it on the type A mom in me) and everything turned out fine on the big day.Our party package included pizza (Fresh Brothers) which was delivered on time and hot (and not sitting for hours). They also allowed me to bring in my own food and had extra tables set up for the food, cake and presents. The only thing to note and I would not take off a star for it, was the fact that I paid extra for a party attendant from Sender One to help with the food and cake. I think this attendant was a bit shy and possibly not used to hosting kid's parties because he was pretty timid and seemed a bit out of his element with the food serving and drinks. Sensing his timidness, my fellow moms stepped in to help and he seemed okay with having things delegated to him rather than taking the initiative. Again, no big deal, he took care of everything else, and maybe he was the only one available that day.My daughter keeps asking when she can go back and so do her friends. There is nothing better than hearing from other moms that their daughter had the best time at our party.Thank you Sender One!", "date": "4/6/2017"}
{"review_id": "P6xM6WQMDPFbbkzYzOutow", "user_id": "RsZoAl4T7XwIpYRjNdRaIQ", "user_name": "Alex R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been waiting for a climbing gym like Sender One to open on the westside of LA since moving here three years ago.  It's a godsend.  Among other things, I appreciate that they keep late hours.  Only issue I've had with the gym is that parking can be tricky, despite their having a decent sized lot.  I fear that the situation will only get worse as they get more popular.", "date": "6/23/2017"}
{"review_id": "OnUpgcHwggNP43JWX_QswA", "user_id": "pNUxWrTd5ASGyrxs85urDQ", "user_name": "Kevin K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 3, "funny": 2, "cool": 1, "text": "Love this gym!  I'm not a big boulderer, so my review is based on the rope climbing.I've been a member at Hangar 18 and Rockreation, and have climbed at Cliffs of ID and Stronghold.  Sender is leagues ahead!  Pros:  -The wall variety is great, lots of small ledges, angles, overhangs, corners - the setters do a great job using the wall features.  The main lead wall (the torch) is insanely fun!  85' routes will push your endurance!-Very clean, very open and good circulation - no funky sock smell!-Extremely friendly staff - Most knew my name after a few visits, and I've even climbed with a few of them.-2 training areas - cardio and lifting equipment, and a climbing training section with hangboards, campus rungs and a yet to be opened angled training wall.Cons:-Parking:  Spaces are pretty tight.  Some street parking, but during busy times, it is difficult to find a spot.-Pricing:  On the high end of climbing gyms in the area.  I do feel you get what you pay for though!-Really small slab section - wish there was a bigger slab wall to practice footwork and balance.-Technically still in their soft open - steam room still isn't open!All in all - it's a great gym to climb hard and train, as well as get into the sport!", "date": "2/27/2017"}
{"review_id": "X0ZxKYEAj6dIkfuUiNbS1g", "user_id": "R2xVajZWMHj5ZOrODr5zCw", "user_name": "A K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I will preface this by saying that we were members for a year and we love the facility (this review is for the sender city kids area). My review is strictly on the service which I would give maybe 2 stars (added a star for the facility). It is unclear to me what the staff does in the kids area other than strapping them in, and at that, only one staff member and there are no checks and balances to ensure these vulnerable kids and properly equipped. A friends harnass kept moving and turns out it was wrong. Also they play a video saying that staff members will help and yet from when you begin to the end nobody comes in unless you ask for help. There is a two child to one adult ratio but that is really hard given and there is zero staff support. In fact, when I was there almost six staff members were hanging out at the front desk and none seemed to be working. I came by to ask for help and it seemed to be an inconvenience. I don't feel this gyms service is good and for that reason I won't come back to be a member again. Again great facility but serious work on the service side.", "date": "5/2/2018"}
{"review_id": "8IBUgYs7K4rClsbPMkL0TQ", "user_id": "ndEB5-TTMVbsr6IHF-emvA", "user_name": "Joshua R.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went for the members preview and was blown away! The climbing (the setting) is great! The walls were so tall it made me feel like I was climbing outside. I cannot wait to try their two story bouldering section! This gym is going to have it all!", "date": "10/15/2016"}
{"review_id": "gw1_9A-mCZW_kzoJEIaP8g", "user_id": "Lb40kiB5iX7kuqwq49akjw", "user_name": "Gary M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a super fan of this climbing gym.  If you are looking to get a great workout in it's a fantastic place.", "date": "7/24/2017"}
{"review_id": "p8aikSb9uHn1O24T7gzBAA", "user_id": "Bc1E3ad_cSt2IuejEy4MAg", "user_name": "Robert A.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Pricey, but excellent venue, nice and helpful staff.  The bouldering is excellent with a great texture to the walls, and the lead climbing is the best I've ever seen indoors.", "date": "6/28/2017"}
{"review_id": "pLLP1CQ_OdqYKdYhmV7xHw", "user_id": "_-xpMdzFSNBXvp71lmipdw", "user_name": "Orlando S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! Front desk staff super friendly!of course the gym is on the expensive side but you get what you pay for (taking the metro green line saves me tons on gas, exit on Aviation ) Walls are massive, so many routes to choose from, for both ropes and for bouldering. Great selection of equipment to use in the fitness area to get your weightlifting and cardio going. Super clean gym!", "date": "5/1/2017"}
{"review_id": "Rrdzf8Y9kpWMGjNbIVELYA", "user_id": "PcyC-OP7YW_cgBul4w2zrQ", "user_name": "Marie H.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was so much fun for the whole family.  We climbed only in the Sender City portion of the gym but Sender City is fun for kids and adults alike.  It's fun and colorful and clean. The staff that work here is really friendly and knowledgeable and always willing to help.  You can scale a series of buildings as a superhero but maybe the best part is repelling down.  There are so many different climbing themes to choose from. This is our second time here and we will definitely return regularly!", "date": "3/27/2017"}
{"review_id": "oPcQTIZetCu07Cp26lcwUw", "user_id": "1BS6kR7hV2ctyc8uISC7nw", "user_name": "T M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had our son's 8th birthday party here and it was a huge hit!  I had a few Parents that for on on the fun as well.  This place is great for both kids and adults.  I hightly recommend this place and might just do it again!!  Thank you Sender One for making our son's Birthday party a huge success.", "date": "4/30/2017"}
{"review_id": "og1PBuQ9Uf1EQzEO4Nkrcw", "user_id": "2-IBUR6Ox5JmBmgzG4J_RA", "user_name": "Oren W.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The kids had a lot of fun and asked to come back, so I guess we will....When you walk in middle school and clean there's a gym but as you look to you're right, you see the whole rock climbing area which is very impressive.", "date": "3/10/2017"}
{"review_id": "2uxmusjtCLrJDqsaFSVkEw", "user_id": "jP5FDHNwsZ4ME7YA-f2rRQ", "user_name": "Lisa M.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Very cool! Sender opened its doors for members and member guests to preview their new gym in LA! Great treat for members! The gym looks great, the walls are tall and climbs are fun. It has a good range of difficulty so all levels can find fun climbs. The staff is friendly and helpful. Can't wait for the gym to open officially!", "date": "10/30/2016"}
{"review_id": "v1hL7b4ZJzHChbWcrMg8rw", "user_id": "I-i-Vid4i_JCvAAUv1icVg", "user_name": "Stephanie G.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "So amazing, it's the best sport climbing in southern CA. If you don't believe me come check it out for yourself", "date": "10/16/2016"}
{"review_id": "P1CfOnnhP5ZP0rqQAhYbIg", "user_id": "hxEtWcmCLLgiyN8srNSAPw", "user_name": "Colin O.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had the best time here. I had never done indoor climbing before and they had plenty of routes that were beginner level for me, but I also watched some climbers on the very difficult routes that were amazing!! They definitely have something for everyone. I will absolutely be coming back to this gym", "date": "3/9/2017"}
{"review_id": "P-SDV-keW9LL-lUub04-Nw", "user_id": "A5ldtVQWuaEl6RT5ZJ3qtw", "user_name": "Robert S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Wow what a place. A 60' lead wall will build your endurance and skill like no other. Maybe even better than the Orange Country gym! Again, Sender One sets the bar for climbing gyms worldwide.", "date": "12/27/2016"}
{"review_id": "fWf_9Fb7WZEY4_3dJwlLUQ", "user_id": "_Ddt1e5pF335Rkec0tEehw", "user_name": "Jenkin C.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Beautiful facility, extremely helpful and friendly staff.  Had a fun time and paid with a good amount of skin on the new holds.  Did a bit of the top rope, but mostly on the bouldering routes on the first floor.  The top out bouldering problems seem fun on the 2nd floor but didn't attempt much there.", "date": "3/12/2017"}
{"review_id": "Z2dQ9FJkzf8BYi6WlwmLmA", "user_id": "85rPsRarzU6PMcyJn3ZHrg", "user_name": "Florie-ann S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Love climbing, but one of the staff members could have given better customer service. Was kinda disappointed. Overall the climbing was great.", "date": "1/29/2017"}
{"review_id": "8quV67_KV3RTmRt7dTMEdA", "user_id": "Ria8jlKhH9x0bS8TdKav4g", "user_name": "Ron K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a corporate event at Sender One. The staff was very welcoming and patient making the learning experience fun. Paul was a great instructor!", "date": "1/25/2017"}
{"review_id": "WzRUr0diVA2A-lhmpFUboQ", "user_id": "D1tFAPgEq9CND4UBqjMddw", "user_name": "Jane L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went today for a birthday party and I was impressed with the place. Lots of climbing varieties for kids. And a good size party room.", "date": "6/25/2017"}
{"review_id": "Cesjo0V5u1fghTG_RxlNJw", "user_id": "9IXFB2vtjt8FFP4nWHF43Q", "user_name": "Charles S.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place! Sender City is perfect for kids and the staff are very helpful.  The kid courses are also well organized.", "date": "7/20/2017"}
{"review_id": "I5b-a4vZ9Vp13IIf9P61gg", "user_id": "dcQjO-01PDBv-OiaBH5XVg", "user_name": "Robert B.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Decent top rope gym if you live close by, good top rope and lead climbs. Staff is pretty good and rope setting is above average but bouldering leaves something to be desired. Don't expect them to have any parking, or to be open to gym members at any given time. Have fun circling the neighborhood for 30 minutes before giving up or get there and realize the gym is closed for an event. I'd recommend a 5 punch pass before committing to any membership.", "date": "6/13/2017"}
{"review_id": "9f1im9sVPS-CSIuxLs_AqA", "user_id": "mmyfEU3GpsXTBdtqJ-i3bw", "user_name": "Michelle L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is an amazing gym and the facilities/amenities are top notch. I feel like their Santa Ana gym is already nice but this new LAX facility is even nicer and larger. I can't wait to start climbing at this gym once it opens and to bring my daughter to their Sender City kids climbing area.", "date": "12/30/2016"}
{"review_id": "Aiz7xXZz6be2hQbyRSJCEg", "user_id": "U22F4Z94-VSmUDhgdkdWOQ", "user_name": "Sara K.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We loved the climbing room for kids.  Such a fun activity and different than other rock climbing gyms.", "date": "4/13/2017"}
{"review_id": "c9IaeCX_AuGBTc9XJmzyLA", "user_id": "nwsj3E_pRJjSvFO2B57MsA", "user_name": "Nate P.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a blast! Friendly and knowledgable staff with climbing options available for all levels of expertise!", "date": "1/25/2017"}
{"review_id": "cssDxYChAZ6aRfrrs2WTuw", "user_id": "K1ZalKX8EJ3bmnb8hFl8Bw", "user_name": "Charles L.", "business_id": "4TlQdpDRKQVR8jF-wwLxNw", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Wow!!  Best climbing gym ever!!  Amazing walls, fantastic routes and the staff is really great.  You have to see this place in person, it's just amazing.", "date": "12/3/2016"}
