{"review_id": "VcpFDkLeHKO6xKl2H8tSzQ", "user_id": "BIigoyHX-W2Y7m0ePiYPBA", "user_name": "Anna-Marie T.", "business_id": "NUXYTPnWkTsSCs3BMycwxQ", "stars": 5, "useful": 4, "funny": 3, "cool": 4, "text": "Sender One up their game (and made their $$$ membership worth it) by expanding the gym and yoga room to the building across from the climbing gym. There is so much more space and equipment to use and you can easily get in a great workout here. Love the expansion!", "date": "12/1/2018"}
{"review_id": "BT88G66up2xvqZn5ged4bg", "user_id": "s-BoEWOFlzCFt62B8rSL8Q", "user_name": "Q. L.", "business_id": "NUXYTPnWkTsSCs3BMycwxQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I really enjoy the new studio and workout areas! It's more spacious and allows for more room to work out, as well as more classes. I have taken Adrea Reed's Mat Pilates, Rebecca Fink's and Rohaya Esa's Yoga classes, and they have all been thoroughly and enjoyably challenging. I look forward to taking more classes at the yoga center :)", "date": "8/20/2018"}
{"review_id": "giwLD1lt0b6fHO6dnOVUfw", "user_id": "Iiu_Absi4Nodaqpd1rAKCA", "user_name": "Laura A.", "business_id": "NUXYTPnWkTsSCs3BMycwxQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "SenderOne has provided a space for my practice to grow tremendously over the last 3 years. Rebecca Fink's exemplary wisdom and sattvic lifestyle have been influential as I wander the yogic path. Finding balance by focusing in the breath was introduced in her classes. Great new studios with all the props one could need.", "date": "8/18/2018"}
{"review_id": "iAW3h3rIoHCMhX-vs839iw", "user_id": "X_SAw4vmDVYwVpD1SzGqHA", "user_name": "Rose Q.", "business_id": "NUXYTPnWkTsSCs3BMycwxQ", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Love going here! There's a plethora of classes: Vinyasa, Acro Yoga, Move & Meditate, Yin Yang, Restorative, etc. and I've gone to all. They use Mindbody so it's convenient to see the schedule and reserve your spot. There's also a fitness center next door so it's convenient to get a workout in and then head to yoga to wind down :) I'd check it out if you love to stay active to recalibrate!", "date": "8/17/2018"}
{"review_id": "H9dusieTpkg-HTOjoyCg5A", "user_id": "K1ZalKX8EJ3bmnb8hFl8Bw", "user_name": "Charles L.", "business_id": "NUXYTPnWkTsSCs3BMycwxQ", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great classes!!  Love the classes at S1, really great teachers and a nice variety of times and styles.  The gym is now a go to destination for yoga!!", "date": "8/17/2018"}
