{"review_id": "Ne5zWteYlU-YjURtcK7lJQ", "user_id": "3yNzPG-rZjfiQgZrLPv-fg", "user_name": "Aubrey P.", "business_id": "O9wesGb5fts6d391iGTxRA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Sam is honestly the sweetest human. She made us feel so welcome. You can tell she loves her job and it shows. She went above and beyond to show us the ropes and teach us all the climbs and how to do them. We had the best time because of her.", "date": "5/18/2019"}
{"review_id": "xYVeLlBgUeoRNby7UTy4pQ", "user_id": "LI90Aml83LsgGJdio624QQ", "user_name": "Jen A.", "business_id": "O9wesGb5fts6d391iGTxRA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Basically my second home!! Joined bc I am scared of heights. Shasta is like one BIG FAMILYYYY. Alex. ben. the whole crew!", "date": "2/19/2018"}
{"review_id": "ymsZCubQvWUoJ0QT-MKPFw", "user_id": "C-pclBYLY225wJ5NuQ_uxQ", "user_name": "Rachel K.", "business_id": "O9wesGb5fts6d391iGTxRA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super cool place, the employees and people who come here really make you feel welcome. The building is a built small but with what's given the fun is endless. The little cave they have is intense!!!I'd definitely recommend buying a monthly membership.", "date": "11/16/2016"}
{"review_id": "MMqkeabcc0ON5iw5EONuew", "user_id": "T3tPfEL_xrqnXMg_JGOPUw", "user_name": "JP O.", "business_id": "O9wesGb5fts6d391iGTxRA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I'm glad Shasta Rock Club is the home of Redding's first climbing gym. I have met so many cool and helpful people here in the few weeks that I've been coming. It's all bouldering, but there are a lot of routes to choose from and I think they update the routes about once a month. If you have a full access monthly membership you can climb at a top roping wall at a nearby college from what I've heard. Alex and Isaia are the people that I've met who run the place and I couldn't be happier supporting them. They are very inclusive and enthusiastic about climbing and all its positive benefits. They offer a fitness circuit once a week on Tuesdays and usually when they change the routes I heard they have a friendly comp. I'm psyched to have such a fun place to get a full body workout and I hope to make some friends to visit nature with, and climb outdoors soon.", "date": "10/17/2015"}
{"review_id": "4ze4SrR6Fuxozlbo1E7rNg", "user_id": "BxkjMzM6pk9TooDvSlFt_w", "user_name": "Autumn P.", "business_id": "O9wesGb5fts6d391iGTxRA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Thank you so much Shasta Rock Club for donating to the Catalyst Youth Fundraiser. As Redding's only rock climbing gym they have brought such a new and exciting culture to the community. The Northstate has great mountains to climb but what a great place to learn and practice for the real rocks. With courses that change every couple weeks it offer a continual challenge for everyone from amateurs to professionals. If you're visiting Redding or have always been interested in climbing I would definitely suggest this place. Thank you guys again.", "date": "3/24/2016"}
{"review_id": "ChmyG81cAYK9IfLctqanzg", "user_id": "JWejqX6cs0oC1WbL8I4wuw", "user_name": "Rebekah S.", "business_id": "O9wesGb5fts6d391iGTxRA", "stars": 5, "useful": 4, "funny": 0, "cool": 2, "text": "This is an amazing place to climb for people of all ages and all levels. My husband and I came and Benjamin came out from behind the desk and helped us get started. We were a little intimidated at first because we had zero experience climbing, but we soon forgot about that because of Benjamin's positive attitude and welcoming manner. While we enjoyed ourselves on an easier part of the wall a group of more experienced climbers were refining their skills on a more challenging part of the wall. Everyone was friendly making it a very enjoyable experience. Whether you are a more experienced climber or a newbie like me, Shasta Rock Club is the place to go. The entire staff makes you feel like family and will help you achieve whatever climbing goals you have. I highly encourage you to check it out!", "date": "1/11/2015"}
