{"review_id": "QRwbzCDG1ECe0UR3YYHb1w", "user_id": "RTXriAubrOylN-_fWhXO6g", "user_name": "Kiri O.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "First time here. Brought my kid and brother and it was fun figuring it out. No one helped us climb, but the guy working showed us around, how to fall and gave us a chalk bag. We discovered climbing on the upstairs Boulder was easier than downstairs. It's $20 for the day with their shoes to use. We'd come back again.", "date": "4/6/2019"}
{"review_id": "oO0zXt5BzfmzjPJW1phnfQ", "user_id": "ofVsZ5BKgmEwyozNz80dBw", "user_name": "Victoria R.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 3, "funny": 1, "cool": 1, "text": "This place is awesome and for all levels! Great staff and atmosphere. I was in charge of our company party and this was a great place to have our activity! If you haven't done this before don't worry! The staff are super helpful with direction and can answer all your questions! If you are not into bouldering there's also some days they have yoga classes! Check their schedule out :) lots of parking too!", "date": "10/21/2018"}
{"review_id": "BdIPxmRDhqUENYMIH1SUvw", "user_id": "QIBzZuljqCOIuHRjl9GEMw", "user_name": "Mallorie N.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Super friendly, welcoming staff (patrons as well). Clean, roomy, well lit and great for climbers of all ages and abilities. Lots of classes available. Shoes, etc available for rent. Our family has been going there regularly for over a year and the boys love it (they climb/work out while I read/do hw on the couches or upstairs ;) ) everyone's always friendly and encouraging, great family environment, no bad vibes!", "date": "12/19/2018"}
{"review_id": "Ak2GNnBCHYuOom7jq443zA", "user_id": "gfvYAb5SAj4oe-6A9PctGw", "user_name": "Michelle M.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Super fun bouldering spot, brought my brother here when he was in town and he had fun. They went over the basics of how to fall properly and watched you do it. It was pretty awesome they had a ping pong table and fun workout area. After climbing we played ping pong for a while then messed around on the pvc parralletes. We had a blast!", "date": "8/27/2018"}
{"review_id": "oW8t9hzdIgfckJz2KS0gmg", "user_id": "FB9sfeKUiSNHgIfQQAVB2g", "user_name": "Ryan S.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It's been about a year and a half since I last went climbing and as my first time back trying out a new gym it was an ace experience! The staff made you feel welcomed and answered all the questions I had. It wasn't too crowded the day I went so there was plenty of room for us to try out a mixture of different routes. Their route setting is one of the best I've seen. There's some really fun routes! I would definitely recommend this gym for first timers and regulars. They also have a pretty good workout area to work on your strength, and finger grip and finger strength.", "date": "5/28/2018"}
{"review_id": "XgU6UWoJ5lxgfDBB-oLKBQ", "user_id": "v9IJq-R6FfTMbSeOAXEaLw", "user_name": "Andrew F.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I came climbing here a few weeks ago, and it's a great spot. The walls go higher than I expected for a gym that doesn't have ropes, and they have a lot of routes. It's been forever since I've gone climbing, so I mostly stuck to the easy routes. I tried a few of the harder ones, but I have zero grip strength. I liked the wall upstairs because it's meant to be traverses horizontally. It reminded me of being a kid and playing don't touch the lava. Overall this was a very fun gym and I can't wait to go climbing again!", "date": "8/5/2018"}
{"review_id": "nrD9phUyu9rNteAwSuQTnw", "user_id": "-i-pNHjjflNNYbD4b3S3jA", "user_name": "mamminger z.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great little spot. Love that this is a bouldering gym. The kids had a ton of fun here. We're definitely coming back again soon. :)", "date": "7/28/2018"}
{"review_id": "0vxSdc1QT_k6SG631ZiUDA", "user_id": "2dubkVlMgh3-QZbVXqEplQ", "user_name": "Greg B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 4, "useful": 0, "funny": 0, "cool": 1, "text": "I've been coming for a couple months after gym shopping the area. There are a lot of options for bouldering gyms in the area, and the wall is very competitive. The wall space is on the larger side, and I can always find some space somewhere when I go, usually after work M-F. The routes the setters put up are pretty decent, creative and varied. Routes are set by schedule (unless there's a comp) so you get new fresh stuff for your workouts, but things hang around (see what I did there) long enough to make a project out of. The mensroom is just okay; I would not touch their shower.I have yet to try their classes, due to scheduling, some at 5p or 5:30 would be great. Their training area looks pretty thorough, I plan on hitting it once I plateau again. The climbing team seems pretty active and competitive, not just a daycare for kids. Employees are friendly.", "date": "1/12/2017"}
{"review_id": "cZ5aWFOybadj8spHIYsi9Q", "user_id": "EiMmeh7whwTaVEQ2XZRVnA", "user_name": "Juan A.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The yoga classes are super cool.  It makes way more sense to have a membership here then going to a regular gym.  It's fun and you get a good workout.  Love the feeling of making it up a route that pushes you to your limit.", "date": "5/11/2018"}
{"review_id": "do8sIbe8zXDi0brndlL6gg", "user_id": "oDktNz4nP_XnQvD_FdrYZA", "user_name": "Lindsey M.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I am excited to be returning this week for my second round of climbing! I had such a great time the first time, I've been recommending this place (and really, the exercise in and of itself) to so many friends (and strangers)!While I wish the climbing options were a bit more expansive (more wall space, implying I wish the gym was a wee bit larger), I thought they offered enough for every level of climber. You definitely won't catch me attempting the inverted wall anytime soon though! Love the overall lounge feel, like climb at your leisure and relax as you choose. They also offer yoga classes from what I could read on various signs -after all it's a gym and you can sign up for a membership and perks, such and such!Chill staff members, definitive plus. Very helpful in giving tutorials and tips for a better climbing experience!", "date": "6/22/2015"}
{"review_id": "549iDF4ZSka5WdZ1k91wWg", "user_id": "g-bodSKORZR3cQ0qeptMUw", "user_name": "nicholas S.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 1, "useful": 2, "funny": 5, "cool": 0, "text": "Was here with the kids to have them climb. One of the workers rudly told us to get out of the gym area after one of the kids touched something that almost fell. Well if it was secured that would not be an issue so probably not the safest place . After I asked why didn't someone tell us then he say well there is a sign.... but we were there right in front of you for 5 mins while u watched us!!!??? What a smart ass he was he could have explained nicely the situation instead of snap at me. Rude.... then he tried to stare me down. He climbs for a living I teach jiu jitsu for a living. If only my kids weren't with me..", "date": "11/12/2017"}
{"review_id": "O1OAK7qGptjdGubMG7u-bQ", "user_id": "2CaNYzGKOwzwDT-Cfwq1Lg", "user_name": "Shelli B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I bought my son a membership here.  Great place.  Great atmosphere.  Challenging walls.  I felt completely safe dropping him off for a few hours to climb.  He really enjoyed himself.", "date": "6/7/2017"}
{"review_id": "JN_4o_iJWqtDmjxvYWSO6Q", "user_id": "O5WoMpq2H9Sd7NfQAZwl4g", "user_name": "Maya G.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 9, "funny": 6, "cool": 1, "text": "I. LOVE. THIS. GYM. Climbing is literally the only sport I really like, and my first send ever was a chunky blue VB at this very gym. I signed up for a half marathon like an idiot, so I'm taking a step back for a few months so I can focus on learning how to run without breaking my face or crushing my soul. HOWEVER, the time I've spent there has been nothing short of amazing. The staff is really friendly and encouraging. They don't just sit behind a desk and stare at you. They want to get to know you, they help with problems, and they provide awesome recovery advice. They're also funny as hell. The gym is always clean, and their music playlist is  diverse and solid. The bathrooms are spotless, their little kitchen they've got going on is organized, and they're consistent with changing the routes. Part of me wishes they opened a little earlier, maybe around 8 am, but I can't help but feel like even though I'm wishing for it now, I would probably sleep in like the lazy, useless turd I am, regardless of their operating hours. BY THE WAY! The age diversity at this gym is nuts. I've seen babies and baby boomers on the same wall. If you have a kid, and you're sick of seeing their face melting into their iPhone, for the love of all things high in carbohydrates, let them try climbing! I promise you, it's not just \"climbing a wall\". You build strength, flexibility, balance, focus, and problem-solving. You learn that it's okay to fall and mess up over and over and over again. Instant gratification is ruining our generation, and nothing is more humbling than falling on your butt (safely) repeatedly until you finally get both hands on that very last grip. I FORGOT TO MENTION THE CLASSES. Yoga. Bootcamp (is that one word, or two? I'm too lazy to google). Intro to bouldering. All included in the membership. THEY HAVE PING PONG TOURNAMENTS. Anyway, try it. Just...just go.", "date": "12/1/2016"}
{"review_id": "I3goqCpwTe-00d7U4U1wtw", "user_id": "sjOhXzXxXWsmcSi5kgAA2w", "user_name": "Brad K.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "pros:- TONS of bouldering- well-set routescons:- no sport climbing or top roping- sandbagged ratings- small training areabottom line: decent bouldering gym, but doesn't compare to the full experience of mesa rim.if you're exclusively a boulderer, the wall does the job; if you're not, it leaves something to be desired. the routes themselves are excellent: interesting moves, unique sequences, and tall, overhanging walls with safe landing zones. however, their ratings are quite sandbagged (i would add 1-2 to each of their V ratings) so a new climber might be discouraged. they have a variety of hangboards and a teenie workout area, but on the busier days it gets too packed. also, and perhaps this isn't a fair criticism for a bouldering-only gym, there is no rope climbing. this is a huge deterrent for me, as ropes are an essential part of my climbing experience and an invaluable training tool. overall decent, but you'd be better off exploring mesa rim, especially as a new climber.", "date": "11/24/2017"}
{"review_id": "KWi-6E1AEHaPblR4G8OWnQ", "user_id": "iGczVdFhEuHXTXiSYSFN0g", "user_name": "Pamela R.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "My son is the climber, I'm the observer and he loves The Wall!Friendly staff and clean gym.Holds for the beginner all the way to the extremely advanced, \"wow, I wish I could do that!\" climber.  A separate area for training as well with a peg board, rings, a climbing rope, slackline and more.  They have an early bird special...$12, including shoes before 2pm.", "date": "8/21/2014"}
{"review_id": "tIP7M2iJAEA11qK511GTMQ", "user_id": "3l_oad3_k41N0jcw8Zw7Yg", "user_name": "Brandan S.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The Wall is a great place to go to climb. If you're looking for classes to learn to climb or just looking for a great work out they have all of that. The team of employees there are very nice, and they change the climbing routes out quite frequently so that climbers don't get bored. The price is worth it at $60 a month, if you're going every day. I really enjoyed going but for me it wasn't worth it when I didn't have anyone to go with.", "date": "6/28/2017"}
{"review_id": "cy9wed_1qk84fdP2OF0ORw", "user_id": "erZDsKvOfzutbvM6vPXpAQ", "user_name": "Rachel B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went here on vacation because a friend invited me and was intimidated because I haven't really stayed in shape after high school. When I walked in there were a lot of people so I just watched for a while. After about half an hour of seeing how fun it looked and seeing how friendly everyone was I decided to give it a try and loved it!! There was no judgment, the owner personal gave me a training to get started, and I didn't feel shy at all once I got started. If you are in the area I definitely recommend checking it out, it totally motivated me to use my body more! And they have different courses from very beginner to what looked like very advanced, as well as yoga classes, a slack line, and gym area so there is a little something for everyone!", "date": "5/31/2018"}
{"review_id": "xwzQVoODSnG7vUyPdInqcg", "user_id": "NKBZealc4PB5DGgBB3C51g", "user_name": "Analise D.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time. Yoga was great and included w entry. Employees were very helpful, Victor was awesome. He even explained what shoes are best to learn and advance in. I'll definitely be back.", "date": "3/24/2017"}
{"review_id": "eoa9eLI4EhC6iAh7tw9U2Q", "user_id": "NKAu6TmHG5CGAybhgnmX3w", "user_name": "Dylan R.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came in for the first time with some friends that are regulars. We were hesitant at first because everyone seemed so good. When we finally decided to try we went up to the counter and to our surprise the owner named Randy was working it! Smalls businesses like this are what make the world go around. Amazing fun at any level of climbing. 100% recommend this to anyone looking for some fun! Don't be discouraged, there is a wall for everyone. Keep up the good work and keep places like this in business!", "date": "5/24/2018"}
{"review_id": "-pkCLzGeGKh-xK-sbkSwZg", "user_id": "_uCPEh56iVbeYGAK0S78sg", "user_name": "Kathy D.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "I am so glad to find this hidden gem in Vista, CA.  I just started getting into rock climbing, and this gym is great!  The walls are for bouldering which is a bit more difficult that regular rock climbing.  The climbs are challenging, but it will give you a great workout.  I love that it is mainly for bouldering, and you can take your time and make as many climbs as you want. Great place for boulder climbing!", "date": "8/9/2016"}
{"review_id": "Y0EGeP3a-L60CruMibNxEw", "user_id": "e9-FgTwG3Acez_yt5ony_Q", "user_name": "Sara S.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Everyone is super helpful here...some employees overly honest but I guess a business like this it's not so bad..we got all the help we needed along with shoes, chalk and harnesses, and had a great time climbing. The levels on the wall were pretty accurate, but the ones on the boulders not so much. Overall great experience, and we will be back.", "date": "8/15/2017"}
{"review_id": "-6uC_StHETBpRt56aF9k-g", "user_id": "IwtpHYDunJs9Wi8t-xQZxQ", "user_name": "Micah P.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I had a great time at the wall climbing gym.  This place was definitely a challenge.  It will make you realize how out of shape you really are, but has a friendly staff that is there to help and encourage you.   I had fun with the V0 but didn't have enough finger strength to do the V1.  They gym here is very spacious and clean.  I really wanted to do there cross fit that they had going on. The instructor had some cool exercises I have never seen and fun workout area.    There has plenty of places to sit and comfy couches to chill on. The only thing I wish they had was ropes and taller walls.  To get done you have to jump down about 5 to 10 feet onto a pad.  The pad is plenty soft but still would like the safety of the rope.All in all this a good time and had a great time.", "date": "7/28/2016"}
{"review_id": "4lRnBXp9F3sn2R3JOdoOcw", "user_id": "FRduSfMfb3qBHlK42nyeww", "user_name": "Janet H.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff here is friendly and helpful.My kids (age 11-15) had a great experience here with their friends.  On top of that I appreciated the great price for the introductory month.", "date": "12/20/2016"}
{"review_id": "kNomVU23piu9zsc9rD_UUg", "user_id": "LdR2u6iwOD8-0lYX0TGOww", "user_name": "Benjamin B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "First off, The Wall is a beautiful facility.  I stopped in for a day pass just a few days ago while I was down visiting some family who live close by.  There were a couple other options I could have went with, but the giant overhung surfboard in the middle of the bouldering wall caught my eye. I arrived just as they opened and it was a weekday so there were only a few climbers around.  Nice clean and quiet, unlike my normal gym.The bathrooms were modern and clean.  Yoga studio with hardwood floors and heat.  Training areas are large and state of the art.  Cardio equipment.  Coffee station and small kitchen.  Also a water bottle filler - something cool i hadn't seen before.  Interesting artwork.What makes it 5 star for me is the climbing though.  Afterall, that is why i went there in the first place.  I found the setting to be noticeably different than my home gym.  I found myself using unusual body position and really had to think about solving some of the boulder problems. For insurance reasons you can't top out any of their problems, which is a slight bummer....i guess the cost of their premiums could be really high if they had top outs....none the less you still get pretty high off the ground, enough for it to be exciting, and if you fall they have an excellent crashpad floor to soften the landing.Also, the holds themselves were all very new and clean.  They have spared no expense in this department and it pays dividends in the quality of the climbing experience.I will absolutely be back next time I am down visiting family in the Vista/Carlsbad area.", "date": "1/9/2016"}
{"review_id": "bnsoW93SSXn6FE3pXRjAQQ", "user_id": "1vdgPSYl4kIn2Yj4ze1b3g", "user_name": "Josette M.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "After hearing great things about the wall climbing gym,  me and my husband went to check it out over the weekend and we were so impressed with how awesome it was. The climbing was so much fun and had different combination of all levels, and great for beginners! The gym itself was beautifully designed with a really colorful, bright and fun decor. They had fun alternatives for the climbing such as the wave where you could do inverted climbing! They also had a beautiful yoga studio and some cardio equipment. The climbing was such a great all over body work out. The staff were so friendly and helpful and gave great climbing tips / advice! Can't wait to go back!!", "date": "2/28/2016"}
{"review_id": "O8Q1h01Mhv5CwUQYO3smLQ", "user_id": "ZV-igYZbuetjkaAdwvpuyQ", "user_name": "Kate A.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had a fabulous time climbing here. I went during a slow time and pretty much had the place to myself! The staff was super friendly, helpful, and knowledgeable. I'll definitely be back!", "date": "2/5/2017"}
{"review_id": "aMyGWlglLUGtsf3Vqi4kqg", "user_id": "yNEou1DEHozk_ApFQnY6iw", "user_name": "Jennifer Y.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So much fun my kid went on a school field trip and came home and couldn't stop talking about how much she loved it", "date": "5/11/2017"}
{"review_id": "sEFASQ1x8m88H5FG-ThZCg", "user_id": "P1n6snwgVD1ixRBuGstVOg", "user_name": "Jeff U.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I take my 12 year old son climbing here and always have a great time. Cool people and plenty of challenging climbs that they modify often keeping it fresh. When our arms get too tired to climb we end the visit with a game of ping pong or 2. The slack line upstairs is fun too. Looking forward to getting my 9 year old daughter climbing with me here soon.", "date": "12/29/2016"}
{"review_id": "WHRfFu62FB5LFmHtyQX65A", "user_id": "63n3O_yWScykILEPF_L2GA", "user_name": "Matt B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very friendly atmosphere at The Wall. The best climbing walls in North County!  It's a very spacious gym with plenty of room and lots of great climbing challenges to be enjoyed.", "date": "12/20/2016"}
{"review_id": "Pkdr3rdj5KtYls2aLVuMUA", "user_id": "6_j1zUKe_nhEzZFqDY9aHw", "user_name": "Skyler J.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The Wall was an awesome place to Boulder. The staff was very generous and will to teach anyone who needed help with their first time bouldering. The Wall has other things to do like yoga and their gym that is included with the price. The only downside is that you have to be over 18 to use it. Other than that everything was good the price for a student was 14 dollars for the whole day couldn't complain with that. I was very pleased with the facility and will definitely be back soon.", "date": "12/4/2016"}
{"review_id": "_MW1_EBCDZ7CoX-Y3LoOmQ", "user_id": "q1woBr64XfQHtW_ROkc_5A", "user_name": "Mike O.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "One of the top gyms in San Diego! Highly recommend checking this place out if you're a first time climber or a veteran.", "date": "1/14/2015"}
{"review_id": "UdW_x4nS-lJEYt-tL0WY8w", "user_id": "NKbVHb94TDcA2SljSMPlSA", "user_name": "Torrey S.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "The Wall has some great things going on- this is much more than just your average climbing gym!First off: the actually climbing portion of the gym is huge. They re-set weekly or so; you will never bore over the same problems. I really appreciate that they try hard to create a combination of all skill levels- the experienced will still have a challenge and everyone can still come here for the non-climbing superstar like me, haha. The Wall also offers yoga classes that are donation-based (included for members) - this is a great concept and allows even non-members to participate in the overall vision of the company that surrounds health and wellness. There is also a full training area. The topper though is the staff- I always feel welcome. I often find it intimidating walking into a climbing gym, especially if you are new to the overall scene- not here though- they are here to help! I know they are currently expanding as well which means that it can only get better from here!", "date": "5/29/2015"}
{"review_id": "YIjJP3vhW-lc_dbC1coE1Q", "user_id": "mHcfXnviKXH0__2esynNnA", "user_name": "Pablo T.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The staff is always super friendly and The Wall always has a good feeling vibe, I love it here", "date": "11/30/2016"}
{"review_id": "ziUMIFboLM47V3EKQHbb6w", "user_id": "suCtOp_sZNtbMJ0_b1K7RQ", "user_name": "Victoire C.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "Man do I love this rock climbing gym! The Wall is incredible. It has some of the tallest walls, 18 feet or so. The flooring is top of the line. No problem falling from any height. Another thing that makes this gym stand apart from other rock climbing facilities is the climbing specific training area with hanging rings, atomic bombs, rope, crack wall, and much more!And let me not forget their donation based yoga! Can't get a better deal on yoga than a $10 suggested donation. If you are a serious climber you need to be training here. If you are new to the sport or just curious about climbing this place will blow your mind out of the water and spoil you.  The Wall Climbing Gym is one of my favorite climbing gyms in the US. Hands down!", "date": "8/19/2014"}
{"review_id": "_9Vvifkuyf2AvfBRi_Dlcw", "user_id": "HOSI0CVqfATJoal-4I9X_A", "user_name": "Sean F.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "When I first came here, it was to find a place I could climb while I was in Carlsbad for my 2 month internship. I wasn't looking for anything special, just a place that gets the job done before I went back to my regular gym in Orange County.  However, I grew to love this place and I'm sad that I will be leaving in a month. What will I do without the fresh new holds, yoga for climbers, and that gnarly cave? Everyone is very friendly and helpful; all the problems are wonderfully thought out, and not to mention the sick ass cave. They reset one part of the gym every week so you'll always have something new to climb unlike many gyms that will leave problems up for a months at a time. Also, many places will keep caves for experienced climbers, but here, they make sure to include some V2's and V3's in the cave too, so amateurs don't feel too left out. :).Because this gym is brand new, so are their holds. You won't have the issue of climbing on smoothed out, dirty holds. They also color-code the problems with their holds instead of tape, like many places do, so you won't have to worry about looking for a piece of tape in the midst of 50 other pieces of tape. Ever find that black holds look like dark blue holds? Do you get frustrated that some gyms cross 2 problems with black holds, and you can't figure out which hold is associated with which problem? You won't have that problem here. They set the problems so that there is no confusion between 2 problems that may be next to each other. Their workout area? It's all you need. They have pull-up bars of different sizes, they have a slack line, weights, gritty pull up ball shape things, fingerboards, and a bunch of other stuff that I'm not knowledgeable enough to explain.And the Yoga classes! I've only been to Yoga for Climbers with Mary, and it was the first yoga class I've ever taken, but it was great. Awesome thing to do for a rest day where you get to stretch out all your achy muscles. My entire time here has been during their soft opening, but their grand opening is coming up in a week and it definitely will be the place to be. It would be wise to come in soon before it gets too crowded, because this will definitely be the climbing spot in North SD County.", "date": "7/13/2014"}
{"review_id": "zhoUcV1t2-RRrISeWsZtqw", "user_id": "Dvc13jub0s9I5DbUzCFNpQ", "user_name": "Melissa B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place overall. I attended the Yoga class with Brittany so this review will be about that and not wall climbing (maybe next time). First of you the staff is helpful and welcoming which is always a plus. The yoga studio, I would say could accommodate maybe 10  comfortably. They have plenty of props including blocks and straps but I would suggest you bring your own mat. The class itself was challenging but not impossible, the teacher did encourage you go at your own phase and offered pose modifications for all levels. Personally, I highly enjoy the end of the class. Brittany (teacher) went around spraying essential oil that smelled amazing and enhanced your relaxation stage. She also rang a bowl that sent vibrations through the room and that surprisingly felt great!  Brittany's class combined the physical and mental/spiritual aspects of Yoga which is sometimes hard to find.", "date": "6/9/2016"}
{"review_id": "FNHF4wNfkTaWMIX1u811ww", "user_id": "lsd2iktbPxL0uqlSB1BAYQ", "user_name": "Thalia L.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "For my first time wall climbing. No going to lie my hands hurt but it take practice and good technique. That's for all the great tips. I really enjoyed this for my first time. I was actually able to climb. I had a blast. Will be coming back. Thanks Gabe for a little inside scope on the walls. That's was cool to know.", "date": "6/9/2016"}
{"review_id": "AxagNgHxZ_2H2UDQyDYXNA", "user_id": "WgPCaY0wJR6YqFaiuBvQ7A", "user_name": "Trevor L.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great bouldering gym with a lot of different climbing/training areas to keep you busy and coming back. I love taking my son here to climb with me! He thoroughly enjoys himself here and loves seeing other young kids to climb and play with.", "date": "8/15/2016"}
{"review_id": "mTioJn4HNnv3L2pso1RjMQ", "user_id": "tXQoU8YjsSeLspO01k4l4g", "user_name": "Caylee D.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "I don't usually write reviews on yelp but this is the best climbing gym I have been to. It's very spacious with plenty of room to hold lots of people so it never feels crowded. Their workout area is totally comprehensive for any type of bouldering workout and their yoga studio is awesome with really great classes for any level yogi. If you like to boulder, do yoga or weight train you should definitely check this place out. The people here are really cool too and are eager to help in any way they can. Great environment.", "date": "6/27/2014"}
{"review_id": "LCZI9VXS7wt126rcewt22Q", "user_id": "oeK_idZ52gY0MiMivTu5NA", "user_name": "Sherman S.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 1, "useful": 4, "funny": 1, "cool": 0, "text": "It's a cool place, but had a very bad experience 3 times in a row. There is no communication between management and staff, therefore customer service is worst then any other climbing gym I've been to. This doesn't effect everything in a gym, but it relates directly to membership, purchases, and questions.", "date": "8/22/2015"}
{"review_id": "b2jWO7k3sB2fusVrVxEVbw", "user_id": "oUZx8t1t8Sl5LIXFkTsXkQ", "user_name": "Ben V.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Randy is the GM over at The Wall Climbing Gym. He's a great guy! I wouldn't go anywhere else. This place is clean with great customer service.", "date": "5/2/2017"}
{"review_id": "Tq2DjDDjnHDWhVJteapX0w", "user_id": "t9rtz3xZmqUvpRhaYLvc5w", "user_name": "David H.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 2, "useful": 5, "funny": 0, "cool": 0, "text": "Been climbing off and on here since they opened. Seems that after a year they figured they would raise their day rates to $17 and no longer offer the $12 early bird special. Other gyms in the area have for years only charged a $10 day fee and are just as good. The routes are good but few in number. I saw nothing in the year since they have been open that would justify the increase. Gonna be awhile before I come back, if i ever do.", "date": "7/2/2015"}
{"review_id": "bjjJaUouBdGDbyWJbAwM8Q", "user_id": "iCoBs9vhNzi2hgm2wafzxg", "user_name": "Spencer C.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Friendly people, nice place. Their crash pads are pretty nice, I haven't hurt myself yet.", "date": "7/31/2014"}
{"review_id": "QHmL6T1m2he-SsW21sgWow", "user_id": "mIsR0FFo_fIBmn_rlsIY3w", "user_name": "Tianyu Y.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went to Mesa Rim today and I guess I've just been spoiled. The holds were grimy and the venue just felt like an old gym. Walking into The Wall, the space is inviting and the place is well lit. Everything is clean, yet their is an air of casualness. When you're tired at mesa rim, you can sit next to some stinky shoes. When you're too tired to climb at The Wall, you can play with someones dog (BANNED at Mesa Rim BTW). I originally went to The Wall because of a groupon deal (amazingly cheap btw), but it's just so far away. Maybe one day I'll live closer, but until then I'll be rocking my tank top from them at every other gym.", "date": "4/29/2017"}
{"review_id": "3IAZ7RlBqMT2HtyEjBS-aA", "user_id": "Rf_raStwLQDRO18GbIs3HA", "user_name": "Em B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "REALLY warm, friendly, merry staff members who serenaded me on a ukelele as I walked in. Hilarious! VERY sandbagged and tendonitis-inducing routes (think Stone Gardens in Ballard/Seattle with dyno's on more than half the routes....).", "date": "6/14/2016"}
{"review_id": "Jm_-OH13nXDUT6dJfAuDnw", "user_id": "qao2DcGZ7GIQNoHnsRtFDQ", "user_name": "Kelsey T.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "All the staff is super friendly, easy going vibe and helpful. I don't go to climb, but do go to the Monday Wednesday & occasionally Friday yoga classes. Traci is my fav instructor, (Mondays at noon) she warms you up plenty before going into a nice flow.", "date": "12/3/2016"}
{"review_id": "tdtyD5CPyB9nqSGfhjRv0A", "user_id": "clfZ4DS9gKWzBPHjbLuilw", "user_name": "Craig G.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My son Dylan went there for a week and said It was really cool and a lot of fun! He was a little afraid on day one, but he gained confidence and friends as the week went on! He now loves rock climbing!", "date": "7/21/2015"}
{"review_id": "IfVC4srT7xO6KHSgzU_fbw", "user_id": "nRQ2kCBguv6ZH-VFzbEYCg", "user_name": "Angelica T.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "cool place to come climb hangout workout do homework, i brought my cat once and it was ok but ive heard, since certain events, no pets are allowed now??", "date": "6/1/2016"}
{"review_id": "F2mQJ-3DLW7AGzUg5v23qQ", "user_id": "-uTtBXSA14musZMD7Ca2mA", "user_name": "Angelina R.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came in with kids and the staff was friendly and able to help right away. Gave a falling demo. The area wasn't too crowded. Didnt seem to be many options for true beginners (no experience with sports or outdoor activities) but the kids enjoyed them self none the less.  The favorite was definitely the tight rope/strap for balancing. So fun! Will back again to do some climbing myself :)", "date": "4/11/2015"}
{"review_id": "lD7QSldXq-NWPrtPZiF-lw", "user_id": "gEAPZYWu7BzqOLZdfW7MBg", "user_name": "Christopher C.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "The Wall Climbing gym is Awesome! Their walls are some of the best indoor climbing walls I've seen. The variety of terrain is excellent, the features are cool, the colors are fun, and the route setting is great. The staff was great and the community was really welcoming. I look forward to heading back and sharing this place with family and friends.", "date": "6/26/2014"}
{"review_id": "2nrZV8XBf4i95zuaRhqbJQ", "user_id": "WsOJwl_Uc4FsRHz4EHInnA", "user_name": "Katherine S.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Super long post below. Sorry!This is a new gym that opened about two months ago so everything is pretty much brand spankin new. My hands took a beating but I could also say that is also due to the fact that I was climbing like a baby tonight. The gym is super spacious and the layout is nice and open with routes spaced out. It didn't feel like you would get in someone's way if two people hopped on at once, although I haven't tested that theory yet since I missed the rush when I came in. There's also a nice little snack area where there is a fridge (not sure if it's for everyone to use though), microwave, and a sink with dishsoap and drying rack. The routes are color coded and the tags have the rating nicely bolded. There is a strip of color on the bottom of the tag indicating which route it corresponds to. Only thing that was unclear to me was that I wasn't always sure which holds were the starting holds.Shout out to Clay and Alicia. My front helix piercing fell out and when I was trying to put it back in, the post fell out of my hands. They were on their hands and knees helping me look for it until I realized it had fallen down my shirt. Whoops but thanks guys!I'd be here a lot more often if I lived closer but prices are beyond reasonable for what you get. Fridays are college nights ($12 from 5pm-11pm), early bird ($12 M-F before 2pm) and ladies/wear pink nights ($12 on Tuesdays I believe).", "date": "8/14/2014"}
{"review_id": "ci-FkWS2cf38RiLOHW8OjA", "user_id": "AmL57N_ZMzvyylU6HSPCxQ", "user_name": "Derek L.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I am relatively new to bouldering but I really like the idea of it.  Its like golf, you can be bad and still have a good time and there is always room to improve.I was met at the front desk by one of the owners, Matt who was very friendly. Apparently everyone new gets an orientation on how to fall properly, which i thought was helpful (and i used), so Matt ran me through that.  Then I was off to climb.The facility is pretty epic, lots of wall space lots of different problems and a very fun training area with slack line, pull up bars, weights, TRX and other stuff. Very much for functional fitness.I didn't go to a yoga class, but did meet one of the instructors, Mary.  She was delightful.I will be going back", "date": "7/9/2014"}
{"review_id": "-PxkmiU51rOKsCgHYiBicw", "user_id": "Y6XegNIMu45jZP6wtc29zA", "user_name": "Elizabeth P.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! I like that they have crash pads, unlike some other gyms in the area. The environment is friendly and not overcrowded. Guys who own this place are really friendly and welcoming too, as well as the staff. I am considering a membership! If you haven't checked this place out you're missing out!", "date": "3/4/2015"}
{"review_id": "UVv3lUSFtUamMC_58xcQ6Q", "user_id": "HfiKERmnS15RcKuzcUVZMg", "user_name": "Sierra B.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is so cool! It's spacious and clean and the staff are great, but the setting is really what set it apart for me, definitely my favorite of any gym I've been to! There's an awesome mix of slabby, balance routes and nice roof climbs on the huge arch. I'll definitely be making the drive to go back soon!", "date": "6/30/2014"}
{"review_id": "doMEByCJX5Uuon3bcyFJrg", "user_id": "Dv6zH54-wQVXwHbp1Yu_cQ", "user_name": "Wes D.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome spot for a great session and burn.  So glad I found this place.  Really cool staff,  good range of problems,  one of the best indoor gyms Ive visited.   Definately will be back on my next trip to the area.", "date": "6/30/2014"}
{"review_id": "quwVBqWEzCnFBxbR_073MA", "user_id": "dHPxwYWW_5m7COH3HoKYjA", "user_name": "MG G.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Dooooope! Super friendly staff. Good fun for the whole family! I'll be back next time I'm in town!", "date": "6/26/2014"}
{"review_id": "FW-tj1FxbxbebiMf6JPoLA", "user_id": "6hx0nfNbaaW9ssvWqaKZuw", "user_name": "Maryann G.", "business_id": "XQp7oU5yYnRFPTWGmlx8IA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Great experience during my recent visit to the Wall! One of the tallest top out boulders I've ever seen in a climbing gym, and the facilities and wall are really well laid out. The yoga class I took was amazing and the instructor was super with lots of positive energy. The climbing specific training area is really well designed and will help me to become a stronger climber! Everyone was super friendly and eager to make my experience the best!", "date": "6/28/2014"}
