{"review_id": "79SaNm6-gZ7Prr8J_ovQ9g", "user_id": "jDfC3XHefzHpd4xP7zVkww", "user_name": "Arleigh R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love Love Love this place! If you're interested in climbing, this place is perfect. I finally took the plunge and became a member and couldn't be happier. The staff at VH is incredible! They always welcome you with a smile and are always willing to help. They are extremely encouraging too!The gym is great, the routes change often but not too often so that you can really harness your skills and challenge yourself. It's a super laid back feel and the sense of community is really special here. I've met so many wonderful people at this gym. They have a weight room that has all the basics you need and the upstairs has a slack line too.", "date": "5/20/2019"}
{"review_id": "ecj5ob9Y-BZU-_taFOBD9w", "user_id": "PuU6ew5y4S70KXmn0caCxA", "user_name": "Michelle N.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I introduced rock climbing to my boyfriend about a year ago when I first saw Vertical Hold had a Groupon. We initially went to the Poway location, but now regularly go to the Old Town location. We started a couple's membership as we've been hooked on going back every weekend we can. SD/Old Town location definitely isn't as open as the Poway location, but has just as many great routes and staff. The Poway location has a bigger gym area, with 2 treadmills and a ping pong table. Vertical Hold staff members are always super friendly, whether they greet us or are helping out newcomers, they are always patient and willing to help. It seems like this location switches out routes on different walls every month or so, which helps keep routines from getting dry. There's always a challenging route that I want to complete before they switch it out, but also a great balance in easier routes for warm-ups and just being able to finish a climb. They have two auto-belays in case you come alone one day, and have several bouldering routes.Other climbers here are always nice, which is great to know there's a community here that is collaborative in giving pointers or tips for routes that may seem challenging to one person but isn't for another. I definitely recommend anyone to try rock climbing with their friends as it's a fun activity and gets your heart pumping - whether if it's from using all your muscle strength or the thrill of going to new heights you've never thought before!", "date": "5/10/2019"}
{"review_id": "469Jof1IOeEsnlFIhn4X5A", "user_id": "sRDnMobOTDQhF3rWyGpI6w", "user_name": "Matthew G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I am beyond amazed that Vertical Hold let us bring our kids out to enjoy a day on the walls. We are a mentorship group with Urban Surf 4 Kids that serves foster youth and at-risk teens so when we were invited to bring our kids for a complimentary day was so moving. The confidence that is wrought from the struggle up a wall is extraordinary, just like our kids themselves. They begin the day thinking that they can't even go up the easiest of walls and end it racing up the more medium based challenging ones time and again to beat each others' times, pushing themselves each time up the wall.We serve our kids with Aloha and the giving bestowed upon our Hanai mentors and Hanai kids on this day is so graciously appreciated.Aloha to you and your amazing staff.Mahalo, US4K", "date": "3/4/2019"}
{"review_id": "t6QfP24SKeDgflgMDqjDMQ", "user_id": "3sVC_jyU2mqQhpVkeJlcQw", "user_name": "Einna S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "My man & I hosted a little gathering for some of our friends. Luckily, the guy that helped my group was awesome! Shout out to Fran!  He made everything feel comfortable & provided great instructions! Everyone seemed to enjoy it. I wouldn't mind coming back if we want to do some belaying. Typically, I boulder at another gym. Great change up!", "date": "11/22/2018"}
{"review_id": "JR22okxP2L8zKdGpwBtEGA", "user_id": "pC9FwVfNInWkrABSslPmaw", "user_name": "Natalie P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "My friend and I bought a Groupon here.. and for $28/each.. we got a belay lesson, unlimited climbing, and gear for 1 month. The place is big and open. There are a variety of difficulty levels for climbs as well as climbs with ACT vs grigri methods. There is also plenty of bouldering. We took the full belay class-- Ben was our instructor and he was terrific as he was so patient and helpful. We quickly grasped the concept for figure 8 knots and the whole belay system. He had us climbing in no time.. the whole process took 45 minutes. And now we can join our other girlfriends who climb.. because we can prove to tie a figure 8 knot! Thanks Ben! We also saw kids there-- kids are able to climb but have to be at least 13 to belay. Anyways.. we will certainly be back. Looking forward to my next climb here.", "date": "3/23/2018"}
{"review_id": "gDy8mG6bgRzUAvZXauHesA", "user_id": "FeGL0PAHNoAcQ9UP4_uKnQ", "user_name": "Rodney Z.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "We had an awesome experience at this place! The guy at the front was so nice and helpful. When we told him it was our first time at this place he welcomed us and helped us get the best deal. It was my second time ever rock climbing so instead of charging us for the beginner package he let us pay just for the day pass and gave us a quick refresh lesson with no charge! The whole staff is friendly and helpful. The gym is great! They have walls for beginners and more advance rock climbers. Everyone there seemed friendly and there was just a great vibe! We also had a very great time bouldering and using the other facilities -they have a weight lifting, stretching and a cardio area which is very convenient for a full work out. When we left, the guy offered us to come back later for a yoga lesson which was included in the day pass!", "date": "3/13/2018"}
{"review_id": "VLuvSrhn6wZhFPYeURdPYg", "user_id": "1MwanAkjNuiUdvTxYPj4pg", "user_name": "Ben Carlos D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Came here today to experience rock climbing. One of my friends has become a rock climbing fan and we decided to see what it was all about. The entire process was simple and easy. If it's your first time then you use one of the iPads next to the desk and fill out a waiver. One of the staff members hands you a harness then some shoes. The staging area has cubbies for you to put in your belongings. Once you're ready, one of the staff members will teach you how to clip on, climb and belay. They'll stay to ensure everyone understands what they're doing and leave when everyone understands the basics.They have multiple routes with various difficulties. You can start off with 5.7 or just jump into 5.10. There are two rooms and there is a small upstairs area in each room. In the main room, there is a slack line you can try to walk on. They also have some yoga mats since I guess they also have yoga classes in the same building. In the other room is a huge area for buildering and upstairs are some weight lifting equipment. Their bathrooms are clean and they have a tiny locker room area. Not sure if intentional but the guy's bathroom had moisturizer which is super helpful when you dry your skin with chalk. They have tape and band-aids at the front if you need them. The environment seems super friendly. The staff is always ready to help you out. People are very respectful and mindful of others. Some people will actually cheer you on. I think this is super important if you're just starting out in anything. Finding a sport you like and a supportive community is always essential to anyone's fitness journey. I would definitely recommend Vertical Hold to anyone looking for a rock climbing gym or just to try rock climbing.Also...if you're unsure about trying rock climbing they do have packages available to help you ease into it. They also seem to have technique lessons if you want to further your skills. Lastly, if you are still on the fence about it, think back to when you were a child and you climbed, jumped and explored everything. Rock climbing is the grown up version of that.", "date": "7/15/2018"}
{"review_id": "u2Rp13ZGLI5sn021keVJ3A", "user_id": "UGpVy5bZZJ0uHmOs91udwQ", "user_name": "Jocelyn V.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great. My boyfriend and I had a Groupon deal and wanted to try rock climbing for the first time. Their staff is pleasant and friendly, they are very welcoming to beginners and patient throughout the learning process. The gym itself always has available areas for climbing. There was never a time were I had to wait for anyone to climb. I highly recommend this place to beginners who are interested in climbing. Don't underestimate this gym, my arms and legs got an excellent workout. And it's so satisfying to see yourself progress in your climbing abilities.", "date": "2/9/2019"}
{"review_id": "sLwqldXPjrg_K_IRWVsERA", "user_id": "IfCThfT6JlbUGvIxrUcNGQ", "user_name": "R Chalom B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The people running this place are super nice. I have been a member more for 6 months and yes it's really difficult to get into and there are other more expensive and maybe they have better locker rooms but this place is a real as it gets.Everyone is really friendly, offering advices and really great vibe. I def recommend you checking it out, they always have groupons promo and that's how I got hooked. Good luck.", "date": "2/13/2019"}
{"review_id": "vA1ovNXCChTCw4JgqU1-zg", "user_id": "bZnr4s8bCQyIkzSM9ruyaw", "user_name": "Ariana A.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time here. Arianne and Melody were amazing! Would definitely come back to this gym for rock climbing. Everyone is super chill and good vibes! Check this place out :)", "date": "3/23/2019"}
{"review_id": "hlweuV4se1aJCL4ZHbG3nQ", "user_id": "JXiioaYZ8Mqm7zotMxYAIw", "user_name": "Sochietta K.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "New to rock climbing or advance? Check this place out! Came here with family and my sister and nephew have never rocked climbed and they came it loving it! Staff is super friendly and helpful. If you are a student there is a discount. If you don't have the gear you can rent it all ( harness, shoes, chalk bag) for $20 all day pass. Reasonably price.  There are easy trails and harder ones you can even boulder. Make sure you have someone that can belay. Or can learn quick the staff shows you how to belay quickly as it does get busy.You get a nice work out in so added plus and children friendly. Would definitely recommend coming with a friend!", "date": "10/8/2017"}
{"review_id": "v-EsKQD1dHUZdw8FCasnTA", "user_id": "0pZYfXeJWGa-y6E6oyIRRg", "user_name": "Emily H.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I've been coming here regularly for over a year now, and absolutely love this place!First off, my friend and I knew absolutely nothing about climbing when we first started coming in September 2017. Even so, as we went through the belay lesson (I don't remember now who took us through it, might've been Dorian), I never felt singled out or self-conscious about being a beginner, messing up the knots, etc. Staff were (and still are!) always very patient and accepting of all skill levels, and by the time we started going up the wall, we were at least confident that our knots would hold and we weren't going to die.After that, we started coming about once every 2-3 weeks for the next few months. Eventually we ended up getting our own gear instead of renting, but even when we were regularly using the gym's gear it never looked on the verge of dangerous--a little beat up, but sturdy. Staff are professional yet chill--it's clear they enjoy their work, are passionate about climbing, and aren't overly focused on making a buck. In fact, there were a few times when we were renting gear that the folks behind the desk would shrug and just tell us we could have it for free. (Don't take advantage of that, though--they deserve our money!) They also set new routes at a good pace, maybe every 1-2 months, which keeps everything new and refreshing.A year later, I'm climbing 5.10a's (and the occasional 5.10b on really good days), and my friend and I have the couple's membership. It's one of the best investments I make, IMO. We're not pros by any means, and I'm still pretty intimidated by the bouldering room, but whenever Wednesday rolls along and it's time to head to Vertical Hold after work, I'm always super pumped and excited.Only suggestion: a locker room would be great! Or at least a closing door with a lock to the women's bathroom area so there's a place for me to change from work clothes to gym clothes without taking up the only ladies' room in the place.", "date": "11/29/2018"}
{"review_id": "bFFN1wbVYgfFaLHnpF68Ow", "user_id": "ABmzo9oUGCbe_3Tf10qPHw", "user_name": "Mark S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "A true climbing gym.    On my visits to San Diego this is my choice of gyms.   The staff is incredible with sincere care for their climbers They have been around even when climbing wasn't a trend.   It's small, without all the bells and whistles of \"new\" gyms in San Diego It's well worth the visit.  A special shout to the \"Dani\".   Thank you for making my nieces feel welcome.", "date": "1/12/2019"}
{"review_id": "Gqe9i-ofgkfhEyT437DWQA", "user_id": "IYSuvJHKKbGNxkJgw_rtmQ", "user_name": "Zeina E.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had such an awesome time, the staff was so nice. It had been a while since I went rock climbing (only been once before years ago) so I needed to be refreshed on all the tips and techniques. Our instructor, Danielle, was very attentive and showed us how to belay and other safety tips that you need while climbing. I started out on the easier levels and found my self working my way up to the more challenging levels. What a great option for a work out, I felt so good afterwards, will definitely be returning soon!", "date": "3/1/2019"}
{"review_id": "EC7sxila47N7d-ftD7nY-Q", "user_id": "yL1bCMG4L2UdyTShCrl-3A", "user_name": "Jenny G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "This gym has very friendly staff and self-belay walls which is very convenient when you go on your own. However the walls are limited; not a lot of variety so if you have a membership it's hard to go over and over because you're doing the same thing. There is a very small gym with very outdated equipment so it's not very usable.", "date": "3/1/2018"}
{"review_id": "yS6IfZOpG3OR6_XCP8RTuQ", "user_id": "GlT3DIot81AHeLPY8G0gHQ", "user_name": "Olivia C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 2, "cool": 0, "text": "My sister's a member here and dragged me out for a full-body workout. While I didn't die as expected and am not the biggest climber around, I had a great time in the facilities. Service: as a first-timer, I had to sign a waiver but that was quick and easy. I hadn't learned how to belay before, but the staff was OK with my sister teaching me without imposing any additional fees or mandatory lessons (as I've heard other places do). It's also great that dogs are allowed inside, which makes the experience livelier and memorable. Size: adequate size, since we came off-hours around 730pm on a Friday night. My only complaint is the lacking amount of storage for personal belongings. Since there was no space, people were leaving bags on benches and floors. While no theft occurred, I'm wary when it does get busier.", "date": "2/8/2018"}
{"review_id": "FriFoMpXgSrPANRAHqtJtA", "user_id": "4HcaHH6J4YLk2xfZ46whww", "user_name": "Ryan R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "If you're in the mood for some new hobbies or maybe you just want a new kind of workout, you cant go wrong with rock climbing! Vertical Hold makes it fairly easy to become a regular member, or if you just wanna try it out with some friends for a day, they've got decently priced $17 all-day passes as well!This place is formerly known as Solid Rock Gym. I've been here plenty of times before the new ownership in late 2016, and it seems like the set up is practically the same. Plenty of walls for harness climbs, bouldering, routes that change regularly. The 18+ boulder room is still there: bigger walls to practice harness-free climbs with mats all around. There is also a mini gym upstairs in the boulder room if you wanna warm up! Complete with weights, olympic rings, kettle bells, racks for squats/bench, bicep curls etc. There are even some pull-up looking platforms with different holds to practice strengthening your finger/forearm grip. Fans all around for a good cool down after climbs. I should also mention the gym upstairs seems cleaner and upgraded from prior ownership.The staff is super friendly, easy to help set you up with gear, climbing 101, yoga classes-- whatever you need to get you and your group started. A lot of people seem to be regulars with memberships, also making it a fun place to watch people with more experience. Not gonna lie, their membership deals aren't too bad either. I'm considering becoming more of a regular and this place has that nice local gym feel I'm looking for. Highly recommend if you're interested/new to rock climbing and wanna try it out for some good fun with friends. They've also got a 10% military discount, college discount on thursdays, and regular monthly events so plan accordingly! Climb on friends ~", "date": "11/2/2017"}
{"review_id": "RERVYKCwiIH3nEEg0BHhvw", "user_id": "R238i4S-FKZe9sPgmxkovA", "user_name": "Daniel O.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I recently started rock climbing about a month ago and after the second week, I immediately got a membership. For those who are seeking a thrill and new ways to exercise, Vertical Hold is the place to go. First off, the staff is very welcoming. From the get go they provided excellent customer service and answered to what seemed like a million questions I had. You have the option of bouldering or top roping, meaning no harness vs harness. There are many different routes that range from beginner to pro, so dont feel left out if its your first time climbing. All in all, be ready for some blasted forearms and a sore back because rock climbing at vertical hold is addicting!", "date": "12/23/2017"}
{"review_id": "Kf8yz2WU5eZOMbxhtVxHNQ", "user_id": "gYsBoBt2f0UJZMKUtDwjWw", "user_name": "Nathan N.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is great, it has a lot of well set walls, that are all really fun to climb. The staff is super friendly as well, it feels very welcoming here. It's also a great place to meet new people and hangout.", "date": "10/21/2018"}
{"review_id": "t8Z9_aSdMa-kHaRNjyXNdw", "user_id": "FNb9FVw5jvAsW7InEpoOPA", "user_name": "Jason B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I visited with my brother, his girlfriend and my mom. Had such an amazing time with the amazingly friendly staff. The instructor, Shannon, was the sweetest and very patient with my mom as she was nervous about her first time climbing. My mom went from almost quitting to having a great time.Thank you again Shannon and Danielle for your patience and expertise!", "date": "4/2/2018"}
{"review_id": "XB0l0FcX5wZnSWeRvz4vBw", "user_id": "X7K7OjUUi_ulMtfIOCCM2w", "user_name": "Maryanne A.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "Talk about a full body workout! I enjoy rock climbing and hope to get better at it. No better way to practice than at Vertical Hold. I guess I'm kind of biased since I've only gone rock climbing at this location even when it was Solid Rock Gym, but I enjoy this place. The staff are very friendly and helpful. They are willing to help you out if you have questions about anything!I always go with friends so we could belay each other but they have a boulders that you can try on your own. One day I will be able to do that once my arms don't decide to give up on me, but it's always worth a try. They have military and student discounts as well, so take advantage of that to save you some money!It does get busy at times especially at night, but for the times I've been there it wasn't too crowded to the point where there wasn't an open area. My suggestion is to stick to the same colors to guide you to the top especially if you're a beginner. But if you want to have a good time and get a workout, then Vertical Hold would be a great place to visit!", "date": "8/24/2017"}
{"review_id": "wBvwqc2XDHd5R-J_0bJ0aQ", "user_id": "pskFTWTeQTIlkWu90Dw_Ow", "user_name": "Dawn P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Staff is very polite and makes you feel comfortable like family.  My brother and I go here 3x a week.  Super fun and creative workout", "date": "12/20/2018"}
{"review_id": "qcSQ2pLFasfmRoKtGAItXQ", "user_id": "7KbX4-bc5Yy9gVfs32FGWQ", "user_name": "Janie L.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 2, "cool": 0, "text": "The staff is awesome. They have to cater to a lot of kids with a limited staff and they do sooo well. I respect them for their patience. The place is smaller than Mesa Rim, but it was great and the paths were advanced. I loved the place and would go back for sure. Beginner's pay $30 to borrow equipment and the lessons. If you already know your stuff then it's $17 with borrowing the equipment. Not bad at all.", "date": "8/30/2017"}
{"review_id": "ALlX73MRGPcbvVdzCGp5_g", "user_id": "F0j1s6eXQ2bkkRJpSmhyfg", "user_name": "Christine J.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "We had a great time!  We were here yesterday for a group event, Girl Scouts.  We had 20 kids and worked with Kenny.  He was friendly, fun and helpful.  All the girls had a great time and felt safe and adventurous.  I definitely recommend this place and Kenny.", "date": "1/9/2019"}
{"review_id": "VD3RMdmW9JFxMK4UqEiF4Q", "user_id": "IckO8qHB_lIlyf3Tm9T2mw", "user_name": "Elizabeth B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! Awesome mix of climbing options. The staff is so nice. Always a great experience", "date": "1/18/2019"}
{"review_id": "9AhukcrjFaucgnKQeU60_g", "user_id": "0V7v-d2K6oiiQnGWHhmU9A", "user_name": "Serena W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I had a great time working out here today. The staff is friendly. There are plenty of courses and options for all ages and skill levels. I will be back as soon as my muscles aren't sore. If you are not sure about what you are doing they can and will give you a lesson to make sure everyone is safe!", "date": "3/14/2016"}
{"review_id": "QEqalI3ufxonQ8lawuXJBA", "user_id": "kTCND3fn2LwtL0Wh9tRHRA", "user_name": "Gillian S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I just wanted to say a special thank you to Matt for not only making me feel welcomed and comfortable here but also wanted. He thoroughly explained how I could get into the climbing community and how the beginner course here at vertical hold is held. Great information, polite and energetic attitude. Thanks man !", "date": "7/30/2018"}
{"review_id": "V0oEG_0XXZYQGFelf7BOKQ", "user_id": "RgDMTL28alJffD0L-vxnzQ", "user_name": "Armonster v.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 2, "text": "I've been here a few times since this location became a Vertical Hold gym and I really like it.  All the staff I've interacted with are very friendly their rentals are all good quality and well cared for.  They regularly switch up the bouldering room routes which keeps things interesting.  Definitely worth checking out if you're looking for a good indoor rock climbing gym.", "date": "10/10/2018"}
{"review_id": "mt4ABLE8fpVEarQB_RpLHg", "user_id": "np5LT00YvbUxRv-qhOikmw", "user_name": "Kaelyn W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "The first time I went here was with my previous job. I actually had no idea it even existed. The place is very professional inside, well kept, very clean. The walls are always changing, there's a variety of level of difficulties and an additional room for the more experienced climbers. They even have a gym! It's a totally decent price to climb for a day, it is a lot cheaper if you have your own gear, but renting their gear for a day isn't breaking the bank. Going on your own or with just a couple friends is ideal, but they don't seem to handle large groups very well. Slightly understaffed and a little careless when the numbers increase. They don't help out too often for beginners or those just coming to have fun. A few staff members are really cool and they were helpful, but there's always one that can ruin the experience.", "date": "11/21/2017"}
{"review_id": "BSzuB4_Cz1CYtGDEIeSFLQ", "user_id": "zmX8c6yoS1EguoFYtwIy6Q", "user_name": "Veronika H.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I LOVE this gym! I've been to others here in San Diego but this one takes the cake by far!! First off, yes they use gri gri belay devices; how awesome is that for newbies?!  I feel confident taking inexperienced climbers there, and teaching them the ropes. With so many routes to choose from, you'll never be bored. The ratings are a little off sometimes, but I'm also a shortie, so that probably has more to do with it than anything. Let's talk Boulder room: WOW! Incredible. Always on point with the routes, making it fun, and the traverse is rad too. I love how I can count on the routes to be changed frequently and you can follow solid rock on IG to see when routes are changing. You can utilize the natural features of the walls on some routes which is awesome. Customer service?? Yes!!  I have never once been treated poorly and the vibe in this place is super chill. If you're looking for a fun small gym with a non-corporate feel, solid rock is your place!!!", "date": "9/23/2016"}
{"review_id": "0R86wC1RVwUuYHYrpBjByQ", "user_id": "u-rO_1IR1d4xibcYHA4zTg", "user_name": "Maridel A.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 2, "cool": 2, "text": "So much fun here. Helps me over come my fear of heights. It's a great workout too. I've been here 3-4 times with my company's adventure club. I feel like a badass when I make it to the top! Yay go me!", "date": "3/5/2015"}
{"review_id": "R8tJg4VWrjK5dYPR4-9s8Q", "user_id": "E2vFGXcNjrEYQ3cTcksbXg", "user_name": "Julia P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Super fun place to learn how to climb. You need to go with someone else to do the activity. Live the workshops wish there were more.", "date": "3/12/2018"}
{"review_id": "F-8rujqmSWMScItLXcuHYQ", "user_id": "URQvI3KplmSyMcfh0NHY7g", "user_name": "Julian W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The employees at Vertical Hold are what make this place a hidden gem.  The first time my girlfriend and I came we brought our own gear but my girlfriend had a brand-new pair of shoes that turned out to be a little too small and painful halfway through our visit.  The guy at the front desk let us borrow a pair and when I tried to pay him for the shoe rental he refused my money, saying \"we've all been there.\"  The routes are fun and they have some nice routes under the auto-belay if you feel like climbing alone.  I'll definitely be returning.", "date": "6/19/2017"}
{"review_id": "-x0ZHvS0It7QBwgI8KEGaA", "user_id": "LkkzGpeMdv4EHvL28j8_7A", "user_name": "Drew L.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Before I started coming here, I couldn't climb a set of stairs. I was forever plagued of living in single story buildings. After 2 years of coming every day I'm sending 5.15s and am living out of a van. Shout-out to the front desk staff Dani and Matt", "date": "5/17/2018"}
{"review_id": "iltAgr0J3ettFLVyb1rNDw", "user_id": "34LkId3UkwjGCTMt-lthvA", "user_name": "K C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Awesome rock climbing gym.  You can climb ropes, rappel or boulder.  It's a pretty open gym so you can do whatever you want.  Once you get into the gym be sure to sign your waiver and select the package you want.  Best deal is to go with an unlimited monthly pass.  Be sure to bring your own rock climbing shoes and chalk so you don't have to use the gyms stuff.  You will have a blast!  Be ready to sweat!!!  Enjoy!!", "date": "3/30/2017"}
{"review_id": "l4N6Q-q2WiqgTuAARMrFGQ", "user_id": "fv4b_Ibsjg7ogkqmOfVshg", "user_name": "Rachel N.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going to this gym for over ten years now, since I was a child having birthday parties here with friends. I've always loved the fun atmosphere, reasonable pricing, and of course, the very friendly and helpful staff. The variety of \"skill-level\" options is great - being a simple hobby climber and not seriously dedicated to reaching the highest degree, and it's a great way to have fun while working out your upper-body. I recommend this gym and will continue going as long as it's still open!", "date": "3/31/2017"}
{"review_id": "T6ZWx132-4FfoLR8QTvvsA", "user_id": "H4ZauBEaKj_m0NvzDa1fdw", "user_name": "Brea N.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Thank you Josh for the amazing customer service! I have never been rock climbing and called to know what to bring and prepare for. He was so patient and kind on the phone and then even more when we arrived. He was informative to myself and two nieces and definitely a patient man that seemed to love his job. Will be back for sure!!", "date": "7/23/2018"}
{"review_id": "XU9I1w9ImWpiV7VZ3XT3qA", "user_id": "NlDGItfQGrk7khRJFH4n5w", "user_name": "Kristin K.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Really fun activity and the instructor did a great job. There are many different routes to try and I can't wait to try some more difficult walls!", "date": "10/21/2017"}
{"review_id": "uW5IxxDVFhWxK-0mHVc9Zw", "user_id": "x11LxPmiEm9uIhwitdFYow", "user_name": "Ellena S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This place is legit. It Has so much character and the routes are awesome. Challenging and tricky! They have some wise people setting up the routes and it's fun as hell! Not a corporate feel at all. People are chill and the atmosphere is great. My 2nd home :)! Thanks vertical hold! Shout out to Shannon! Thanks for making everyone feel like they belong!", "date": "9/14/2017"}
{"review_id": "zreMiYl_WTr8AuR__yijfw", "user_id": "U8yIU10tGm2Qkuq3P51p_w", "user_name": "Linda C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here a couple of weeks ago with friends. It was my first time indoor rock climbing and loved the experience, but man do I have respect for people who do this for fun! It's definitely hard work, but I can see why people get obsessed. The place is clean, staff is friendly and the prices are fair.", "date": "9/23/2017"}
{"review_id": "hDSIa5kWQiR2cx1w6c5GOQ", "user_id": "miSmwx0JJArO3XqY6jpK-w", "user_name": "Kim G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Me and my friends try out a new activity each week and tried rock climbing yesterday. It was so much fun!!! Parking here was easy as they have a parking lot right outside. Our instructor Christina was so cool and chill and super funny!!! She made our whole entire experience. Def with a try!! PS students get a good rate of $10!!!!", "date": "8/19/2016"}
{"review_id": "KanC5fSqVhHDfVA0NGYqWg", "user_id": "b6fSUoEmWBHLCXFH5_9tKw", "user_name": "Kara C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 4, "funny": 0, "cool": 2, "text": "Definitely not the most ideal climbing gym for those who want to top rope. But for the boulderers out there, a pretty nice spot.Pros: decent amount of space to boulder both near the top rope area and in its own room. Pretty nice alcove for lead climbers. Good for young birthday parties, groups, first timers. Friendly staff who are willing to.. literally.. show you the ropes ;)Cons: for the top ropers, although an OK place to learn if you've never done it before, the routes are kind of few and far between. The jump from white (easy) to 10.8s (the next lowest rating I could find) was a bit steep in my personal opinion. Also, the ropes and grigris seem  worn and old. When you descend, it's a cumbersome process for both climber and belayer because the ropes don't slide nicely through. You'll likely have to manually feed the rope into the grigri to speed it up (I'm about 110 lbs and my weight wasn't enough to lower me, so the manually feeding was a must haha). I prefer Mesa Rim myself, but I wanted to at least recognize this place for being kid-friendly and a good start for beginners.", "date": "4/23/2016"}
{"review_id": "jm4THiA9N0q2bP4sIpPK7Q", "user_id": "6vZsw723pNUOKYhDTYxhAg", "user_name": "Hazel C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The facilities here are a little bit older (not walltopia walls, pebbles rather than mats) but the staff make it a really great experience! Especially Alana who went above and beyond to make sure we had a great first experience here. The bouldering routes can be a bit more challenging for beginners but the belay walls are really great. We had an excellent time and Alana really made sure of that!!", "date": "3/10/2018"}
{"review_id": "eFJrRIDJCqLaaBSlog8tqg", "user_id": "17CKtabF2GFU9s8V-JQVYQ", "user_name": "Drew W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Thanks for the great Welcom n awesome guudance for my lil strong RockStar baby girl... Dorian n Dani were a great help today- Cheers!", "date": "8/19/2017"}
{"review_id": "qUV5U3Q5-h7Xln0AfxQ6rA", "user_id": "mLuJ1eS5_dIVr2Y8Ni1MrQ", "user_name": "Raquel R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It was very clean and fun.  All staff was super nice and helpful, except the guy who said he couldn't wait until winter break was over. I was there with my 2 boys and I didn't appreciate the comment. But everyone else was cool.", "date": "12/31/2017"}
{"review_id": "49JPAHA971UqZI8J1pAwqw", "user_id": "uXeLniueNrgf4FbiW49IIw", "user_name": "jhozy p.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good value for the price. I do prefer Mesa Rim because I love top roping without the auto-lock belay. But if you want a good work out and don't wanna spend too much, this place will suffice. I give solid rock 3.5 stars, I rounded up. :)", "date": "5/9/2016"}
{"review_id": "65XZW42pQK8e5E4qc803dw", "user_id": "yswxpVwptlI8kf8KfB8ZDw", "user_name": "Trang N.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "A good place for beginners, especially because the belaying device (grigri) is already set for you so all you have to do is lock yourself in. The staff is pretty chill and they do military discounts on some days, you'll have to check. There are big mats you can move around for bouldering. I suggest getting your own pair of shoes if you're going more than once or bring your own thin socks to wear the shoes bc they are designed to be tight and can make your feet sweat like crazy.", "date": "5/29/2016"}
{"review_id": "7t6aoeAgN_7d5AkeFXRSRg", "user_id": "j_mJELv0tBQZMGB85xrFWg", "user_name": "Travon U.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Great prices for all day fun. This is somewhat perfect for a first date if he or she is athletic or is simply not afraid of heightsl. As for me I'm as scared as scary gets when i comes to high places and looking down. They sometime tell me to not look down and I do, but when they don't say anything I find myself paying more attention to whats at stake then whats below. Solid Rock was a fun time and I would love to go again and again. There are different levels from beginners to flat out one-handed spidermen. No worries the staff is super friendly and will assit you in every way. Open parking is just in front of the establishment. See you there soon...", "date": "10/7/2014"}
{"review_id": "0pugwUmFm5hi3K2wOrKpuw", "user_id": "Kij3NAKr3xqUF2ylKH-5HQ", "user_name": "Shelley C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "First time rock climbing and came here with some friends. The staff seemed scatter brained and seemed like they didn't really care or want to be there, which I understand since it's probably just some crappy part time job. It was pretty expensive, especially renting rock climbing shoes. Turned out to be around $25.The rock walls were good, it appeared like there wasn't many walls for people who wanted just basic walls and nothing crazy, but I think there actually was a decent amount. Lots of kids, and kids birthday parties so it will be loud and obnoxious, including other people who are also just there as well. There were a few times where you just have to wait for people to finish climbing.I probably won't be back. It was exhausting and fun, but nothing crazy or special. Also expensive to just wear yourself out.", "date": "4/27/2014"}
{"review_id": "ND8jtj2DtUgFJvmBKxCaRQ", "user_id": "91_NAQHlWULtD9TLF31ddw", "user_name": "Alex D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The employees here are fantastic. FYI: They recently (in Dec. '16) changed their name from Solid Rock to \"Vertical Hold.\" The staff really is amazing. Went yesterday and was helped by Melody. She was so so so nice and really understanding despite the fact I had never rock climbed before. Best part is they let you rock climb in your own shoes (so if you're a noob and cheap, you don't have to spend $5 on shoes.) All in all, great experience.", "date": "6/7/2017"}
{"review_id": "4Bzdx13u7zXk1GU6bHfwAw", "user_id": "-GgfD5R3_QSWgq7DSTdl9g", "user_name": "Gloria Z.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 5, "funny": 3, "cool": 0, "text": "The routes SUCK here. That being said, I'm not a veteran climber by any means, but could get up easier routes (5.9 and low 5.10) with ease at all the other rock climbing gyms I've been to (I was with Touchstone in the Bay Area). Here though... I got up half a 5.8. No exaggeration! There's no safety training at all when you first come in, and honestly, who the hell decided to have those little pebble/rocks as the floor? Walking around in my climbing shoes sucked a lot, and then there's the fact that I just felt like I was going to plunge down to my death for sure or at least break a ton/ankle if I tried to jump down. Heading to Mesa Rim from now on and forever. I don't think I'm hardxcore enough for Solid Rock.", "date": "5/20/2015"}
{"review_id": "BD9TzRiRnszK1sa5yhiiRg", "user_id": "KrXU4c4Zf0sBrb7u0QB8-w", "user_name": "Kelsie M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "First experience actually climbing and belaying without the help of an experienced person. The front desk team was so awesome and helpful to get us geared up and started and gave a brief and informative instruction on how to climb and belay each other with their gear.Tommy was first to help us and was awesome so helpful, and John have us out little lesson.The gym overall very clean and the vibes were amazing in there. Really good, chill music that really set the atmosphere. Overall the experience here was just awesome, really great people just hanging and having an awesome time.", "date": "10/25/2013"}
{"review_id": "SgMjnSPpHP_t4NN2pQ_L3w", "user_id": "XWMul-gcyAfimEN7a4ypZQ", "user_name": "Dennis G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "For a first time climber, such as myself, it was a simple introduction to rock climbing. The staff was helpful and gave me a quick lesson in belaying, however that's about the only solid thing I can say about this gym. The walls themselves were in disarray and the way the paths were labeled made it hard to tell which rock went to which path at times. Also, the difficulty jump from the beginner paths to the next level (5.8) was quite the leap. It made it frustrating to go from a path that I could climb with my eyes closed to one where I couldn't even figure out how to get to the next rock. Granted some of this is due to me being a beginner, but I noticed others around me struggling with the same ordeal.", "date": "4/23/2016"}
{"review_id": "YCR8F8A46oAxTmjpLuMnnQ", "user_id": "btKT25J7WJoWB1tPvF7ugw", "user_name": "Steve F.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "To quote John Cougar Mellencamp, \"It hurts so good...\"We came out to Solid Rock Gym as part of our friend's all-day bachelor party event this past Saturday.  This place was packed with kids; apparently, the gym is a really popular place for kids' parties (and with the number of rugrats climbing the walls like ninjas - some of them even blindfolded(!) - I can see why).  As for our group, most of us were climbing novices, and the only direction we were given was, \"Guide with your hands, and push with your legs.\"  Nothing in terms of climbing safety - although they did point out what the tape on the walls was for.  Once my group got the hang of it, we all got our inner Ninja Warrior on, even if one wall managed to break us in the end.  Bloody #12... we will conquer you one day!The facilities themselves are pretty nice, though I wonder how often the handholds/footholds are cleaned (at many a point, I felt my hands slipping off a grip I had grasped solidly a moment prior).  There's also a bit of a tightrope area here, which all of us each had a go on... only to fall off after going at least a foot's distance.  One caveat - parking really is at a premium here; I found myself parking a couple of blocks away.Still, we had a great time here... even if our shoulders hurt and our fingers felt tender afterwards!", "date": "8/23/2011"}
{"review_id": "pdOg183Wup9vrnHvwnZ8Sg", "user_id": "nRBl3tzNGJetMUu8CX2tPA", "user_name": "Cole M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have a membership here and I absolutely love it. Climb here all the time and the employees are cool. The rocks are never loose and the the routes are changed often so you never get bored with your membership. Oh and I absolutely love the fact they have a crack tower with 4 different cracks. All around I would say this place is pretty solid.", "date": "12/10/2015"}
{"review_id": "B_We0xyoW2roFmynu3rqWA", "user_id": "ajPTpN2VTiKDIpHgsGWKTQ", "user_name": "James E.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good, affordable, and friendly place to climb.$10, for a day, for military and college students right now.I came here just to try rock climbing and it was a fun experience.", "date": "8/6/2016"}
{"review_id": "NR_hLnTnXvInOzpAtQE1qg", "user_id": "Z9X_cXpYL9lIrhJBRkIf0Q", "user_name": "Alex H.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been climbing with a friend for a couple months. We bought climbing gear at REI and used our receipts yesterday for the free day pass at Vertical Hold on Hancock St. For one day, it was fine. It's old and a little rough. It was also empty, on a Tuesday. Almost all of the ropes have grigris tied into them with fairly ugly zip-tied knots, so you can't use an ATC except on a few routes. I think the grigris should be optional and everyone should be trained in how to use an ATC. The ropes on the grigris are completely stretched out and stiff. Crash protection is very limited - drag a pad to where you want to climb, or understand that if something happens and you hit the deck, it's going to be rocks. Personally I'll stick with Mesa Rim. It's cleaner, more professional, safer (the entire climbing floor is padded, bouldering section is double thickness) and has more amenities. But if you're on a budget or like the atmosphere better, VH is good.", "date": "8/16/2017"}
{"review_id": "U93rd0tzsUBKm7wcjZBgmA", "user_id": "CkxvEnbtkzOKdXT7G17ecQ", "user_name": "Myleen A.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is such an amazing alternative to the different trails and work out methods I'm accustomed to and it's a terrific group activity to do with the fams. The only disadvantage to it is that when you do go with your family (especially with my cousins) you end up hurting more after because of all the laughter generated by our stupidity. Fellow rock climbers, we apologize whole-heartedly for our rambunctious ways.What I love most about the gym is that there are so many scenarios for your to put yourself through. If you're a beginner, they've got a wall for you. If you're Spiderman, they've got a wall for you too. And if your someone like me who's down for a challenge but not enough to cling horizontally for dear life, then they've got you covered. For $21 bucks, you're laced with a harness and a whole world to explore... until 9:00 on Saturdays. The staff is friendly and the place is generally clean. Location-wise, it can be slightly hard to find because you might catch yourself heading back onto the 5 South if you're not careful. But I can tell you that it's a great work out and you'll definitely wake up with your upper body pleading for more rest.", "date": "6/3/2013"}
{"review_id": "CqctgPF0j-NBwIO0gIQAmg", "user_id": "Db6VFlEr-eT4v1nNFU-9ag", "user_name": "Genevieve A.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "Newbie alert! I went with a group of friends this weekend and got a great upper body workout. I had no idea what to expect like, do I need a helmet? (no) will my delicate hands get caluses? (yes, small, but they're there!) do I trust my friends enough to make sure I won't fall to the ground? (yes, great trust building activity ;)) will I break a nail? (no, chip free is the way to be)After figuring out how to put on the harness, the guy at the front dest gave us a quick run through on climbing safety and belaying basics (this alone was a workout). There are color coded tapes on each rock along the walls for you to follow certain routes ranging from easy to difficult. We were able to do most of the rope walls for the 2 hours we were there. This is a great place for beginners, there's a small area in the middle of the gym for rock climbing without ropes.$23 for 1 day pass, harness, and shoes. I wore gym clothes and some Nikes but opted for the shoe rental. I recommend renting the shoes since they were much lighter and slimmer to wedge onto the rocks.", "date": "4/28/2014"}
{"review_id": "OWlDAChuxJw4cHkWTJXlIQ", "user_id": "m-RmhmrukSaSUy8hVpcMzQ", "user_name": "Mosie B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Solid rock rules. All of the staff do a GREAT job of making you feel welcome and comfortable. I've been a member for a little bit now and it's super addicting and challenging. When I first started going I was pretty intimidated... but thankfully everyone who climbs there and the staff crush the pretentious vibes that I have gotten at other climbing gyms. I appreciate the multiple locations and I almost gave a four star because I will all of them had showers but oh well, these guys deserve the 5 stars!!chalk up suckers!", "date": "3/16/2015"}
{"review_id": "mZb8fMio0-CMzOC7IIrhpw", "user_id": "dDlvIFyZ-OlZPSrcd6N4Tg", "user_name": "Emma C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to get introduced to indoor rock climbing. It's small but perfect for someone who just wants to check it out! The people who work there are friendly and very helpful. It's been quite sometime since I've been there because I moved, but I remember Karen was super nice & helpful with answering all our questions. This place doesn't have the fancy look or feel of other rock climbing gyms, but it's great for what it is. Looking for something different to incorporate into your week? Then give this place a go... you'll either say ya or nay when you're through, then you can give your own review :)", "date": "1/28/2015"}
{"review_id": "urFTCcztIkANiIOjlmjB_g", "user_id": "eyHW_diFXlqqL9EMu4LeHg", "user_name": "Leslie G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 8, "funny": 0, "cool": 0, "text": "It seems like the owner doesn't give a crap about this place.  Maybe I'm just spoiled by going to Vertical Hold a bunch of times before trying Solid Rock.Tags marking routes are falling off all over the place (or are all the way off).  Tags are just pieces of tape.  Why not use something that is sturdier and looks better?  Maybe it's just me, but the lack of caring about the way the place looks made me wary about how much anyone cared about anything else - like safety.When you sign in, they don't give you any information or make you sign a waiver.  Then, there are some signs in other places in the gym that say by signing in, you are agreeing to whatever is on these signs.  I guess they think that is a waiver?  Don't give any safety information and then say by signing a paper you agreed to something you probably never saw (a sign in another location)?  Not sure if that would hold water if someone got hurt here, but I'll leave that to the people getting paid to answer those legal questions.No belay training required to belay others, as other reviewers have stated.  Scary.The bathroom was a mess, trash can was completely over-filled and had overflowed onto a good portion of the floor.I'm sure it is really hard to clean the chalk (and sweat, and other stuff) from the rocks (the entire floor is rocks - you have to drag crash pads around for protection), so my allergies were going nuts from all the chalk dust.  I also saw a mouse, so there's probably some other stuff in those rocks too.I would love to love this place and give them my money because it is so close, but it seems so unprofessional that I would not go back.  It just made me uncomfortable.", "date": "11/13/2013"}
{"review_id": "Up8NBprFrZa2NcW89h89Kw", "user_id": "XXdjYP6bQ9yTaOoo3bbV6Q", "user_name": "Stacye T.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went last night with a friend.  We had a blasted.  1st timers.  The staff was extremely accommodating.  Plenty of walls to climb.  We will definitely be back.  Great time, great place. Yes I recommend it.", "date": "2/24/2016"}
{"review_id": "-TACNxawgZ0yQ7QiHQwrrw", "user_id": "hUFLEBcaWp22BkcwnSBe3A", "user_name": "Erin D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is a great place to go climbing. I'm not from San Diego and I was staying with friends for a week and wanted to do some climbing while in town. This place has a lot of bouldering, 2 rooms in fact, and also has belay. It's great for all levels of climbers. Friendly atmosphere and good price. Would definitely come back if I'm ever in town. I gave 4 stars because I'm used to massive climbing gyms in San Francisco, so this felt small to me but it is still a good size with lots of options. Happy climbing!", "date": "5/26/2016"}
{"review_id": "hYw_h2Os8M6LcVcqiQ-d6w", "user_id": "d8lNH_Q7D6cCu3E3s4e2_w", "user_name": "Louisa E.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This was a pretty cool climbing gym with a lot of options for both top rope and bouldering. I loved that they had the slack line up stairs, I used it as an intermission for my hands when I was getting tired. In my opinion though, their bouldering routes are a little sloppy.", "date": "7/19/2016"}
{"review_id": "sARU7YzJQqaFo0WZZoYyPA", "user_id": "VY04otq5wUCnVScF9Q-uEw", "user_name": "Savanah S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Fun, kinda small, but really fun! Me and my boyfriend came here for both our first times the other night and the guy at the front taught us how to do everything. It started to get busier and we only lasted an hour and then our hands hurt (get the chalk!) but we both loved it and will be returning!", "date": "2/27/2016"}
{"review_id": "v22B02bq3jbbvAnl42zsCQ", "user_id": "aROG_5lT8PuXEG54QedtvA", "user_name": "Ilisa G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "We had our daughters 7th Birthday Party here with about 15 kids and it was great. The children really loved it, the parents had fun, and Rick our instructor was great. The upstairs party room was wonderful as well. It was so easy as far as kids birthday parities go! Only down side was it did start to get crowded during the last hour of the party which made it a little harder to get the kids up on the easier routes. But it all worked out and everyone had fun!", "date": "2/17/2015"}
{"review_id": "hyjV3n4zKCRkAo_LacSbuQ", "user_id": "ssFBTi6I5E_D7ujLMw5khA", "user_name": "Rachel R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Randomly decided I wanted to take up rock climbing, so I convinced some friends to come with me. It's $20 on the weekday to climb and rent equipment, total, which I think is super affordable. We all enjoyed it, so we jumped in on a 6 mo. membership. If you only climb twice a month (which is easy to do and you'll likely climb more), the membership pays for itself, so it's definitely worth considering. Also, they have auto-locking belay devices, so it's essentially fool-proof. I'm sure for liability reasons on their part, but I appreciate it.", "date": "10/30/2014"}
{"review_id": "oh_mel55pKhBqZdWL8Zzjw", "user_id": "bbsV7-JGgfcnBWSzmkXLNg", "user_name": "Becca Y.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "A really good variety of skill level sets. The employees are awesome. They also have specials on Fridays for military!", "date": "11/3/2015"}
{"review_id": "07BA8JWlVHqMDjvtapqBKA", "user_id": "7j85licG-cKVIGVdCxD2Sw", "user_name": "Susan r.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "By far the best rock climbing gym in San Diego. Very welcoming to new members and new climbers! They foster a safe but fun environment for learners and expert climbers. The bouldering is fun and diverse, and the climbing walls offer a range of skill levels. The best part about this gym is the atmosphere and community--fun, friendly, and safe!", "date": "4/28/2017"}
{"review_id": "TsEmFWClF_iIzJRyBZOojQ", "user_id": "C2JJOlE07gO1s_5atbnBsg", "user_name": "Leah P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter had her birthday party at Solid Rock today, and to quote her \"Best. Birthday. Ever.\" It was a great space, the instructor was awesome, and the kids had a blast. We did the party right when it opened, before it was too busy, and it was perfect. Loved the fact that there were bouldering walls, lots of different climbing options, and plenty for all the kids to do.We'll be back for more climbing without the whole party.Thanks to the entire staff at Solid Rock for a great day!", "date": "11/23/2014"}
{"review_id": "9IOMFHes5j_TDSFunAAIDQ", "user_id": "8qafQUn3hA4qlLNxIb44bQ", "user_name": "Eric S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "Was staying in downtown and paid a visit to Solid Rock. Here's the skinny:It's an older gym so don't expect it to be sparkling clean. It serves the local climbing community and kids parties at quite a clip.Routes were ok as I have climbed better and worse. If you are really into climbing indoors, its worth the drive to go check out Mesa Rim further north.", "date": "12/12/2013"}
{"review_id": "jAJ_iI-RMfBK1c7ezamz1w", "user_id": "P_ysoJEz0U1etb_Yx2EIpA", "user_name": "Adriana E.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I enjoyed coming here, the staff is very friendly and helpful. However the cost for a day is ridiculous. I believe they should do hourly rates, because lets face it how many people are going to climb all day? It is a little run down. The three stars are for not so great parking and the cost for a day pass. I might only come here once a year or so, but would look for a cheaper day pass place.", "date": "1/28/2014"}
{"review_id": "k4IIjswZrCwVNiHhqvkYeg", "user_id": "xhyA3eNb6DRc5bVMarB2uw", "user_name": "Drea C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 6, "funny": 0, "cool": 0, "text": "This is a little painful to write but I have to. The climbers at Solid Rock are a great crowd and I really like the vibe there. I give them a 5 star review for sure and I even like the pebbles over the pads, plus the convenient location of the gym is just hard to beat.Unfortunately, the administrative style of the gym has disappointed me beyond belief. They are completely inflexible and do not understand the needs of their paying customers. They need a doctor's note even for a minor injury (a single visit to the doctor can easily cost $100!) in order to pause membership and in order to cancel membership it absolutely must be done by the 25th of each month, otherwise they charge you FULL for the next month. I tried cancelling it the following day and there was just no reasoning with them. We had every intention of coming back to this gym (we had to pause/cancel our membership for a few months) but now we're probably going to go to Vertical Hold instead. It's incredible to see how I couldn't possibly imagine changing gyms when I first wrote my review. The owners of this gym should focus much more on customer service in order to keep your paying customers happy. Otherwise you'll lose them just like you've lost us, we're moving our three memberships elsewhere.", "date": "3/1/2013"}
{"review_id": "MmG9zPPGRejRNAkpLrXsUw", "user_id": "1SnLppWPCWhdqkxTQfNHMA", "user_name": "Steven W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been going to SR for about a year and love the place.  I've been to all the other gyms in town and dig solid rock the most.  The crew they have are super friendly, cool people.  Ben, Josiah and Tommy make the place.  Rad vibe and cool community of people.  They've got a nice little lead dome and they always have a slack line up.  Highly recommend it.", "date": "6/12/2014"}
{"review_id": "1QsXlDiFK0okNtHF_in3xw", "user_id": "YQiWx69BP4TfvwXU8GFBPA", "user_name": "Jamila G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Etiquette of climbing participants could be better. Staff is super friendly and informative. Overall, as a climbing gym, the routes are fun & the terrain is perfect to train on. Not many gyms top out their boulders with true mantles.", "date": "7/1/2014"}
{"review_id": "JhSt7LXEaxVhQPwqIZRzYw", "user_id": "YyzkzDuErXnv5E9yMq7AMQ", "user_name": "Denise A.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This is a great alternative to your average gym sesh! For nearly $20 or so, you have rentals & climbing to try! Don't worry if you're a newbie because their trained staff will ensure you understand the terminology and how it works before you venture out on your own. Grab a couple friends and check this place out for some gnarly fun. It's always good to try new things :)", "date": "8/15/2013"}
{"review_id": "Jw0w757aHYp6zR6OY6X8QA", "user_id": "q_T1kIZBA9y8Ky-kbkds2Q", "user_name": "Ben A.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Having never experienced any of San Diego's rock climbing gyms, I set out to try Solid Rock in Old Town.  What a great workout for your core, legs and mind.  The gym was a little busy as there was a French school doing a group outing on site but my friend and I had no problem finding our own area.  They have some challenging routes and decent bouldering area as well.  The thing I like about the gym though was the option to try slacklining as well.", "date": "5/20/2013"}
{"review_id": "D5WcCWMPd_FQAiURUg4oeA", "user_id": "yeIIG8XdA2dw_RwBMEE3OA", "user_name": "Danielle S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great indoor climbing gym for any level of experience! Pretty cheap too! They show you what to do and they are constantly switching up the courses so it's never the same. They also have a bouldering room for those who love to Boulder! You can rent your gear from here too!", "date": "10/15/2015"}
{"review_id": "C8ElC6KZ0joFUmfeYf4mmg", "user_id": "jPUlzQW1qSjKhQfMbAjYgA", "user_name": "Anna K.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "Very disappointed. I'm trying to cancel my membership over the phone and the staff won't let me. I moved so trying to get over there is extremely inconvenient. That being said the routes aren't that great. They rarely switch it up and the walls are crowded. The place isn't any sort of clean and it's just a lousy experience. Just skip this place and go to Mesa rim or a nicer gym because this place will try and milk you for every penny.", "date": "5/27/2015"}
{"review_id": "O7EbElAev3Kfq91TbYxHwQ", "user_id": "XNsZsfhQxtoEmQJFaN30WQ", "user_name": "Scott S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We had our daughter Sophie's 10th birthday party at this Solid Rock today and it was a wonderful experience. The staff was great the kids had a fantastic time and it was was a lot of fun for the kids and the adults. Thank you to the staff for taking the time to instruct the kids and helping them with the equipment, climbing, and tether line fun.", "date": "6/6/2015"}
{"review_id": "gPXsxhK57VQHrYmOBl3tMA", "user_id": "_3eBtN63wDbCnomRu50qrA", "user_name": "Lee N.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 11, "funny": 0, "cool": 0, "text": "Worst gym around.  Shocked it has such good reviews....maybe its because they removed my last one and probably countless other 1-star ratings.  1. No music and awkward atmosphere2. Terrible and boring routes and inaccurate ratings3. Grimy, unclean holds4. Way too few crash pads5. Rude, unhelpful staff", "date": "9/12/2012"}
{"review_id": "lSf6XV5L8mRejRjW28lLEw", "user_id": "_mfVg2apfsD8BIpgCMoIig", "user_name": "Kristen R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Maybe I just got spoiled by nicer gyms at better prices but, I was really disappointed with this place for the price. The rock wall pegs just didn't seem like they were setup well and instead of mats or floor they have rocks on the ground that made the whole place dusty.", "date": "3/29/2013"}
{"review_id": "K26M3zqrJlcAyY5jRAA2Fw", "user_id": "_K0NrkuxOGMEzxWiTNutVw", "user_name": "Omar D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Solid fun experience, been here before. Overall good fun if you bring a bunch of friends.  I would give it a 5 star but the blonde girl that works on Tuesday afternoons is rude and has an attitude. Beside that costumer service is great !", "date": "9/29/2015"}
{"review_id": "eYUto0cjKukjzU1O2uWE2g", "user_id": "Yjt96iEB7Qkt7UIQOjD7xg", "user_name": "Shane B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Good variety of climbing surfaces, from crack climbing to bouldering the selection of what you want to climb and how hard you want it to be is all there. The staff are very responsive to any questions new climbers may have as well as very willing to let experienced climbers do their thing. The location is spacious and well suited for larger parties. If you are a climber or are going to get back into the sport, this gym is a great place to do it.", "date": "10/16/2015"}
{"review_id": "cc6hVjHWjVF17T8auXouDw", "user_id": "km2_AXS1BTfXWb7ltcmC1w", "user_name": "AK Z.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "I just had a birthday party for my daughter (turning 7) at this gym. They have an area upstairs where you can bring your own food, drinks, and party decorations. All the parents who came with their children enjoyed watching their kids climb and belaying them. This gym was ideal for introducing the parents and children to a new, challenging sport. Many of the parents told me they had a great time. They had reasonable group rates and only charged for the kids that actually climbed. The staff (Christian, Ben, and Tatum) were extremely helpful and friendly. I had a very positive experience with this gym, and I would recommend parents consider this venue for birthday parties and group events.", "date": "12/15/2012"}
{"review_id": "Lx1a6yqwBUeiFIZbawl97Q", "user_id": "23vtzNCf98ZlBNUxFdpraQ", "user_name": "Sarah W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 7, "funny": 2, "cool": 1, "text": "This is the first time I've reviewed any service on yelp, but our experience at solid rock was so poor, that I felt the need to warn actual rock climbers who might want to check this place out.My fiance and I love trying new indoor rock gyms when we travel, and have been to quite a few. This place is by far the worst.Safety last. This gym does not require that you pass a belay test or take any type of instructional class in order to climb.  They have pre tied first gen Gri-Gris on bowlines with zip ties keeping the knots in place.  The locking biners and other hardware are ancient and many sides or corners of the biners were very sharp to the point that I was afraid they would cut either my harness strong points or the rope. The ropes have obviously never been replaced since their inauguration and were so worn and flat that they would often times not feed through the belay device. The routes clearly do not get reset and so the holds never get cleaned or replaced causing them to be very slippery.  A hold spun on me while climbing and when we notified the staff member she blankly stated, \"yeah, doesn't that make the route so much harder,\" as if that were a good thing.  She did not offer to fix the hold and we questioned whether or not the gym even owned an allen wrench.  If you belong to this gym please for the love of god get an experienced guide or mentor to teach you... basically everything over again before attempting to climb outdoors.  The guy at the front desk saw that I was belaying without ever taking my break hand off of the rope (I'm used to an ATC) and told me that since I was using a Gri-Gri I did not need to worry about keeping my break hand on the rope.  WOW!!!  Also, the two guys that were lead climbing were jumping around like apes and almost swung into me twice while lowering. NO, you do not need to or ever should clip the anchors and then jump out and sideways as far as you can to look cool after completing a route.  If you do this outside the rock can and will cut your rope.In point, the gym was gross and clearly not maintained, the staff was obnoxious and not knowledgable, and safety is clearly not a concern.  Also, the routes are some of the least creative and un-intuitive (basically they make absolutely no sense) routes that I've ever climbed on.Don't climb here.", "date": "7/3/2014"}
{"review_id": "Gw90UOnUK3Cc-2sJo_6SRA", "user_id": "C1uxGKaz4s0g2OxZ3UNUOw", "user_name": "Hannah Z.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place rocks! Went with a group of 8.  2 of us had never done it before and the other 6 were regulars going twice a week.  I was the newbie and was impressed by how many different course options there were and difficulty levels.  If you've never gone rock climbing - this gym would be a great place to start.  The people that work there are very knowledgeable and genuinely enjoy the sport.  The night we went there was a meet up group at the same time.  So lots of people with varying skill levels and the place never felt crowded or full.   Other rock climbers are also very friendly and courteous.  It was great to mix up the work out and focus on upper body strength and skill.", "date": "7/23/2013"}
{"review_id": "mUgB5IdIk5qEEKZwSHwjjA", "user_id": "nOugSplrgOdvuDdO4bQ6_g", "user_name": "Ashleigh J.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 2, "cool": 0, "text": "First off, many of these negative reviews are laughable. Seems like most folks are grossly uneducated on what Rock Climbing Gyms are like. Solid Rock offers more than 30 top roping routes, crack climbs, a phenomenal lead cave as well as exceptional bouldering. When novice climbers come in, or even those who have climbed before who just want a refresher, SRG gives FREE Belaying lessons. Why? Because safety IS priority there. The staff is incredibly knowledgeable and will answer any questions people have. Routes are reset every three months or so so that no one gets bored. Plus, you have time to nail those routes that shut you down a time or two. They also have an amazing kids climbing team. The coaches blow my mind with how encouraging and positive they are with these young kids. SRGs manager, Mike, is most definitely a no bull shit kind of guy, which is exactly what that place needs. In an environment where safety is essential, Mike does a fabulous job at keeping SRGs record of almost 20 years (which is the amount of time they have been established) of ZERO major accidents or injuries. They must be doing something right! I have three young kids and Mike has been incredibly patient with teaching them the rules of climbing and helping foster their skill. SRG has faithful and wonderful members and staff and I am incredibly grateful to have found them! Parking is not plentiful, but it is located in an industrial area... none of the businesses there have an abundance of parking, but there IS ample street parking. Don't cry about having to walk 1/8 of a block to get to the facility... you are going for a work out. Get over it. That is hardly a reason to give a negative review. Rock as a landing is actually what MANY rock climbing gyms use... when I jump down from a route I may have gotten shut down on when bouldering, I land in the rocks (only if I didn't have the crash pad near by... I usually set the crash pad further along my route for if I take a big fall). When doing so, the rock spread out to soften my landing. A mat would send a pretty impressive shock wave up my leg, and doing that repeatedly would surly result in an injury. Using the rocks allows for better distribution of the weight of impact, much like someone laying on a bed of nails. There is a scientific purpose, and clearly folks do not take the time to understand WHY things are done the way they are. Don't let someone's bitter review sway you from checking them out for yourself. Moral of the story: Solid Rock Gym Old Town will Rock your world. Pun intended.", "date": "12/5/2012"}
{"review_id": "rh5XjH1haWQkffg6Ad1iqg", "user_id": "zHt6wmcXyNwamMBsdjeQVA", "user_name": "Deborah L.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is the 2nd time I have brought my kids here and they are very good with them. They take their time to make sure they understand before they let them loose. Great atmosphere and great service!", "date": "11/15/2013"}
{"review_id": "iJnPfIDBViNlrQ5NWM4K5g", "user_id": "OMWfum-7GBEnXgH26GPxhg", "user_name": "Lorayne S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Here as we speak wrapping up a 12th bday party. Can't recommend this place enough! Great place, great instructors (Ben), great price. We cannot wait to come back! THANK YOU SO MUCH!!!", "date": "7/11/2015"}
{"review_id": "tVQRdu7ZMQr9TmH1j1mA0g", "user_id": "YgubyTSnPgKh2NyBJSuWMw", "user_name": "Julia E.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 4, "funny": 0, "cool": 0, "text": "The first rock gym I went to was in Monterey Bay. First off, who puts ROCKS as landing ground for this gym?? The other one I went had cut up tire pieces. Much safer and softer landing.I've taken a few people here for their first time experience so it did the job but the last time I went it smelled like feet which would make sense because of the people taking off their shoes and replacing it with the rock climbing shoes. This gym is bigger than the one I experienced but I wouldn't say better.The crew is quite apathetic. Shape up, Rock solid in Old Town!!", "date": "7/6/2012"}
{"review_id": "KWHl6ExpnN28kC4dKiOagw", "user_id": "XT-qXWLa_SCLKpNB-13pAw", "user_name": "Mayra P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great climbs! I want to go here again and this time actually try them all out. I only tried about 5 different climbs but they were harder than I thought.", "date": "4/13/2015"}
{"review_id": "R4RN3izWFwnhus9SCgJpmg", "user_id": "fredbSEwqSXdqG0iTGzFTA", "user_name": "Ashley S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "Some of these reviews are comical and make me extremely angry. Most of these people are first time reviewers or perhaps think they know about rock climbing but clearly don't. To say Solid Rock never replaced ropes or routes is ignorant. I see them constantly working on setting routes and know they reset something at each of their locations every two months. The reason for any slippery or spinning holds is because of the amount of traffic coming through the doors. Anyone looking through reviews will notice how crowding is often mentioned. So what do you get when a gym is constantly busy and greasy hands are constantly climbing the holds, greasy holds all too soon. I climb here at least twice a week and get a crazy good work out and find the routes challenging and fun! The setters take time to perfect their work and tweak a route until it works. That said, they do grade a bit harder here than most softer gyms as they try to mimic the outdoors. There are easy routes but everything takes practice and I, at my start of rock climbing, felt discouraged. Come with an open mind and be positive please.", "date": "7/8/2014"}
{"review_id": "XcMM4atcwDsefI4gpFvACw", "user_id": "RKz4YwFyc8ij3RbIB7V3Qw", "user_name": "Mary Ann C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 10, "funny": 4, "cool": 2, "text": "Been meaning to post this for months now, but it was never the right time for me.   And I do hate giving one star ratings...  My cousin and I decided to check it out.  I called ahead of time to make sure we were prepared.  I asked about appropriate clothing and shoes.  I also let them know that we would be needing an instructor as it was our very first time rock climbing.  After we arrived, I tried to inquire at the front desk to get started.  It took a while to get anyone which was weird because there seemed to be a lot of staff coming in and  out of the door behind the counter and walking around.  One person told me he would get someone to help and 15 minutes later I had to ask someone else for help.  :(  \"Ok...  They're busy.  I understand.  It's Saturday.\"  Finally we get some help and I start small talk.  Just wanted them to remind him that we were beginners again because I was nervous!  LOL  We finally get our harnesses and the guy walks away (to God knows where).  Me and my cousin are left to figure out the harnesses.  Guy gets back and takes us to an area and  tells us that the area he has taken us to is not really for beginners but didn't have a choice as there was a birthday party taking place so that area wasn't available.  THAT should have been a red flag, I know. (-_-)  The instructor didn't explain ANYTHING!  He just told me to hold the end of the rope and told her to start climbing!  LOL He was still standing with us but instead of watching my cousin climb or instructing me as she was climbing he was looking everywhere else.  She got about 4ft up and dropped, landed incorrectly and ended up injuring herself.  This guy freaked out.  He had no idea what to do.  These guys are NOT  well equipped for injuries/emergencies which surprised me.  I thought these guys would have at least known First Aid.  Luckily I'm a nurse.  But this really has me concerned. I asked about a refund and the manager informed me they don't give refunds and proceeded to offer me vouchers that didn't expire to come back in the future!  Ok.  At that point I wanted to slap someone. LOL  Really?!  You really think we're coming back?!  We ended up contacting the owner who was apparently away on vacation at that time and he has happily refunded us and sent us a lengthy apology letter.  However I didn't care.  All I want is for him to teach their employees how to properly handle emergency situations and work on their severe lack of management & professionalism.", "date": "1/14/2012"}
{"review_id": "4NYPutpLlIuN0m-lOhlDag", "user_id": "TQ6solaXoni75EcbrdlF-A", "user_name": "Christina R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My first experience rock climbing.  Brought the kids since one of them had just finished rock climbing camp last week.  I have nothing to compare it to, but the overall experience was pretty great.1.  Friendly and knowledgeable staff - Tommy spent time to teach us first-timers the basics.  The instructions were simple and easy to follow.  Throughout the morning I saw Josiah repeat them to incoming climbers.  2.  Surprisingly kid-friendly for my toddler who tried \"bouldering\" a little and at one point even put a harness on.3.  Affordable and accessible.  I thought the set up was fine, with many different course options.  I would seriously consider doing a birthday party here for my kids, a Happy Hour, or Girl's Night Out.Thanks to Melissa, Tommy and Josiah for making my initial experience a positive one!", "date": "7/29/2013"}
{"review_id": "q15vXQQF1kKURLzt-PqpJA", "user_id": "q683sTCk-YOJ2jyJEsIwzA", "user_name": "Eddie R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "So me and my gf decided we were gonna try indoor rock climbing looked it up and found this place. First off I'm a picky guy and and hard to please but this place was amazing the staff very welcoming specially the guy with the long hair", "date": "2/6/2015"}
{"review_id": "1zEslVa09egHjd_ChIkw_A", "user_id": "2g5BfVYHp81-Ux5kYGAigw", "user_name": "Timothy D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Great place to climb some rocks. The staff was awesome and helpful. If you're up for a challenge you'll find it here.", "date": "5/18/2014"}
{"review_id": "9z9730lyLtAQqSMdoAmOqg", "user_id": "Dgrj6TfolLHkvTx4_KHjhQ", "user_name": "Jaron W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "Worst climbing ever. Parking and entry make you question going in to begin with. Staff was rude and not helpful at all; didn't even ask if we've climbed before or know how to use the equipment. Rocks you have to walk on ruin your shoes, ratings are totally wrong, ropes are too short, staff sat behind the desk on their phones instead of keeping an eye on customers. Will never come back, mesa rim is 1000% better.", "date": "8/21/2015"}
{"review_id": "dKtuL7LLMLwPCBq45PyKVQ", "user_id": "KeAntZqKlvOJE0e84t3gxw", "user_name": "Jay C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time here, employess were verey friendly an helpful for beginners. Im hooked ill be coming here more often with my friends!", "date": "4/22/2012"}
{"review_id": "79O685gKTRKgxgUL4EQsyw", "user_id": "_LnxiD5K_BlpBPuQkRwxtQ", "user_name": "Nik R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Ok place to climb. Found a lot of lines that seemed like they had missing feet holds, which inadvertently turns a V0 into a V2 and is not the kind of situation you want to be in as an inexperienced climber 12' off the ground. My favorite thing about this place is the boulder/gym room, but only because you can plug your own music in their stereo and giant (speaker).", "date": "7/5/2014"}
{"review_id": "GY8ghvVdYtgeAMRgZOd3GQ", "user_id": "hKu8wq_udiZkh0ZVtBkMvw", "user_name": "Angela D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 1, "cool": 0, "text": "Came here with a group of friends for a birthday party during the week. I was pretty surprised how full the gym was on a Thursday evening. Regardless, there was someone right at the front waiting to set us up with harnesses and shoes, I recommend wearing \"gym\" attire for girls as it can get pretty sweaty! The staff was friendly enough and only took us about 10 mins to go over the rules and saftety procedures. Got in a good workout while kickin it with friends.There isn't any lockers so I'd recommend traveling light. Don't forget to bring some water and socks for your shoes! Overall it was a really fun time!", "date": "2/6/2012"}
{"review_id": "l3tM-1Bnyz5NgHQW2AiQzg", "user_id": "5qZb6nLd7gRnTQK6OKwAPg", "user_name": "Heather W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 2, "funny": 1, "cool": 3, "text": "This is definitely a situation where I'm glad I didn't get the opportunity to read reviews before my visit...I suppose for the more experienced rock climbers - this isnt the #1 choice?  I dunno, it was my first time ever rock climbing so this review is probably more helpful for someone in my shoes.  For an all-day weekend pass + rental gear and shoes, it's $21.  I thought that is pretty fair for an out-of-the-norm weekend activity.  If you get there before noon, the place isn't too crowded.  I found around the time we took off (1:30) it had about tripled in the amount of people.The experience as a whole was very enjoyable.  We got started right away and after putting our harnesses on, the staff member gave us the low down on how to operate the ropes and be safe.  I thought he explained everything easily and made me feel comfortable and safe as a first timer.  We each took turns in the different roles with his assistance and once we felt good about what we were doing we were sent off to climb around at our leisure.I thought the variety of terrain was good and their system of colored tape to distinguish the experience level of the routes was very effective.Great activity for a couple, a few friends, and probably even a group of people.  I wouldn't call this a good date with a new person given the oh-so-attractive crouch-factor.  I gotta say, here's a funny opportunity to see guys \"lay it all out for you.\"  I was thoroughly amused at what the harasses does for the males :)I made the mistake of wearing shorts...probably not the smartest idea with the angle people are seeing you from below and the whole harness thing.  Make sure to wear longer shorts (like knee level) or khakis...something like that.  I saw people wearing straight up jeans but that doesn't seem very smart to me.Overall, cool place to try out if you've never done it before.  The staff is friendly and knowledgeable, you feel very safe, and you are entertained for as long as your hands and arms can hold out.I'm typing with some rather awesome blisters on my hands right now!", "date": "1/18/2009"}
{"review_id": "SRamwertA_s8nXz0thxxLA", "user_id": "S1-DPOUlOj5TEhvVJIEtIA", "user_name": "Kimberly C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "One of the best indoor rock gyms my husband and I have been too. great deals for military families. great place for first timers or experienced climbers!", "date": "8/16/2014"}
{"review_id": "J5Fa9vkUEXHcdcMvYZO1cw", "user_id": "WD8E5NKEVGX66PAWJdXWzA", "user_name": "Mike D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "In a nut shell: -Good gym to get your climb on. I'm more of a fan of the bouldering but the rope routes are decent too. A bit lacking but it has a worn-in, homey feel. -Don't hesitate to try it out. Pros: -For me, close to home. You can even take the trolley if you so choose. -Very challenging lead climbing cave -Pretty good bouldering area, although it gets crowded quickly (on a side note, some guy wanted to fight me because I was in his way... even though I was there first). -Difficulty levels from very easy, to extremely hard so there is something for everyone. Cons: -Parking can be a pain in the ass especially at night when I see the most people there. -There are always a lot of kids here. I have no problem with them but they sometimes get in the way and are loud. -The floor is rocks. I prefer foam for indoor places. That's just me. -The walls are tall, but not tall enough for me. Little details: -Staff is friendly but I got the impression that they thought they were better than me the first time I went. Every other time I just ignored it. -They have some decent clinics but mine got rescheduled 2 times before I actually went. -They have a small gym area above the main entrance/office. -Slack line, pegboard, and crack wall can be found in the bouldering area which is cool because there aren't kids running around everywhere (kids are not allowed in the bouldering area without an adult, if I remember correctly).Overall: -Check it out, I doubt you will regret it unless you are super nit picky and have ultra-high standards. -Fun if you want a good workout or just want to monkey around.-Good practice before you hit the real stuff.-I will return but I found a place that works better for me.", "date": "8/29/2011"}
{"review_id": "d4o4I6k9ACbkl-hPvpf4gg", "user_id": "N4C4V4wyXzaMSjAAwrpPvg", "user_name": "Frankie G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "The team was amazing! There was a while group of kids in and they did such an awesome job. They worked really hard! I was super impressed. They were also witty and fun, made the entire experience unforgettable. Thanks guys!", "date": "5/13/2012"}
{"review_id": "Ze1MatET6EM7uyGqzyJrgA", "user_id": "-0zEEaDFIjABtPQni0XlHA", "user_name": "Nicole C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 3, "funny": 4, "cool": 1, "text": "2012 was my boyfriend's and my Year of Debauchery. We traveled near and far and got nothing short of OBLITERATED in every corner of the contiguous US of A. It was awesome, but spending most of the year either drunk or hungover took its toll on my body and probably my mind. It just took me 30 seconds to figure out if it's pronounced \"con-TIH-guous\" or \"con-ti-GYOO-us.\" My brain no worky so good and six. So we decided that 2013 should be the Year of ADVENTURE. After a soul-clearing trip to Yosemite we vowed to try something cool and new and exciting at least once a month, preferably something that would benefit our life-expectancy instead of slashing it nearly in half. This month, we wanted to try out a rock climbing gym because nothing says ADVENTURE like shuffling across plastic rocks indoors.I decided on SRG Middletown despite the multiple scathing reviews for two reasons: proximity and price. It's pretty close to us, and for our first time (and because we figured we'd only last like, twelve minutes before collapsing in a sweaty heap on the floor [that's what she said]), the $23 initial price (as opposed to Vertical Hold's $31 and Mesa Rim's $30) seemed the best use of our money. In retrospect, we probably should have dropped the extra dough for a legit lesson in belaying and knot-tying at one of the other gyms, because the SRG \"belay lesson\" was pretty bare bones. I can kind of understand people feeling like the safety was lacking (especially if they're \"heights averse\"), but if you pay attention and use common sense there really shouldn't be an issue. I do wish they'd given us a tour or explained the numbers and color rating system and whatnot, but I'm sure if we'd asked they'd have gladly helped.As for the \"GROSS\" shoes everyone speaks of, I personally did not notice any particular stench. Then again, I don't stick my nose in RENTAL ROCK CLIMBING SHOES TO CHECK FOR CLEANLINESS BECAUSE I AM NOT DISGUSTING. The climbing itself was a blast - we showed up early (about 9:45) so even for a Saturday we had no trouble getting to climb as many routes as we wanted - although a little girl's birthday party started on our way out... I can't IMAGINE how the place looked then. The Dude enjoyed bouldering more than the top rope climbing, so we spent some time in that room too. Within about an hour and a half, my hands were too tender to continue, although I wished I could have kept going all day! That shit it FUN, yo. I can definitely see myself getting into climbing once I develop some callouses on these frail little flower petal fingers. I'm sure we'll eventually hit up some of the other climbing gyms in the area, and maybe then we'll understand the hate goin' on. For now, though, Solid Rock is A-OK.", "date": "3/10/2013"}
{"review_id": "dwu5eBjbIbu-C-eDQaUHVA", "user_id": "OsWLgsGEuA_axoJUDIfoEA", "user_name": "Michelle Z.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here a few times & it was simply a new and fun way for me to get a workout in. It's doable for anyone whether you have no experience at all or are very experienced at rock climbing. It was $20 for the gear and you're allowed to climb for as long as you want. Memberships are also offered which would probably be cheaper if you plan on going often.", "date": "11/11/2015"}
{"review_id": "-XuW-p2yKpfqKA5WfUq3Vw", "user_id": "0L_mr1mN9yd0Wz0cOnoqTw", "user_name": "Johnnatan L.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is awesome...  Nice location off the freeway...  Not too packed on a Saturday...  Got a great workout...  Will come here many more times...", "date": "11/6/2014"}
{"review_id": "j58jr5ylk56xZTcwX2U0hQ", "user_id": "PCUFHnjmYlCEdGY8-t82LA", "user_name": "Dennis T.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 1, "funny": 1, "cool": 0, "text": "I'm a climbing novice and this is my first indoor gym experience. I've been here twice now.My biggest concern here is safety. They pretty much gave us our harnesses and said \"have at it\", without belay instruction or anything. I had to rely on my friend to teach me how to properly belay, and he is fairly new to climbing also.It's ok for me since I'm new and I suck, but I've heard there are better gyms (Verticle Hold, Mesa Rim). I'll keep coming here to gain skill and experience then work my way up to the other gyms so I don't look like a total noob. I do like its proximity to where I live, I think its the closest climbing gym to Downtown.", "date": "7/6/2011"}
{"review_id": "ZKkX6He-b7Nth5xeuD0ryQ", "user_id": "NRB8xfZFzc5KFlKUEzIzWA", "user_name": "Knight S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 0, "funny": 3, "cool": 0, "text": "Horrible website. Note user friendly at all. Does not even have prices posted!", "date": "8/20/2013"}
{"review_id": "8Y7GDRI_ml5ZfBV3w7ePyA", "user_id": "gjkH8VV8BStDzsl1rp430g", "user_name": "Keakulina G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This place is super fun! It's an excellent workout. I advise bringing a buddy because it's a lot more fun/productive when can communicate with a person you trust. There are a plenty of courses to take and they color code the difficulty level so you don't wind up climbing up a wall that you simply can't conquer. It's decently priced and they also have a month membership. If you plan on visiting regularly, I highly recommend buying a harness elsewhere, otherwise it's about $5 to rent one. I really wish I started a long time ago, I'd be a lot more fit by now! The walls encourage me to come back so I can finish what I started. It's great for people who like to challenge themselves, especially in the fitness department. Also, prior to going, I let the cashier know it's been years since I last climbed and he gladly sent someone to help instruct me and my partner. He gave us tips on belaying and climbing. I also used my regular gym shoes which turned out just fine, but I think if you rent their shoes, you'll have more success climbing because they may have a better grip. Check out the gym though, you'll get a good sweat and have fun! Missing 1 star for the small parking lot! But it's worth it!", "date": "2/13/2014"}
{"review_id": "L9gSfTghYj-H6JPbyvlfJw", "user_id": "GUsxSk3AVpGKbC-hg13--w", "user_name": "Joanie T.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 1, "funny": 0, "cool": 2, "text": "Went here for the first time today and I love rock climbing now. Great upper body strength! But one thing I didn't like was that it was small and you find yourself doing the same ones over and over again. And the safety issue here should be more strict like at least having the workers stand around and watch the people belaying eachother instead of sitting behind the counter doing nothing.", "date": "4/5/2013"}
{"review_id": "NxBpo_ukfMAWpTZK_kH2jw", "user_id": "F3eOliG56dCpOEa6U9ZrCg", "user_name": "Evan S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! I got my membership in January and go as often as I can. Awesome boulder room and lead cave. Tommy, Ben, Josiah, and the rest of the solid rock staff are not only helpful, but also extremely welcoming and encouraging. From beginners to experts, it is a great community!", "date": "5/28/2014"}
{"review_id": "7oIuLziKc2Kalx-oiGZljw", "user_id": "SUbzZvqs-NTs1gTZad9AeQ", "user_name": "Michelle T.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This is the third rock climbing gym that I have been to and I think it was my least favorite.  Instead of having mats on the ground to fall on, they have rocks and it seems to be a little bit more pricey than other gyms.  All in all it is not bad but it is not great I am no rock climbing expert but it was just okay.", "date": "5/17/2014"}
{"review_id": "N_bxEfNUBt02XYr_2XhoLw", "user_id": "0jrsphYS2yZCLz5O6rxnpw", "user_name": "Brian C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've been going to this gym regularly for almost 2 years now. I wouldn't say it's the best gym in town because it lacks some standard gym amenities, but they do have some great climbs. The staff are friendly and the regular climbers are cool too.I think it's good for first timers and from what I've seen they do a good job with kids parties. They usually have groups of kids coming through for summer camps and parties so the staff are all used to dealing with the kids. During summer and school holidays there are a lot of kids on the top-ropes but the boulder room and lead-cave are always kid free. What made me convert from the occasional day pass to an annual member is the 18+ boulder room. The overall shape, and even the texture, of the new boulder is fantastic. They are able to create some really great routes. I wish they had a padded floor rather than the rocks and crash pads though. Nothing more sketchy than trying a dynamic move with your heel hooked in a horizontal position 10 feet from a pile of rocks.I also agree with some previous posters that the ratings seem to be easier than they actually are. A 5.9 top-rope at Solid Rock is probably 5.10 at other gyms, I can see how that might bruise the ego of the visiting climbers but I like it. Whenever I go to another gym or outside I'm able to complete routes one rating higher than I can do at Solid Rock.They also have a free weight gym upstairs, but it rarely gets used during the day. For me, this is where they loose some points. I can see that it doesn't get used much during the day, and that's probably why the're not investing in it, but maybe it's not being used because it's so small and lacking some basic equipment like an elliptical or cycle. More than 3 people in the weight room and it's overcrowded. I'm sure 95% of the people that come in are only there for the climbing so it's understandable that they don't invest in it, but I'm in the other 5%. On the positive side, at least they *have* a weight room. They have several benches, full rack of dumbbells, plenty of barbell plates, rings, and finger boards.  I'd like to give 5 stars, but there are a few things that bug me:- Need to clean up the lockers, they are all covered in chalk dust. The bottom of the locker shelves are as dirty as the floor. - The weight room is also covered in chalk dust because that's where the finger boards and rings are. - Get at least one elliptical or cycle for some cardio. Just truck one down from the Poway gym!- Need to maintain the tape on the routes. Nothing makes a route more difficult than an unmarked hold. The top-rope routes are pretty well maintained but the boulder gets more and more difficult as the tape falls off.- It would be really nice if they went for a more traditional gym approach with the weight and locker rooms.Even with the few gripes I have, I'm happy with my membership here. I plan to have future birthday parties for my kids there when they get older and I will likely renew my membership as long as they continue to invest in new holds and keep that boulder room fresh.", "date": "4/8/2011"}
{"review_id": "kKkS9-3AcY0NcniGJMamig", "user_id": "1gxC-NbdGSMf5TCnbBbFNg", "user_name": "Adam W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 5, "funny": 1, "cool": 0, "text": "I like this gym and it's the one I visit the most because it's closest to me. I would love to give this place 5 stars for being a climbing gym but I feel like it could be a lot better. At first I was really sad about how expensive this gym is... I guess the price is average (at least in SD) but I refuse to come here when I'm not apart of a long term membership because the per-visit cost would kill my wallet.My biggest complaint here is that the routes are poorly taken care of by staff. My favorite climbing style is bouldering and the boulder section is always missing tape from routes or is hanging on by it's last sticky bit of life and the employees don't fix it. The employee's tend to sit behind the counter even when there is more than one on the clock and I feel like they shouldn't. If even just once a day, they checked the tape and replaced ones that are needing to be replaced, this place would be at least a star better. It's almost like no one has any pride or ownership of this place. Even when I ask an employee where I'm missing tape, they might tell me what they think it was and they still wont care to fix it and if they made rounds just once a day, there would never be a lot of work to keep it maintained. it's frustrating! The ropes are old and they feel gross. I want them teach people how to belay and how to put a grigri on a rope properly or just anything that will teach someone something. I guess my only other complaint is that the gym is small but with a membership and enough gas money, you can visit their Poway gym which is betting in my opinion and not much further than Vertical Hold.", "date": "7/18/2010"}
{"review_id": "zj9Nw_MWxikDsZ5FMaxeCw", "user_id": "RC5m9iZl4USU25CfOB8bnw", "user_name": "Chip C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 7, "funny": 0, "cool": 0, "text": "I've climbed here many times over the years. They recently made strides regarding the expansion and more actively resetting routes, but the bloom is off the rose now. These changes are lipstick on a pig.  FYI - I'm an experienced climber who has climbed many place. Here's the real deal with this joint:- staff could definitely be more attentive and professional.  I watched an employee free climb an entire top-rope route in flip flops while on the clock.  Great example you're setting for the customers (including kids) who were watching!!  I've also seen customers have to wait at the front desk while the employees go climb.- safety.  Can't believe no one has been hurt badly here.  Safety training since there are so many \"tourist climbers.\" You can walk in, say you've climbed once ten years ago and they are like \"cool. Next.\"  I've seen tons of dangerous belaying here - teens 2/3 up the wall and the belayer hasn't taken any rope.  The staff should definitely pay more attention to this sort of thing. - crowds!!!  It's small, and it's horrendous when they have parties of screaming kids (all the time!!). There's nothing more annoying or unsafe than a bunch of unsupervised kids running wild and doing idiotic stuff like standing directly below climbers who are bouldering or being belayed down.  The parents are even worse because they do the same things and should know better. - one of my biggest peeves is that the staff doesn't care if customers  throw their water bottles, backpacks, etc. on the ground near bottom of the wall you're climbing.  You land on that crap and you'll break your ankle.  No one cares. Not the staff, not the lazy customers, no one. - they have no computer system.  A year or so ago a staffer gave me crap b/c my annual membership had expired like 2 months ago.  I've never intentionally not paid, but isn't it the business's job to keep track of this sort of thing?  Duh! A computer costs $300 dollars today...- there are three positives. It's got a good location, it's cheaper than the other (superior) SD gyms, and the pebbles as footing are superior to the pads.  You can fall from higher and there is no bounce, unlike the terrible mats all the other gyms use.", "date": "6/14/2012"}
{"review_id": "PP5ZNZEZ8AA01OgOi-twgg", "user_id": "C7dOcyVWVzrVBz4oSgkeYQ", "user_name": "Kristyn B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time rock climbing. Great gym with friendly employees and instructions are well taught and easy to follow. And they have snacks! They have a boulder climb room and it's great! Well I'm only a beginner... For now ^_^ definitely going again!", "date": "9/8/2013"}
{"review_id": "qU0fpC6FcHBeHBcunxdIHQ", "user_id": "KZq-5jXwkJow6dOqcjFgAw", "user_name": "Katrina C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We just finished my son's 6th birthday party at Old Town's Solid Rock Gym. I couldn't be happier! The atmosphere was super chill and accepting. All of the boys and parents had such a good time. They all plan on bringing their kids back. Josh, our party attendant was great with the kids and was able to motivate them to try hard and climb higher. I hate structured parties with a bunch of frills. Having the birthday party there was perfect. Simple, accommodating, easy going, and AFFORDABLE! (Only 11$ per kid). I definitely recommend this for a kids birthday!", "date": "3/29/2014"}
{"review_id": "59X9avfHogAvnb5tkBrR3A", "user_id": "5qQpmL8m7tqTcLcHdiQZWA", "user_name": "Cody T.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was our first experience at a rock climbing gym. I don't have anything to compare it to but we were very happy with our experience. The staff, Tommy and John, were awesome and very helpful with all of our questions. There were plenty of routes and the bouldering gave us tons of options to choose from. Another review said they had bad music but that person must have terrible taste because their tunes were perfect for the gym. Overall it was a great time and we are going back ASAP.", "date": "10/25/2013"}
{"review_id": "rrl7TJbe_46h4nnzB3rUug", "user_id": "s5w0o7-ReMmba8SAbLRVvw", "user_name": "Lara Raven F.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 5, "funny": 2, "cool": 0, "text": "One word: gross.(If you want more words, here you go: * The bathroom was covered in about a quarter inch of urine, which could be smelled all over the gym. Footprints led out of that to the climbs. Nasty. * One notable day, the manager and his buddies were playing dodgeball in the parking lot, leaving the gym unattended. Yes, they were hitting parked cars.*Employee smoke drifts in from the big bay door, stinking up the gym.*The lock on the ladies' room door was broken for an entire year. The gym solution was to put up a sign asking people to knock first.*A light fixture fell down in the locker room, nearly hitting my climb partner.*Employees walk around barefoot, feet dirty to the knee. Not barefoot between switching street shoes for climb shoes, but barefoot for entire shifts.*Another day, several hours after the last kid party, the upstairs area was still covered in food debris. The employees were chatting behind the desk. When we asked if we could just borrow a broom to clean it up ourselves so we could stretch, they said that they would get to it eventually.*There are no safety checks or safety protocols. I've seen belayers completely let go to take pictures of their climbers. I've seen people that 10' falls because their belayer doesn't know how to belay. This is not an employee problem. This is a complete lack of management and training. When I spoke with the owner, she blamed her apathetic employees instead of making changes. After five years with Solid Rock, I'm happy to have made the switch to Mesa Rim. Plus, all of the serious climbers I had missed were there, having given up on Solid Rock for the same reasons.)", "date": "5/1/2012"}
{"review_id": "pR9Ko4iHJwNn25IIJC7OPQ", "user_id": "uQ45Qe1LuafoIs0p3OjqJA", "user_name": "Dorothy M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "I don't like the grigri on ropes. It also lacks intermediate routes. There are tons of easy routes, then it jumps from 5.6 to 5.9. And the 5.9 in this gym are definitely 5.10 in some. In general I just don't like the gym that much.", "date": "8/17/2012"}
{"review_id": "iSoNCU5ohuV5X9Qi5UbIIw", "user_id": "E0wgNGboRIS3eHUIVUlHLg", "user_name": "Megan G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 2, "funny": 0, "cool": 1, "text": "I signed up with yelp to rate this place. When I first walked in, I was impressed with the employees welcome but that is the only reason this gym gets two stars instead of one. The landing ground is filled with rocks. There are some crash pads but most of them are small and thin. The grades are ridiculous. There are no a, b, c, d's on the TR routes, it's either + or -, or just a solid grade is given. You can't belay with your own device, you must use their grigris and auto lock biners that are attached to noticeably fuzzy, hour-glass-shaped rope. They zip-tie their figure eight follow throughs on the belayers side for whatever reason (seems a bit lazy, sketchy and unprofessional). The employees sit behind the desk fooling around while unsupervised belaying children swing from their harnesses and scream in excitement.  The water fountain water pressure is so low you can barely drink from it, let alone fill your water bottle. There is so much needed to make that gym a better place. Start with getting different route setters and actually caring about safety in your climbing gym.", "date": "7/27/2012"}
{"review_id": "2FBdgRTWE-NyoM8RfJYq-A", "user_id": "BZ88HpxB3X4cVBOJWWd6CQ", "user_name": "B W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 0, "funny": 0, "cool": 0, "text": "I attended a child's birthday party at the San Diego location recently and cannot say that it was a positive experience. The staff was just too cool for school, and made no attempt to hide the fact that they didn't want a bunch of lame-ass parents around crowding their gym. In many cases they were just down right rude, and not at all good with kids.I have been to a few child's parties at Vertical Hold in Miramar, and the experience was WAY better. The staff there were friendly and helpful. The climbing was more kid friendly. The harnesses and lines were better quality and they include climbing shoes (unlike Solid Rock, where the kids climb in street shoes). Vertical Hold also did not have a time limit on the climbing (unlike Solid Rock, where once the kids ate their birthday cake, they kicked us out).A disappointing experience to be sure. The attitude of the staff just ruined for me. If you are planning a party for young kids, skip this place.", "date": "8/16/2011"}
{"review_id": "_u-qHKY1IgyqjHusUSaerg", "user_id": "53q8EFs2pTjlIo0hYPE3vg", "user_name": "Alex R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for my cousins birthday party. It was a lot of fun. They have a few different walls for all levels. It really works you out and if your afraid of heights this will push you to the limit. It's fun.", "date": "4/28/2013"}
{"review_id": "EHShgH99D-M6vmuZqcepaQ", "user_id": "7zUXN6QmqZ779S7bXQj1kA", "user_name": "carlos c.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "A friend of mine and I went for the first time five days ago on a whim!!!! We loved it, the staff is very friendly and attentive but not breathing down your neck, the routes were exhausting for us novices but we got a great workout. I worked muscles I didn't even know I had!!!! The price is very reasonable, the place open and airy with the bay open, lots of lighting!!!! My friend loved it so much that three days later she was telling me that she wanted to go back!!!! We will be back and I'm also considering getting a membership because I have caught the \"Solid Rock climbing bug\"!!!!!! My cousin now wants to go next time I do and this next weekend I am taking my nephews and brother!!! Thanks Solid Rock Gym, you have the nicest , coolest employees, who are not uptight!!!!! Good experience!!!", "date": "7/1/2012"}
{"review_id": "YN4IpLNfKga_8aeHymIr8g", "user_id": "8EQ_Ms6npRVVwYkEmpiybQ", "user_name": "Amy J.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great activity if you want to make a fun day of rock climbing in San Diego! It was my second time at Solid Rock and my boyfriends first. The first time I came here was in 7th grade on a field trip. Great for kids and teens!The girl behind the desk briefly explained what we need to do and checked up on us multiple times throughout our 2 hour visit to see how we were holding up. The ground is made of gravel, which was not great when I fell a couple times. Overall, a great experiene and I can't wait to go back!", "date": "3/15/2011"}
{"review_id": "h9J00TUa--5VDE483UQJJQ", "user_id": "Wnb5gvhlqdKgmZcy5xgp0Q", "user_name": "Katherine Joyce B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "In comparison to Mesa Rim and even Vertical Hold, I was astonished of how poor some of the routes were maintained. I love getting on a 10c and dyno'ing for a juggy knob only to have it shift out of placement 20' on TR (luckily on TR). My fav part is the bouldering section, it really does beat VH's because you have the ability to top out and don't have to mess with down climbing and landing on ankles. The slackline addition upstairs is pretty cool too, ghetto as *&!, but cool nontheless. They could do a better job labeling/marking the routes and holds in a more distinguished fashion, 2-5 are completely incomprehensible. Good to know before choosing the wrong rope idiot.", "date": "4/26/2012"}
{"review_id": "wC-WM_ecyYI-OrBVRdr-vA", "user_id": "zj46btUicz6bGmSzcRr1oQ", "user_name": "Ed K.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my Scout troop on our annual Climbing merit badge trip and, as usual, was not disappointed! The staff was FRIENDLY and HELPFUL, and JUSTIN did an awesome job with the kids! He was patient, friendly, and held their attention; not afraid to make sure that they paid attention (safety is paramount). He did a thorough job teaching them the skills they needed to climb. Outstanding job!", "date": "4/27/2013"}
{"review_id": "quidgCuLlHkGtgNtfEKFZg", "user_id": "61ZZd0eLPkPA6CI8j2ia1w", "user_name": "Liz M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 3, "funny": 0, "cool": 0, "text": "Found this place via yelp.  Took some of the criticism with a grain of salt, thinking the negative ones were a bit spoiled with their super nice gyms.  Unfortunately, I have to agree on their reviews.  I felt very nervous about taking my sister (a 1st time climber), especially since they didn't even ask if either of us had experience or knew how to belay.  The gym floor was gravel, which was not fall friendly.  No one checked up on us; the staff mainly stayed behind the front desk.  In addition to inadequate safety measures, I also felt the routes were inappropriately graded.  The top rope routes were ridiculously difficult and the bouldering was confusing, mismarked, and misleading at best.We had fun despite these concern, so, not a total waste.  Know better next time.", "date": "11/24/2009"}
{"review_id": "GsJbOkMJAe7k6xlncNTcQA", "user_id": "jLMkZCPgAcTaxCl85JNJ4Q", "user_name": "Refugio J.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "When I was a teenager, I used to scramble up and down the hills outside of my hometown in Arizona. The fact that I lived proved that Darwin's Natural Selection is true! So what do I do when I'm all grown up? I take up rock climbing. Darwin smiles.One of the places I frequent, is the Solid Rock Gym near Old Town (actually it's across I-5 from Mexican-American Restaurant heaven). This gym is not the prettiest, it's a bit dirty, it's a bit worn, but it's also a great place to get an awesome workout. Rock climbing will scare you right out of your socks (if you wear any), but it'll also make you feel ten feet tall - well maybe your arms will stretch out that far after climbing. Rock climbing gyms are dirty, they're supposed to be - a bit that is. Solid Rock was one of the first ever in San Diego and so you've got to understand why it looks the way it does.The Beta:- Reasonably priced: $12 to get in.- Cheap rentals: ($5) shoes and ($5) harness- I recommend renting their shoes for a better experience.- Locations: The original is close to downtown with a second in Poway- Climbing: Routes vary from beginner (white taped) to advanced- Parking: Not the best on a busy night (lots of nearby businesses).- Inside secret: They now have a new boulder area for members.- Group party area!Overall, I like it because it's close and it offers something for everyone.Check it out - makes for a great date place too.Climb on!", "date": "12/11/2009"}
{"review_id": "THybvyWJsxjPUvqRxf9zuw", "user_id": "X15qpbkFvJ8LOpt4x7dAFQ", "user_name": "Alissa G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "This place rocks! (Sorry, I couldn't resist!) Still, five stars for a wonderful birthday party experience. Our instructor, Tiffany, was great with all the kids and got them all up on the ropes quickly. She motivated them to push themselves and do their best - I was impressed!The party plan was an outstanding deal as we only paid for the kids who showed up and were not charged for the parents who wanted to give it a quick go. The party \"room\" is actually an upper deck, like a treehouse among the cliffs, where anyone who needed a break during our party time could sit down, have a drink, and cheer on their party-mates.We will definitely be back!", "date": "6/5/2010"}
{"review_id": "PAKsWSTvwe3Gy7j3OSKmBA", "user_id": "eijSbsCGz_frhDkd41KjfQ", "user_name": "Kim B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I'd give this rock gym a solid 3.5 - I'd go back again (and have) but there's room for improvement.I climbed in the Denver area for a good 5 years and got used to really nice gyms. I started going to SR while commuting to San Diego for work and got some of my co-workers learning to climb there. The newbies loved it, but had nothing to compare it to. From my standpoint:a. I found the routes to be pretty decent with good variety of skill level and pretty accurate ratings. b. I didn't mind the gravel floors, but I don't boulder.c. I was shocked they didn't require proof of belay knowledge or any test-out. S-C-A-R-Y! For the sake of the sport and everyone's safety, it's good to ensure folks know how to correctly belay and use the common verbal commands. d. I wouldn't trust their ropes for lead climbing. They looked well used and god knows how many big falls they've taken. All in all though, I think my expectations have been lowered now that I live in Orange County CA and haven't yet found a climbing gym I'd return to. I'd love to have this SR transported up to OC any day!", "date": "1/6/2011"}
{"review_id": "wkRfHYch3QGwGZcYtMssrg", "user_id": "4eGPdyVsgVn7wx3wLs8kXQ", "user_name": "Kristin B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 2, "cool": 0, "text": "It's not fancy and doesn't have nice bathrooms/changing rooms, but the routes are fun, it's not too crowded, and you can get a beer in old town afterwards.  The routes are definitely more fun than those at Mesa Rim - although Mesa Rim is 'fancier' and definitely taller, the routes at Mesa Rim are pretty boring compared to Solid Rock.  And Solid Rock is WAY more affordable.", "date": "5/12/2012"}
{"review_id": "X2eisFsb0wtiY5mUZlcHkw", "user_id": "VgCFRKlepyMAWA-t0lzS6w", "user_name": "Winnie W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "Five stars! Helpful and friendly staff. Excellent for a rock climbing noob like me to get her feet wet.  Whether you are a newbie like me or an old hand at rock climbing, this will be the right place for ya :)", "date": "11/9/2009"}
{"review_id": "xMVBg-2th8Xw3dAJllbf3w", "user_id": "3CKFJXDS8wftOO7_KkLI8A", "user_name": "Cody H.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 16, "funny": 4, "cool": 2, "text": "Worst.  Rock gym.  Ever. I may be spoiled because I climb in the Bay Area where there are real rock gyms to choose from.  But even so, I know a crap place when I see one.  And San Diego has Vertical Hold a bit farther out, which is infinitely better than this fiasco of a gym.  Here's a non-exhaustive list of the things wrong with this lawsuit waiting to happen:1) No belay check.  I went with a novice climber.  We rented gear, and I asked if they wanted to show her how to tie in and belay, or if I could teach her and then have them test her.  They just asked me if I knew how to belay.  I said yes.  They said that was good enough and that I could just show her how to do it.  They never checked on us or tested her in any way.  Crazy.  2) The routes are set and graded by mentally handicapped chimps.  I'm not a great climber by any stretch, but I can do 5.10a's and b's pretty comfortably.  But at Solid Rock, I couldn't do a 5.7.  The routes made no sense whatsoever.  Some weren't graded at all.  You had to guess at what you were climbing, and when you'd look for a foothold, which would be the only way to make the next move, it wouldn't be there.  Terrible.3) Old ropes.  You don't have to tie in to top-rope -- you just clip the rope to your harness.  And the ropes look like they could use a serious upgrade.  4) Grimy, slippery holds.  'Nuff said. 5) No crash pads for bouldering.  After experiencing the magic of top-roping at solid rock, I thought I might try bouldering.  But there were no pads, and the floor is made up of pretty large gravel.  Yeah, that seems like it's going to feel good.  Sign me up.  I could go on.  But I won't.  Just don't bother with this place, I beg you.  Go to Vertical Hold, or keep driving north and go to Planet Granite in San Francisco.  You'll be a much happier climber.", "date": "1/11/2009"}
{"review_id": "cksUBucL76Y2Wkkn2NE5zw", "user_id": "RyRSk3FjrwXJeS54BTkQGw", "user_name": "Colin M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "My visit to Solid Rock Gym was a fun experience. The staff was friendly, informative and helpful, the equipment rental was in good working condition and the overall atmosphere and attitude of other climbers was ideal.  I give Solid Rock 3 stars simply because it's a bit pricey, the gym is smallish and the courses aren't all that challenging. An occasional visit is nice, but I don't think I would be interested in a membership here.", "date": "3/28/2013"}
{"review_id": "v2uJuU04f8OmzUbsIUyG2Q", "user_id": "KLHbLcLYppMqvgjHvi07CQ", "user_name": "Doug M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 4, "funny": 1, "cool": 0, "text": "BRING YOUR OWN EQUIPMENT!  Their rental shoes smell disgusting.  Some of the worst smelling equipment I've ever encountered.  The guy at the front desk was extremely unfriendly and didn't seem to care about assisting us in the least.  Another thing that we didn't like was the rock filler on the ground.  Other gyms we go to have soft foam so if you fall while bouldering it's soft...here you need to drag a fall mat around.Lot of good routes and stuff.", "date": "7/13/2009"}
{"review_id": "ShGyqyopa7TieR69h_b7jg", "user_id": "uTPW_r-BFHJ6J43yzgdl7A", "user_name": "I-Wei F.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 6, "funny": 2, "cool": 1, "text": "I have been climbing at SR in Old Town for about 2 years. It's the only gym I've climbed at, but even then, there are things that I find very lacking:The ropes are mostly too short. If you're height impaired like me, the first person who clips in has to climb up the wall a little in order for the second person to clip in.Many of the ropes are frayed. Even though it's in a gym and it's safer than climbing outside, it still worries me a lot, it's a long fall.They advertise \"free lesson\", but when you ask about it, it's really just a belay lesson.The women's locker room is nonexistent. It'd be nice if there was an actual locker room with a shower instead of the little hallway in front of the bathroom. And the floors in the bathroom and in the \"locker room\" are not clean enough where I feel comfortable taking off my shoes in order to change.Maybe it's because I've been going there for a while, I haven't had many problems with service. But when I tried to renew my membership by downgrading from 6 months to monthly, the desk was entirely staffed by new hires and they had no idea what they're doing nor were they familiar with the policies.Nearly all of the lead climbing is in the cave with serious overhangs. It's pretty much impossible for someone to learn to lead climb in this place without having done a lot of it at other gyms or outdoors.The climbers there are pretty nice and friendly though, that's why I keep going there.", "date": "1/4/2008"}
{"review_id": "PDVr-TKZ1AAfHc2O8ajsAA", "user_id": "gE4yrx8NpqdXHfmc8_1QFQ", "user_name": "Ryan J.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 4, "funny": 6, "cool": 2, "text": "Ok, all you Bay area snobs, we get it.  This place isn't as good as the rockclimbing gyms in the Bay area.  Great.  That is super helpful.  Next time I want to go rock climbing at a gym I'll hop on a flight and join you at your uber excellent bay area rocksnob gym.  No this place isn't dangerous, and is not a law suit waiting to happen.  It's owned by two attorneys, who, believe it or not, know more about liability then you do!  I personally love solid rock.  Yeah, some of the criticisms are fair.  They use the cheater belay devices.  No one can free fall and get hurt that way, which is good, but the climbers aren't practicing tying in and belaying, which is bad.  The top roping could be higher, the workout area could be nicer, and they could have some showers...The staff is friendly.  The routes are good, with a wide variety of difficulty, ranging from 5.7-5.12+.  The bouldering area has tons of good problems.  The rates are reasonable.  I started climbing here, and love it.  I am sure there are better indoor gyms, but this is great place to learn, and improve your skill.  I go 5x per week.  It's the only gym within ten minutes of downtown, hillcrest, mission valley, pt. loma/ocean beach, missin beach, pac beach, etc.  It's right off the 5 which makes getting there easy from all over.  So unless you want to drive inland, or fly to the bay area, I recommend it.DISCLAIMER: This review is a natural product. The minor inconsistencies in spelling and grammar only enhance its distinct character and are in no way to be considered flaws or defects.", "date": "2/25/2009"}
{"review_id": "iBGLUt48-43lwXQ7lwhmWg", "user_id": "xN-xoLhTHUFfTS_BMGG0xg", "user_name": "Teej T.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 3, "funny": 4, "cool": 4, "text": "I enjoyed Solid Rock.  Granted, Yelp steered me wrong by having the wrong address at 2704 Hancock instead of the correct one at 2074 Hancock.  It's a funny street, divided by a freeway, a highway, and railroad tracks.  I was totally lost.  Boo.But that's not solid rock's fault.Let the record state that I don't like doing things that make me feel stupid or are outside of my comfort zone.  Rock climbing falls into that category.  However, it was a friend's bachelor party plan and I'm the best man, so off we go to climb some rocks.Solid Rock is a cheery, well-ventilated, well-lit indoor rock climbing gym.  It does get crowded a bit fast, but the staff are cheerful and helpful from my experience and I greatly enjoyed my stay.  My favourite part?  The very bizarre and differently shaped hand and foot holds on the rock walls.  Some look like neo-Art Deco pieces; others look like overblown skateboard wheels.  Overall, they're pretty damn cool.  I enjoyed it, and while it hasn't made a rock climber out of me, it seems like a good place to let off some steam, or take the kids for a birthday party (there were two when I was there, plus a boy scout jamboree).", "date": "5/18/2008"}
{"review_id": "IlYZkOhFemo4WQdMzQNmEw", "user_id": "PUYKClfdIFrVnwZbC3VfxQ", "user_name": "Nalipay M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 4, "funny": 3, "cool": 2, "text": "SRG took my rock climbing virginity, It was a wonderful and scary experience. We told the girl that it was our first experience and she took us and two other girls who've never climbed either to a wall and briefly explained the basics: how to hold, how to lock etc...all in about 5 minutes (which at the time seemed enough for me until I went to vertical hold and was impressed at how much time they spent teaching you the proper ways of things). I climbed up the wall and felt such joy when I got to the top, that is until I looked down and imagined myself plummeting to my death. 'Okay now lean back and let go of the wall' the staff yelled up at me. 'Are you crazy woman!' I yelled back down at her. I was prepared to climb up, but wasn't prepared for what I had to do when I had reached the top. The trainer didn't check to make sure that the rope was taut, so when I finally let go of the wall I dropped a bit. Scary stuff when it's your first time. I don't always understand the routes. I imagine someone around 6ft is the one that's setting them, because the distance between the rocks are near impossible for someone of my height to reach. The rocks are not always screwed in properly, so sometimes when you step on a rock it'll shift causing you to loose your footing. I guess they're trying to give you that real life feel to climbing, getting you used to rocks slipping under you. The place is small but the staff are really friendly and so are the patrons. Everyone is always willing to give you some pointers as long as you ask.", "date": "11/18/2008"}
{"review_id": "odHDjV66HZei-XpRBNVNUA", "user_id": "cfZ2aPzis4XVAMruB-f5qw", "user_name": "Talar P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good times!  Been to this location only once, and it was full of more adults than the Poway Solid Rock gym -- everyone is very laid back.  Lots of fun racing to the top and watching the pro's climb upside down and swing around boulders by their fingertips!", "date": "3/8/2012"}
{"review_id": "c1vmkd5jB6m6jNh2EIJw8w", "user_id": "FSl6qeRIu7kPQfZpBl1Npg", "user_name": "Giggly C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Oh, they're expanding this location! I can't wait!!  They bought some space next door and will inc the lockerroom and add in more walls. Yeah!!  Should be coming in the next couple months.I think it's ironic, even though it seems so many yelpers don't like this place, it's almost always packed when I come (and as a memeber, I come 1-2 times a week).  So they must be doing something right. *wink*", "date": "8/11/2009"}
{"review_id": "LP8M_1gZBPglJx8DHXA5Gg", "user_id": "rAiPl4pbiCyAnEOUAmEOSg", "user_name": "Kerin S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place and the staff that works there. Also the art work on the wall is amazing ;). Karen is the best! So happy she is back. I wish they had like one treadmill or elliptical. Something for cardio.", "date": "2/27/2012"}
{"review_id": "tlEsyaBa1WL9zGRiWU-2SA", "user_id": "864nL0po2ldN8TPgbSiwOQ", "user_name": "Walter M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Ah Old Town, the smallest and busiest of the 3 remaining SRG gym's. They just got a new boulder for members. This place can be discouraging because of the crowds. I'd suggest you bring a partner and an ipod. The lead cave is the steepest of all 3 and their routes get changed the most because it sees 3-4 times more traffic than the other 2 gym's combined. I used to be a routesetter for all their gym's and loved the variety of working in a fast paced gym versus a more relaxed more family oriented one. It's the oldest gym in San Diego with steel reinforced wood frame (except for the new boulder). It will have the most variety because they set more hard routes there. San Marcos and Poway do college night. 1 hour of steady consistent climbing burns more calories than none stop running for an hour or lifting weights or swimming (up to 1000 calories)", "date": "1/26/2010"}
{"review_id": "hamYSd-4Y9xDRx25ZF9B7A", "user_id": "VkGPWnsChMkjMWqcSe1y3A", "user_name": "Terri D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great time, great value!  Try it, you'll love the workout!", "date": "3/11/2012"}
{"review_id": "0EdehpRwywgvTe5beR3F-Q", "user_id": "bhr_v0MWuNwQkrHNe2WR0w", "user_name": "Khanh N.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This review is for Climbing Merit badge experience done on the  weekend of 8/11/2012Two session course and we had 12 scouts participating. Ben and Anthony were our instructors and they were great with the scouts.They class portion had great overview of climbing and plenty of visual aids. They both were very encouraging with all the kids, getting them to push a little harder above what each kid thought was their ability level. Great reviews from the scouts, especially day 2 when Anthony let them try the slackline. Overall a great experience I would recommend it to other groups who want intro to climbing.Over all 4.5 stars. Only reason why it wasn't 5 is there was a lot of confusion on the booking and cost. I called in a few times and got different information on how much it was going to cost,  but it all worked out. Bottom line to earn merit badge cost is $30 per person minimum of 8. Minimum 1 week advance notice and non refundable $100 deposit to secure the reservation, but is applied towards the cost. No need to rent shoes for beginners it doesn't make a difference.", "date": "8/22/2012"}
{"review_id": "ZGiVcmT1jJVhkrh4W0o01w", "user_id": "45aOEKZT0ekZbsXbygesjg", "user_name": "Aileen L.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 2, "funny": 4, "cool": 0, "text": "Let me put out a disclaimer before reading beyond this as to why I rated this place as one-star:I guess it's a good and fun place for people who don't normally climb and want to do something new, but as a climber, this place made me really angry and upset.As a climber I like to find new gyms and experience different climb setters. I come from Threshhold Gym in Riverside, check it out if you're in the area.Back to Solid Rock- I was visiting my boyfriend's cousin out there and we had some time to kill, so we brought his cousin for her first time climbing. We'd never been there before but we assumed it would be cool to try out a new gym. She liked it for her first time, but we totally hated it.The gym passes are so damn expensive for what you get! Okay, if you are new to climbing then sure, knock yourself out- but I didn't get ANYTHING I paid for. It was $16 on the weekend for a freakin' adult pass. So what does that get me? Access to crappy EVERYTHING. Why?1) Their holds are never cleaned. Judging by the look/feel of it, every hold was greasy and left uncleaned from probably MONTHS.2) The workers ALLOW people to climb with normal shoes on. HELLO, that is what makes all of the holds so greasy! You should be climbing with shoes that have rubber soles specifically meant for climbing, or you will be greasing up the holds and people like me won't have fun slipping off anything and everything!3) Their route (and bouldering) ratings are COMPLETELY OFF. I did a 5.9 route that probably would have been a 5.10 outdoors with a 5.11 crux. I checked their website, and they even have a section that says \"Interested in route setting?\" so really, like ANYONE can come in and set up a route? No wonder why their ratings are so inconsistent! Also, I warmed up on this supposed-to-be V0 in the adult section (yes, the bouldering is in a separate room that is 18+ years old only... but I still saw children in there), and that in my eyes was a V3. What kind of V0 really makes your feet cut in the gnarliest way so that you can fly backwards and eat a mouth full of...4) ...PEBBLES. What the hell, really... typically all climbing gym floors should be padded! but PEBBLES!? They filled the entire gym with pebbles (or may I say little rocks, because these were NOT Cocoa-Pebbles-sized pebbles, they were pretty huge). In addition, They had a limited about of crashpads that were all disproportionate and ripped up because they were handmade and stuffed with cheap foam. Accidents happen, and sometimes people don't land ALL on the crashpad... in fact, my boyfriend landed one foot on the pad and one foot on the pebbles and his ankle started hurting, even with me spotting him!5) This gym does not teach safety or how to do things properly. Yes, for convenience on all the ropes they have attached a gri-gri and have tied it in so that you cannot take it off and put it back on improperly... but I still see people clipping themselves in in some kind of stupid fashion that makes it five times harder to bring someone down. 6) Their gear is all worn out. Just like the uncleaned holds, their gri-gris are extremely worn out, as well as their ropes. Try to replace some of this stuff every once in a while! With the money they are charging for day passes and memberships, it's unacceptable to have this low-grade stuff in this gym.The only thing I looked forward to was that they had a crack climb section, however the inside of the crack was completely smooth from too much chalk and usage, and the crack was way too big to do a single handjam, so I kept slipping.If I had to rate this gym, I'd give it a big fat F. This place is completely unacceptable for experienced climbers and probably even dangerous for people who are inexperienced! Judging from the crowd, this place was filled with a lot of little kids running around with tennis shoes on, so I assume maybe this gym caters to little kids and people who are inexperienced. Even still, the upkeep is unacceptable- this gym is expensive and unkempt. If i had the option to give it NO STARS and even take the ones they earned away! believe me, I would. If I was in the area and had to satiate my craving for climbing, I'd rather bring a hammer and chisel off a random boulder in the area rather than go to this gym.", "date": "3/3/2011"}
{"review_id": "RgmGAzU3bS8dyLSROpWACw", "user_id": "Q0ESqCgRm33PHWeIu4ZUkQ", "user_name": "Neille S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to climb, very laid back atmosphere, lots of friendly regulars.  If your looking to waited on or catered to this might not be the gym for you.  But if your looking for a fun time climbing at a reasonable price, come on down and climb.  Love that there is a small weights gym upstairs.  There is a section for slack lining, a nice sized lead climbing cave, and a big old bouldering room which is pretty awesome.", "date": "2/1/2012"}
{"review_id": "lgv6Z3LVggEacT2q9uMe6w", "user_id": "z9Om-8ivGoZQv9fOlwstRQ", "user_name": "Mel M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We just had our sons birthday there, it turned out awesome! Luis was great with the kids and made sure everyone had safety instructions. We all had a blast. Loved that you could see the whole gym from the party room.", "date": "8/17/2011"}
{"review_id": "_GlFSLUFDpnHVmqGQ7oqlA", "user_id": "HswuIN-4YxiaXy_mrtcCWA", "user_name": "Jackie K.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "If you're looking for a decent place to work out, without having to go to a boring gym, then you are looking in the right place!As far as I know, Solid Rock is really the only option in San Diego for indoor rock climbing. But because it's the only option, don't think they skimp on good tracks and lots of variety in wall selection, because they don't. There are lots of different walls and tracks from beginner to advanced. It's also a great idea for a kids party (they do them A LOT). So go and try it out!", "date": "1/21/2010"}
{"review_id": "b_XM5rBBkUK40juDDnCNdw", "user_id": "h25vnXfrFPckqCGqFLe3oQ", "user_name": "Quan D.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "The location is a bit hard to get to, if you're not coming off of The 5 South. The gym is pretty small and it is always full of kids. There is no real technical knowledge of climbing, the climber clips in to an auto-locking clip and the belayer has a grigri belay device, which takes out any sort of thinking, all you have to do is keep the slack out.Not really recommended for more challenging climbs, but it does have 'white' trails on every top line, which allow for an easy ascent to boost confidence and warm-up.The last time I was here we only got in 1.5 hrs of climbing before kids took over every top rope.", "date": "6/24/2009"}
{"review_id": "3JbhAK8n23sYG-eFMlt8TA", "user_id": "KaOT1LhjYFt_HnpFmSqlTw", "user_name": "Sandy H.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "Poorest quality gym I have ever seen on every Level. We were visiting from Seattle for the weekend and stopped in to climb. As everyone says, there are young kids everywhere belaying each other and climbing on the walls. SO SO SO unsafe. The routes are not rated wrong, the routes as many have stated are not even routes. I have climbed for 15 years all over, lead 11's and could not get up 5.9's because the the holds are randomly placed, totally polished and the routes make no sense.  Even worse are the ropes that are unbelievably HORRIBLE!! You have to manually feed them through the sticky grigri's. We watched kids doing this and they had to REMOVE THEIR BRAKE  hand to push/and or pull the rope through and could never have caught the climber if the rope had suddenly started feeding. I am going to post a picture showing the rope... one end looks like a thread while the other end is fat and won't feed. We did not climb on one rope that had the core intact.It is unreal to me that they can run a gym like this and actually have members that accept any of this.Obviously the owner is not a climber and has no interest in safety or quality of his gym. I do hope he is making a good income from his business because clearly that is all that matters to him.The girls working there said everyone has the same complaints and the owner won't make changes. In addition there is a  suggestion box there asking people to write down their complaints instead of yelping. That kind of says it all for me!I", "date": "3/18/2013"}
{"review_id": "cqO_zOYR5BQzZLO42uI6ow", "user_id": "dam3rzshBdd0yv5Qc8F1wg", "user_name": "Kim K.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Ben was awesome today with our family that was visiting from out of state. This is our second time to the gym and each time we received great customer service. We would highly recommend.", "date": "8/4/2012"}
{"review_id": "Z1dK6sU5xdXIdQgzvqINJg", "user_id": "-LfCl9iuTXRScrt2yPbrAA", "user_name": "Theresa W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 4, "funny": 0, "cool": 0, "text": "Scouter's Beware.  Their website advertises the following (copied and pasted)\"Scouts will learn how to use our climbing equipment, learn climbing commands and the necessity of communication while climbing. The Scouts will also get to boulder and top rope.This program is taught in a single two-hour session. Upon completion, the participants will receive their very own embroidered INDOOR ROCK CLIMBING PATCH.COST: $15 per scout + nontransferable $50 deposit at the time of the reservation. (minimum 6 participants) \"We made phone reservations and told them we were bringing a group of about 20-30 scouts.   They made no mention of the little to no parking.  It's mostly street parking.   When we got there, the guy behind the counter was rude and unpleasant.   The trainer was nice, but all he did was demonstrate how to use the ropes.   Nothing like what their website lead me to believe.   The walls were a little too difficult for our younger boys.  Some of the rocks were loose and the walls were very dirty.   There was little padding on the floor and relatively little to no supervision from the staff.   At the end, we were hoping that the boys would be presented with their patches, instead, we had to ask for the patches and when we did, they tried to charge us $3 a piece.   When we explained that their website made no mention of an extra charge nor did they ever mention it to us when we made the reservations, the guy actually argued with us, right in front of the kids and families.   Very unprofessional.  Why would we book a \"SCOUT PACKAGE\" that is more expensive then the regular price and assume that there would be an EXTRA charge for the patches?   He finally gave us the patches, but he was obviously not happy about it.   We'll be looking for another place to take our Pack to next year.", "date": "12/1/2012"}
{"review_id": "PWGIXmD-sXlIeiknbVZgkg", "user_id": "uqOKKoW2QZ5IdnG-kunx5g", "user_name": "Anne S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love this place! It might not be the fanciest, but there's a great vibe, the staff are friendly and laid-back, the prices are good, and I almost always have an awesome time here. The clients vary from beginners to experts (I'm more towards the beginner side myself), but I never get that \"I'm SO much better than you, watch how awesome I am!\" vibe that I've gotten at other gyms.Other reviewers have mentioned the kids, and I do agree that they can be annoying at times (they host birthday parties and Girl Scout training there). The individual climbers who come with their own kids are usually fine, but the giant groups can be a bit much! I've found that avoiding peak hours (like Saturday afternoons) works best if you can't stand the kids (you can always ask the staff what times are more crowded).My boyfriend and I purchased a 6 month membership and it has been well worth the money so far! Officially, they are supposed to charge members for equipment, but they actually don't, so we get to climb for free whenever we want, plus get guest passes!As for those who have complained about the lack of instruction, well, maybe you should actually pay for an instruction session?", "date": "2/6/2012"}
{"review_id": "C3C0hn88kci5ZmFILdNo3Q", "user_id": "ucUr8zBr79ctqGer2B_FMQ", "user_name": "Tayloe K.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 3, "funny": 0, "cool": 0, "text": "I cannot believe how unsafe the gym is! They don't bother testing people's belay skills! I've seen people clipped in wrong, people leaving several feet of slack in their climber's line and people soloing walls and taking breaks by clipping their harness to a quickdraw! The worst had to be when a school group of about 60 12 year olds came in. Two of the boys clipped in to a rope near us and then the one with the grigri started climbing the wall while his friend just pulled on the rope! He was probably 25 feet up before we noticed. Luckily there was 4 of us so 2 held the rope and 2 spotted him while he climbed back down. The worst part is when I finally found an instructor and told her, she seemed more annoyed with me for making it a big deal than concerned for the boy's safety. I'd say the only reason no one has died is because the walls are only 30 feet. I don't care if you use grigris and auto-locking carabiners, you should be making sure people know what they're doing!", "date": "12/3/2012"}
{"review_id": "3RHBHmolI1ki0_ebI6WyRA", "user_id": "QzTOwL4Ndb273um2Bc40aw", "user_name": "Vareen O.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Legit.  The guy knew I had never been rock climbing before, so he was extra helpful.  He also gave me gear and shoes for free.  Awesome.", "date": "9/7/2011"}
{"review_id": "WLCzMN12kVecJf0pjArI3A", "user_id": "V7EF-8YB7EKmMfqAF_WrrA", "user_name": "Chelsea R.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 1, "cool": 0, "text": "\"Rock climbers do it against the wall.\"    Solid Rock is best if you just want to show up and get climbing. They'll take a few minutes to show you what you need to do for top roping, but you aren't tying any knots or doing anything fancy. Depending on your desire, this could be a good or a bad thing. Either way, it's great fun and a great work out. The staff is pretty hands-off which makes me feel comfortable, as they're not breathing down your neck and/or judging you, and if you specifically ask them for help they're pretty responsive.Their top-roping routes starts have an easy way up (the Girl Scout route), then increase in difficulty to 5.7 and above. The bouldering section (without ropes & harness)  is a lot of fun, with challenging traverse and sit-start sections. There's something for everyone here, including an awesome lead-climbing section which you have to get clearance to try. If you are going to do top-roping, bring a friend to belay you while you climb and vice versa.The only thing I must point out is there are quite a few greasy. loose, or broken holds, and a few disabled or weathered ropes. And for about $18 a visit or $75 a month, you'd hope for slightly more pristine conditions. Definitely go for a day, you just might like doing it against the wall!", "date": "12/9/2008"}
{"review_id": "bYlvjCFpLDcLE0kKYcI1jA", "user_id": "NMXPNliQXLGG-STsW5UOBg", "user_name": "Lindsay W.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "The place is really cool for kids. They have some easy and some challenging courses and walls, but all in all it is fun.", "date": "2/20/2012"}
{"review_id": "giaumBMlmXQ9j4JMx4syCQ", "user_id": "e-eI1lIrl3sT8DuVZGk6HQ", "user_name": "Brian S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I came here with a few buddies who have a membership and had a free pass.  staff was cool, came in, signed the waiver, got some shoes, and was on my way.  Spent most of our time in the bouldering area so cant comment on the other areas.  There was one or two birthday parties going on and a bunch of kids who appeared to be having a good time.  The bouldering area was nice, not too crowded, challenging walls, and cool people.  Overall a great first time experience.", "date": "1/28/2012"}
{"review_id": "5K6UekgVm0bHqwVohg9JHQ", "user_id": "6VuzidZ0JeozC9XdS8W4kQ", "user_name": "Renee S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First timer  - that's my disclaimer.  I quite liked this place based on my rock climbing gym naïveté and innocence. It's a good date spot --men who know what they are doing *hint *hint. I had a lot of fun.  It was laid back. I didn't feel like I needed a degree to be the novice that I am, although, I put safety first and made sure to understand the physics behind belaying etc... as I didn't want to drop anyone off the side of a colorful artificial rock mountain.", "date": "12/8/2008"}
{"review_id": "WFAigQz2qK99jxYbN1kyPg", "user_id": "fLs6kjU7XKSIjzMKYTjO3A", "user_name": "Joseph L.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My home away from home. I don't need to try any other climbing gyms, let alone even go out to the other Solid Rock's. I love this place, I love the staff, I love the climbing. I never really use the upstairs gym part but it has everything you need, a campus board, rings, training board with all the holds and weights. The bouldering room is basically the only part I use since I don't have any friends or climbing partners to come belay me on the top ropes. I also love the traverse boulder in the middle of the main room. Great for endurance and always has some sweet problems on it. I'm glad to be a member here.", "date": "10/3/2011"}
{"review_id": "CyKbkbgZl_d2AMB_sdpkhA", "user_id": "dSS5gT5Ajmv-NKoxna4e4w", "user_name": "Grace C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here once and I did the boulder today. It was fun and a great workout.  Bruce the front desk was very helpful and friendly.I will definitely go back again.", "date": "12/12/2008"}
{"review_id": "SC8gQ-kqREHhWiQAAhrFgw", "user_id": "jCMXiBUjQt03BoecVQhpDw", "user_name": "Kayla M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "We had a great experience at Solid Rock for my daughter's birthday.  Justin was our climbing guide and did a phenomenal job.  He was fun with the kids and made my husband and I laugh.  He was helpful and gave the kids clear directions and then cheered them on as they climbed.  It was great.  We would definitely go back.  My only suggestion for the gym is that they allow you to leave a tip when using a credit card.  We ended up going to get cash and coming back.  Justin was worth every penny.  Thanks for a great experience!", "date": "8/25/2012"}
{"review_id": "T3IhNlHKqpCyve_eu8RlXg", "user_id": "hucz9pcxv-OOYAJOsxOnhA", "user_name": "Michael P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place totally rocks!  Haha!  But seriously, knowledgeable and attentive staff, easy first time use safety equipment, a great variety of climbs, and it's all a great deal!", "date": "8/14/2013"}
{"review_id": "ffcBmxeM4tG5FGpXxZWfbA", "user_id": "gHPpCa8QHku6Joxt1Ty1Hg", "user_name": "Celeste C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Solid rock is a great climbing gym. The routes are interesting and the general culture is welcoming. The staff are friendly and knowledgeable, Tommy, in particular, is helpful, cool, and gives good beta.", "date": "9/24/2013"}
{"review_id": "yqZlt2iny02jqfiBftsRIw", "user_id": "h_-ZhN_mFN8QO-L46bewkA", "user_name": "J M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 2, "useful": 1, "funny": 0, "cool": 0, "text": "Front desk folks very nice, and a good location relative to downtown, but shocked with the lax safety of this place compared to other outfits like Sport Rock in DC.  Flooring is all river rock, no wall to wall padding.  Nary a helmet in sight.  Hard concrete curbing in close proximity to many of the climbs.  How the hell did this place ever qualify for liability insurance?", "date": "8/22/2012"}
{"review_id": "VLT62wM15s_wcLQwNXacmg", "user_id": "6LiON7hSZ8ZnjaC4NJpnpQ", "user_name": "Tyler H.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Many of the complaints I've seen on this page really are frivolous or non existent. I find it funny that the lowest ratings here are from people out of the area. Gyms in San Fransisco or LA are better but also cost  a lot more for a monthly membership and a day pass. Ropes and holdings are in good conditionRoutes are good for beginners or for Advanced climbersThere are routes for clipping in as you go if you're advanced or easy lock in top ropesSeveral Bouldering areas, Arches and a CaveRoutes are consistently changingThe staff is friendly and will help you if you're not experiencedThere are plenty of times when the gym's not over crowdedAlso there are are groups that meet up if you need a belay partnerThe price is also less than other gyms for a day pass and membershipThere are 3 different locations in San Diego county so if you get tired of one location or want to try some different walls you have 2 other locations to  choose from for the same price.", "date": "8/20/2009"}
{"review_id": "LAdSlby_XULQsV_-55dhvw", "user_id": "IFliL5NoDyVc4jtohP-LLw", "user_name": "Brian J.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym! The first time my friend and I went the staff was super friendly and helpful. We ended up signing up for a membership that day. I havent been to any other gyms in the SD area but I dont think I need to, SRG has it all!", "date": "5/14/2013"}
{"review_id": "SA1ybYxmmvkqtDKoWmivZQ", "user_id": "UA4Ur6Npwi9wAnQ-G3Lu1g", "user_name": "Tyler H.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have nothing but good things to say about this place. Took a group of nine students here this past weekend and they all had a great time. Our instructor, Ben, did an absolutely amazing job. I can't say enough great things about him and his patience with our group. He not only helped us but he also had our names memorized by the end of the first hour. That is great customer service. We will be coming back for another event for sure!", "date": "5/13/2013"}
{"review_id": "zlrLABh5YFi7VCJ-AJf1XQ", "user_id": "dUAchoRUN8A1O013ip37Ag", "user_name": "Marek M.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "this place is pretty cool to start climbing or to do some bouldering. Although the majority of the bouldering area is only available if you are older than 18. All of the top rope climbs are fun but the height of the walls aren't that impressive. They have a cave where people can lead climb with some very challenging routes. They require you to use their ropes. Sometime they host parties so the place can get a crowded easily. Staff seems nice and helpful every time i have been there. Good place to start if you are new to climbing. The routes are challenging and still offer a good workout.", "date": "4/28/2013"}
{"review_id": "s-P_vAi2Yq6SxrQV-HMlLA", "user_id": "5YsZZ5ziqOehWb2PxTAB2A", "user_name": "Michael C.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It may not have the biggest walls in San Diego but it has a great community and great setters. I've met a ton of awesome people here and have advanced my climbing many grades since joining. It can get a little crowded at times when they host birthday parties but there is an excellent 18 and over bouldering room that stays pretty open. They change their routes pretty frequently, about once every two months or so as far as I can tell.", "date": "2/5/2013"}
{"review_id": "wKlh2nkqlH7KTDb34oMoAw", "user_id": "2-Mor-bkJkPxHrLsaGqgJw", "user_name": "Ashley P.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My boyfriend and I went with some friends and had a great time! We brought our own gear but they have harnesses and shoes for rent too- were both a little rusty and they were happy to give us a little refresher. Staff was helpful and nice and the climbers were really friendly too. A great way to spend a rainy night, or any night for that matter. Check it out!", "date": "3/4/2011"}
{"review_id": "yWlSUoHweb4zyUPFGgIOyg", "user_id": "LmkJZ5OF__lSHfGsrhP4DQ", "user_name": "monkey l.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 1, "useful": 3, "funny": 1, "cool": 0, "text": "terrible. okay, so admittedly i have been spoiled by the sf bay area's gyms, but this was the saddest rock climbing gym i've ever been to. i mean there was just so much wrong about this gym. my roommate's bf, a serious rock climber and route setter, warned me not to go. i went anyhow, and wish i had paid attention to his advice.here is what was just wrongness all over:1. they don't belay check. okay so admittedly, they use caribiners on the figure-8 end and a gri-gri, but seriously, people can get really messed up and hurt on poor belaying. my belay check consisted of the girl asking \"do you know how to belay? cause if you do, that's your belay check.\" uhhh. being flippant = someone getting hurt.2. the routes. ridiculous. some started at my head. and when you got up to the 1st or 2nd holds, they didn't make sense. unless you could fly, there was no way to get to the next holds. and they were poorly marked. 5.10. a 5.10 what? a, b, c or d? stickers were peeled off so there was no way of telling the difficulty of some routes. others weren't even marked.3. the holds. grimy, dirty, and totally not powerwashed. gross.4. the belay ropes. some of them were so short you had to step up onto the holds in order to rope in and have your belayer rope in. other ropes has this weird thing where excess rope was tied into a bundle, and taped over with masking tape into this potato-shaped thingy. sort of interferes with the gri-gri, if you ask me. and they were crazy frayed, which made taking up the slack really hard. like abnormally hard.i was so disappointed. so not coming back. vertical hold is much better.", "date": "8/31/2008"}
{"review_id": "PxIEH7GFzpZE4U-Z0fQp7w", "user_id": "RqmI3dyeLAem6P0b-_qxig", "user_name": "Leigh O.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I learned to climb here at Solid Rock in Old Town. So I am a bit biased, but some of these complaints are just completely wrong. The staff are rude and uncaring? TOTALLY not true, they will come out there and help you with ANYTHING, belaying, fixing a broken/loose hold, or missing tape, they will even come out and help with bouldering problems sometimes. And so what if they play around behind the counter? It isn't as if they are leaving people without help. I would much prefer fun employees with personality over staunch and stuffy ones.Ok yes, at first the gravel does not seem like a good idea, but trying falling on it! I have fallen flat on my back many a time and it is not what you would think. Also, I know climbers there, including myself, who would rather fall on the gravel than a pad. It displaces the impact very nicely. At Mesa Rim, letting go feet first onto those flat mats scares the crap out of me, I feel like I could break my ankle. I would rather fall on rocks any day.Now when people say the routes are poorly set, yes, there is some validity to that. Many of them are harder than the routes in most gyms, despite the fact that they have low ratings. But, this makes it much more realistic to outdoor climbing! So when that guy from the bay area complains that on a 5.7 he only has a foothold to step up on for the next move, he is actually clmbing much more realistically than he would if he simply had to reach up to a nice jug! All over the gym, there are white routes that are SUPER easy, so quit your griping!I am not much of a top roper, I am mainly a boulderer, but when I read these complaints about the belay devices, it blows my mind! TOO EASY TO USE?!?! What the hell is wrong with having a belay device that a beginner could use right off the bat? It works for them, and it works for all those experienced top ropers. If you want the real experience, just go to the lead climb cave! There you get all of the fun of the real thing in a safe place.The one complaint I would ever have, is the kids. If you can, try try try your best to avoid the middle of the day on weekends or during the summer. But they have to make money somehow right? Just go in the evening/night! The other climbers are so friendly, I guarantee that if you go alone, you'll leave with at least 2 new climbing buddies. All-in-all, yea it's a bit dirty. Yea some of the routes are harder than they are rated. And yea there are kids that run rampant during the day. But for me, there is no other choice for a sure fire good climb. I know that when I go, I can spend hours and hours just trying a few problems until I get them down perfectly. Plus, the harder climbs, make me a better climber when I go other places. The charm of this place, trumps everything else I've ever been to.", "date": "8/5/2010"}
{"review_id": "q0LHtQrgbh-pd_9y2BckUw", "user_id": "fLOG_UHouWEPWZ_qmDo8Ow", "user_name": "B B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "I've been to gyms where they did not want you to use chalk because it was too messy, where to climb lead you had to study two pages of does and don't, where you were expected to know the precise tie in method desired, and lectured like a child if you didn't guess correctly.   I've climbed at Solid Rock gym on a regular basis for many years now, and I can tell you it is not like that.  If you are a climber and going there just once, your experience will vary depending on your attitude, as these other reviews will attest. This review will hopefully give you a heads up so that your visit may be more enjoyable.     The first thing you do when you enter this or any climbing gym is SIGN YOUR LIFE AWAY. This should ring a bell.  It's DANGEROUS PEOPLE,but If you expect someone to hold your hand and baby you, forget it and go ride a bike.    Beginners:  This gym uses fixed carabineers and grigris on the top ropes.  This means that less practice is required to belay safely and less time is spent tying in,so you get to climb more.  Pay attention when the staff explains how to use the system.  If you don't get it, ask again. They will help you. There are lots of climbs for beginners.     intermediate climbers: The top rope climbs rate from 5-8 to 5-12.  The ratings can vary widely so expect to get spanked on some routes that are rated at  what you think your level is.  They change the routes faster than I can get used to them, and I think rating stuff is dumb anyway.  I do set routes there from time to time and my feeling is that, if you are always looking at ratings as an indicator, then it is much better for me to sand bag the numbers so that you don't go outside and get yourself killed on something you thought you should be able to climb.  If you get my 5-10b then you are pretty much in there for 5-10b's.     Experts:  5-13 and up.  Well, you are mostly out of luck.  You would probably like the lead cave and could get a long workout in but there simply aren't enough of you to justify setting routes in that range.   Bouldering:  They have a great new top out boulder, and kids are not allowed. It really is way cool,but it scares me.   The only complaint I've heard is that the problems are not hard enough, but I hear a lot of grunting and yelling when I pass by.  I really don't want to know what is going on in there.  Oh! They have a slack line and a peg board.  How about that?      Lead climbing:  I think this is the best lead \"cave\" I've ever climbed in.  It is really overhung and intimidates most climbers, but it is a total kick.  The routes run from 5-9 to 5-13+ (only one)  with most in the 10+ to 11+ range. You have to get certified to climb lead.  You can tie in with a dbl. figure eight or a dbl. boline, with backup.  You have to understand back clipping and z clipping;that is know not to do it.  This gym provides rope and the atc. Once you have tested on a climb and passed,  they leave you alone, something I like.  To enjoy the cave you are going to have to be a very solid 5-10 climber.  You have to give the desk something of value to check out the ropes.  I keep a kid in the back of my truck for just such occasions, but keys or I.D. will work they tell me.     If you are just beginning to lead, there is another flat section in the gym where you can check out a rope and  practice lead with a top rope belay.    If you hate kids, or crowds then check ahead. They do have parties up over the boulder.  Sometimes they will give you treats if you perform well in the lead cave, a plus.    They do not have showers.  Do you really want to step into a public shower?  You have no idea what just went on in that space you are stepping into.  They  have lockers in the new boulder area, really nice, carpet, even a table with magazines and stuff.  Alas they are not coed.  No juice bar either.     I admit that gravel in the top rope areas is not really necessary, and mats would be cleaner, but that isn't the way the gym was made years ago.  However, I can personally tell you that if one of your bozo friends isn't paying attention and drops you twenty feet in the lead cave, you are going to kiss that gravel for breaking your fall, twice.    I like the staff, friendly,enthusiastic, but not hovering.  I like the routes, always a challenge whatever the rating.  I especially like the people I meet there, always nice, willing to give advice or a belay, and they let this old guy hang with them, sort of.  I take all the other little picky complaints, too dusty, hate gravel, lose holds,fat ropes,kids, no Beethoven's ninth on the c.d. with a grain of salt, because you won't find a nicer bunch of gym rats anywhere.", "date": "9/25/2010"}
{"review_id": "dTOr-3Vz-CbmkBw-JNSAtQ", "user_id": "kUg7Gn6w3HlV5Iwr7sVqAA", "user_name": "June S.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "It's reasonably priced, but a bit smaller than some of the other climbing gyms in San Diego. Also, if you're there on the weekend, there's a 50/50 chance of overlapping with a kid's birthday party group, which can be annoying.", "date": "4/17/2011"}
{"review_id": "M2bQE3PIHp9E1Dtud0ZYeA", "user_id": "F50lHvUw84anKJFkUcPL2A", "user_name": "Paul G.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "great gym lot of fun great for family's/ beginners to pro's the lead cave is awesome and there are great routes and the staff are super friendly and helpful i recommend the gym to any body how is thinking of going", "date": "11/29/2012"}
{"review_id": "iuf5RhRYTU6qNFzMfDw6gQ", "user_id": "_DUuA1VIbg6tL_fCeTVe6Q", "user_name": "Dustin B.", "business_id": "kABG4yANouUv_WZYQW4weg", "stars": 3, "useful": 1, "funny": 0, "cool": 1, "text": "Solid Rock Gym is a great place to learn how to climb and improve your skills.  Are there better places?  Yes, but not this close to my house.  The rates are reasonable and the routes are fun and they are continually changing them.  Just go and have fun, but avoid the weekends unless you go late because of all the kids parties.", "date": "3/22/2009"}
