{"review_id": "V9AiEotMtJcemXZNvW-Wsg", "user_id": "LHIsKMqoN6hlmWOU7SeVRw", "user_name": "Morgan F.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am a beginner and rock climbing gyms can be pretty intimidating. But, the staff is super friendly and very helpful. My husband and I have been coming for a couple months and didnt know how to tie our own knots. But Alex saw us bouldering and offered to teach us. He was SO nice and helpful. He taught us both and then quizzed us. It was a quick and easy process. Once we learned that, so much more opened up for us. For a beginner there arent many options for routes, but I manage to make it work for myself. My husband is at an intermediate level and he has plenty to do there!", "date": "1/15/2019"}
{"review_id": "CMKpulCuxVe674iEfea61A", "user_id": "hpHGjRsg2WhMDpupi0q_xg", "user_name": "Judy B.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Bro this place was all that and a bag of chalk! Super fun set of rock climbing patterns set up for different levels of difficulty! I got to experience this place with my best friend today and i feel like im hooked for life! I want to make rock climbing a part of my weekly work our regimen! My butt got kicked in ways i did not think it would! I love how they have different set ups for different levels of difficulty. This also includes self belay routes, partner belay routes, or free boulder routes which does not have a rope attached to your harness. So you essentially rely on your ability to push past your limits and fears to keep climbing and reaching to top unlesd you try to break your fall on these super soft thick mats, which also wotked out fine when my friend had to use it today. Scared the hell out of both of us but she said it was a super soft landing even from 15 ot 20 ft high lol. Anyways, i highly recommend this place! Great family deal if you have that option for 20$  month, otherwise ots 60$ for each individual. Theres even a lil gym to help you build up strength if you need to! This includes rock-like pull up stations for your fingers to help your grip strength for the rock climbing improve! Amazing!", "date": "7/31/2018"}
{"review_id": "nBOsxs1dCbvJFYOiXTxgYA", "user_id": "2rQKIw2STpWAA3CwoOVqjw", "user_name": "Mae Joy G.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Been here twice so far.  The staff is super friendly, which I appreciate for people like me and my group who were experiencing rock climbing for the first time EVER.  Vincent explained everything so well and was super super patient and understanding with my little one, who could be a little difficult considering she's on the autism spectrum.  There were a good amount of climbs for us beginners, free climbing walls, and everything in between.  Nobody there makes you feel uncomfortable.  The other climbers there don't make you feel awkward, either.  Everyone is just doing and staying focused on their own thing.I also saw a flyer for birthday parties.  I will definitely be coming back here.  Highly recommend.", "date": "5/21/2018"}
{"review_id": "SAcHvKyDNgviEc6CDhmH2A", "user_id": "z52mDYtyGJHTLRzn-wdofw", "user_name": "Tanner H.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "Best rock climbing place around! Attended a meet up group, and just ended breaking off and going on our own. The place is well maintained, and the staff are super cool! They provided all the gear, and everything. We are keeping this place as our go to!", "date": "4/4/2018"}
{"review_id": "xxcXzBDQDXDTW01Bde4Hhw", "user_id": "TS2WGxTZgaH0BKefS08_mQ", "user_name": "Matt M.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "great climbing, but gravel on the floor. This is a safety issue. Saw one girl eat it after falling before the first clip. Management,When are you going to get rid of the gravel and install mat flooring? Bouldering pads after not enough!", "date": "11/10/2018"}
{"review_id": "OPfr1M_U9DttfTZw3t2Dlg", "user_id": "RW2Q1zNDkWh32C1t8GohhA", "user_name": "C C.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here spontaneously one night to rock climb and I was not disappointed!Happened to coincidentally come on a \"College Night\" special and it was a great deal which included the rock climbing cost, gear rental, and belay lessons.I've bouldered and rock climbed before but never learned how to belay.Shoutout to Ari/Ary for detailed yet simple instructions/lessons. She was super patient, didn't mind repeating instructions/steps, and ensured that everyone was performing the steps properly before climbing.The facility is nice and the climbs are actually challenging! Would recommend for anyone in the San Marcos/ north county area!", "date": "9/28/2018"}
{"review_id": "gGR6GX7HVWbvplS5l7mJrg", "user_id": "_GUBiQrIs5onVr1cV-hIIA", "user_name": "Patrice M.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "I was a disappointed to see that 2/3 of this gym was now for expert climbers only - 23 ropes for experts and only 11 for non-experts (plus 2 independent climb). This might be great for the experts, but for my family it got boring after a few climbs. Also, there were too many non-experts and not enough climbing walls in our little 1/3 of the gym, so it felt very crowded. Meanwhile, the other side of the gym was practically empty, making us all feel a little angry. When it was owned by Solid Rock I would often take my kids there to climb, and ALL of the areas were available to ALL climbers, so my kids were watching the \"experts\" climb the walls they used to be allowed to climb, thinking that it was not fair. I will not be bringing my family to that gym again. I think it is bad for business to only allow most customers access to a small area of the gym. It makes us feel insignificant - not how you want to feel when you've  payed money thinking you were going to get a fun workout.", "date": "4/7/2019"}
{"review_id": "vvxoSyw4UcCuWfCy13cjkQ", "user_id": "BsM1FFv4_qSnxmkBnzfniw", "user_name": "Stephanie Z.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Fun! Not super easy but it seems to be for kids who are fearless. I on the other hand... am not fearless! I'm so glad this place had harnesses. They showed us how to belay and as soon as we were on our own, I got scared when my daughter was about to come down because I wasn't so confident on my own and before I knew it, 2 or 3 staff members were there in a quick second to help. I only shorted a star because I wish more of the rocks had better grips. I couldn't really do those. It's for sure a good workout and our arms our sore. Your hands will hurt when you're done. Highly recommended this place. Especially for family or relationship bonding! I had a great time with my daughter. P.s. Cut your nails before you go and bring someone. Can't do it alone.", "date": "1/28/2017"}
{"review_id": "_NzK7SWnhCmvq72kpbYq4g", "user_id": "aps_OvV1w14UKttnwVjSoA", "user_name": "Ellie R.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place! I come to catch up w friends, it's a great activity to do while hanging out. (Activity= rock climbing) It also works as a great date. Another plus: it exercises a part of your arms that normally doesn't get exercised through normal dumb bells. Yet another plus: it's pretty cheap. If you're a woman, go Wednesday's! They have a special that day, but again I haven't been in a while so it might be outdated. Basically, GO/ COME!", "date": "10/12/2017"}
{"review_id": "rpC7IAnMPlxNqbBzyBX1Jw", "user_id": "HJu8AUkFy0Ay1jIXAV3kmA", "user_name": "Jeff R.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 2, "useful": 0, "funny": 0, "cool": 0, "text": "Routes do not get changed often for top rope, and autobelay rarely get changed. The holds become overly dirty fast, not sure if it's the quality of holds. Bouldering routes rarely drop below V2, so for those looking to improve its a steep learning curve. Staff is very friendly, but you can tell out of the 3 vertical hold gyms, this one gets the least attention. It's a shame considering they just raised the prices.", "date": "12/3/2018"}
{"review_id": "xTqIv9isf_JbiKzvRH52mQ", "user_id": "u9tIl9rJ92TPmBOBGDuAkw", "user_name": "Camp B.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We love hosting fun climbing events here! Great staff that are helpful and take their time ensuring safety. Fun place for kids to climb, boulder and even play ping-pong! They also offer youth climbing teams, outdoor climbing instruction and more. We highly recommend Vertical Hold Climbing Gym!", "date": "3/1/2018"}
{"review_id": "aCnVkU2gFnV6rj3JYWsmGA", "user_id": "gfvYAb5SAj4oe-6A9PctGw", "user_name": "Michelle M.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "We're from out of town and found this place on yelp. They had awesome discounts for WCW, half off for women and they took care of us. The staff checked our belaying tech and made sure we knew the rules to have a fun safe experience. I loved the globe climb in the back of the gym. It was a fun 5.10 vertical climb up to the globe then unhook as you pass. I swung out near the slack line which was scary and funny. Overall this is a cool gym, they have a fun bouldering section up on the second floor, also you can do bouldering on any of the top rope routs as long as you stay below the first crease. Pretty neat place... but no AC. I'm not used to thit heat so I was drenched! Nonetheless it was a cool fun place", "date": "7/27/2018"}
{"review_id": "Eko5rinoRoNIh0fZkXd8Aw", "user_id": "rF5jdHK5T9LD_YjxlQHCtQ", "user_name": "Skyler W.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I used to climb here years ago when it was still Solid Rock, decided to get a membership the first week of May and haven't had any regrets. The staff is super friendly and helpful. Vincent always gives me some beta when I'm working on a route that I'm having a hard time with.", "date": "6/26/2018"}
{"review_id": "QbS3YcrpsVYBWnab6XJn2w", "user_id": "5cjJHA59oYUdsn7gcGiwyg", "user_name": "Annelisa Z.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is great! The staff are super friendly and helpful. We asked plenty of questions (it was our first time rock climbing) and they were happy to give us answers. It's a little smaller than I expected but still plenty of room with a variety of walls to cling. They have the holds color coordinated for each difficulty level so it made things a lot easier!", "date": "7/7/2018"}
{"review_id": "FY9fw8EvQ8E0SNJdFa5LJg", "user_id": "s5qTC3zDybfxIiZVxsflBg", "user_name": "Jeri G.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Been there for my son's bday party when younger.  Typically stick to Vital climbing gym in Carlsbad and Oceanside but wanted to switch it up.  Not sure about bouldering quality but the guy on staff was helpful and went out of his way to help my son and answer questions.  Good time!", "date": "12/28/2017"}
{"review_id": "QGzhpkjg33tWZQHzPIClKA", "user_id": "UABBYCw9tc5yEamTfEc26w", "user_name": "Mike S.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic place to climb.   Fantastic staff.   Highly recommend!!!!   Always a fun experience.", "date": "4/21/2018"}
{"review_id": "CVDRiVMb-VY8bVcMnsr7tw", "user_id": "hSuwe1KXlSmerAhfvQwz9A", "user_name": "Trevor L.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love coming to Vertical Hold to climb indoors. The staff is always accommodating and greet you with a smile. You can tell the staff love their jobs and that makes for a great environment to be around. There are auto-belays for those without a partner, a bouldering block in front and a nice bouldering cave section in the back. Simply put, this is a great climbing gym!", "date": "11/29/2017"}
{"review_id": "P4HY-wx73yL2qXuGIjyIAw", "user_id": "HyAAsCY79JtNBjjU7pn_dQ", "user_name": "Meri D.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "GREAT workout!!!I've missed Rock climbing and bouldering as I used to do this at SDSU's Aztec Recreation Center back in the day so it was great coming back and trying it here. This gym, located in San Marcos, is definitely more challenging than the ARC, but I like it! There are tons of walls and ropes which allow for a variety of climbing. I recommend also getting the chalk bag because I did not buy it or bring my own thus it became harder to climb towards the end of my session here. The only thing I don't like is how they don't have self-belaying because I would love to come alone  as I used to self-belay at The ARC.. so keep in mind you must have partner to belay you.", "date": "6/13/2015"}
{"review_id": "KVmXuw-oJpgP3fsOpIz1VQ", "user_id": "5I57oLag9pJWDlFQdDxCOQ", "user_name": "Marissa C.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 3, "useful": 4, "funny": 0, "cool": 0, "text": "I personally wouldn't come here again. We got there and the guy with the brown hair was super friendly and welcoming, but it doesn't seem like some of the other staff really likes being there to work. They seem to like showing off their moves ahaha. The guy with the man bun and the colorful bracelets just randomly came up to us and idk I guess he was helpful, but he belittled my friends at the same time.Same guy was teaching me how to belay and he was rolling his eyes at me because I was trying to do it exactly the way he was teaching me, but the way he taught it was pretty dumb. No one was doing it that way so I was super confused.I don't know, this gym must be for the pros or something because whewww, are they big headed. I really enjoyed myself and the other people there, but the staff, not so much! If you are a beginner, i wouldn't recommend coming here :) also some of the holds are loose at the top.There was a kids party going on when we were there, its probably a good place for that!!", "date": "2/26/2017"}
{"review_id": "E5WZPvR6w1bDHbajfKi7mw", "user_id": "2dubkVlMgh3-QZbVXqEplQ", "user_name": "Greg B.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 4, "funny": 2, "cool": 2, "text": "Cleaning up my review since VH has some new owners and has undergone some changes.This is the only place I can find in North County that has sport climbing, everything else is bouldering. There is lead as well as toprope, but the ceilings are kinda low, like 30' maybe. There is a decent amount of surface area to use compared to the crowds, same for the bouldering areas. Staff and regulars report the grades are honest and moving towards an outdoor-equivalency rating.", "date": "6/5/2014"}
{"review_id": "GMcGpxh0T3kH7JiJK8y82Q", "user_id": "_uCPEh56iVbeYGAK0S78sg", "user_name": "Kathy D.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 1, "funny": 2, "cool": 2, "text": "This is my other favorite rock climbing gym in North County. The walls look intimidating but after a few tries, it is fun!  You will need to have another person with you since you will be strapped and will have to take turns climbing.  This place gives me a great full body workout!  I love it!", "date": "8/9/2016"}
{"review_id": "VNzqDYYALaHy6OB3IhrnlQ", "user_id": "t4NyQil-B_GF2TUtFbjK8g", "user_name": "Kimberly E.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my team here for a fun end to a week long retreat. We did the beginner lesson and climbed for a few hours after that. They had a great little space with a table for us to eat lunch and chat about the week before taking to the rocks! Friendly, knowledgeable, and safe staff! Would definitely go back!", "date": "9/9/2017"}
{"review_id": "Rp9ejnTwSe9VJt6FLAV1TQ", "user_id": "VxQchJc6S97Qvw-GYnhhUA", "user_name": "Wendy D.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my three granddaughters here and they had a really good time. The staff was very kind and helpful. I am not an expert on vertical rock climbing, by any means, but I can say that my granddaughters (10-year-old twins and a 12-year-old) had a really really good time.", "date": "9/8/2017"}
{"review_id": "c4BEJ3gpoGWcQ5iCh32U4Q", "user_id": "mLvXvB14Ia1PycVQQwcqwQ", "user_name": "Corin T.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My son and I were looking for something to do for a couple hours. So happy we came across this place. We were welcomed by Jenna who was super friendly and made our experience an awesome and fun one. We will definitely be returning!!!!", "date": "8/18/2017"}
{"review_id": "l8wnqqTqqXMB-SSAAEyJ3A", "user_id": "Mikt-KJSQ-3Y1h0RJgoatw", "user_name": "Christina A.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Perfect place for families and those to just love having a good time. I've taken my kids (ages 9 & 6) there twice already and they love it!! I feel comfortable and confident that my family is going to have fun & get in a good workout. Thanks Vertical Hold for taking over this gym.", "date": "1/24/2017"}
{"review_id": "KLP9uuJ6kUS2mDJwAALH9g", "user_id": "eBcFalVOmjQiBp6LAUEdlg", "user_name": "Kelly S.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "I like this place! It's perfect for me, especially because I'm just starting out with rock climbing...  The hours are nice and the price isn't too shabby! I've only been a few times but never seemed to be overly crowded.If you're more advanced or looking for really high walls, this probably isn't the place you want to be a member at... This all just from what I've heard. But if you are starting out or just like the indoor feel, this place is great! I like coming and will continue to! Thanks guys!!!", "date": "10/2/2015"}
{"review_id": "WWLGE9Yr4MuhyUikDvn4vw", "user_id": "_PPVP0AQAnqD-trizPI_YQ", "user_name": "Polly L.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome gym! Really friendly staff. I'll definitely come back here next week for a gym membership.", "date": "5/1/2017"}
{"review_id": "_-yjalE0qM3t_ALT_Pe-Kg", "user_id": "ktp_AfniQqxq37S5K2wkGw", "user_name": "Andrew W.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great place and friendly people all over. My brother and I went with his 15 year old daughter and 13 year old son, it was a first for us all. We tended the lines and the kids had a blast. The counter lady gave great instructions. Other people in the vicinity gave the kids great tips.", "date": "4/18/2017"}
{"review_id": "OOXkXUNUdD6lXOGp5EzdfA", "user_id": "U8l0aENBoz2Rz4bsMt2qSQ", "user_name": "Angel R.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've been rock climbing a couple of time in the past, (not pro by any means!) but it was always at the the Poway location.As far as first impressions are concerned, this location is much smaller in comparison to the Poway location, however unlike the Poway Solid Rock they have an area sectioned off with gym equipment and a GIANT Bouldering rock. The staff is great and very helpful, and apparently tonight was Ladies Night! $10 to climb to your heart's desire plus shoes, harness and chalk! Pretty great deal if you ask me! :)Even though there's not as many walls as the Poway location, they still had a lot to choose from, ranging from beginner to expert. If you really wanted to up the ante, there was a little chart with colored tape, depicting the difficulty of the grips. White being the easiest, Yellow/Red medium, Blue/Green being the hardest. All of the grips on the walls have these bright electric tapes, and you had to scale the wall using those colors only. It was KILLER on my arms, but it was so much fun!There are two areas for Bouldering; there's one near the walls, and one in the 18 years + section. In this section there's some gym equipment, mostly for upper body, back and abs. There's also a tight rope to practice  your balance on. Even though my arms were DEAD from all the climbing, I managed to climb up and conquer the boulder! Once you reach the top, there's some stairs to make your exit safely.This place is tons of fun, and a great workout! Be sure to bring a friend, because it's a two man job; while you're climbing you need someone to belay and pick up the slack in the rope! I like this location just as much as the Poway one, it's a toss up on which gym I would go to. :)", "date": "3/8/2014"}
{"review_id": "kkoaSpZZfZy4EHtneid6Sw", "user_id": "JwO1m2dO261NZWSou9kVgg", "user_name": "Christina R.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 3, "useful": 2, "funny": 0, "cool": 0, "text": "I've been coming here regularly for a couple of years now. I've noticed a definite decline in Solid Rock's quality. There's been some turnover in the staff, who aren't as friendly. The quality of the boulder sets has degraded a lot - inconsistent ratings, inexperienced setters, and at least one prolific setter who frankly should not be setting boulder problems. I don't wall climb, so I can't speak to the quality of the wall problems, but the degrading quality of the bouldering aspects of Solid Rock trouble me.", "date": "8/11/2016"}
{"review_id": "I1JbnDGMjZHd6SUMaWGBtw", "user_id": "10esda_k_xqb5u6QA9Jqdw", "user_name": "Alanna P.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I had a great time here for an unconventional Girls Night Out. For just $10 we were able to climb all evening - harnesses were included! For this girl who is terrified of heights, it was exciting to find that I could make it almost all the way to the top. The staff was helpful and patient when explaining how to climb to four adult beginners. I will definitely go back!", "date": "11/30/2016"}
{"review_id": "cL_ToQWI9pPDJPAWyFnaNQ", "user_id": "CnT1mtEAoVAMUUku_J_huA", "user_name": "Stacie B.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "$20 for unlimited climbing that day and a harness ($15 if you have your own harness).  Lots of parking.  The gym is in a warehouse with natural lighting and fans.  It was a hot day, but it didn't feel hot in the gym.  Numerous walls to climb from beginner to advanced.  You will need someone to belay you.  Be prepared to get a wedgie from belaying and from climbing.  I would suggest wearing workout pants or longer shorts.  I wouldn't recommend wearing jeans.  They have snacks and drinks for sale.  There are a couple chairs to sit on if you need a break.  They have restrooms, cubbies to hold your things, and drinking fountains.  The employees are very chill and helpful if you need assistance.  Cool way to spend a couple hours and get a workout.  They also have a birthday party room and birthday party packages.  We will definitely be back!", "date": "7/27/2015"}
{"review_id": "Zp1pBg13K6UPuX36yUlT5A", "user_id": "9wRmwN4rb5dy1BOz_2YosA", "user_name": "Josh C.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had an awesome time. The staff was awesome and the price was cheep. The place is well maintained and everything felt safe. I will go back as many times as I can", "date": "10/22/2016"}
{"review_id": "OW3g28alE9wYU302DpzCUQ", "user_id": "TIa_wziqxlepbS6jBNZlgw", "user_name": "Nicholas F.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Fantastic rock climbing gym. I'v been to this one three times and I have also been to a few other in San Diego county. The staff is extremely helpful as they take time to make sure you know how to use the equipment, they are knowledgeable with any questions pertaining to the sport.  They even gave me advice on which walls and which levels of difficulties to work on.  It made the experience even more fun as I only go once every few months for a fun workout. My favorite part is that they use the old fashioned relay harness style so it is a fun activity to do with a close friend. Plus it means that the rope doesn't help you up the wall which is the way it should be.  Can't wait to go back for a fourth time! Highly Recommend!!!!", "date": "11/10/2016"}
{"review_id": "0U6on6hXG4JFy6cxyHQ3uQ", "user_id": "zjNO8dWdedq9IFPt9brC8g", "user_name": "Gabriella V.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have been to this climbing gym multiple times and I have had a great experience every time! I really love this climbing gym, the people who work there are so nice and informative.  The climbing gym is rather large, it gives you a good workout as well! I know, I was sore the day after a good climb! :)", "date": "6/6/2015"}
{"review_id": "lmxifq8_6LWdkxSZNOg-zw", "user_id": "8aq8DaxZJzxqbz8Ob3Hc2w", "user_name": "Drea M.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I had a blast! I took three 12 year olds and myself today. The staff were very friendly, helpful and informative. The climbing walls ranged from beginner to advanced and we tried them all. All of us had a great time and plan to return.", "date": "1/31/2016"}
{"review_id": "sANU_MNnlu8cFTgD-DGW7g", "user_id": "_MkA3W0jU1zzR3DFa2qFoA", "user_name": "Anna R.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 0, "funny": 0, "cool": 2, "text": "Friendly staff. Very clean. Went here for my first time ever rock climbing and it was awesome! If you don't know how, the staff can teach you. Most of them, if not all, rock climb there. They are very helpful so don't be afraid to try something new!They also do parties for kids there. It's a great place for the kids to exercise and hang out. The staff are also great with the kids!", "date": "11/2/2014"}
{"review_id": "6XisYn3R7yuS5KyQKa6hkQ", "user_id": "gsPu5Co_a6znjaxGGXrL_Q", "user_name": "Amy H.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "Stopped into this gym the other day for a fun evening of rock climbing with friends. It'd been years since I last went, but it was just as fun as I remembered! This gym offers a lot of climbing options with varying levels of difficulty. While I stuck with the pretty easy routes, my climbing-fanatic friend had plenty of challenging routes to push his monkey limits. The gym was not overly filled, but enough others to make it feel like a happening place to be. My hubby and I will be adding this place back into the rotation for fun date-night activities!! Belaying eachother is definitely good for trust building!! ;-)", "date": "11/28/2015"}
{"review_id": "n-oKgVQ97OkQAdu4CNY41A", "user_id": "agiorMvhQ-xlBDAGNdUM3g", "user_name": "Trish R.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Why can't every gym be this fun?I have been going here for only two weeks as a member, and I can't explain how amazing the experience has been.  The staff has been absolutely helpful; whether it's just being a friendly face while I'm grabbing gear, or whether they see me staring at a (personally) challenging boulder, they're always there to help or give advice.Environment wise, the place is always clean, open, and airy.  I've climbed on busy weekends where there's birthday parties and lots of kids running around, but that doesn't interrupt any top line or bouldering sessions since there's always an available route/wall... you can also always escape to the back boulder if you're over 18 years old or are a SRG member.  There's some weights in the back, a tightrope line, a bench, dumb bells, and a dip \"machine.\"  Oh, I should mention: now that it's fall, there a bit of a cold draft - it is a warehouse environment, after all - so bring a sweater or dress in layers.Most importantly, it really doesn't feel like I'm going to the gym.  It's just a fun time to hang out, solve routes, and enjoy the piped music (mostly EDM/electronica).  Indoor rock climbing has improved my upper body strength, mental stimulation, and has been a great way to work out, whether on my own and bouldering, or whether beta-ing with my hubcap while top roping.  There's just so much to do at SRG in San Marcos.I'm looking forward to updating this review in the future as I learn more about indoor rock climbing!", "date": "11/11/2014"}
{"review_id": "SqyjHHWVcSSdB4SuP37s1g", "user_id": "DNHCKrCopOeEFmOFeVx_UQ", "user_name": "Stella C.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I like this place. A friend and I went here and paid $20 for the whole day with harness and shoes included. The gentlemen who gave us advice and showed us how to rock climb was very nice and even check on us throughout our stay. I will be back and definitely being friend too!", "date": "1/4/2016"}
{"review_id": "oWmKoCj19TgKGLuFeJtEWA", "user_id": "8gN9M3QfK1f1YBxXZL5c3Q", "user_name": "Ken T.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is fun!  The employee at the desk, Patrick, is a true gentlemen.  He explained the somewhat complicated process known as \"belaying\" in a concise manner.  The routes were exciting and varied from easy to hard.  We all had an awesome time and whew, what a work out!Great snack selection too.", "date": "6/1/2016"}
{"review_id": "YmkPBL_N3eGvVqUFtqO1Gg", "user_id": "KOHQT9prRSG8RryfyVUL5A", "user_name": "Tony M.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "This is a great place to go for a good workout. There is a challenge for any level, the people are great and it's always a lot of fun. I've done some real rock climbing in the past but enjoy this more. You can cut back and have fun when you don't have to worry about dying. You can also get a better workout when you can keep going until you fail.", "date": "9/15/2013"}
{"review_id": "ub2lH9raL7kAqeE8IExMEg", "user_id": "m6CDpHFf8kh7a0hpowpr0g", "user_name": "Andre J.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 5, "funny": 0, "cool": 3, "text": "This is a pretty solid place to go rock climbing. Staff was extremely helpful when i told them i wasn't a pro rock climber (yet). He gave me the ladies night discount i have no complaints over that and told me if i needed any help training he would help out, but since i was with my friends It wasn't needed.There were tons of different courses to climb up, ranging from beginner to expert climbs, and all fun. Once your arms are destroyed there is a place in the back where u can practice bouldering (ropeless climbing with mats) and even a tight rope to mess around on. Really its kinda like a garage gym.It was 10$ for all i could climb (which was only 2 hours) but they gave shoes, belt, and chalk which seems like a pretty good deal. The guy working there told me that sometimes it gets pretty busy because a group of rock climbing clubs frequent there.All in all heres what to take from this:Service is great.Make sure you bring a friend.Almost every weekday has some type of deal.Rock climbing is a great workout and a lot of fun.Give this place a shot.", "date": "2/20/2013"}
{"review_id": "yL2y8ggRQibptxMnbnXCRg", "user_id": "R-ICRVJngbMzev5z8HV7cA", "user_name": "Tara O.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Birthday party fun!We had a group of 12 here for my daughter's 12th birthday. The kids loved it, they stayed active for two solid hours before we had our half hour in the party room.Two and a half hours was a great amount of time and it was nice being able to keep the kids active and happy.We had a dedicated instructor helping out the group and the price was good.", "date": "11/14/2014"}
{"review_id": "JcpLRhE8ANCzi_Xdj9MoKg", "user_id": "njwFk51hH06hnToOeR9IZg", "user_name": "Brian G.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Great place to have some fun climbing around. I've only been rock climbing twice and both times were here. Staff was awesome and \"hooked us up\" with some discounts even though we went in the one day they didn't have a special going on. There were tons of places to climb and two bouldering... Boulders?Definitely recommend this for people looking to have some fun for a few hours (can't speak for experienced climbers however). Be aware that there are some rock climbing clubs that go on certain days and it can get kind of busy. I suggest calling ahead and asking the staff which days are busier even though there were still plenty of places to climb.", "date": "2/20/2013"}
{"review_id": "QNdtk-XrQ3mBx9LNKUyyjw", "user_id": "Jw9-FFeOmTWeznebGY2D0A", "user_name": "Jun C.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "First-time climber. Awesome staff. Great facility... Today was my first time at indoor rock climbing and actually any type of rock climbing in general.  I came to this particular gym (they have 3 locations in San Diego) because my friend lives out in Oceanside and we decided to go to a gym that was relatively close to both of us.  When I first walked in, we were greeted by the guyz at the front desk.  They asked how we were doing and if we had any questions.  We told them that we were interested in climbing.  They asked a few questions and I told them that I've never gone climbing before and that this was our first time at the gym.  We signed the liabaility waiver (which everyone has too) to use the facility.  They checked our shoes to make sure we had proper shoes, which we did (laced running or tennis shoes) and they also offered to rent some actual rock climbing shoes for a small fee.  They even said we had the option to rent shoes later on if we didn't like our own shoes for climbing or if we wanted to try climbing shoes.  We opted to use our own shoes.  Since it was our first time, one of the staff members gave us a free lesson on how to use the equipment. Instruction was given on how to put on the harness, how to attach the carabiners and safety rope to the harness and how to properly belay a climber  (The belayer is the person who takes up slack on the top-rope so that the climber doesn't fall).  Everything seemed a bit tricky at first but our instructor told us it will all seem natural in a few minutes.  He was right!  My friend and I both climbed and belayed one time each with the instructor and then asked if we had any other questions.  It all seemed pretty straight forward now and so he let us go and told us to have fun.  We spent about two hours at the gym and we definitely had a lot of fun.  We were there on a Saturday afternoon.  It wasn't too crowded and even thought the square footage area of the gym seemed small, there was a lot of walls to climb.  They also have lockers but no lock so if you need a locker for your If you've never gone rock climbing before and you are interested in trying it out, come here!   Bring a friend so that you can belay each other.  You'll have fun and the guys at Rock Solid Climbing gym are very friendly and will help you out.", "date": "10/10/2010"}
{"review_id": "OGO39OpMUrche-99NHpUJg", "user_id": "uPZEsKp-W6Mb5jDnE3P7_w", "user_name": "Taylor M.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place was so fun!! The general manager was so helpful and patient with me and my friends! He gives really good advice while climbing, tight rope walking, etc. I would definitely recommend going here!!", "date": "10/8/2015"}
{"review_id": "blJqIv1r2p0NCbyxv39Gbg", "user_id": "DxJZC7zanuHXsSZwA-tNkw", "user_name": "Sharon C.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great work out, nice staff.. They even have a tight rope which is a nice way to take a break from staining your fingers hanging from rocks :p shout out to Ryan! He's really nice and also happens to be a great rock climber :-)", "date": "7/15/2015"}
{"review_id": "SOF3EZyXhKwQBwL6BYDQAQ", "user_id": "GjC33pjYmcQGa9VDtveC4g", "user_name": "E L.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 1, "useful": 7, "funny": 0, "cool": 1, "text": "NOTE:  I have only been to the San Marcos location, and can't speak for the Poway or San Diego location.Readers Digest version:Great for kids parties, bad for actual climbers.  For more description please read on:My background:I have been climbing for more than 15 years on and off.  I mostly love trad climbing but sport and toproping as well.  The gym for me is a place to work on grip strength and stay limber for outdoor trips.  I have climbing in too many gyms to list, and have pretty much been satisfied with all of them up until now.  They were all pretty good.My experience here:I was really excited about this place, it is centrally located between my wife's work and my work and would be a great place to meet up a few nights a week to get in a workout.  Also, the prices are quite reasonable for a climbing gym, so that was a bonus too.  It would have to be a pretty lousy gym for me to not want to join with all these great conveniences.  Below are my impressions:First:I was shocked at the lack of oversight by the staff.  They basically asked us if we had our own gear (we did) and let us go.  My wife had never even used a Grigri before.  That's a red flag for me.  Second: There was an over 18 area with weights and bouldering.  Red flag.  It tells me this gym is catering to kids and parties more than climbers.Third: The route setting was incredibly awkward, and I'm not that picky.  I love rock climbing techniques, i live for laybacks, lock-offs, underclings, foot flagging, etc. It appears they were rating the holds, not the moves.  Juggy holds on easy routes and sloping holds on harder routes, but there wasn't much thought about the transition from hold to hold.  I have been to so many climbing gyms before and this was the only time I have ever been felt frustrated on routes that I was easily completing first try because the moves were so awkward.  Fourth:  (As if i needed a fourth)  The route tape was placed directly beneath the holds in such a way that you couldn't see the holds you needed to put your feet on.  This is a weird thing for me to point out because I have never even thought about this before, apparently all the other gyms I've been to have a better way of marking the holds because I've never even noticed this before.", "date": "2/5/2012"}
{"review_id": "NOMrMMvNdqRVx73lkNsw3w", "user_id": "NEDuE1AyVo_Huayo1-BoTg", "user_name": "Rick W.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 2, "useful": 1, "funny": 0, "cool": 2, "text": "After visiting Vertical Hold seeing the gym at Solid Rock in San Marcos was a let down. The staff were nice enough (one suggested that I check out Nomad Ventures to buy shoes which was a great call) but the facility seems to be there more to make money on birthday parties than for serious climbers.While I am only bouldering at the moment I would prefer to use an ATC instead of a GriGri for belaying. I can understand why those are in place though since the gym is crawling with kids and/or boy scouts many weekends. Luckily I can go back in the top-out boulder area which is generally less busy (except on College nights on Thursdays). That being said the routes seem fine to be as a novice, I'm still only able to climb up to a V1 (or maybe a *very* easy V2 on a good day).I think my biggest beef is that there is not much training equipment specifically for climbing. Sure there are free weights and a campus board but I would have expected at least a fingerboard as well. When I asked about that one staff member told me they used to have one but took it down, and in fact they were going to toss it so he took it home instead. This is a major failure compared to Vertical Hold (which has a stadium board and fingerboard); VH lacks free weight but that doesn't matter to me in the slightest.I bought a 6-month membership here only because it is less travel for me. While I work in Miramar very close to VH I take the Coaster so I don't have a car to get to the gym. If it were closer to home I would gladly pay a little more to join VH but the difference in distance would kill me on gas money so I am just going to continue bouldering in San Marcos for now. At least I can also go to their Poway gym if I happen to be in the area.", "date": "3/28/2012"}
{"review_id": "hlQbEwCcWTEtiMP9qnD-EQ", "user_id": "PlAcAtgovcF1qk011_c-qQ", "user_name": "TJ J.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter loves this place more than I do. The gym has equipment including shoes for my daughter who has small feet, she is only 5. But loves to come here and top rope and boulder. I have never had a bad experience with the staff here, the members have always help us and everyone who comes here are friendly and helpful. Don't be afraid to come here with no experience in climbing, I would just call ahead to see if they will have the instructors available to help out newbees. Over all great place to bring the whole family.", "date": "3/9/2016"}
{"review_id": "dmlij24_PVRlhd5S6req9w", "user_id": "cXVoq0WVar_s8Y2HH6sRQw", "user_name": "Eric W.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "Other than this gym, I've only climbed in Planet Granite in NorCal (SF and Sunnyvale).  I was very confused for a while by the tape and problem marking.  After starting a few runs, I just had to stop because I couldn't figure out what to do.  This to me means unclear/confusing routes and even more confusing holds.The routes weren't as long as I'm used to up north, but considering the above, they're not short either.  I think with more space, there could be better problems and better routing.I'd be disappointed if this was the only gym I had access to.  For this, this is only a once or twice a year gym while I'm visiting family in the area.", "date": "7/23/2012"}
{"review_id": "WLri1SsV2AKJSB7TWMdqjg", "user_id": "Pwq_6NZrZQvTzXWeFgLoag", "user_name": "Jennifer T.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "First time ever rocking climbing so I don't have a frame if reference-- but the gym was fine- a little small, staff pleasant and helpful, inexpensive but the rental gear was smelly- I'm not a picky person but it had a funk to it. I'm excited to rock climb again but would probably checkout another gym to compare.", "date": "12/29/2013"}
{"review_id": "sjMCZ0USOtrIN_u21-TaYg", "user_id": "fMyr8zDEbJGne8W6FRKv9A", "user_name": "Jessica F.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My first time coming here, enjoyed it a lot. The place was not too crowded even as it is on the smaller side, but the selection is nice. There is a slack line that I have yet to try out, but there is always next time.", "date": "4/8/2014"}
{"review_id": "TVZmeC-AZ16XluIa-itVSQ", "user_id": "b8hF9YzuNrN4xjXJdzTPRQ", "user_name": "Darcy J.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "I really wanted to like this place.  My friends took me here with a guest pass, and other than it didn't cost me anything,  I was not all that impressed.   Oh, I so much wanted a climbing gym worth going to that was closeby. Oh well.", "date": "7/14/2011"}
{"review_id": "jfkFFRXnVNmXijp7zlQoVg", "user_id": "HYb_qc0TIFXoC1exn3pDkw", "user_name": "Brandy P.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 2, "funny": 1, "cool": 4, "text": "I really don't have anything to compare this place to since tonight was my first attempt at indoor rock climbing ever.The one employee I encountered was very friendly.  He gave me tons of advice to make my first climb easy and didn't try to force all the rental equipment on me and told me my sneakers would work just fine.Their were tons of different paths to take and even when the place got crowded we never had an any issues finding places to climb.  I can't comment on difficult the routes are since I'm new to climbing and all but it was a fantastic time and I'd recommend it to anyone.", "date": "3/24/2010"}
{"review_id": "YnZJNmOiYoIl0wImM1rusQ", "user_id": "cnOdgdxWmMTiWKQ8W63-CA", "user_name": "Preston W.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "I was impressed.  The staff was nice.  You can tell that staff loves to climb.  They are the ones that make the place fun and enjoyable.  The gym was a good size.  It was kid friendly.  My son had a blast.  He wants to go back everyday.  This is saying a lot from a kid how just wants to stay home any play video games.    What is cool about solid Rock is that you don't have to take a belay test.  They use a grigri system which was quite easy to use.  I believe they also have another location in San Diego.  I think I see it off the 5 freeway when I go to the airport.  Anyway, if you like climb or want to try it out, I do recommend it.  Take your kids too.  It is fun for everyone.", "date": "8/8/2010"}
{"review_id": "ohIYu-FhGhKqxSmG01wl9Q", "user_id": "lUvqK4hiFZRkkA0Z50_ZCw", "user_name": "Bjorn F.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great gym - better than others that I've been to. They have a couple of bouldering areas, longer climbs with ropes, and basic workout facilities. In sum there's enough variety in the routes to never get bored. Very friendly staff, too, and just down the road from Lost Abbey in case you want a post-climb beer!", "date": "4/24/2013"}
{"review_id": "3gL7NmIhZLyj7-yn_YNLNQ", "user_id": "zFtFgeIpiAWQW7Gzbz9hfg", "user_name": "Allisoto P.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 3, "useful": 3, "funny": 4, "cool": 2, "text": "Staff: Helpful & pleasant. Seemed they were happy to see a new face, and  one of them was nice enough to show me how to use the Petzl Grigri set up. I had only ever used an ATC/carabiner setup. The Petzl Grigri is easier to learn to use, but not necessarily easier to use. Belay test: None...since they use the Petzl system, you can just show up and climb...Crowd: I went on a monday night which is college night, so there were lots of young people in their late teens/early 20s. High testosterone quotient. Alpha males- prepare to feel inadequate or territorial or something.Climbing: The courses are tough. I haven't climbed in a few weeks, but I was surprised at how difficult it was here. I was having trouble getting up some of the 5.8 courses (i had been climbing 5.10a's previously). The wall surfaces are smoother than at other gyms I have been at in northern california. Their floor is gravel rather than padded, so if you want to take off your climbing shoes while you belay, bring sandals.So 3 stars because I had fun, it was a good work out. But overall, it just made me really miss Berkeley Ironworks.", "date": "5/13/2008"}
{"review_id": "R20SerbiXz4ZaomINMvnZQ", "user_id": "6jT-CsKtLoMkKHUXf2iU3Q", "user_name": "adam b.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "Seriously one of the best places to take a date, a group of friends, family event, or for an amazing work out. $10 college/military Monday & Thursday...... On point!", "date": "9/28/2011"}
{"review_id": "V9o0uiOsGS4xkq1KE2wOmg", "user_id": "T1l4LxRR0xCdZPvgt_ggPg", "user_name": "Eric G.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a Scoutmaster of a local Boy Scout Troop and was looking for a fun local activity for our youth. One of the boys suggested rock climbing so we called around and found Solid Rock Gym. Turns out that in addition to having fun and challenging climbing walls, they offer a program where we can rock climb AND earn the Climbing merit badge. The icing on the cake was that that they provide the BSA registered merit badge counselor.The merit badge took two separate 2 hour sessions. We scheduled them for early Saturday mornings were there would be less people. The first session was mostly classroom items, but the last 30 mins the boys were able to get in a harness and free climb. The second session was virtually all climbing and passing off the various MB requirements.Overall the staff was very friendly (they let us plug in our own iPods), knowledgeable and the gym had plenty of ropes and courses for us to climb on. Since we were there Saturday mornings we practically had the place to ourselves.The price for the 2 sessions wan't too bad and included all of the gear (including climbing shoes on the second day) as well as instruction time from the 2 instructors.After each session, I asked our boys how they liked it and each one responded more than enthusiastically. Getting positive vocal responses from teen-aged boys is often hard to do, so well done Solid Rock Gym.", "date": "12/14/2012"}
{"review_id": "WgLgoQbMBKKVwTwbc3lv9A", "user_id": "xedxVt_VM-3YI5Z665Yptw", "user_name": "Billy B.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awesome for kids and adults. Most people don't realize they can do it, lots of people watching who didn't have the confidence to try. Friendly staff, $20 for all gear and all day, good deal!", "date": "3/25/2012"}
{"review_id": "VKJcOaQYoONK6tgnQYecBQ", "user_id": "xGP7OdZQy9RTKLRUvCtM1g", "user_name": "Jeff S.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place ROCKS!  The facility is outstanding and the staff outstanding!  The climbing is great. Me and my son go there every Tues & Thurs. The manager Alicia is really great with the kids. They are going to be adding on a new wing with a full gym and showers, weight room, etc. I really like this place and would highly recommend it.", "date": "9/22/2011"}
{"review_id": "hLD_Rjb4QsG9u71-JO6oiQ", "user_id": "_s_8Uk4eCB6c_KoCXZVOIQ", "user_name": "Shant O.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great Gym! Im very grateful I found these guys. They are in the process of expanding and will be done in a couple months! Seems like they will double+ their size. After exploring a good amount of indoor spots. I have to say that this gym is high up on my list. Chill tunes, great vibes, and fun scaling routes along the top rope set ups. vladimir was a great help and was super nice. Anytime I'm in the area I will be back for some peace of mind and a nice climbing session.", "date": "9/21/2011"}
{"review_id": "rbC25sljjaCry2OAxv1VEg", "user_id": "Keqf1MCEkfJB3M827LcfRg", "user_name": "Steve P.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "there ok and in a close to home location i signed up for a yr membership and im committed to going three times a week after work thanks for keepin the routes challenging and unique", "date": "1/4/2012"}
{"review_id": "Q-oP3d7Oabh6j175537QbQ", "user_id": "4ZuqWnsjtc5FP4fzLLC_fQ", "user_name": "Janet F.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 1, "useful": 0, "funny": 1, "cool": 0, "text": "This was our first time going to Solid Rock in San Marcos and will definitely be our LAST! We were there for a birthday party today and were supposed to have the party room and be there from 2-5 pm. The mother of the birthday girl was told that we could get there an hour earlier to set up the birthday party. When they arrived there was someone else in the party room and we were unable to put our personal belongings, food, and even our purses anywhere. The previous bday party went over their allotted time and when we were finally able to get into the party room, we were given only 25(ish) minutes to eat, open presents and eat the cake. The manager came in and told us to \"wrap it up\" because there was a birthday party after ours. When we explained that our entire time had been cut by almost an hour and that they were being unreasonable, the manager got very huffy, copped an attitude and began to raise his voice. I have NEVER encountered such a rude and inconsiderate manager in my life. With all of the screw ups, the birthday girl's mom was still made to pay 180.00 and no indication that they wanted to make things better. I hope people see this and think twice about taking their kids there for a birthday party. You will be made to pay and not actually get what you are paying for.", "date": "2/4/2012"}
{"review_id": "TPmjMItThmOD1tFUvC67_w", "user_id": "6RFxwva-oKRRXXO9lrvUgQ", "user_name": "Matt D.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 1, "useful": 1, "funny": 0, "cool": 0, "text": "If your a newbie you will not know any better but if you're actually a climber you can find many better gyms in SD.  The place smells, the routes have been the same every time I have been there, the bathroom is dirty, some of the holds are loose or not flush with the surface of the climbing wall.  I could overlook many of these items if the place was cheaper but the fee for a day pass is unreasonable especially on a weekend and the membership fees are a joke.  No thanks.", "date": "7/14/2011"}
{"review_id": "7gkHm_v1SveBFoXqfcua0g", "user_id": "5midVKx2votbONjqP_uU6A", "user_name": "Cristina E.", "business_id": "lI024TtsxTm2Et6Vrbl-nA", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Don't be fooled by the photos on the web-site. This is a small gym. It looks like the one in Poway is much larger, maybe more modern but I haven't been to that one. Having said that I LOVED my adventure here. I did not have any previous rock climbing experience at all prior to coming here. (I am in fact afraid of hights) We called before heading over on Saturday and the person on the phone was very helpful and offered all the information we would need, even letting us know that coming before 1 pm that day would be best as they had some birthday parties booked for the afternoon. When we arrived the girl at the desk was great! I can not praise her enough and i wish I remembered her name for this review. We had TONS of fun and felt the effects for days on our muscles! Even though it's small it was great, especially for someone like me who was a slow and inexperienced climber. There were parents teaching their kids and families and lots of beginners to make you feel at home. And for $10 (Summer special day pass) + $5 for gear (we took them up on the shoes included offer but not helmets) it was totally worth the experience!", "date": "6/19/2013"}
