{"review_id": "_is7kwtjHfSWIinRXHM_1w", "user_id": "ZpQTFhxh-CBZKFq1F60zpw", "user_name": "Ashley J.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 13, "funny": 12, "cool": 14, "text": "I'm not the biggest fan of heights. I can't look down when I'm on a single story home or going up escalators. Going wall climbing wasn't my idea and I went in with the intention of climbing 5 feet. My fear of heights stems from not being able to help myself if I fall. We paid $30 for a full day (you can leave and come back), shoes, and Dorian was kind enough to do a rundown on safety with me. Learning everything with Dorian was a good way for me to relax... and stall from climbing the wall. I learned how to tie an appropriate knot by strangling an alien and poking him in the eye! Dorian showed me how to hold the rope when Taylor is scaling the tricky walls and how to catch him when he releases. After some more stalling it was my turn. I had the shakes and that moment of, \"where's the exit?\". I however felt confident from my training with Dorian and knowing Taylor had the rope. I failed hard core and was like a drunk monkey my first climb. After a few more tries I started grasping it more. Literally. I was able to touch the top several times!! I still couldn't look down without freezing but I was getting comfortable with letting go and not worrying about slipping. I appreciated coming to this climbing gym for my first time because everyone was so nice! Thank you Dorian for making me feel comfortable and letting me stall. I definitely will be back to explore more!!", "date": "6/25/2016"}
{"review_id": "vn_lHjavmbp1fi5ztnNt5w", "user_id": "RfXmL2DsYE3oAeyiWdQ0iQ", "user_name": "Karen H.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 3, "funny": 2, "cool": 2, "text": "I've been wanting to try indoor rock climbing for a while and this was the perfect opportunity. We walked in signed the waiver and we got started right away. Stopped in on a Tuesday night and it wasn't super packed luckily. We purchased the lesson and pass. This included the all the gear, shoes and harness. They also provide you with powder for your hands to keep moisture down.Our trainer was awesome! He took us to the side and he taught us how to figure 8 knot several times. He showed us proper technique and how to act as a belay trust me you don't want to use a auto belay I learned the hard way. After the lesson he took us to he wall for a trial run. We did it once with a belay and then once with auto belay. Word of caution make sure to lean back when descending and feet against the wall. I unfortunately didn't do so the first run and hit the wall. When doing the auto belay DO NOT GRAB THE STRAP when coming down just lean back and let go. We then moved onto bouldering and he showed us the numbering system for difficulty level of the walls. We had so much fun after we got the hang of things. They also offer yoga classes and a small workout section. The staff is great! Super friendly and helpful. They have a full bathroom with lockers and showers. Awesome gym and a great place to start your rock climbing adventures!", "date": "11/25/2016"}
{"review_id": "oZO_X17Q9ybctiXM7GkTDw", "user_id": "0gvetX-CZwk85wvHU_gJ5A", "user_name": "Kristine T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 5, "funny": 1, "cool": 3, "text": "It's been years since I've been back here. My cousins have memberships so my husband and I decided to join them last night. It wasn't too crowded which we liked. I haven't been to any other rock climbing gyms so I don't have much to compare to. As beginner climbers, I would say this location had a bunch of good walls for beginner to experts as my cousins are experts. The staff here are very friendly and take care of you. We had a ton of fun but heard they were closing so that's a bummer. Enjoy it while you can!", "date": "10/30/2016"}
{"review_id": "oSsfQz4IoLGGDU8dAFLcww", "user_id": "H1x-M7zrDWbtnSAW6ZZznQ", "user_name": "Joseph Y.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 17, "funny": 8, "cool": 13, "text": "Climbing things comes common in my line work, however it's usually not as tricky as making it up rocks. My visit to the Vertical Hold Rock Gym was my first time trying out indoor rock climbing and I must say that I really enjoyed myself. My friend had purchased a groupon for one quick lesson and day pass for some indoor climbing at this gym in Miramar. She invited me to go because she knew I wasn't scared of heights at all, unlike her. When we first visited we were greeted by the young woman behind the counter who ended up being our instructor as well. The gym provided loaner shoes and harness for each of us. After teaching us how to cinch up the ropes correctly, she let us loose to try out any of their many walls. Rock climbing is definitely way harder than it looks and this gym provides walls that are easy to scale along with super intimidating courses as well. The gym is correctly maintained, clean and organized allowing people to freely flow from wall to the next. Vertical Hold. Look forward to coming back here or another rock gym to get better at the sport.", "date": "11/3/2016"}
{"review_id": "-2PKk3EdQgfro54_IT6_iA", "user_id": "U1Nbo2wMqUcHQBJSMzOiKQ", "user_name": "Austin K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "VH has everything you would want in a climbing gym.  The staff is very friendly, the gym is clean, the problems are changed often, and the people are friendly.   I have been coming here twice a week for the past few months and I have seen the same faces every time.   The same people keep coming back because this is a top notch gym!   Some people say the gradings are a bit stiff for the problems, but they are accurate with regard to the other problems in the gym.  There are plenty of vb/v0 climbs with big jugs to get even the most green beginners into the action.   There is also yoga/fitness classes that come with admission if that is your thing.   The monthly membership plans are a great value especially when compared with other climbing gyms in SD (there is a reason I drive past 2 other gyms to come here).", "date": "12/30/2015"}
{"review_id": "1jxjzbb-ZwnGZSO9XOHdqg", "user_id": "Suq-J8j4GjYwk_19dOFIWw", "user_name": "Jasmine P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Vertical Hold is a great rock climbing gym.  They have great pricing for day rates and memberships.  I've only tried bouldering at this location, but the routes are great.  They have some V0/V1 levels that are beginner friendly as well as ones that are very challenging.  I love the boulder in the middle as once you reach the top, you can climb over the wall!  VERY fun!I think the warm-up wall is such a great idea.  It's fun to go back and forth on this wall progressing through the levels.  Would love to come back.", "date": "4/5/2016"}
{"review_id": "TKb0j8Qxs4nZFwCaR8Mshg", "user_id": "eMpfBfTjsarX4sS3udrUdQ", "user_name": "Richie W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Had a ton of fun here.  Double date with my wife's best friend (and her boyfriend).  We didn't get any special deal, which by looking at yelp, looks like they offer promos once in a while.  We opted for the day pass + lesson + equipment rental.  The class was short and sweet (I can say I'm an expert at making figure 8 knots now haha).  After the short class (also teaches you how to belay), onto climbing!  It's a lot harder than it looks.  Works out your fingers way more than you think, as the things you grab onto (especially for the harder routes) are harder to grip.  The easier routes like the 5.5's have giant handles to grab onto so it's easier :) They also have a fun little rope ladder on one side to try.  I was attempting some of the boulder climbing, but that is a lot more difficult for people who are just getting into it. They also have a few automatic belay machines if you decide you want to come here without a friend to belay you, but rock climbing is more fun with a friend.  Either way, tons of fun. Might become a future hobby of mine!Btw, I believe if you check in on yelp you get a free gatorade so don't forget that.", "date": "12/8/2015"}
{"review_id": "spwLB84X0JzMfLEZa8eDig", "user_id": "ILtY_PxEzwRx3cda1BtLWA", "user_name": "John M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I went here 3 years ago when I turned 30, that was my midlife crisis.I did ok but I wasn't able to conquer any of the crazy angled walls. I been wanting to go back here for 3 years and finally went back yesterday. It kicked ass, hung out with 3 kick ass friends and stayed for like 6 hours. If you aren't a rock climbing type and you're a gym type but want to try something out of your element do your pull ups. Wide grips especially.Lat pull downs help too. Being a curl monkey and lifting for cosmetics so you can look good for Billys pool party wont help. I beast modded the walls this time around and it's more fun when you do well and you feel cool being able to do the angled walls.If you're like 5 foot 3 105 pounds you'll probably do well here. I noticed most people who kick ass at this are super petite and move around like little spiders. If you aren't built that way just beast mode it!If you Cross Fit you won't do well rock climbing. You can't half ass climbing to the top of a wall. Stick to Cross Fit.5 Stars.because the guy who taught us how to tie the knots was patient with us.  We're dumb and it took us an hour to figure out how to tie the knots properly. If you get lessons you'll learn all the safety stuff so you won't die then you get to climb for the rest of the day.", "date": "7/29/2015"}
{"review_id": "O1IQ6IRlT__ZMxgK6poSrQ", "user_id": "adKonsQWY64vJYglPotH5Q", "user_name": "Stefanie C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 2, "funny": 0, "cool": 1, "text": "I feel conflicted because Vertical Hold is so highly rated on Yelp and recommended by my friends, but something about this place just did not jive with me. Perhaps my regular climbing gyms have spoiled me with more climbing space and excess amenities, but I will try to be unbiased in writing this review.I will say that the staff is super friendly, especially the guy that helped me at the front desk since it was my first time. From filling out the paperwork to making sure I had all the right equipment, even that was a delightful experience. (By the way, they have student discounts, so take advantage of that.) The locker room is small and simple. There are limited showers (well just one) and bathroom stalls, and the lockers are tiny so leave most of your belongings in the car. I don't understand why the entire floor (especially the top rope area) is covered with pebbles instead of soft mats. Oh but I do think it's cool that they are starting to install auto-belayers, which is super high tech. There is a middle bouldering area where you have to drag the crash pads whenever you climb to make sure you don't fall on said ridiculous pebbles.My favorite place to boulder is the upstairs \"cave\" which also has a small yoga area. The routes are super challenging here, even the most basic ones. Seriously if you can climb here, you can climb at a lot of other gyms that normally have easier routes. Huge semi-unrelated plus is that there are many breweries close by to grab a beer with friends after climbing together. The ultimate bonding experiences.", "date": "2/4/2015"}
{"review_id": "4N7REClUCrZBwKMdZO0rzw", "user_id": "jxr8O4H3ivg630bbrix7aQ", "user_name": "Rocky B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here for my birthday. Was looking at another place but this accommodated my party of about 20. Reserved a spot upstairs and have been hooked ever since. Started with the belay lessons and moved my way to trying the bouldering which is addicting and challenging. The staff is nice and helpful and I ended up getting a 10pack pass since I'm sure I'll be coming back again again.", "date": "8/12/2015"}
{"review_id": "SCStyVx-m7MGhJtaKHF3TA", "user_id": "H0zXRdXsCGD46OXr81lTfg", "user_name": "Andrea K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 4, "funny": 0, "cool": 0, "text": "I came here on Monday for the student discount after 3p so that bouldering is only $11. They close at 11p so you can pretty much just spend the entire afternoon/night there if you really wanted to.It was my first time and I'm also really scared of heights, so I was glad to find that the staff there provide you with all the information you need to stay safe. The climbing area is padded really well so that if you do happen to fall, it's like falling on a cloud... and the reason why I know is 'cause I fell near the top of one of the boulders, which is totally predictable for me because I'm a complete klutz. Anyway, this place is great for all sorts of skill levels ranging from beginners to pros who just hang around upside down on the boulders! There's also slack-lining, caves, rock-climbing, and kid's bouldering. The bathroom (or at least the women's) was extremely clean and there was even a shower with shampoo/conditioner/soap. The bathroom was also stocked with lotions and face washes, among other little toiletries, which I thought was super convenient.  Overall, I had a really fun experience and I'd be down to come back again cause it's like working out without working out!", "date": "9/11/2014"}
{"review_id": "8NWTHeDFjXJQCFrYzhGw3Q", "user_id": "xM1SpngQUAQtttr0lzyY_Q", "user_name": "Thanh T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I came here a few times and then became obsessed and bought a membership. I have never regretted it. I love this gym! Everyone is so amazing and friendly. The staff is great, the members are amazing! Also they always have some cool setup or something fun going on. A great place to indoor rock climb whether you're new or experienced. They have a lot of different problems for all skill levels. Although I do prefer bouldering here more than top roping. But top rope is always an option. But I feel VH is really a great bouldering gym!", "date": "7/13/2015"}
{"review_id": "aaqp9I8SOwQxKMMNE_GW8Q", "user_id": "MOVQzAf_cZNPxKjru75boA", "user_name": "Clara Y.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 3, "funny": 3, "cool": 1, "text": "My roomie rock climbed before and she wanted to bring me here! It was my first time rock climbing and bouldering so I was pretty excited. Im mildly afraid of heights, more so when im not strapped in, so bouldering was more intimidating, but rock climbing was fine. Theres a parking lot right next to the arena, and monday after 3pm, students can get a discount for $11 admission. Since I was new, I had to pay an extra $9 for training. The staff was really friendly. They taught me all of the safety precautions, signals for communicating between climber and belayer, tying knots, and looping and tightening the rope. He also made sure me and my roomie were comfortable with everything and watched each of us climb and belay once to make sure we were confident to go on our own. I felt comfortable after then to climb them rocks! You can ask for a bag of chalk and clip it to your belt. The chalk helps with your grip on the rocks while climbing and also on the rope while belaying. Hours end at 11pm!It was a great first experience and it was fun pushing myself both physically and mentally. My arms and wrists and hands are so sore now, but its the good kind of pain. My roomie and I want to come here every month to build up them back and arm muscles :DPlus there is some awesome eye candy. The shirtless guys with the amazing back muscles who were bouldering. Thanks for the great view!! Dayummm, You show that rock who's boss. ;)", "date": "8/25/2014"}
{"review_id": "pG8dT_jTjNtmTTFMkdcYPg", "user_id": "DzZRy_oLpkQkNFED3KRZQA", "user_name": "Beatrice T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "What an amazing first time rock climbing! The facility was super clean, the ten minute tutorial was perfectly done and informative, the gear was in good condition. We can't wait to go again!!!", "date": "3/24/2016"}
{"review_id": "LV79w8KEWRPotj0K_i71dw", "user_id": "8JcESAsr5es156K1YJ1v2Q", "user_name": "Ashlee P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Vertical hold is the best rock climbing gym I have ever been to. Primarily, I Boulder since I often come to the gym alone, but they do have a couple auto belay walls which I plan on using someday. For now, I'll stick to my beloved V1s. The staff here is so incredibly nice and encouraging. They made me feel very comfortable with the equipment. The community of climbers here is also great. Everyone is friendly and talented. I'm excited to finally be able to call myself a member here.", "date": "3/5/2016"}
{"review_id": "G6sS-FXpplb9UGqqmDiBxA", "user_id": "M7nYz2dHoikZuXPoVOCbpQ", "user_name": "Christian O.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here with my wife to change things up with our workouts. The staff was extremely friendly and easy to talk to. The quick beginners lesson was easy to follow and we had a great time! There is a good mix of easy and more complex climbs. This is a great place to go for people who are completely new to climbing as well as the more experienced. I strongly recommend it!", "date": "5/10/2016"}
{"review_id": "5us-hcdjGmr5Zp99axV0aw", "user_id": "eLSQlDkmhCTQyI7PUM-CFQ", "user_name": "Richter T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Went for the first time since I was in there area for work. Friendly staff and a very \"team work\" environment.  I've climbed a few places in north county and they all have a grigri (auto belay system) which kind of takes away the experience.  The staff here will take the time to teach you how to belay and tie the correct knot to your harness. Overall great place.  I'll be back soon vertical hold!", "date": "4/27/2015"}
{"review_id": "3uGFFD3dl1BuJPGhWSklYw", "user_id": "YDBvmId3Bwf3fov98HLBWw", "user_name": "Sean M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 2, "useful": 3, "funny": 2, "cool": 1, "text": "I live closer to 2 other climbing gyms, but the drive to Vertical Hold used to be worth it for the laid-back atmosphere, great music and weekday \"lunch pass\" deals. I would look forward to coming here to build my strength, push the grades and just have fun climbing. Now the lunch passes have been disappeared, and in their place dozens of summer camp/birthday party children are clogging up the place. What happened? It used to be a \"by climbers, for climbers\" kind of place. It now seems to be going the way of the daycare center/ amusement park, like so many other gyms trying to maximize their profits. This is fine for summer camp children and first-timers, but for climbers looking to have fun and improve their abilities it is a pain in the ass. Until this changes I'll take my business elsewhere.", "date": "8/4/2016"}
{"review_id": "qtEtLWAVDkbsXTGEVKQEzQ", "user_id": "a3cHIJzd-tJqiT8-8XqghQ", "user_name": "Sarah L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I've been here 4 times now, and being a beginner I absolutely love how confident and helpful the staff is. The never hesitate to give tips or a quick lesson and explain things so clearly and easily. There are endless options for walls to climb on, great bouldering and a fantastic spot for kids parties! I always feel so comfortable there and really enjoy the workout!", "date": "2/13/2016"}
{"review_id": "QecRjTOMRfiBlr4DhBj07w", "user_id": "cGqe3bxRNpRre3lnDoXepQ", "user_name": "Marwan A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 2, "text": "I love this gym. I have been to other climbing gyms in SD and I like this the best. Does that mean it's the best in SD? Maybe, depends on what you are looking for. The routes are always fun and they change them up often enough so there is always some new challenges (but not too often that you don't get to enjoy them first). The staff is incredibly fun and laid back. They always make the time to answer your questions and will sometimes also stop and chat with you. They care about making sure everyone is having fun in a safe environment. For me, they embody the environment of what a rock climbing gym should be (huge plus). They renovated the gym earlier this year and it looks great! They added some cool stuff too (you should go explore and find it).I might climb at other gyms every now and then but VH will always be my favorite! :D", "date": "9/2/2015"}
{"review_id": "Hn3Nm2ZON8AkJbIXN2sKqA", "user_id": "r4fviG_y1jY-BDMgTJZa5w", "user_name": "Shayne C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 9, "funny": 8, "cool": 8, "text": "Possible hobby ? PerhapsLatest addiction ? MaybeHOTTIES Central ? HOT DAMN ! Jamie was right ! :)Plenty of eye candy up in hurr. Not that I came here for that..just an observation and bonus IMO ! Side Note: Muscular arms and broad shoulders makes me goo goo ga ga !SMH. Okay back to reality !Previously purchased the Yelp deal:$25 for a Beginner Rock Climbing Package (regularly $53), which includes: *Beginner package - belay lesson, day pass and rentals*One additional day pass with gear rental included I decided to set  up a yelp meet-up for anyone interested in trying it out (both inexperienced and experienced climbers).For a Saturday afternoon, it was initially packed due to group parties and classes, but later died down and we had more room to maneuver.Minus 1 star for the girl working in the front desk. She didn't seem to want to be there and quite annoyed for some reason. Wow. Terrible service on her part, especially since it was my first time and was super excited. Anywhoo..I didn't let her phase me. She gave us our gear rentals and we went on our merry way !Belay lessons were given by a cool instructor (seriously he was) and we were able to practice until we felt comfortable on one of the walls. I highly recommend it for you noobs. After 3 hours and successfully climbing 5 walls, I was pretty beat. It's quite the workout friends so make sure you come prepared for it.No worries though. Plenty of walls for different leveled climbers. There's something for everyone so don't feel intimidated. Just take your time until you feel confident and comfortable in pursuing a more advanced wall.Looking forward to Rock Climbing meet-up Part 2 so keep an eye out !", "date": "3/18/2011"}
{"review_id": "Cp9muvT5pZRnUZfb9rRIQw", "user_id": "ee54XJRPsdJokPqtADTpzA", "user_name": "Cody W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vertical Hold is the best climbing gym I've been to in San Diego. It's a bit pricier than the chain ones such as Solid Rock, but the extra wall options and the staff absolutely make it worth it.Shoutout to Dorian who hooked it up with an incredible belay session on the house when we came with a Meetup group. He was very patient, knowledgeable, and fun to learn from.", "date": "3/2/2016"}
{"review_id": "b0MW1YrVgMi8NT-pYVNH8Q", "user_id": "Mikt-KJSQ-3Y1h0RJgoatw", "user_name": "Christina A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 3, "funny": 0, "cool": 0, "text": "I came to Vertical Hold with NO experience as a climber and was very intimidated to try it. The friendly & helpful staff was exceptional in helping me with getting shoes, getting my kids set, and teaching me the skills of belaying. They went above and beyond in making me feel welcomed & were open to all my questions. This is a kid friendly environment and safe at the same time. My family loved it so much we bought annual passes!! Try it out.", "date": "5/23/2015"}
{"review_id": "vHUCBdC48wwMk6lRtLZGFg", "user_id": "Qpdp-snc3dsnRY7CWGyuEA", "user_name": "Katie B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "This place is great. All employee's are friendly, and the climbing walls are great! They will teach you all you need to know within 10 minutes if you can pick up how to tie the knot correctly and you'll be on your own to roam and climb.They also have a big bouldering rock in the middle which is pretty sweet. It's really well priced and something you'd be able to afford pretty easily if you wanted to come on a consistent basis.", "date": "9/24/2013"}
{"review_id": "XVLYfjiADYo0WmPrEbUMvQ", "user_id": "TsN1fJqqBOtONYMd9AOamQ", "user_name": "Nick A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 2, "cool": 0, "text": "Really nice facility. Great climbs. I've been in climbing gyms that are crazy dusty inside- like just chalk floating in the air...coating your lungs giving you mesothelioma. But not here. I don't know what they're doing. Maybe there are gnomes cleaning the air....or they just have a nice air filtration system- but if you value your lungs and you wanna climb- this is the place. The staff is super nice. Except that Alex guy- I can't tell if he was joking around or if he was actually giving me attitude. Either way- he got us taken care of and we had a great time. We'll be back. Best birthday party ever. The owner is super nice!", "date": "5/4/2015"}
{"review_id": "4H7fwhJzMbTw39RVV6oTIQ", "user_id": "3PiuCfNSeib3iCbn4eltnQ", "user_name": "Liang T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've been here and Solid Rock. This place is closer to UCSD, but more expensive by a few dollars. They do have a student discount though so be sure to let them know if you're a student.", "date": "7/22/2015"}
{"review_id": "0mrROvBQyNPij5X62D5QOg", "user_id": "IU86PZPgTDCFwJEuAg2j7g", "user_name": "Danny W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 11, "funny": 5, "cool": 9, "text": "For an idea of how hard-core indoor rock climbing is take a look at the regulars who come here. They are shredded like extras from the movie 300.  When I finished only 3 climbs I was sore in muscles that I don't think I had ever used. As a first timer and someone who is afraid of heights I was pretty nervous during my belay lesson. So much that I kept screwing up the knots I needed to master before they let me climb. Thankfully the instructor was patient and basically held my hand through it step by step until I felt comfortable enough on my own. Once I passed the knot and belay test I was free to explore the little city of manmade walls that waited. It's massive and kept in very good shape despite being one of the oldest in the area. To put into perspective how large it is Solid Rock's 3 locations aren't as big as it so expect to be mesmerized.  Big ups to my buddy Dave for introducing me to this place and the sport of rock-climbing. If you want a badass workout that hardly feels like one because it's fun and your adrenaline is in overdrive then get to Vertical Hold.", "date": "9/20/2010"}
{"review_id": "ks-dEGNYIaP-7cQSFoAHbA", "user_id": "w3_06v680YRX7pki2QGIxw", "user_name": "Ryan P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 5, "funny": 0, "cool": 0, "text": "I have been to a number of rock climbing gyms, and this is by far my favorite.  Decently large with a huge number of top-rope and lead climbs, surrounding the entire building, ranging from 5.6-5.12.  Their lead cave is massive, with a hanging spire!  Their bouldering is equally impressive, with a massive top-out boulder in the center of the building with challenges varying from \"V-fun\" to V-10!  They also have a small area upstairs that has a training area good for working on specific muscle groups, and a small wall with ropes designed for children.  Also upstairs they have a bouldering cave with more climbs!They have deals for almost everyday of the week, if not everyday!  For example, Sunday is Military Day and all military members receive $7 off a day pass.  Monday night they have a live DJ mixing music for the populace, and occassionally they'll host a night session where they turn off all the lights minus a few blacklights, and you climb with a headlamp!Tons of climbs with all difficulty levels, tons of cool people, and tons of memories.  These are why I keep coming back to this place.", "date": "11/6/2012"}
{"review_id": "CH3C9NGAJcT7BhQ59e62Ow", "user_id": "djuTJKL2AQBH68DuluZjVA", "user_name": "Christine K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "Newbie here! Ive been here 3 times so far and I'm totally loving it. Tried bouldering and just learned how to belay. Belay lesson for first-timers is $9 (worth it). The staff are so nice and like people have said, they try to remember your name!The atmosphere is really cool here too. The people who go here are nice and rock climbing in general seems to create a socially positive and encouraging environment. And also there are tons of fit people ;) If you're a student, definitely go on Mondays (after 3) for their student discount ($12 for day pass including gear). Super cheap. You'll definitely get a good full body work out in here.", "date": "7/8/2015"}
{"review_id": "ZKixc7XRi2Zrmj5XYwtM1Q", "user_id": "RNndtyDFSKHwRJ-iUzLqrg", "user_name": "Dima I.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "It's an nice gym. The atmosphere is pleasant and the instructors were knowledgeable and friendly.  The only criticism I will make is that the web based waiver forms I had to complete on the ipads are very slow, and frustratingly difficult to navigate. Otherwise, its a great place. I'll definately be back.", "date": "7/26/2016"}
{"review_id": "Jr_Zur-CH4qUG3ekIfsitA", "user_id": "hbF8TACKA2WsyBPdqtYGTQ", "user_name": "Ron A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This is my second time here. The guys working behind the counter were nice, friendly, and helpful. Since it has been a long time since we last climbed, we asked for a \"refresher\" course of how to tie a knot and belay. It was helpful. Good variety of walls to climb.They have specials on certain days to try and bring in business. They have no specials on Thursdays.There are restrooms with a shower inside. There are lockers to use, but bring your own lock.They do have drinking water. They provide paper cups, however to save the environment, they have a sign to please bring your own bottle.", "date": "10/11/2012"}
{"review_id": "V0kSi07TvXneX1xC8QmSnA", "user_id": "MBguorXyFfuzjQvXCLrR6w", "user_name": "Quinton A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "New Climbers are taken care of by this extraordinary staff!The first time i arrived i felt welcomed. Gym owner, Ben happened to be working on this day and he took it upon himself to set me up and teach me important techniques of safe and fun climbing. I have returned several times in the last few months and brought friends with me. Vertical Hold gym is LEGIT!", "date": "7/31/2015"}
{"review_id": "x3jvBlno9PgSM1Do2AlItw", "user_id": "L7VEJP1RrpXRRRWsYIu3tA", "user_name": "Leonard L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Vertical Hold Sport Climbing CenterSD: Miramar4pm Tuesday 17 July 2012Five StarsThis was ridiculously cool place.  We went bouldering which is free climbing with pads on the ground, meaning we did not have to get harnesses and belay lessons.  The front half of the boulder was closed for an upcoming competition so the attendant gave us the military rate. As for the climbing, I am at least 25 lbs heavier than the last time I rock climbed, which made things much more difficult.  However, the whole experience was fun and now I want to get in even better shape.", "date": "7/18/2012"}
{"review_id": "sUQocEjQ3h7q72nXR1xoVQ", "user_id": "ViUIb0jvsXCo8euj4F5aWQ", "user_name": "Michael C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 7, "funny": 5, "cool": 6, "text": "Vertical Hold, a great gym to rock climb.scale up the walls, they're open past nine. (11pm weekdays)Top rope or bouldering, whatever you choose.The routes are challenging, there's nothing to lose. Great service here and the staff are so friendly,Even if you're new, they can help you get ready.Signing some waivers will be required, Rental gear can certainly be acquired.Climb all day and into the night,overcome your fears of very great heights.A great place for newbies and even the hardcore...Once you start climbing you'll definitely want more.", "date": "2/26/2014"}
{"review_id": "eJwx15SbroejBVTR6Ttf7A", "user_id": "w7orfq6ZWNviSZLCu09CNA", "user_name": "Chere' V.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Just had my first climb at Vertical Hold Rock Climbing. Sean was our belay instructor and he was very patient and soooo helpful. My husband and I had a great time. This is definitely much more enjoyable than going to a regular gym. I say give it a try. The bathroom is clean and comfortable with a shower and a few lockers. There are also a few weights to use but it's not like a regular free weight gym. The only thing I wish they had was a sauna. Overall, I can't see any reason to not give them 5 stars. Even the patrons were super helpful.", "date": "4/22/2016"}
{"review_id": "YDoGejAsSxk3mmfPodSYRQ", "user_id": "gg-lCFEX99ymyhZVKqN9tg", "user_name": "Vivian C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 8, "funny": 0, "cool": 0, "text": "I love Vertical Hold! This is probably my favorite climbing gym. It's got such a nice and welcoming \"community\" type of feel to it. On my first trip here, Reanne (?) gave us a brief \"refresher\" belay lesson. She was super friendly and helpful, and definitely went above and beyond to make sure we felt ready and prepared before setting us loose. The routes here are awesome. It definitely caters to all skill levels so everyone can have fun.The upstairs bouldering cave is pretty cool too!I love that they have different specials throughout the week.Mondays - Students pay $11 for day pass + gearWednesdays - Guys save $4 on day passFriday - Ladies save $4 on day passThey also have volunteer opportunities as well if you're broke but have magnificent belay skills! For every hour you volunteer to belay, you get a free day pass. AND!!!!!!!!!! If you buy a harness/climbing shoes from REI, bring in your receipt for a free day pass!", "date": "3/7/2014"}
{"review_id": "jT1YeFx9OUu8gXFt91iooA", "user_id": "3OZdx3SWw1SIcuwCVgtkIA", "user_name": "Han-Mei C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "My favorite climbing gym ever.  I've been to some in LA and SD and this is by far the friendliest gym.  It feels just like climbing outside where someone who is resting from a climb will suddenly give you just the right tip to complete that problem you're working on :)Also the climbs are always surprising and can have every type of climb (crimps, slopers, etc.) in a single route.  The bouldering here is killer - as in it amazing and might kill you.  I often find myself struggling to gain 2 feet, and 3 days later, when I finally get that 2 feet (and reach only the next hold) I am so impossibly thrilled and feel like I've conquered the world.  I get a workout here without even noticing I'm working out.  I just want that next hold and that next hold... until one day I went home and realized I can do pull-ups... then discovered I've made pecs... then discovered I can balance on river rocks when I'm jumping around on hikes... or can hold this one move when snowboarding.  I love this place.  The atmosphere is so chill... when they are not playing awesome music, they have live DJs weekly spinning from vinyls! It's a place where big kids come to play and work out at the same time.The staff is ALWAYS friendly, have great tips for indoor and outdoor climbs (and activities), encourage the easy atmosphere, and lol great music taste!Sometimes I see tiny kids here under 5.  The climbers are so respectful and chill with the children too.  It's a wonderful gym.", "date": "7/30/2014"}
{"review_id": "E803V40EwR99NRK3sP7HwA", "user_id": "VJkbdaybD2usSxz1Np7nkg", "user_name": "Dominique M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "This was my first time visiting a rock climbing gym.  It was outstanding.  The facility is very clean and the staff is friendly, safety conscious and helpful.  I took the belay class to get certified - it was confusing at first, but the staff was helpful and it really clicked once I was able to belay a real person.  I will definitely return - its a great workout and a lot of fun!", "date": "8/29/2014"}
{"review_id": "sxb_aqPWfaCiF_RegsBIdw", "user_id": "bPq0jz5r4JEajNaO09j5GA", "user_name": "Heaven M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 4, "funny": 1, "cool": 0, "text": "As far as rock climbing gyms in San Diego, put this one at the top of your list. The front desk girl, Lauren, was so friendly and accommodating. She was very patient with going through all the steps of belaying with us. The walls were so fun and diverse, all offering different ranges of difficulty. This gym is rather large- so even on a busy night, I never had to wait in any sort of a line. Everyone here is so young and friendly, so I'm sure this would be an awesome place to try to meet new people. Every Tuesday and Thursday night they have free yoga as well, which I didn't try but I think it's great that they offer it, should you choose. Also, located next door is Saint Archer Brewing Company. So when you finish climbing, be sure to head next door for a cold, local brew.", "date": "3/12/2014"}
{"review_id": "2N8Koh9S8gWILKgr_k4r-Q", "user_id": "w1D2qzgeHl32c-TGfqHV4A", "user_name": "meg b.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughter age 10, participated in a week long summer camp Although she had never climbed before, she absolutely loved this camp. Each day, the instructors came up with a new word( leadership,trustworthiness, community etc) and constructed the climbing lessons with that word in mind. The camp was the most fantastic experience for her and we are so impressed. Highly recommend this for any kid! FYI our daughter is shy and timid and did great in this environment. Thank you to Dylan, Kate  and Jam.", "date": "7/7/2016"}
{"review_id": "sqd214v8TFSH-RVnz62VXQ", "user_id": "G0L6Gwpg_Z_SXHxE7Y3yOA", "user_name": "John L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Fun climbing gym with reasonable prices.  Get the 10 pass.  It's the best deal for climbers that plan to go less that twice a week.  Parking can get busy, but you can park in the back area or on the street and walk in.PROS  -Good vibes  -Friendly staff  -Safe and fun environment  -Friendly customers  -Frequently updates the climbs  -Yoga sessions  -Strength training wall  -Cheap rental equipment  -1 beginner level slack line available  -Free climb days if you buy harness or shoes form REI with receipt CONS  -Smells like felt (pretty much all climbing gyms)  -No workout area", "date": "12/10/2015"}
{"review_id": "H8uvfYmTF-FGwuKjVivM0Q", "user_id": "8dhzj7Ulwf5iI835LjHLvw", "user_name": "Jorgeanne C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I have only been to one other rock climbing gym and Vertical Hold with its convenient location with Saint Archer brewery right next door has instantly become my favorite  rock climbing place.  The facility is very clean and the staff is friendly, safety conscious and helpful. I took the belay class to get certified - it was confusing at first (especially for a novice), but the staff was helpful and it really clicked once I was able to belay a real person.  They test you with your figure eight skills too.  Especially since its easy to make pretzels instead. They have all essential gym climbing needs and have all new bouldering set up. They have a number of difficult climbs as well but is still a great place for all levels of difficulty from beginning to advance. Tip: On Mondays they have a student discount too, which includes gear rentals.", "date": "10/19/2014"}
{"review_id": "t0BMvV7cyqFGIxxWDZkE0A", "user_id": "SmZZD8wu9I2zcbAe7PS6sw", "user_name": "Shawn C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 1, "cool": 0, "text": "First impressions: 1) Located in a business/warehouse district so a bit tough to find. Assuming you turn onto Distribution Rd via Miramar Rd, keep your eyes peeled on the right for the small-ish white-ish \"Vertical Hold\" sign. 2) SUPER FRIENDLY STAFF!!!!! A+++ 3) The gym was smaller than I imagined, but in their defense, I do have a wild imagination. 4) If you're a noobie like me, VH-B's, VH-FUN's, VH-0's, and VH-1's are plentiful and will keep you real busy for quite awhile. 5) Super good deal for students on Monday evenings. $11 for shoes and an entire night of bouldering with a DJ playing some nice tunes. Super relaxed environment. Oh, the shoes are kinda smelly though so beware. 6) Not toooo fond of the rocks that are laid out at the base of most of the walls. Even though there's padding over the rocks in most of the bouldering areas, the rocks are a bit ominous..  Overall.. Great rock climbing gym, excellent environment, and super helpful and friendly staff!!", "date": "1/16/2015"}
{"review_id": "ffFQYl9GjP6vbuRq3L_Q6Q", "user_id": "qdiAyHn0CHt4EC0kVSdXFQ", "user_name": "Sam M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Awsome gym with lots of good routes. It has a lot of fun bouldering and all workers the workers i have met have been great.", "date": "6/27/2016"}
{"review_id": "_aMmlARY0tzKZOKmquKLLg", "user_id": "d77Q0t0YRFopAzRRvMVVOg", "user_name": "Jonathan H.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is amazing!  The staff is extremely helpful, knowledgeable, and friendly. I would recommend this place to anyone local or just visiting. They taught my wife and I how to use the ropes in 20 minutes and we climbed all night. Loved it so much we got a membership.", "date": "6/3/2016"}
{"review_id": "X55Xg_zWRfPNyjcoXVhFNw", "user_id": "ofMESFOXORl9Ng5KGGf4kg", "user_name": "Sammy B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 2, "cool": 1, "text": "After heart break and misery, I decided I needed to get away from my surroundings and get out of my head. After booking tickets to head down to San Diego, my friends picked me up and asked if I would like to climb. Being a fan of bouldering, I nonchalantly said, \"Yes\" (after all, I am still heartbroken). When they were driving me through what seemed endless miles of furniture stores, we arrived at a building that was away from the main streets and unassuming to the untrained eye. We had arrived at Vertical Hold and I wasn't ready for the awesome that lay inside.APPEARANCE: 5 starsFrom the moment you walk in, you can tell this place has got it together. Firstly, the place is fantastically huge. With very high ceilings to accommodate very high rock climbing, the place is filled with mucho amounts of climbing. To give you perspective, it is:- 3x the size of Rock City- 2x the size of Rockreation- 5x the size of ClimbxHuge. Also, the place is immaculately clean. Most climbing gyms are filled with an air of chalk, B.O, and feet. Not this place. Because they have such large, open space available, and their venting is fantastic, the place smells fresh and alive.Also, the floors and walls are clean. Aside from the chalk residue on rock handles, the walls themselves are very well kept and clean. The floors around the walls are filled with small rocks, almost like a sea of pebbles to cushion your feet. The work station where they take your money and rent out equipment is also very clean, with equipment placed in designated spaces and areas. Honestly, I cannot believe how well organized they are. It shines in everything they do and it's hard not to be impressed by the cleanliness of this place.CLIMBING: 5 starsThe climbing here is fantastic. All the holds feel solid and the paths are well placed and distinguished. The ratings seem fit to the paths (for the most part), and there is so much space in this climbing gym you don't have to worry about waiting to climb. To have so much freedom and options available for you is absolutely liberating for a climber.PRICE: 4 starsThe price for a regular day pass is $15, while harness rental is $5. However, depending on the day you are there, there is always specials going on so you really have to see. Student discounts are given as well so just inquire.CONCLUSIONI've been to several rock climbing gyms in my area, and only left one where I felt impressed. Now that I've been to Vertical Hold, I can say that I have a new climbing gym to put as the creme de le creme. With a friendly staff, friendly climbers, and a gym that won't kill your senses, Vertical Hold has definitely won me over as a new favorite. It'll also be a great excuse to come back down to San Diego again.", "date": "3/27/2012"}
{"review_id": "yDO2kI39ndMEKanvHMGmPw", "user_id": "y3tqAXIUVJEA8TmbSwcC_g", "user_name": "Joanna B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Out of all the climbing gyms in SD, Vertical Hold is my fave. Reasons why you should climb here:- The staff at VH are awesome. Very friendly people always willing to help- Tons of routes for all levels that are always being changed- Traverse wall and campus board- Clean bathrooms w/amenities like lotion, bobby pins, and lady products just in case    you forget yours- Great prices, lunch specials and options for punch passes- They have ladies nt, guys nt, student specials, military day- Free monthly clinics and free yoga twice a weekIt is also pretty clean, but dont forget that it IS A GYM and it will start to smell like a foot in there when there is a bunch of people climbing their butts off.Also, during the summer they look for volunteers to help belay for the summer camps that come in. Belay for a few hours, have fun with kids, make new friends and get yourself a few free day passes!", "date": "3/15/2012"}
{"review_id": "caWXEEYxyUWTFVPb3Uy9FA", "user_id": "ZGeGlvZKJnrEHjeBTMtPLA", "user_name": "Dien V.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My friend and I came here on a Saturday night and got a lesson from Morgan, who was very friendly and welcoming. He gave us a quick and thorough lesson so we could start scaling the walls, since they were going to close within the hour. We had a lot of fun and got a great arm work out.Thank you so much for the great service Morgan! We will be back!", "date": "4/19/2016"}
{"review_id": "bSqXdR5fjRlmuD_P_i6UKw", "user_id": "VNA0Dfg2QeCB7jz-7hL6gw", "user_name": "David K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "I recently discovered the sport of indoor rock climbing and can't get enough of it now.  Much of the reason for my infatuation is that my initial climbing was done at Vertical Hold, providing tons of routes, interesting bouldering and top notch instruction and service.  Located in a non-descript Miramar office park, Vertical Hold has tons of climbing routes, difficulty options, and they are always updating the facility with new routes.  Living in Encinitas, we have closer options, but keep driving back to Miramar to use Vertical Hold due to the superior facilities.", "date": "12/16/2013"}
{"review_id": "R5GQ89L9rVrDTXAnf0XlLA", "user_id": "5lqHwN9uVHPrCkhC4-iApg", "user_name": "Michael L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 10, "funny": 0, "cool": 0, "text": "EDIT: To follow up, I was contacted by the owner who refunded the fees. That went a long way to making us feel better about recommending Vertical Hold again. But definitely read through the membership agreement really carefully when you sign up.---This is a really great local gym. We've been going for almost two years now and have had a membership for about half of that. The staff is really cool and the routes are solid.Unfortunately... we've had sort of a bad experience here, which has soured our feeling for the gym. We wanted to suspend our membership because we'll be out of the country, but apparently if you're gone for more than 3 months, you have to cancel it. I was pretty surprised; we had to suspend for short stints before and never ran into that problem.So we fill out the paperwork to cancel, and it turns out that there's a \"60 day notice\" clause. So now we have to pay an extra $200 in membership fees, because we were (1) loyal members who (2) didn't remember a contract we signed over a year ago.We go in all the time and are constantly dragging other people over to the gym. Once we rolled in with 10 new folks who'd never been before. What I'm trying to say is, we were really loyal customers who tried to spread the word about a cool local business. And somehow, we ended up burned! One of the staff said it happens all the time, which means that they're squeezing a bit of extra cash out of loyal customers who have to leave.If nothing else, let this be a \"cautionary tale\" for others with memberships: make sure to give them tons of notice if you need to cancel, move, whatever.I don't blame the staff, their hands are tied. But it's really soured my feeling about the business, and I don't think we'll be coming back when we return to San Diego. Looks like it'll be Mesa Rim next time around.", "date": "7/10/2013"}
{"review_id": "DBjWAyqJEghigDIR0MHUKw", "user_id": "x5GMNGftGKRMYwgLE3TZAQ", "user_name": "Courtney B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Such a fun place! We went here for a double date night and we all had such a good time. We paid just for bouldering and it kept us very busy for a good 3 hours. There was a lot of stuff to do, even for beginners like myself. The man at the front desk was also very nice and helpful to us newbies!", "date": "3/23/2016"}
{"review_id": "6-wMavfjQe8HJP0OjkRWPQ", "user_id": "eWb1P2a3aBQ-vNMXATzfDA", "user_name": "Alex B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Best climbing gym in San Diego. Tons of top rope/lead climbs, and boulder problems. Rock climb styles are diverse and the set changes with good frequency. As a member, you have a bunch of weekly clinics and fitness/yoga classes you can attend for free. There's a ton of community and soul in the gym and between the climbers. Way more so than some of the others nearby. Definitely my home gym forever.", "date": "3/31/2016"}
{"review_id": "1hykT2_DDgji0WKx4huhSA", "user_id": "-vPM7C063BZ1s5jzuCpcvQ", "user_name": "Angela Y.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 5, "funny": 1, "cool": 0, "text": "I'm relatively new to indoor rock climbing and I am by NO means an expert, but I always look forward to the next chance I get to visit this gym. There are lots of routes for beginners and advanced climbers as well. if it is your first time you do need to be belay certified in order to top-rope but this lesson is only $9.00 (one time) and the instructors are super patient and helpful. There are hair ties and tampons in the ladies locker room which I think is a super nice touch. It is $16.00 for a day pass - If you go between 10am and 3pm the \"Lunch Pass\" is a steal... only $10 to climb! Almost every day of the week there is a different special... Fridays is Ladies Night so it is $12.00 for a day pass instead of 16. (Mondays $4 off for students, Wed $4 off for guys, Sundays Military $9 off) On Tuesday and Thursday evenings there is free yoga from 8p-9p. There are membership options which are a bit pricey but I guess could be worth it if you go often enough. You can rent gear (harness, shoes, and chalk) for $6.00 but if you enjoy the sport I highly encourage you to invest in your own gear. It is a lot more comfortable (and cleaner!)", "date": "6/6/2013"}
{"review_id": "uJNSJsYayeUtA1mXRpQ_OQ", "user_id": "eyHW_diFXlqqL9EMu4LeHg", "user_name": "Leslie G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "I'm a beginner, and this is the best gym I've been too.  I like it more than Mesa Rim because there are more beginner-level things for me to try.  They have lots of V-fun, V-B, and V-0 bouldering routes, so I can try a bunch of different stuff without getting bored or burned out on the same old route.  (Don't worry, it isn't all babies' stuff - my old man knows what he's doing and has fun here too!)They also have \"fun\" rated top roping routes and several other beginner-level routes I can try.Whichever female staffer was working on 9/6 at around 8 pm was super friendly.  Ladies' Night on Fridays is a great deal at $12.  I would totally get a membership here if it wasn't for that darn $60 initiation fee, and I didn't notice they were doing a no-initiation fee special in August!  The bathrooms are always clean and are kinda fancy - they have lockers, a shower, some lotions and soaps, and even hair ties if you forget yours!  Nice little touches I appreciate.", "date": "9/12/2013"}
{"review_id": "R0wfFgMWSnGz3goRJUfWJg", "user_id": "RoFSSHc_8TMDqAI4K1V2Pw", "user_name": "Erin B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "This gym is my absolute favorite because of the various types of routes set by the different climbers, the laid back feel, and atmosphere. I've only been climbing for a year give or take, so I'm still trying to get a grasp of my own style. This is a great way for folks trying to do the same! It helps that they change out the top roping, sport climbing, and bouldering routes every few weeks.Since I've been here, the staff has been very friendly, membership and passes have been affordable for people I bring in, and the atmosphere is always great.It's also great to see them hold themed climbing nights for a little variety :)", "date": "1/3/2014"}
{"review_id": "gjV1nleutlxuxy8qvt8TiA", "user_id": "w8YaigOI3k4B1XnBbBg_9g", "user_name": "Brianna C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We've had the greatest experience here! The staff is so friendly and excited to help you learn (safety and skill). It's a really fun family environment. They offer so many classes and membership options. The amount of routes, diversity in difficultly and overall environment has us coming back every week!", "date": "2/14/2016"}
{"review_id": "aR1D8ZK-jwR-YZSUea2dUg", "user_id": "T_9gAnL5VFFLjv-ar6xRhQ", "user_name": "Kat K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 5, "funny": 3, "cool": 5, "text": "I was incredibly spoiled to have gone to Vertical Hold as my first adult rock-climbing experience. Too bad this is all the way in San Diego, but those of you who live down there are lucky to have a facility as good as VH. The sheer size of this place is enough for a great rating, but the top-roping climbs are challenging and fun, and really get you thinking about where to place your feet and hands. This facility has atc belay, so learning proper belay technique is a must.Staff is very helpful at this location, and takes the full 20 minutes to instruct without becoming distracted, which is pretty important when you're learning to keep the other person alive.Women's bathrooms have hair ties and lotion. WHAT.Monthly memberships, one-time charge, or punch cards allowed.", "date": "3/23/2013"}
{"review_id": "DYS6ymefEN7t1HRG8yyQpw", "user_id": "QAwuXX5R67Tdty78vzcp3w", "user_name": "Katherine L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My friends and I went on Monday for the student discount. Since it was my first time, I also had to take the belay lesson ($9) which was really quick so the total was $21. We had a really good time, I mostly did the boulders and not so much the belays since I'm slightly afraid of heights. It was a lot of fun but also very challenging, but they have a lot of different difficulty levels. I mostly went for VB and V0s. Would definitely recommend going and will come back again!", "date": "1/7/2016"}
{"review_id": "_Y6hyh-8jOOk1sURYAIjHQ", "user_id": "xgRe8ZaAYfOFKf_nzJSDog", "user_name": "Erica P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 3, "cool": 2, "text": "\"Belay?\"\"Belay on!\"\"Climb?\"\"Climb on!\"You will say those phrases dozens of times on your climb, and if you're like my friends, you'll say them with all kinds of crazy cartoon-inspired voices.  Bart, Bree and I experimented with variable vocal intonations replicating  Boris and Natasha of Rocky and Bullwinkle Fame, Justin Bieber and Michael Jackson mid-codpiece grab.  We were total newbies to this climbing business and had a fantastic time making silly quips while we hoofed it all the way up.  Charlie at the front desk got us all set up with rental climbing shoes (bring a closepin for your nose!), harnesses and was really patient with our belay knot lesson.  We're all adventurous folks of varying degrees of fitness and had a fantastic time. We even experimented with bouldering (thank gods for crash pads!).  Prices seemed reasonable, especially because I had a sweet Yelp Deal (thanks for setting that one up, Danny! Wink, wink!).  They have nice locker room facilities with shampoo, conditioner and soap all provided.  We went on a weekday during lunch and the place was pretty quiet.  If you're in the area I highly recommend coming by at that time - they have reduced lunchtime rates and it's not crowded at all. Definitely looking forward to the next \"belay on\" - with my own shoes next time!", "date": "6/2/2011"}
{"review_id": "jCNQA-GXoJwHzLjz1rwLPw", "user_id": "REhQLUsp6PtQu_QTgPmHeg", "user_name": "Rob B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Loved this place...knowledgeable staff, great facilities. The best part was that I haven't climbed in over a year and this place had lots of beginner or novice routes to work on. I was able to get a great workout and get my passion back for climbing...BIG ups to vertical hold", "date": "1/5/2016"}
{"review_id": "PihejtPwwuJwB72deSrTNA", "user_id": "bFudqbSNAW2OCfeGj47FZw", "user_name": "Yoshi I.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We went as a group of 12 beginner rock climbers including 2 kids. The assistant manager was very helpful and had all of us trained on using the harness and the rope within 30 minutes! Great place for a party and fun place for kids:D", "date": "1/3/2016"}
{"review_id": "AuKeIJvIWqYg8zahaQdNdg", "user_id": "_FMKp1eMkr1R9nyMlopvOw", "user_name": "T P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Came here a couple of weeks ago with some friends for the first time. All but one wasn't belay certified so the guy gave us a group lesson at a discounted rate instead of charging the per person. He was very professional and thorough. We all did our first climb and went straight to the top. It was amazing!I've been to one other indoor rock climbing gym and VH definitely offers more walls and boulders.", "date": "2/27/2014"}
{"review_id": "g7jdI1mwNUrf1G_bJi1kOw", "user_id": "KGSyyMOpzrcGT6ZL5ZswHg", "user_name": "Bernadette A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 3, "funny": 0, "cool": 0, "text": "I'm really not that great of a rock-climber, but I like coming here. I can see how people say that there are better places in the area, but VH still has a variety of climbing difficulties. The employees are super cool and friendly here. I'm more of a ropes person, but I like to watch all the bouldering guys. They're so good. I also like how VH has different discount days. Friday is Ladies' Night (They have a guys' night too don't worry). If its your first time rock climbing, expect to spend a little more because you have to take a belay lesson regardless if you've been rock climbing elsewhere. Its a fun workout if you need a break from your normal gym routine. I also saw that they hold parties here. Saw a buncha little kids being hoisted up on the ropes once..so cute!", "date": "4/25/2013"}
{"review_id": "gefbZRbU4pJqzIswRzW-BA", "user_id": "lPD_d6n4CueRXPFZfjggtA", "user_name": "Andy F.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First time climbing, guess I can't complain because I had a smile on my face the whole time. Great workout.", "date": "12/4/2015"}
{"review_id": "tquJ0Vfg9-RxCI86kX_AYw", "user_id": "7spXhDh2NoFn-yab4bA1lw", "user_name": "Colin C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place is the spot if you just learning how to climb. Warm welcome, friendly staff and judgement-free instructions. Challenging routes and lots of area to cover. Fun and diverse bouldering walls too!", "date": "11/20/2015"}
{"review_id": "9FJRRGx863c9RWVt1MelgQ", "user_id": "L7LZCyWACSqdVxNec17Beg", "user_name": "Jordan W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love this rock gym! I went for the first time about 6 months ago and continue to go there! The staff is amazing and they really try to get to know you by name and make sure you are safe/having a great time. They offer many great clinics and other fun activities (lead clinic, beginners clinic, yoga classes, flash fit) which are all included in your membership. Student memberships are about 40 bucks! Super cheap with everything they offer! Also, this gym is conveniently located within walking distance to St. Archer Brewery! You get a discount at the brewery if you have a membership. Score!", "date": "7/2/2015"}
{"review_id": "pIIBowTVoRk_fZgp7XlLsw", "user_id": "e3fX7_qkoSm-6-yTdlwcXw", "user_name": "Riza H. C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "Friday July 25 2008:We went to Vertical Hold for an indoor climb.  Lots of routes but the wall height is not too high as compared to what I am used to here in Colorado.Staff is friendly and accomodating to our needs.  We got a free pass for that day since we went Adventure 16 for a visit.  When we were there like at their opening openings, 11:30hrs more people came streeming in.I would love to climb more at Vertical Hold but due to time constraint we managed to squeeze 1.5hours of some workout climbing indoors.  Would definitely recommend here if you have kids since there are simpler routes for them to try and the wall is not that high.", "date": "8/5/2008"}
{"review_id": "d_KPCcGOC8H_iSiu_yjoWA", "user_id": "WDwExh-uUFWRC5mgqqsdPA", "user_name": "Matt W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "In the mood for an exercise change, so I looked into rock climbing.  I went to Vertical Hold because they have a few auto-belay stations.  I had my girlfriend with me at the time but I like going more than she does so this was important.  The intro was very thorough, and good enough to give my 105lb girlfriend the confidence to belay me right off the bat.  The boulder in the middle of the gym was also a nice feature.  Plenty of space and not crowded at all.", "date": "11/26/2015"}
{"review_id": "dOZWMufJHJVUku6KFeFj8Q", "user_id": "gwx9aG1I_aXIn1miTfrQiw", "user_name": "Charlotte B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "It is honestly the best place I've ever been, and I LOVE Disneyland. Vertical hold has a youth team, recreational and competition, and my daughter is on it! She has so much fun every time she goes, and she is done with a smile on her face. She loves to work hard, and accomplish her goals. The coaches are beyond nice, and the staff is willing to help with all of you questions, comments, or concerns. I'm not sure if this is a big factor or not, but they always have cold, fresh water for us to drink.  The gym is unfortunately closing soon so you have to come soon. Vertical Hold is overall the best place me and my daughter have ever been!", "date": "11/14/2016"}
{"review_id": "BZnAOhwIZn25Jfwjlbpkxw", "user_id": "jIZ9hSbuoqJWghsi4XVuzQ", "user_name": "Adam T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "Great climbing gym.The lunch pass for $10 from open until 3pm on weekdays is the way to go if you can swing it.  It is never crowded during these times.  You can also get a 10 pack for $85.The bouldering is very challenging and fun with routes changing fairly quickly.  A lot of the routes are on some pretty tough inclines which makes even V0 and V1s pretty difficult.  I find that the top roping is the opposite though.  I usually am only in the 5.10a range but I can hit 5.10c-ds at VH.  This is pretty typical with Mesa Rim as well though so I guess it is the norm.The top roping is short.", "date": "3/4/2013"}
{"review_id": "CRNY3Btp7kxX9PwJS3GeDg", "user_id": "irsY_DjPgSZoXblK6Dlwdw", "user_name": "Barry T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I'm a relatively new member to this gym and to rock-climbing. The staff at this place is extremely friendly. They're very helpful in providing newbies like me with tips on rock climbing. The first time is a little scary, especially if you're afraid of heights, but it's definitely a great work out. I don't have any other rock-climbing gyms to compare with, but just on service alone, they get 5 stars. The gym itself is very big, i believe they advertise it as being 17,000 sf. It's usually doesn't get too busy. Overall, great rock-climbing gym.", "date": "4/29/2013"}
{"review_id": "FJW5N30uOB39A7JK7C49Hw", "user_id": "D2adhiQDqQNfduxQiAMnGg", "user_name": "Eric S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Place is dank af. Staff is friendly, routes are challenging, air and facility are very clean.", "date": "10/23/2015"}
{"review_id": "5vYr2vMrnB_Di5NiYAllcQ", "user_id": "WIxfS3stN0gCXclci3Fldg", "user_name": "Kati B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a big fan of this climbing gym! At first I tried it out because it was close to my house, but when I tried it out I pleased with my choice. All of the staff members there have always been so nice and the routes were both challenging and level appropriate. I ended up getting a monthly membership with them since they offer student and military discounts and good pricing compared to other places. If you're in the area and like to climb I'd definitely recommend trying it out :)", "date": "10/8/2015"}
{"review_id": "OxYzhMbylekJ4Ma7YFNADQ", "user_id": "OeXgqfS23E4Mv9_TWlqp1w", "user_name": "Jodie C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "We had an amazing visit here! The staff was vey helpful and took the time to make me feel comfortable before starting. The atmosphere was calm and not intimidating at all. I felt I was able to climb at my own skill (no real experience at all) and have fun without worrying about others. We brought our children and they had a blast! It was clean and friendly atmosphere. We will definitely be going back very soon!", "date": "6/9/2013"}
{"review_id": "CbCfszK8hixZLMSfS74_fw", "user_id": "iawJtDi3Gkx4O6OmSoEw-g", "user_name": "Melissa T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 3, "funny": 1, "cool": 2, "text": "My first time rock climbing ever! I'm so glad my friends introduced this to me. I'm hooked now! :) Well, we actually did bouldering. Such a great workout! I'm afraid of heights, but when bouldering, you don't climb too high. I would say the highest you go up is the boulder in the middle of the room and that's about 1.5 - 2 stories high. You climb over the top. You feel great when you reach the top. It's also a great team bonding/building experience. You cheer each other on and help each other figure out the best way of tackling the track.If you go bouldering, you do not need to get trained on the full wall with the harness or belay. Which in my opinion is perfect, just go!The staff here are exceptionally nice. There are specials on certain days, i.e. guy's night or girl's night and it's $4 off the day pass. I highly recommend you at least give rock climbing a try!", "date": "6/28/2012"}
{"review_id": "FpF67N_ZYgFW9BrurirI2w", "user_id": "IQW9OBWsv59Qj0p7865Ndw", "user_name": "Brianna P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Came here for the first time with my boyfriend for a groupon we got. It was a great gym and had a lot of stuff(top roping,bouldering, lead climbing, weights, slack lining, yoga classes etc) which has become pretty common among the climbing community and places like Mesa rim. Having been to a lot of climbing gyms in San Diego and Orange County I would rate it just under Mesa rim(huge gym with equally great amenities) and above smaller places like the grotto and solid rock. VH had a great selection of routes and being as large as they are there were plenty of beginner/ easy top roping problems(5.5-5.9) to choose from. They staff was supper friendly and fun to talk to. The upstairs bouldering was nice and quiet. They offer yoga and other class that can be included in your day pass which is awesome. Prices are crazy however for a day pass!! It would run you almost 30 bucks for gear and the pass which is way out of my budget had it not been for our groupon. This place is just down the road from me I just wish I could afford it.", "date": "9/6/2016"}
{"review_id": "5jUdRkr14TYr7Rb-Vd6kaw", "user_id": "PD6qoOi7Cfz5GYs1d5CzQQ", "user_name": "Leilani C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This was the first place where I went indoor rock climbing when I moves to SD. It's small but a great place to get started. Their top rope routes arent high but they still provide variations of levels. Bouldering is great here with a lot of routes. I think my favorite part was transversing because many gyms don't offer that. They have lots of discounts for day passes thru out the weeks which saves you at least 4 bucks! (out of a 16 day pass) They have ladies night, guys night, military discount etc. Also, if you buy rock climbing shoes from REI, you can bring your new shoes and the receipt to Vertical Hold and they will give you a FREE day pass for your purchase. I think that's a pretty good deal!", "date": "5/16/2013"}
{"review_id": "Ns6ttiFtG65Nd8EW9kWx2w", "user_id": "2GBBmLX_ZmJpsZUVpd_ylg", "user_name": "Jane N.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "First climb going rock climbing and it was such a thrill. Ya girl is so afraid of heights but I conquered!!! Feels good. I've been in on a work out kick and this place is such a good place to get your upper body and lower body going. If I lived near by, would definitely sign up for a membership. Recommend!!", "date": "7/6/2015"}
{"review_id": "areZU7bKHiXZrRF_eeh4xg", "user_id": "t4iCudSHoqci_0U0KGejew", "user_name": "Serein Q.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I have started climbing here with my colleagues. The place is very nice. They cover top roping, lead climbing, bouldering, and have other training facilities like campus board. As a beginner, I really like to the traverse wall to practice my basic skills. The staffs here are very nice and helpful. I think for most climbers, it is a great place. The major con might be lower walls, comparing to meas rim as wat I heard. But the membership in mesa rim is much more expensive comparing to vertical holds.", "date": "5/29/2016"}
{"review_id": "_I4xPrFBR8tUVwrFE99g9Q", "user_id": "eJgAeR9LknjXPJkdsedVAw", "user_name": "Kate G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I was skeptical to come to this gym since I have a membership at another climbing gym and the price $16 is a lot for 1 time. They do a 10 climb punch card that ends up being ~$12 per climb. Also, I was skeptical because it is hard for me to get to after work during rush hour from Carlsbad and from San Diego which is when I usually like to climb. HOWEVER, I loved the climbs here (bouldering specifically). They were fun routes and were set well. The boulder is inclined which makes even V1 pretty difficult. I climb V3/V4s at most gyms and I was only climbing a V1 here (tried a V2 but didn't quite make it to the topout). Make sure you give yourself time to rest in between climbs because you will tire out otherwise. Top roping was fun because you use ATC's and not auto belay or grigri's which is more intimate and also nicer for when you want to come down quickly.  You do have to get certified by a member here and I think the classes to learn how to belay are $9 a person if you are new to it. I would recommend taking it if you are new to the sport because one of the staff members gave me a pointer during my certification which changed my belaying life!The top rope routes are actually easier than I am used to. Usually I climb 5.9s but I was climbing 5.10c and d here. The ropes move on top, so they have some fun top rope traverse climbs.The vibe is great, which is important when you are in your element. Great music. I've been to gyms that play anything from country to screaming music but Vertical had an excellent mix of motivating beats! The people were great here as well.Its back in an industrial park, so it seems weird with your GPS at first, but you are in the right place!Now I want to go back. Ladies night on Fridays- $4 off! I shall be there!", "date": "3/25/2013"}
{"review_id": "MorDIu_k2hFbVj2qr44Gcg", "user_id": "SGDa-z6MmLmNCamviRsdsA", "user_name": "Katy L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "My favorite climbing gym in San Deigo!  Staff makes this gym so welcoming and the people make it homey!  Tons of climbs and although the setting is tougher than other gyms, I wouldn't go anywhere else!", "date": "12/12/2012"}
{"review_id": "8qHXINenpeU8nLZr820vnw", "user_id": "nPkTidQvXdVPZH7dgDWarw", "user_name": "Kay D.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This is definitely a great place for the top-roping enthusiast, which I am.  I've come here a couple times and always have a great time.  The ratings on the climbs seem accurate and they always kick my butt!The prices are reasonable, and about the same as any other rock gym I've been to; about $16 for a day pass, etc.They have some bouldering routes, but I don't enjoy them as much as I have at other places...but this is the best gym I have found in the San Diego area.  I do most of my climbing up in Orange County.  Afterwards, I like cruisin' down the street to Roberto's to scarf down some pollo asada fries!", "date": "2/17/2011"}
{"review_id": "vQtto6Dr2_3MopFUzcKfMg", "user_id": "bckVWwvjQgLCHxX09s0aNA", "user_name": "Blake G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "My wife and I went in for my birthday last night. Ive been wanting to come here for a while now, so we used a 2 for 1 coupon from the Reader which they gladly accepted. It includes admission, gear rental, shoes, and a intro course for $38. Nice!When we first walked in I braced myself for sweaty feet smell.... Nothing! Great ventilation thanks to the large warehouse style setup they have here. Like other reviews have mentioned, this place is clean. All the gear is well taken care of (shoes didnt have any gross odors or stains), the walls are changed frequently, and the bathrooms and facilities are immaculate.Our trainer was Paul, who was very personable and helpful in getting my wife comfortable with knot tying and belay technique. The intro took longer than I expected, which was actually nice considering that they value safety, and your confidence, as opposed to just sending you off onto the wall without supervision. All in all I plan to go back very soon to get my finger strength up, and eventually work my way outside to the real deal. If your thinking of giving climbing a try, Vertical Hold is a great place to get a feel for the sport in a very safe and comfortable environment. HIGHLY RECOMENDED!", "date": "4/19/2012"}
{"review_id": "ugXoYbFg2q2lagDBIUUa3w", "user_id": "i-2Ih2Vd6FwQYK1b6dpAhg", "user_name": "Stephanie L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 3, "funny": 4, "cool": 3, "text": "\"oh god o god o god o god, i can't do it i can't do it i can't do it, let me down let me down let me down, oh god o god o god o god, please let me down, please please please\" HAHA what an awesome activity for pushing my limits! There really is nothing like getting mid way up a rock and having a panic attack once you realize how high off the ground you are. BUT, it was well worth it..it's an awesome trust building exercise and, it's definitely a physical challenge. We came to Vertical Hold on a Saturday and it wasn't very busy (still good amount of climbers) but, it definitely wasn't packed. The belaying tutorial was quick, simple and informative before we were sent on our way to explore the fairly large space with boulders in the middle and walls fit with rocks for all ranges of climbing expertise.Overall, I had a great time here. Sure..I shed some cry baby tears while I was at the very top of the rock but, it was definitely a memorable (and now, laughable) experience. Rock climbing is a awesome physical activity if you're looking for something a little different and it's great for groups/partners!", "date": "10/17/2011"}
{"review_id": "38YwBNNtuM9sUc95LWsJmA", "user_id": "cy1ikQMm1w3YCgl-Cy2dYA", "user_name": "Amelia M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This place rocks, no pun intended ;) I was in town visiting family and I went here with my sister for the lunch special (from opening until 3pm). After we passed our belay test, we hit the walls.  Event though half the place was under construction, we still had a blast and plenty of routes to climb...meaning this place is huge!  There are also plenty of opportunities to boulder if that's your thing too.  They also offer yoga and tai chi classes.  So glad to have this in my homeland.", "date": "12/17/2014"}
{"review_id": "4D3ZJZuTQRD6hCMNvw8Flg", "user_id": "t1g4ayN-5r9kVWzfOaSj6A", "user_name": "t k.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Do not have a large sample size for comparison purposes.  Facility is clean, staff is very nice, and climbs are challenging enough", "date": "10/7/2012"}
{"review_id": "jfLiXTsKSOOV0G1GDqBNeQ", "user_id": "mGpRDDazqTZU1w46vjGNCg", "user_name": "Sara B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "I love this place! I have been coming for around 6 months with my fiance. He is a member there so I take advantage of the free member-guest days they offer. They give you everything you need, chalk bag, shoes, and a harness (for top roping) all for 6 dollars, pretty good deal. They do change up their routes enough to keep things interesting too! They offer free clinics to members and yoga. The best part about the place, is the people that go there. We are always meeting new people each time we go, the atmosphere is great for it. Good for all ages too!", "date": "4/29/2014"}
{"review_id": "gNgEv6Kw4PdwRyKVmLtyhg", "user_id": "tV7V__y8XZRSUjtiXMEVCg", "user_name": "Allen A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Totally a lot of fun, and a hell of a work out...", "date": "7/29/2014"}
{"review_id": "uVdxN6CISuVhgrlVcBpfeA", "user_id": "_LnxiD5K_BlpBPuQkRwxtQ", "user_name": "Nik R.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Favorite place to climb in San Diego! The people who work there are friendlier and less superficial, in my opinion, than at other rock climbing gyms. I just really like this place..", "date": "7/5/2014"}
{"review_id": "bqXH1uUOaX1cBq65GCTgLg", "user_id": "fnrLtnN97MWqaeYBK0HS3g", "user_name": "Leann M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 2, "funny": 0, "cool": 0, "text": "I love climbing here!! Clean and well managed. I like how they continuously change up the routes. My favorite part is student night!! :) It can get pricey when rock climbing but on Monday nights for student night, $11 for admission and gear! 4pm- closing. Sweet!! :)", "date": "1/20/2014"}
{"review_id": "9oOhQUJpy-iMq-RLCKnkuw", "user_id": "QPJ1QUE116MibSceiszzog", "user_name": "Nancy N.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 1, "text": "I'm a huge fan of vertical hold. They frequently re-do the routes so the same walls never get boring. Complimentary yoga three times a week. Complimentary deodorant, lotion, hair ties, tampons, etc in the bathrooms. The gym is clean. Parking is pretty easy. Staff is friendly and helpful. And strangely, even if it is absolutely packed in there, it's large enough that you aren't just standing around waiting to climb. I'll be going back!", "date": "7/23/2014"}
{"review_id": "Vh69mwCMBWLx0z4zZcce0g", "user_id": "PUYKClfdIFrVnwZbC3VfxQ", "user_name": "Nalipay M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 4, "funny": 0, "cool": 3, "text": "This is the biggest rock climbing gym in San Diego. I don't get to come to this location too often, because it's a far drive from where I live but I think that this place rocks! For first time climbers, they have all the gear that you'll need available for rental. It's a pricier than 'Solid Rock Gym' at $26 for everything, which includes: climbing, harness, shoes and chalk. The staff are really friendly and will show you the basics before sending you off to climbing, meaning teach you how to tie a proper figure 8 (pay very close attention to this) and how to bally. There's lots of routes for you to try, so you won't get bored. They have to giant boulders in the center of the gym for you to boulder and a boulder wall. On the second floor they have a wall that's great for kids. I brought my girlfriends and their daughters here and her 4 year old daughter dominated this wall and felt so proud of herself. They also have a bouldering cave on the second floor with a soft floor to land on. A tip: if you don't have children of your own, Saturday's are probably the days you want to try and avoid this place. Friday nights is ladies night and you can climb for $10 (A GREAT deal!)", "date": "11/18/2008"}
{"review_id": "rNoC5IJl4wtGw5Bbkqv72g", "user_id": "3uR1JrMD6P9ltOx9jLtgcQ", "user_name": "Jenny K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "First indoor rock climbing gym I have ever been to! I was very quickly absorbed into the rock climbing hype and before I knew it I had purchased a 10-time use punch card (lunch pass). Oh and just to quickly mention, if you have free afternoons, the lunch pass is a nice deal :). You just have to enter before 3PM. The belay lesson is $9 but once you're belay certified with them you are free to belay people forever and ever.They change up the routes pretty frequently so you'll never get bored of them. They have top rope, bouldering, transverse, and one other climbing style I do not know the name of. The people here are ridiculously nice. They'll chat with you, try to give you the best possible deal, etc. Also, the girl's restroom is well equipped with feminine hygiene products, hair ties, hair clips, a nice shower, and it's really clean (I don't know if I can say the same about the guy's restroom though). I've never been a climber before but getting the pass got me to go :). It also helps to have a regular belay buddy!", "date": "1/23/2012"}
{"review_id": "BCv8RpCfQI3ikX-y9TWLEg", "user_id": "3jjiY5D7oIlKeiCIZGHQew", "user_name": "Nida K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "My boyfriend's cousin gave him a gift certificate to Vertical Hold for Christmas. Since he was about to start school, I suggested we go use it. The place is located in an industrial area, kinda hard to find at first since it's tucked away at the back end of the driveway. We walked in and basically signed our lives away. Haha. The only other time that we've rock climbed was years ago on a cruise ship. We had to get a belaying lesson, but our teacher was running late so the girl at the front told us to just free climb on the boulder in the meantime and he'll come and get us when he was ready. The boulder is huge and takes up the middle of the gym. People just climb up this thing with no harness or anything. We tried to find a route to climb up around the whole thing, but it was hard and scary.  The gym is lined with padding on the floors along most of the walls in case you do fall, but I didn't really want to test it.We finally found a part of the wall with a route we thought we could do. My bf went first and he made it. I tried next and made the mistake of looking down while almost at the top and freaked myself out so I came back down. I tried again and ended up doing it, but my heart was definitely racing. I'm terrified of heights and especially since we didn't have harnesses yet, I give myself a pat on the back for conquering that.The belaying lesson was very helpful. The guy taught us how to tie the proper knots and how to belay with safety in mind. Afterwards, he watched us belay on each other and then gave us the okay to do it on our own. My boyfriend and I tried every route we thought we could do. It was an amazing adrenaline rush and a good workout. I just had to make sure that I didn't look down at any point during my climb. By the end of it, our hands were red and couldn't hold anymore and our muscles were fatigued. It was a great experience (perhaps, even trust building exercise) and wasn't too expensive either. Check it out if you want to try something new.", "date": "1/18/2012"}
{"review_id": "UdgqD96Mw1B8E_JQ-qHV-g", "user_id": "w7L-q2Z1ENVkz1v6Q0BJYQ", "user_name": "Sarah J.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I took my whole family here on the day after Christmas and Amber and all the Vertical Hold staff were super helpful. Amber managed to help us get four adults and one kid shoes, harnesses, and knot-tying lessons very easily. The three other adults who got belay lessons were ready to go reasonably quickly and really knew what they were doing. I was a little nervous at first about showing up with such a big group of first-time climbers unannounced but it was super easy and a lot of fun. I'd definitely recommend this climbing gym and will probably go back next year when my family is back here for the holidays.", "date": "12/27/2014"}
{"review_id": "d_J6q5OF1h4EoDVGYGDhsw", "user_id": "qakBbQ9CSlxv6voYxKQ9ow", "user_name": "Rebecca G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 1, "cool": 1, "text": "The ginger climbs!!!! The reason this place gets four instead of five is because of the front desk woman, who made it incredibly clear that she did not want us at her establishment. If I weren't overly positive and happy about this I am fairly certain that the group I was with and I would have left because she was so apathetic to our questions and concerns! If you hate your job get a new one lady.Then we met Rob, who gave us our refresher course, and the group attitude shot right up! He was helpful and patient not to mention he put up with a thousand questions and our super lame jokes. From there on we had a great time climbing the walls. They had plenty of ropes set up and walls for us to attempt to conquer. What I also found very fun is that people who are not there with a group easily will ask to join yours, which is rare these days with all of the antisocial types we have. Overall it was such fun.", "date": "10/29/2011"}
{"review_id": "bAsqAjALzZVERfqD0QM16Q", "user_id": "7Es142FCTqk_5-yZ_Wr55g", "user_name": "Dalton N.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "Went here with a couple of friends last night Overall, I had a fun experience, being that I like rock climbing and I am in decent shape. For others, your experience might not be the same as mine.I only did boldering, so i can't fully review how the rock climbing part is. The only thing I can say about the rock climbing is that they had lots of walls to rock climb in, but that is normal for a climbing center like this one.Parts of the center did not have enough lighting, so it got tough to see some of the areas and the 'rocks' on the wall to grab. They do have a sideways boldering wall, which was a first I've seen from others I've been to, so that was cool.Their rental shoes smelled really bad, but that's what you get for renting shoes from places. They could have somehow freshened them up better because after each bolder climb, you have to traverse down a ladder and I could smell the stench coming from the shoes.Lastly, with boldering, the VFun routes are pretty challenging. i am about a V1-low V2 at this place because i did a few of their V1 routes, but for the other 2 friends i came with, they struggled with the VFun routes. I would think the VFun routes would be super easy, but they were a challenge, so careful! Maybe the rock climbing was easier, but until I want to go to this place again, I'll never know.", "date": "1/6/2012"}
{"review_id": "x66BYW-i_mwNLDEdhfsoDw", "user_id": "TKel5cyUQOWx0NAn5gR-pg", "user_name": "Angy B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "This was probably one of the better indoor rock gyms I'd been to yet! The employees were super helpful but pretty hands-off, which is always nice. They have the regular top rope section, lead climbing, a traverse wall and a ton of bouldering for all levels.An added bonus was the amenities they had in their bathrooms - hair ties, lotion, spray on deodorant, showers, etc.The only thing I'd probably change would be the floor... they literally had rocks to stand on. If for some reason you actually DID drop someone, that would be awful to fall on. A softer floor would be better but overall it was an awesome gym!", "date": "7/16/2012"}
{"review_id": "UbOvgDcD4ssABQMu6t2MIA", "user_id": "_kDW30EiINyGsJF3slrHEw", "user_name": "Gregg B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Amber gave a great and patient refresher course and as always the kids had a great time climbing", "date": "1/31/2016"}
{"review_id": "WHFez4I5_o6BYokSAqV0hg", "user_id": "eR1x0Jwc-PlcR9IS7GFCiQ", "user_name": "Vicky N.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 2, "useful": 3, "funny": 1, "cool": 2, "text": "How rude!! We called to see if they could accommodate a big group (13-15) to climb.  They said yes, we showed up, and they couldn't.  Apparently a new guy had given us the wrong information on the phone.  It would have been fine, but they weren't apologetic.We stayed to boulder, and a few people got the belay lesson for an additional fee ($9?).  Overall, the climbs are good but I've been to better places where the service wasn't so rude... and the equipment is newer, and they don't charge for belay lessons.", "date": "5/9/2011"}
{"review_id": "DaVR640URD3LXq2BLMfpVA", "user_id": "5DjvBEpu68DOvHr6wvo2lg", "user_name": "Trang L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This was my first time indoor rock climbing and let me just say that Vertical Hold  was a good choice! We went around 4pm and it was the perfect time to go because it was not crowded at all. The instructors were very cool and helpful. Great workout!Fun place!", "date": "11/10/2009"}
{"review_id": "r6Xv1-crGEoUWp9jpoC2dQ", "user_id": "Od8hBfIaNKzOEB406xeUCQ", "user_name": "Eric D.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 1, "cool": 1, "text": "- Awesome staff (and very skilled) - Top-notch climbing routes- Lots of variety: easy/difficult, technique vs. strength-based, overhangs, heel-hooks, etc. etc.- Rocking musicMy experiences with VH have always been great.  The culture is really laid-back on everything except for safety, which they take seriously for good reason.  So it ends up feeling more like climbing with friends rather than a stuffy business transaction.  They're generous.For first-timers, a visit will cost about $20 total.  If you like it, move on to the 10-day punch cards (there's one for entry as well as for gear) to save a bit.  Then, buy your own climbing shoes to save a bit more.  Then, sign up for a membership.  :)I'm on the auto-membership and I love it.  I haven't been able to climb as much lately but I love being able to pop in whenever I like.  However, in turn for the lower rate, do note (1) the initiation fee, and (2) the 60-day cancellation fee.", "date": "7/31/2013"}
{"review_id": "dKgMbeNmjf_Vq7IVK7_g0g", "user_id": "ygh1FAM5zmfWFeKsV6wJRg", "user_name": "Alice C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 4, "funny": 2, "cool": 3, "text": "[To the tune of \"Jenny from the Block\"]Don't be fooled by the rocks that it's got...Vertical Hold's still best on the block...Why, may you ask?1. Student specials on Mondays 2. Free yoga on Tuesday (8-9) and Thursday (7-8) with awesome, challenging instructors3. Thorough belay lessons with instructors who are patient4. Awesome staff5. Clean bathrooms with amenities like bobby pins and hair ties (ahhh, the little things!)6. Lots of route options for beginners (like me) and pros alike - both climbing and bouldering7. Everyone who I've met here thus far has been super friendly8. Gear rental comes with shoes, harness, and bag of chalk9. Wall to practice traverse (sideways) climbs10. The routes are switched from time to time to keep your workout challengingExpect to come out sore in new and interesting places, like you've just embarked on a workout with 1000 Shakeweights.  Don't be discouraged if you can only climb for like 30 minutes on your first try.  It's freakin' hard work!  But I can assure you if you keep it up, you'll be as solid as the walls of this place.", "date": "12/20/2010"}
{"review_id": "WP5l8bBGG9uMuY-fGN4vRA", "user_id": "hGng2Oyq8YhS7l8AzUG10Q", "user_name": "Alice A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 2, "useful": 8, "funny": 5, "cool": 5, "text": "This place is crowded.  I liked the friendly staff and different special deals on day passes.  I happened to go on a Friday night when ladies get in for $12 instead of $16.  There are also student nights, I think on Tuesdays.The climbing routes are shorter than I have seen at other places.  I did not like the pebble beds that cover the ground.  They have crash pads, but when the place gets crowded sometimes you have to wait for one to become available for your needs.  Bouldering routes also felt somewhat limited, in terms of degrees of difficulty and variety.  I consider myself still a beginner, and I quickly ran out of problems.  They were either too easy or too challenging, and I got bored.  I also did not like the tagging system, with so many different patterns and colors of tapes to keep track of.  They did have more traverse routes, I guess to maximize horizontal use of the wall space, but then it seems ironic given the name \"Vertical Hold\".", "date": "11/10/2010"}
{"review_id": "6jLScf8Kdp9osXtEG2RZjQ", "user_id": "eavIHa4pE_fSPjkBH1cEtg", "user_name": "Matthew W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "This place is not as good as other Rock Climbing Centers in San Diego (Solid Rock). The equipment is more authentic which involves having to tie yourself in on every climb.  It's a lot easier for kids to be able to clip themselves in---they may not tie the knots well enough and you have to constantly check them before they climb. While the staff is friendly enough there are clearly not enough of them.  I understand they staff the place differently for kids' events.", "date": "11/23/2015"}
{"review_id": "I-epCx-_RLlpS1OtwfVNgA", "user_id": "NlVG8Ey9OSAUrKeIQzTvnQ", "user_name": "Super H.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "Vertical Hold does have a pretty aggressive route setting rotation, which is really good.  It seems like they are always re-setting at least one section of the gym, whether it is boulder, top-rope, or lead.  They have a lot of different setters, and apparently a setter that they specially fly in, that come up with some pretty interesting routes.   Also there is this 80 year old Japanese man who comes in on the weekends and sets some pretty fun routes.  Somebody told me he actually died of a heart attack, was frozen, and then brought back to life, where he was setting routes soon enough.  I don't really know the details of it, or if I actually believe it, but it does add to the mystery of him.  Overall, I would say the positives strongly outweigh the negatives of this gym.  On a side note: I don't do yoga, but they do have free classes twice a week.  I always wondered how enjoyable it really would be to be with the background of people grunting and flying about the walls, but who knows maybe they are just too in the zone to notice.", "date": "3/30/2011"}
{"review_id": "ny7vlbie0ytLyHOzm8FzQA", "user_id": "5AcYVmgQ8BM4ohOJb8Hfbg", "user_name": "Ricky M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Very well run. The setters are all experienced and the routes are great. Everyone on the staff is very friendly and are happy to help in any way they can. The community here is great - if you climb here enough you will develop many new friendships. To top it off, prices for memberships here are pretty much unbeatable, especially for students and military. This place is like a second home for me.", "date": "6/14/2014"}
{"review_id": "lSWO-VToWkMsLafwYz0Qbg", "user_id": "7JsVyaCdhad0ggi4EYfEbw", "user_name": "Jamie L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 3, "funny": 5, "cool": 4, "text": "One star for existing.One star for being large with a variety of routes and the super cushion-y pads.One star for the nice guy behind the counter who didn't treat me like a noob even though it was clearly evident I was one.One star for the student discount on Mondays and Ladies' discount on Fridays.One star for being near my house.Of course, I don't have an extensive rock climbing background (or, y'know, any at all) to compare my experience at Vertical Hold against, but I'm pretty sure it's still 5-star worthy.Oh, and for the record, I only bouldered.  But before that night, I did not know that 'boulder' was a verb.Note: I couldn't drive my car for the next two days because shifting gears put me in severe forearm pain.  So, if it's your first time, I don't know... stretch or something?  (And that recommendation applies to all other first-times too.  Jk.)", "date": "10/13/2010"}
{"review_id": "Ss3vs-9BxaU4a9fKA-bq-g", "user_id": "I4X8yvYA5BdwtJpmER7d-g", "user_name": "Carter G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 2, "cool": 3, "text": "I felt as though this place was pretty awesome. I have not really been rock climbing a bunch so I don't have a lot to compare to. The staff was nice, and this place seemed a lot more intense and \"hard core\" then the other places I have rock climbed. Every wall had a rope with a figure 8 knot that you had to tie to your harness. Other places just had a clip which required no effort at all. This fucked up your hands a little more, but it was kind of a cool experience. Their belaying mechanism also was a lot more intense. Other places have the automatic locking belayers, but this place you had to do it all yourself and make sure to have a firm grasp on the rope at all times or else your partner would be dropped to their DOOM. We went with a military guy and they gave us all the Sunday military deal. It was inexpensive enough and 15 dollars included the day pass, shoes, and the harness. He also showed us how to do the figure 8 knot for free, although it is kind of annoying that they would have charged us for a lesson if we hadn't been before. I would think first time people would be treated better or have a more inexpensive experience in order to convince them to come back. (logically...) It was fun! There was lotion and tampons in the bathroom, but the boys bathroom did not have any lotion, so we grabbed some extra for them. Did not really make sense, but oh well!Side Note: This place acts all environmentally friendly and stuff, but then their water jug thing has a note that says \"Our cups are not recyclable, please bring a water bottle.\" Why.... don't you buy recyclable cups instead of bitching about how people who have been climbing around for hours and are thirsty are killing the earth with the cups you chose to purchase? The End.", "date": "1/11/2011"}
{"review_id": "bfeBRVUaagFM8DwqoLx19g", "user_id": "TQ2Vk7RZud9ACoNlzJWCFQ", "user_name": "Ryan P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great rock gym, really big, and the most important thing to me - TONS of bouldering areas. I can come in week after week and not feel like I'm working on just the same old routes. Then when I do feel like I've been doing the same thing for a while, I can go upstairs where they have a cave with even more bouldering options. Pricing is good. Come during mid-day and it's only $10 to climb for as long as your arms will allow you to. Some day I will just get the membership, I'm sure I could have bought a year's membership by now in what I've spent in day passes.", "date": "5/5/2012"}
{"review_id": "1CV5f560jGWtKxzEsNeyeA", "user_id": "z0IwTVtQr4e5FPNz19nF8w", "user_name": "Hannah Z.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 3, "funny": 4, "cool": 3, "text": "So I couldn't wait to get on my work computer and review this place. I had booked a 5pm Saturday group party for my boyfriend's 25th Birthday. Since it's the big quarter century birthday I was looking to do something different sans party bus, alcohol or bottle service. These were my goals:- Gather our closest friends and pay the tab for the whole activity, meaning something reasonably priced.- Be able to bring our own food, drinks and of course birthday cake. - Do something that most of us haven't done before.- A place where my friends can bring their kids if they decide to take them. They have kids walls and they we're cool about my friend bringing her 4-month old, don't worry the baby didn't rock climb :)So thanks again to my lover Yelp, I found Vertical Hold.If you can gather 10 people (minimum for groups) at $20 each you can learn how to tie the proper safety knots, belay and rock climb. You can trade off belay partners and test your friendship cause your trusting that they will not let your ass fall and get gravel up your woohaa. You can yell at each other to \"Man up!\" even though you're not a man. You can chant your friend's last names as they climb up. You can take super cool pictures. In all seriouseness, they do care about your safety so during the safety lesson they really do make sure you know your stuff. Make sure you pay attention and don't get ahead of yourself. They'll make you practice your double-eight knots and proper belay technique. They don't make you feel dumb when you do it wrong (haha my first-time belaying was dangerous!). They also have an upstairs area where you can eat and sit and still enjoy a 360 degree view of the gym and take cool pictures from the higher angle. It was super fun and our whole group can't stop talking about the experience. The guys at the front were nice and patient with our group even though we have attention spans of 4-year olds when we're all together. They have a 10:30am/1pm/5pm time slot for groups I recommend the 5pm time. no one told us this but MAKE SURE YOU STRETCH OUT! My sore ass body says \"Thanks Vertical Hold!\"", "date": "8/23/2010"}
{"review_id": "sxy_hYDGOQ-EszegTvlWvw", "user_id": "gjh6da4yHahEpQ73O6DX_Q", "user_name": "Albert W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 22, "funny": 17, "cool": 19, "text": "Don't delay, belay today!Our hero is no Spiderman (youtube.com/watch?v=g0wm…), but he does enjoy a challenging climb.  Vertical Hold has a very nice set up of many different climbs for varying degrees of skill.  Whether you are a newcomer of a veteran of solo bouldering, there is something to be gained by coming here.  Start at the training wall below the second floor, and one day you might graduate to Cliffhanger status like Sylvester Stalone, young grasshopper.The staff are pretty friendly and they offer classes on climbing and belaying for newcomers at group discounts for those that are interested in getting into indoor climbing and bouldering in a supportive environment.PROS:- Nice thick crash pads aplenty.- Good variety of lead climbing, bouldering, and top-roping climbing walls.- They have many special days through the week for military, men's, and women's discount days.CONS:- A bit pricey for admission and rentals if you plan on coming here regularly.- They let customers wear rental shoes without socks, which is a bit gross when their feet get a bit sweaty.  Remember to bring your own ankle socks (or your own climbing shoes).", "date": "5/16/2010"}
{"review_id": "0hbe6_K1iOtjcemMkQcJRA", "user_id": "rgyhVRc0N6oyDhv3TBksGw", "user_name": "D M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "My friend told me a few days ago that she wanted to come here.  I had only climbed on plastic holds on a cruise ship, a shore excursion, and one other time.  So I never learned how to belay, what a take is, or how to make a double figure eight knot prior to climbing.We were greeted by Olivia, who had just started working there.  (I am glad I did not meet the VH employee who is a grump, mentioned in previous reviews.).  After signing the waiver and filling out the form, we paid on the 2-for-1 deal that we got from the San Diego Reader ($38 for the beginner lesson with equipment, shoes, & chalk).Sweet Dorian taught us to tie the knots and how to belay.  It was weird because it was my friend's first time, & he didn't teach her how to climb.  Maybe I should have gone first.  But she made it.  He was right - you learn to trust each other when you are the climber!We came on a Sunday morning and there were only initially about 10 people there.  We both climbed three times.  Then went upstairs and tried bouldering across the kids' wall.  Not too bad.  Then we laughed alot trying to cling on the rocks in the back while taking pics of each other.The lesson lasted about a half-hour, but he did come by and check on us on subsequent climbs.  Making sure we used the brake right and kept the rope taut.  We stayed for just over a couple hours.  Saw a couple families of four, some men, a few couples including one couple who the husband had a prosthetic lower leg.The shoes are snug to help support you as you climb.  I did again often tense up and used my arms/forearms when I could have used my legs more to carry me.  Certainly bring ankle socks - it's the same principle when you rent bowling shoes.I did like that they had a mix of beginner routes with intermediate and advanced.  They have a free women's clinic once a month at 6pm on Monday was their last one.  Fridays are still Ladies' Days with $4 off--different days, different discounts, and also lunch specials.Overall, a challenging strength-training and fun time!  Would like to go a few times a year to do something different.", "date": "5/30/2011"}
{"review_id": "X_6PKKu7q8nOwSJ37ahpeQ", "user_id": "8gDatdut-0PIX8SSyRjYog", "user_name": "Steve R.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Great climbing gym. Brought my daughter here on Sunday. Very diverse walls. Lots of easy climbs..to some super advanced ones. Staff was very cool..super helpful. I will be back.", "date": "4/28/2013"}
{"review_id": "UcHrmk5WTa4nFEc2kN1Ztw", "user_id": "YNeH97zsmaD3mSnQg33HsA", "user_name": "Eric B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "One of the coolest places I've ever been to.  This made the rock wall at SDSU look like a McDonald's play place.Took about 5 minutes to teach me how to tie knots and the girl worker was super cool.What an amazing workout.  I run 3 miles 3-4 times a week and hit the weight room about 5 days a week and this destroyed my body.  Much respect for all the guys and gals that do this sport because it is very difficult.  People here were very friendly especially in the 2nd floor bouldering area where they were giving me pointers.  A very great experience and I wish to come back here as soon as possible.", "date": "5/10/2011"}
{"review_id": "EXSlfQwu6b-HBuL8dZ1d6g", "user_id": "WabQbWPtqLK2Oo9x1CYllg", "user_name": "Allen F.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 3, "funny": 0, "cool": 1, "text": "Came here with my coworker on a weekday evening after work. I had done indoor climbing once before but this was my virgin experience at a gym dedicated to the sport. The staff is friendly, chill, and jokes with you like you're already a friend. The other climbers were enjoying themselves which bolstered the feel good atmosphere. There were plenty of different routes that catered to different skill levels.For the life of me, I don't understand how some of those routes are humanly possible to scale. I swear you'd have hold your weight with 1 finger at points to succeed. I kept watching, hoping to see a human-monkey climb some of them, but no one did.Tip: there is a list that you can get on where they email the group asking for belay volunteer for various climbing camps and birthday parties. They give you a day pass for each hour you volunteer and you can climb the rest of that same day as well.", "date": "9/5/2010"}
{"review_id": "WNGQTdtsD-WwGW-o245uQQ", "user_id": "wbrSOcs2gqpI5PqOHw8ogw", "user_name": "Chris S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I'm gonna throw this up as a resource for other Yelpers (is it allright to use that word?  Or is it only decoration for the website?) who may be coming to SD and looking for something cool to do one afternoon when it's raining or windy or not  beach weather.  Vertical Hold.  The staff is full of knowledgeable, friendly climbers.  The rates are good.  The routes are many and varied.  They have a decent-sized bouldering section on the ground floor and a cave and workout area up top.  Tons of traversing.  Rental equipment is all good quality, and the prices aren't bad.  A solid gym to pull in if you're a climber, and a fun time if you're a noob.  Can get pretty crowded on weekday nights, but either you already know that and are judging me as you read, or you're not a climber and just looking for a good time, in which case you're probably not going on a Tuesday night.", "date": "1/24/2007"}
{"review_id": "jtVbsOPk8BUC7S64ylxGiA", "user_id": "_EJ3gJu1Ev3825XF2za0jQ", "user_name": "Santiago P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 1, "cool": 0, "text": "I've only been to two other climbing gyms but I have enjoyed this one the most. The top rope routes are not as tall as other gyms (I haven't been there but I've heard mesa rim walls are taller) but the bouldering is awesome. The staff is always super friendly and helpful. It can get crowded but I've never been there where I have not been able to get a good workout while trying interesting routes. I would recommend checking their event calendar as they have special deals for day passes.  Membership wise a couples membership works out to $45 a person plus the joining fee. The quality of the gym, staff, affordability of the membership and proximity to my work guarantee that I will be a happy member for a long time.", "date": "1/29/2013"}
{"review_id": "l_1q_WobcI_41Oi7pfMvFA", "user_id": "OXnzm_Iln0O-Skqs8GehuA", "user_name": "David D.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "The best choice for indoor climbing in San Diego! The staff is extremely friendly and knowledgeable, the routes are maintained well (unlike another popular climbing gym in SD), caters more to serious climbers then parties of children who are not really interested in climbing. I am not opposed to children climbing as I think everyone should try it but not in big groups like birthday parties where there is little supervision and high sugar levels.What I would love is higher walls to climb but this, of course, is not possible due to the warehouse height.", "date": "9/20/2010"}
{"review_id": "L6pkaoCOwA-m2KvV4A7pJA", "user_id": "l296gcyIvNra3FxPF58Huw", "user_name": "Ana M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "This place caters to a wide range of climbers.  There are the beginner climbs, for people like me and for the granola regulars, like the ones that were next to us.  The place has lots of different challenges and ranges of climbs which are clearly marked.  They include specific routes that tell you whether you can put your feet on all the available plastic thingies that you climb up on.It is no lie, rock climbing is HARD WORK.  Your forearms burn, your fingers feel like you grated them with a potato peeler and your toes are stuffed into some disgusting climbing shoes (the smell is indescribable).  I literally refused to put my feet into my own sneakers after the climb because of the smell of the rentals.  I shouldn't say things like that, it makes me seem anti-hygiene but I had no choice.  It was either the shoes or no climbing. (minus 1 star)I had fun and it was a great date idea (thanks bf).  One thing I would caution was that it is pretty scary if you are scared of heights.  It tests your trust in whoever you bring along to climb with you because if they are not paying attention, that's not going to be a pretty sight.I've gone twice, once with a teen and once with my s/o.  Both times were fun so the age range is pretty open as is the challenge that can be found on the wall.", "date": "12/14/2010"}
{"review_id": "nxcWUHkwH31jgUfReyDLmw", "user_id": "20-nIvk4TgxhCZ5GEBoTzQ", "user_name": "J H.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Took my 11 year old son who was begging me to take him to a rock climbing gym....he loved it!  Staff super nice and friendly, good with kids.  We now have a monthly membership!", "date": "8/5/2015"}
{"review_id": "ON1b9DifSXPaJKqEhNk81w", "user_id": "y2gpjMVmiMNdo9FAsCWeqg", "user_name": "Anthony R.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Love it here! Just became a member! The prices are awesome, the employees are extremely helpful and everyone there is so friendly. You can tell they actually care about their members and customers and are in the business because they love it. I felt like i was dealing with actual sincere people and not a business trying to gauge money from me.Got great vibes from this place and excited be going back.", "date": "8/16/2015"}
{"review_id": "cnyYB7nIETf0B4BQ-oGcaQ", "user_id": "jbV5AATSlVJrpA695Dt_YA", "user_name": "Paul Y.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "I am biased by Planet Granite in Sunnyvale and SF, where I played in my rock climbing days.  Vertical Hold has a decent number of courses, and there is a creative bouldering wall where you can traverse continuously from V1 to V5.  However, I can't help but think that the place is kinda small, and the climbs are not all that high.  Maybe I was spoiled by PG.", "date": "10/15/2010"}
{"review_id": "fw9CBJfuq7LOARkFWivtPA", "user_id": "JaWHoW_M_bVQ_a27VLF_0Q", "user_name": "Ritz D.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I only previously rock climbed once and it was at my old university. Vertical Hold is a bit of a drive for me, but I think it was worth it. This place has different climbs with different difficulties, but what I really enjoyed was the bouldering (free climbing). A great workout and a great activity to do with friends.I forgot what day it was but the price was $16 for fees and $6 for rental equipment. I say this because they do have weekly specials you want to look at to make sure you get the best price (student discount, girls and guys rates, etc.). I am definitely coming back but I just wish it was cheaper!", "date": "4/17/2011"}
{"review_id": "DM2Ea263GFm-92klDMF7Yg", "user_id": "_-pvGUjCHAnfMlPRObpJcw", "user_name": "Jill E.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Been going here off and on for the past two years. I've done quite a bit of indoor and outdoor climbing. They did quite a few improvements over the past few years. The new boulder, better top outs on bouldering, a new place to do the fingerboard thingmabobber, and great routes.I think the routes were well graded. And I see a lot more beginner friendly boulder routes versus other indoor places in SD. I like the bathrooms here, the extra hair ties, the lotions and all that girly stuff. And I also like the water dispenser. Small things i know.The only thing is sometimes depending on who's on, I don't see much attention from staff checking on those climbing.", "date": "4/5/2011"}
{"review_id": "ndu31yYWDGfXeO6lpuGODw", "user_id": "QW8-qg7o5dgyX14FR0gNuw", "user_name": "Cesar F.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Last time I checked, the vertical joyride did not include figure 8 knots and saying, \"On Belay\", to your partner.  I was surprised at how much fun I had and not so much by how much exercise this was.The facility is pretty sizable and there are many different routes of various difficulties.  As a beginner, there was plenty for me to practice on and challenge myself with.  There are caves, there are inclined and upside down routes, and there is climbing to be done without ropes and pulleys.  The staff was very helpful and attentive, making sure we understood how to be safe, and requiring us to prove that we remembered all the safety techniques.  After that, they gave us the run of the place and left us to decide what we felt we could do.  Just the right amount of attention required in a place like this.  I want to be safe, but I also want to be free to put my body to the test.The only downside was that the rental shoes stank to friggin high heaven.  I feel no need to deduct a star for this, as this is only the case because so many people enjoy Vertical Hold.If you want some challenging and fun exercise, this is the perfect place.  I can definitely see me adding this into my workout repertoire for good.", "date": "11/14/2010"}
{"review_id": "XcYJjJSbr1DVSFfKUiWQvg", "user_id": "V7np7_fxAPx4ojH0hS_mMQ", "user_name": "Jereld W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 3, "funny": 1, "cool": 1, "text": "I'm a newbie rock climber and this place seems to have a good variety of walls for someone like me to intermediates. The day pass costs $16 and the gear rental is $6. Not too much for a day of pretending you're Spiderman. This can add up quick with multiple visits, so they also offer monthly memberships or 10 prepaid visits.The staff is friendly and passionate about the sport. And the facility is clean and bright.Pro-tip: Take a look at the events calendar on their website; you might be able to score a discount.", "date": "3/14/2010"}
{"review_id": "NUeJt5U2OjCYMnVPcP84Ug", "user_id": "NV7Iqq3yQEN1_WWt5qDsCQ", "user_name": "Beverly E.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I love vertical hold! i love that there are different types of levels, and if you haven't rock climbed before the instructions there can teach you a thing or two before you venture out on your own. I always practice on the easy wall or two before moving down towards the more challenged ones. i haven't been to the other ones that have super high walls, but i already find it challenging enough for me to get to the top of some of the walls here so it's perfect for me. the day pass is awesome. you can go in the morning, break for lunch and come back later to continue if you want. Check out their calendar for discounted days (they have $9 military days, guys night $4 off, ladies night $4 off, etc). we were able to host a friends party here once which was pretty cool. they gave us the upstairs area where parents could hang out with their kids and take a break from climbing. last time i heard they change their routes every 2 weeks, not too sure how it is now. if you haven't been before, you'll be in for a real workout!", "date": "2/26/2011"}
{"review_id": "2gHG0KpuV4el4ZmDz9NC4w", "user_id": "NBmWsJyocNqKvR9SQiCZTQ", "user_name": "Wen L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "I love this place, nice and chill.  Have many bouldering and climbing routes.  The staff are friendly., the place is not over crowded.  If you like climbing, this is the spot for you!  They have all the training walls and free yoga and climbing clinics every week if you're a member.  Great workout alternative to the typical gym routine.", "date": "11/30/2012"}
{"review_id": "FDxIj1VaK1zz4K3MT4XSqg", "user_id": "hFdZQrPK9vHeBDygU5ekwg", "user_name": "K V.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 3, "funny": 0, "cool": 1, "text": "This place is awesome if you are an experienced rock climber. If you are new to it, I would prepare for a long introduction and a little intimidation.", "date": "1/20/2012"}
{"review_id": "MacVmJXHbn7vAjwOVO4-1A", "user_id": "Hv6JGuSqw1CKeXhBj-IA1A", "user_name": "Sasha S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Vertical Hold is an excellent gym.  I've been to most of the gyms south of Riverside County and this one is my favorite.  The gym is roomy, has plenty of options, top rope, auto belay, a great boulder in the center, the routes are fun and challenging, staff is cool and knowledgeable.  I've been a few times taking un-experienced friends along and the staff took excellent care to make sure they had the appropriate gear and took time to show them the ropes, no pun intended, on how to belay on top rope.  If you're looking for a good place to climb, experienced or new, I highly recommend checking this place out.", "date": "6/15/2015"}
{"review_id": "BokrYB3vAAI8NXQSXWbPZQ", "user_id": "BqOlHNPgWIcwA8_EWDyrsg", "user_name": "Mike O.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 2, "cool": 0, "text": "One, the place is huge and has tons of walls and boulders to climb, so even when it's crowded you can usually find a wall to climb. And B, the staff is super friendly. This was my and my date's first time climbing and Travis, who was our instructor, was really friendly and patient with us as we learned the knots and belay techniques. After we knew how to tie properly, and not drop each other off the wall, we were on our own for the night, climbing whatever we wanted. We had a great time, and there are routes for every skill level. One note, bring some socks, because the rental shoes smell horrendous. Kudos for having courtesy deodorant, Lysol, and lotion in the men's locker room though. You're gonna need it afterwords.. Also, a great place to take a date, the view can be really nice...", "date": "11/2/2010"}
{"review_id": "YBusR0qxfan0n0fWU2dw7Q", "user_id": "DpkjrrWXcMmXSvx7MG33zw", "user_name": "Kathy S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "My friends from my Toastmasters group and I just had a wonderful climbing party at Vertical Hold! It's a fantastic place to host a group event - and the parties are not just for the kids! We had so much fun and the staff and volunteers were OUTSTANDING! Everyone should have a party here for memories that will last a lifetime!", "date": "2/29/2012"}
{"review_id": "y_B__a7uiZ4FnODrMnHomw", "user_id": "eZoPLbIMmgQ04I1KVk5dXQ", "user_name": "Dusty G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I brought my couchsurfing host climbing here while I was visiting in San Diego. I was quite impressed with the gym as a whole. The routes were well marked/set-up, and they certainly had a good selection of difficulties. I don't boulder much, but their bouldering setup was solid; likewise with lead climbing.The staff was friendly and helpful, but I was disappointed they wouldn't let me belay the way I learned and have practiced for 4+ years now. I understand their desire for safety, so it wasn't a huge deal.Prices were a bit expensive, but if you have your own gear and spend some solid time there, it's really not so bad at all.I'd definitely visit again - I really liked the vibe I got and the overall atmosphere.", "date": "8/21/2010"}
{"review_id": "yoshJrctdkPBnGAHB1nfBg", "user_id": "UvA3-EM3DXUFYgJ_X_wn7A", "user_name": "An P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 0, "funny": 0, "cool": 0, "text": "I've been to most if not all of the indoor climbing gyms in or around San Diego, Vertical Hold is definitely one of the smaller ones. The ceilings are short, meaning the walls are small but Its good for the people like to boulder and lead. The routes are reset quite often or new ones are always being added which is nice. For some reason i've noticed the guys like to get shirtless there, you'll also run across guys in short shorts and no shirt.(not that im complaining) The men are indeed very attractive but the climbing is definitely not the best around, I often find that when its somewhat crowded you tend to be in a crunch for space which gets annoying when you're bouldering.The prices are kinda steep for day passes but aren't terrible. They do have good deals on certain days for students but its still more expensive than Solid Rocks Gyms day passes and college nights but neither have the same quality of climbing as Mesa Rim but their prices are way higher...Vertical Hold wouldn't be my first choice to climb but i do like it, it has great people and definitely a fun place to bring friends. Also rock climbing is great because it doesn't matter where you go, theres always a new challenge (:", "date": "4/6/2011"}
{"review_id": "S4Dv_yYWta0lbrXAmqKb_w", "user_id": "rVxehsr5SRtrXj7i751kRA", "user_name": "james b.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I really dig this place.  Super nice employees, good atmosphere, usually like their music.  The bouldering is my favorite of the indoor gyms in town, hands down.  Really great variety.  Plus, they have a lot of areas for traversing long routes, which I really like.  And the upstairs room for bouldering is super cool.  The top roping is good, with good routes and setters.  Not as high as mesa rim or anything, but I kind of like it sometimes because you end up climbing a greater variety of routes in a session - it lends itself to a different approach as far as pace.  The only negative I have about vertical hold that keeps it from getting 5 stars are their crappy ropes - and the old crappy ATCs, which I think they just leave on the ropes.  But mostly the ropes - those things need to be replaced already.  Not that there's a safety issue or anything, but they are harsh, for real.", "date": "9/13/2012"}
{"review_id": "lo8BhdUVi_IHbiFdGianPw", "user_id": "16fv403HPRlehKuryyb5Lg", "user_name": "Stephen R.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "Nice indoor rock climbing gym with a variety of bouldering, top roping, and lead climbing.  Interesting features including a chimney, free tower, and a low wall for traversing.  More affordable than Mesa Rim and smaller, but good quality problems.  Friendly staff and clientele.", "date": "1/29/2012"}
{"review_id": "vTJg-5t3k41sULivhLLkNA", "user_id": "RUC_GmIRaW6CZC4YqeLXBA", "user_name": "Zach B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My first experience in an indoor climbing facility was a very good one. I am no expert, but I have climbed a few times outdoors. A couple of co workers and I arrived early on a Thursday morning to get a nice workout in and that place was pretty much empty maybe three over climbers. Getting set up at the front desk was pretty easy, it was $6 for a harness and shoes and you sign a liability wavier and your off. I was with two experienced climbers so no belay lesson needed which allowed us to get right into our climbs. There a a great variety of walls to scale and they are marked very well with different color tags to let you know which routes are more difficult. In the middle of the gym there is a bouldering island that looks pretty intense and after only 3 climbs my poor arms were smoked so I didn't  give bordering a go. The indoor experience is great I think, its a totally different workout than you have ever done and in a controlled environment which is great for first timers and beginners. Also for those hardcore climbers I am sure you will be able to find a challenge in here somewhere. I plan to come back here more often which is a nice break from the typical gym workouts.", "date": "9/2/2012"}
{"review_id": "1uXMHXfuRe2DTUfwHgXnpg", "user_id": "77vChS-bKAkYnFT67iT0tg", "user_name": "Tanya S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 8, "funny": 9, "cool": 9, "text": "What sounds like more fun?  Going to the dentist or a team building event with your coworkers?  Picture it.....first time rock climbing, surrounded by coworkers, and free you say?  Ok.  You had me at free.  The company I work for rented out Vertical Hold before they were open for business hours.  We had full reign of this place for roughly 3 hours for about 40 people. Including instruction and gear it cost $25 per person.  I consider that a really good deal.The helpful instruction time was very nerve racking between figuring out how to tie knots and seeing your coworkers in harnesses.  Let me tell you seeing your boss in a harness is just about as bad as seeing him in a banana hammock. Anyways, it was finally my turn to monkey up that wall and I'm sure all the four letters words I screamed at the top of my lungs won't help me climb that company ladder.  But in all honesty, it was fun overcoming some fears and meeting the physical challenges.  I can admit when I'm wrong--this was a great team building event!FYI---remember to clip your toe nails the night before if you want to keep them.", "date": "5/3/2008"}
{"review_id": "p4LM3hEmSF7fS7LCjfhGgg", "user_id": "Wnb5gvhlqdKgmZcy5xgp0Q", "user_name": "Katherine Joyce B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "Haven't been back since Mesa Rim opened. Friendly staff and thorough safety instruction for enthusiastic noob loved ones; really important to me. The guy Paul even came 'round to check up on belay technique and see if there were any questions, making sure we were enjoying ourselves. What I noticed: I think some routes are slightly harder than Mesa Rim though shorter (just a comparison), Solid Rock seems this way as well. Also, I really wasn't a fan of the thick, stiff non-pliable top ropes they use with the provided heavy-duty ATCs. If you have a fast climber, it really takes work to get that massively thick rope through their smaller gear. I hurt my hands belaying more than bouldering because of this. Overall, we had a good time and the bathroom remodel is a great improvement.", "date": "4/26/2012"}
{"review_id": "eT7tvYxBIMUDwzZaHcr1Pw", "user_id": "PoHANtNRz8D7vZ-ZVZlrnA", "user_name": "Jay P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 1, "text": "one of my favorite places to unwind.they actively manage the boulder and it seems there are new problems every time i go.  i only wish i could be more consistent with my climbing.chill music, yoga on tues/thurs, friendly and helpful staff.", "date": "2/16/2012"}
{"review_id": "c1dRNp3iwfjknj3MskkWZw", "user_id": "CvZGAp4Q2QgJbYqLG1Fetw", "user_name": "Mateo M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I've seen Vertical Hold change quite a bit since 2001. Back in the day the gym was really good, but the staff was a bit aloof. Since then, the ownership has changed and they've expended the gym quite a bit - they've doubled the bouldering section and added a ton more crash pads. They've changed their approach and appear to really care about each climber now. They've expanded their hours and the prices are more flexible (more specials, etc.)I don't go as often as I should, but when I go climbing in San Diego I go to VH.", "date": "2/28/2010"}
{"review_id": "gBl4TXAK16KjjelWPlPC4A", "user_id": "noj1uq9vZo0tuo5ttwsvLA", "user_name": "Ella L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "First off, I have never ever done outdoor rock climbing.  I think I did  some indoor rocking climbing at some ASB event 10 years ago!  There they belayed me and all.  The other night was my first time at Vertical Hold and I was impressed.  Though the place was smaller than I thought, based on the pictures.  The staff is super friendly and helpful.  I got the $31 beginner thing.  It was super helpful.  Robert was a great teacher and super helpful.  My friend and I got there around 9pm and people were starting to leave so it was nice.  I hear it is super duper busy after work until about 8:30pm.I highly recommend this place for everyone.  Beginners, immediate, advance...", "date": "1/29/2010"}
{"review_id": "eL9yZc4cybT1ayj6bGlpQg", "user_id": "oQ6iMyAFx1iB8_LigQ7qhg", "user_name": "Ben A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 4, "funny": 4, "cool": 4, "text": "Fantastic traverse courses, but very short walls.  I also found the routes to be poorly marked.  But, the climbing was fine, and the courses were challenging.I've been spoiled, I guess, by Mission Cliffs and Ironworks in the Bay Area, where the walls can be literally three times as tall.I was also surprised that VH was such a military scene.  Nothing wrong with that -- the military types are every bit as fine if not preferable to the hipsters or hippies in the Bay Area (who are not all that interesting) -- but I wish VH would quit playing songs that sound like they're from the Top Gun soundtrack.", "date": "11/5/2007"}
{"review_id": "bgmKll2sVfzWy0aCFkLm0A", "user_id": "T4HqsoKA_FnrO3pSJ7jy2w", "user_name": "Ian M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Great climb gym with a very local/divey kinda feel too it. Great music, good mix of climbs, and very helpful staff. Also free workshops on clim technique, yoga, and more. Great place for novices and pros alike", "date": "8/22/2012"}
{"review_id": "BFYYA9BXnO8wpmfb3qs2CA", "user_id": "cgNwxklex8ee92dehmhVKQ", "user_name": "Jae A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 5, "funny": 0, "cool": 1, "text": "This is the only climbing gym I've been to in SD and this is the only one I plan on going to.....There are lots of routes for all levels, even kids, and the staff is nice-and-friendly.We had a team-building exercise here for work and they were very accommodating.I'm not a climber myself but my boyfriend is and he's been a member for at least 3 years.He says Tuesday and Thursday evenings are good times to go for the regulars. The weekend is usually filled with first-timers, kids, or casual climbers.", "date": "3/31/2008"}
{"review_id": "yj30YIdLOTJkLvk88Cg9vg", "user_id": "fHmze9jqGf8yeSt4sBaeVQ", "user_name": "Kaylene G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 4, "funny": 1, "cool": 2, "text": "What up San Diego climbers!  I've had a membership here for a couple of years now.  I've tried Solid Rock (SR), but came back to Vertical Hold (VH) for the following reasons:1.  VH is closer to my work & home than SR2.  VH has a mostly adult crowd.  I don't mean old, nor do I mean boring.  I mean that climbers here are *generally* above the age of 17.  At SR, you run the risk of the high-pitched giggling teenage cliques jumping around on the walls in their tight jeans or dealing with the preteen birthday parties.3.  I, personally, like the route-setting better at VH.  I understand that this is a personal preference issue.  So, for ME, there is a better array of puzzle-type climbs, power climbs, warm-up climbs, etc.4.  To follow up on Terry's review, there are lots of lead routes.  I remember being so excited when I got lead-tested and could finally climb in \"the cave.\"Cost & rope quality are comparable at both locations.  Staff at both locations are great, generally-speaking.  VH had a bad apple working there for a while last year, but she's gone now.", "date": "5/11/2007"}
{"review_id": "AGtSNqOV9rDxCmVJKUTCzQ", "user_id": "uQ45Qe1LuafoIs0p3OjqJA", "user_name": "Dorothy M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good walls. Ladys' night Friday nights! Staffs are super helpful. ATC on ropes. Although there are still some gaps for intermediate walls...", "date": "8/17/2012"}
{"review_id": "jTKmel3OHTzEuk6SIpzOGQ", "user_id": "VuiwyPdrPgA2_P-rXH12xw", "user_name": "Terry S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 3, "funny": 2, "cool": 2, "text": "It has been a few years since i visited this place, but I really liked it.  It's a real gym.  No exercycles, no grigris.  The kid behind the desk was the owner (I think), and went out of his way to show us around.  He had some wacky routes that I wish I could go try again. I can't remember there being lead routes, sorry.The patrons skew on the military side for obvious reasons.  That seemed odd to me; I'm used to nice hippie climbers.  But everybody was friendly.The weirdest bit was running into an old friend there.  I didn't know she climbed; I was only in town for a week; and it was the middle of a work day.  So random...!", "date": "2/10/2007"}
{"review_id": "OVsvOAvSU7yg-vXyuNMLrg", "user_id": "iA6YcQ0rSxDGbU55V3Jf2A", "user_name": "Tate J.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "most def the best gym in san diego, my grope a i go climbing indoor and out. staff is cool and personable, not afraid to talk about ways to improve your climbing. i would recommend taking there classes if you are new Vertical Hold knows what they are talking about.", "date": "10/3/2013"}
{"review_id": "vMlPThYmf0IxMfIVwJjI7w", "user_id": "ucTLLwsfoyphU3MOwQX8sw", "user_name": "John S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 2, "funny": 1, "cool": 2, "text": "I'll concede that yay, I'm a fan, but that's about as high as I'll go. Rock climbing in general is good for you, and develops your body pretty well. Vertical Hold changed a lot of its policies about half a year ago, raised prices, added a membership card, added other costs.That said, you can still rock climb for a month for pretty cheap (works out to $70/month on the average after a few months).  So if 2-4 hours of work per month is worth it to you to have access to a pretty good climbing gym and get in good shape, then Vertical Hold is for you.Pros:Safe place to climbEnough routes to keep it interestingBig enough building for the crowdsDecently good staffGood way to meet people, rock climbers, bodybuilders, singlesCons:Kinda priceyKinda CROWDED, *despite* being pricey! (So they need to raise prices to keep it less crowded!)You probably end up learning all the routes after a few monthsOverall, if you take it for what it is, which is a gym to have fun at or get in great shape at or both then it's probably fairly priced, of fair quality, and good value for the money.Btw, the two morons (as of today) who said it's good for kids are retarded.", "date": "8/19/2008"}
{"review_id": "7greQMZmTGpj1wBFPZf6zA", "user_id": "OAC1PJYW1MCYLdWvctU6_Q", "user_name": "Isaac G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 1, "cool": 0, "text": "I had an amazing time here. The facility was great and the staff was super helpful and nice. I wish I could type more but my hands are sore lol! But seriously this was a great first time experience. So much so that I just had to come right on and give them a shout out! If you are new to climbing like I am, I definitely recommend checking this place out!", "date": "7/6/2013"}
{"review_id": "KFkNZwqt1llwP3FNVHpkAQ", "user_id": "oPTSUOpDr2tEV9ZeEPB2qw", "user_name": "Mathew A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 2, "funny": 4, "cool": 1, "text": "Vertical Hold Sport Climbing Center is a rock-climber's dream. It honestly has everything you need! I do have one issue that has been bugging me of late, and I will share it with you, loyal Yelpers of the greater San Diego area...Every few times I go, I notice a pair of \"climbers\" who always line up DIRECTLY behind me. I am pretty sure one goes by Gemini and the other was named something like Nitro. They wear tight 80's-style spandex and their hair is longer than most girls I know. Anyway, once I start up the wall, they wait about 7 seconds and then start climbing--right underneath me!At first I thought this a bit strange, but nevertheless continued on my steady climb upwards. Surely they would not try to overtake me mid-climb! Oddly enough, both Nitro and Gemini would then start grabbing for my ankles in an attempt to throw me off the wall! I would shake them off once or twice, but then usually I would succumb to their shenanigans. I would be pulled off the wall and after gliding back down to the ground, Nitro and Gemini would then engage in some sort of celebratory dance/chest bump. It was all very humiliating for me.However, it is not all bad news with those two. I will forever remember the one time they once again waited for me to get about 15 feet up before they began their hunt, for lack of a better word. This time, though, I shook Gemini hard enough with my leg that he fell off the wall! I frantically climbed, my muscles aching with every reach. I could sense Nitro was right on my heels. But I pressed on. I just had to get away! So i eventually made it up to the top of the wall. Amazingly, a button had been placed there that I had never seen before. I pushed it. Lights went off and confetti was blown into the air! Oh, what a rush!Minus one star for the long name. It took me longer than expected to type it all out that first time.", "date": "3/30/2011"}
{"review_id": "1L23opKuHUXRJ-n_UtqVkQ", "user_id": "llUUQIGpUaswzQd3UWTVpw", "user_name": "Chandra K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "This place is fricking amazing. My classmates and I go every Friday after school to let off some steam. It's a great physical and mental workout.. I think everyone could use some climbing in their lives.The staff is friendly, helpful, sexy and fun! Warm up by climbing back and forth on the traversing wall. Then move to some top roping with a partner or bouldering on your own. The lead wall is super fun too. You can even traverse around the entire gym if the mood strikes you! A crowd will gather to watch you complete your problem, shouting out encouragement and suggestions. You will quickly find yourself among friends here. You will leave refreshed and inspired. You may find it difficult to turn knobs or handles after you're done, but that's how you know you've climbed well. :)The setters do a great job with the routes. They are pretty challenging and you will find yourself kicking ass at other, lesser gyms. This place will get you addicted, so volunteer here to earn yourself a few free passes or save up for that membership.", "date": "10/18/2009"}
{"review_id": "elWGDaVZVhUTtiOYyrxhlA", "user_id": "Y6zLfO3f2-w88Xhopwituw", "user_name": "Cat T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 0, "text": "It's hard not to compare it to Mesa Rim, since they both serve the same area. Yes, Mesa is big and shiny and Vetical is smaller and a bit darker, but Vertical Hold has its own merits worth noting. This place has good vibes. It's got that nice climbing community feeling and people here know what they're talking about. The members and staff here reflect the kind of climbers you'd run into outdoors.The wall features are unique and make the routes really fun. I really enjoy the walls here. They need to do more upkeep though on the route tags and flags that keep falling off since they are laminated paper strips that get tucked under the holds.", "date": "6/22/2011"}
{"review_id": "mdUgCLWIMTFykhwQd2FHHA", "user_id": "wO89-FHNpewpBEeM3rwiXw", "user_name": "Andy T.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I was a member of Vertical Hold on-and-off for about four years. It's a very nice gym, and not too pricey if you have an auto-monthly membership and your own climbing gear (I think they've raised it to about $55 a month for a singles membership.)However, for a casual, you'll pay about $16 for admission and another $6 for rentals, so $22 total. This can add up fast! On a girls/guys night, you get $3 off.They've done some recent renovations with the ropes, climbing holds, and crash pads. All in all, the routes are changed frequently enough, the staff is friendly, and it's the best indoor climbing I've found in San Diego. I frequently take friends.The main negative for me is that there is no air conditioning, so it can get hot in the summer. There are fans and air circulation, but that's not enough for someone like me.You won't get any better in San Diego, so if you're looking to see what rock climbing is all about, this is the place to start.", "date": "11/10/2009"}
{"review_id": "juq4SpN_6X3vMC75wzgWjw", "user_id": "e52q7ldhO-kF1qNaiTArXg", "user_name": "J B.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I am new to SD and thus needed a new climbing gym. This place was just what I was looking for. I own my own equipment so the $55/month for membership isn't THAT bad. Unfortunately the indoor scene down here isn't as good as Nor Cal but this place definitely has enough - the outer wall of the whole place is top rope / leading routes ( with a traversal route around on the bottom), and the inner wall is a huge bouldering section, complete with a \"cave\". Then there's an upstairs bouldering area for those who just can't get enough boulders. So long as you're climbing something relatively interesting (ie not a ladder) people will cheer you on and it's generally pretty friendly. Can get pretty busy in the evenings after everyones off work/school. PS. There's a very friendly blonde girl at the counter who will force you to take a picture with one of a few plastic animals for your membership...lol.", "date": "12/27/2009"}
{"review_id": "GMVt5gdlgaiYAhMMxq7PYQ", "user_id": "AkW5o1WUNUQkvPts-enozA", "user_name": "Joan F.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is my favorite indoor rock climbing gym in SD. Helpful staff and good range of walls for different abilities and levels of experience. I also love that they play great music! They really care about your safety here, which I appreciate, as opposed to other places (ahem,Solid Rock). Have been and will continue to return here. Belay me, baby!", "date": "11/14/2011"}
{"review_id": "Ni5QfA7l-_r0yTme7XfBjQ", "user_id": "zFsi1fQfaFzeoO--xuz4FA", "user_name": "Mimi N.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Love this place. I've been a member since June 2008 and the staff is incredible. It gets crowded after 5:30pm after work but lunch and other hours are fantastic. They are doing major renovations and adding a couple more walls as well as a huge boulder. They have guys night, girls night, members night, military nights, and even a singles night.", "date": "1/31/2009"}
{"review_id": "h1s7A4H_gEFUHeKarPw6iQ", "user_id": "zia1XPyan1_faaBuVyG6cA", "user_name": "Vanna V.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I have been to Vertical Hold 3 times so far.  I don't go rock climbing in San Diego often, but every time I do, I choose Vertical Hold over Solid Rock in Poway.Veritcal hold is HUGE! They have their own traversing wall and 2 levels of bouldering.  Because of their massive amount of space, they are able to have a ton of routes for beginners and intermediates.  It is a great place if you are just starting out.  Other gyms I go to, are usually more catered to intermediates and advanced climbers.  They have friendly staff and are open really late.  They also have specials on Fridays where ladies get in for $3 off and gentlemen get in on Thursdays for $3 off.The reason that this gym only gets 4 stars is because they do not attach the tags to the hold securely enough.  Thus the tags fall off by the end of the day and you are struggling to find the complete route.  Compared to other gyms, this gym is more on the pricey side.  It's $15 for a day pass, but $10 if you go between 10 am - 3pm on weekdays.  Also a monthly membership of $50 with a $60 initiation fee.  Overall, GREAT place to climb!!", "date": "5/6/2009"}
{"review_id": "zZgZCUEshZ4FpHp5XH2Gjw", "user_id": "MaQBs6DgAi61Rbbn00AO5g", "user_name": "J P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 6, "funny": 5, "cool": 4, "text": "Love this place!~For some reason, I am drawn to it every time I have to go indoors, and I really prefer not to go to Solid Rock. Their hours and policies are similar, but I find their prices significantly cheaper than that of solid rock---I know it is down to $6 off for military (or students now) for admission.  That is affordable when you have your own harness and shoes.  And depending on the person, they don't actually check ID, but will just give you the discount arbitrarily if you look broke/student/military.  Their memberships are only $55 as well, vs. around $90 for solid rock, and they provide better customer service.  Their routes are not very hard, few 5.10's and fewer 5.13/5.12, several overhangs, bouldering area, and top rope available.  + both gyms do offer meet up group discounts for San Diego rock climbers as well (not listed on their website).  More information such as free yoga classes and ladies night, etc. can be found on their website. Now I am by no means a regular, nor a Chris Sharma, but here is what I have gathered about Vertical Hold vs. the others guys: It is less crowded--- the patronage seems to be a more UCSD esque, serious athlete vibe, rather than a girl scout birthday party.  There are less screaming children running amok so i can actually get some real climbing done.  NOTE, I would be willing to shell out the extra bucks for Solid Rock if I did not feel like I was paying to have my climbing experience trumped by out of control monkeys high on sugar. It is more inspiring this way to be around a more serious ambiance.  I've done the bulk of my overhang training under these conditions.  So it is in my professional recommendation that if you want to do some more serious training that will get you ready for outdoor climbing, go with this gym.  If you want to throw a birthday party for your kid, please, stick with Solid Rock and stay out of my way.  Sidenote* the shirtless eye candy does not hurt either.", "date": "5/9/2010"}
{"review_id": "n9vU_lq-k6RG2rE_h0ncrw", "user_id": "Qzu-gmU28OJSiTnMC4mD7A", "user_name": "Emyllia D.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Hands down, the best instructor and the best instruction that I have had at a climbing gym.  Sydney is the best and she deserves a plane ticket to annnyyyywhere she wants to go to climb!  and a raise, and a pony...and whatever she wants :)   My Sweets and I went over there because I had looked on Yelp and saw good reviews.  The reviewers stated that the holds were maintained and that the gym was really nice and clean.  They were all right.  I didn't see a spill of chalk and there were a couple of guys that were maintaining the holds.   Sydney was our instructor and, as I said, she was awesome!  I had climbed in other gyms so I took the lesson as a refresher, but my Sweetheart could not get the knots right.  She literally took an hour explaining a certain knot to him.  There was not a hint of condescending in her voice and she was super patient.  She really wanted a person to get the instruction, however long it took.    They use ATCs which are the bottle cap like apparatus for a belay system.  They are not the \"automatic\" systems  (or Gri Gri).  The reason for that is that a newbie could easily rely on the Gri Gri, and if that system fails, the climber falls.  Sydney explained that it is better for the climber and the belayer to know the system that one would use for outside climbing.  More aware+safety from through instruction = no one hitting the ground.  Because we took so long in the class, we could only scale one climb each.  We will have to go very soon to get up them walls lol!!   Oh! Btw, the rentals were cheap, considering other places, and the day rates were comparable to other places around San Diego.  The main difference is that we felt like we were in good hands :)", "date": "9/16/2011"}
{"review_id": "ip40cOP-JZw58i59ZAcxvQ", "user_id": "gxGM1YtUxZqhIn83J-CkQQ", "user_name": "Akeel S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Great place to go climb on days when you can't get yourself outdoors.  The bouldering and wall climbs are very technical.  The one main thing wrong (the reason why I gave the gym 4 stars) is that the bouldering climbs were hard to read and you couldn't really tell each climb just by the tape below the holds.  Each climb did have different holds which was great, but some of the tape was coming off to the point where you couldn't find the right foot placement on the wall.  Other than that everything was superb.  Sydney, the manager, was very helpful giving me a tour of the establishment and letting me test out the gym before I became a member.I highly advise going to this gym rather than any other in San Diego.", "date": "11/8/2011"}
{"review_id": "ZIkpROORXBQtPOOqZxdQvw", "user_id": "h25vnXfrFPckqCGqFLe3oQ", "user_name": "Quan D.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Definitely the better of the two major climbing gyms in San Diego. They actually teach you the knots and belay techniques. The routes are challenging but I feel like they're more accurately rated than most of the other places.Since they completed the renovations, the bouldering area and expanded walls are great. Lots of good routes for all skill levels. Recommend going here for any indoor climbing in San Diego. Not nearly as crowded as Solid Rock, and the caliber of climbers is better. My personal favorite is the traverse routes on the new bouldering area. It takes you up higher than most traverses, which are low to the ground.I've had a blast every time I've been here, with beginners and experienced alike.", "date": "6/24/2009"}
{"review_id": "oJpadHqcuBhbjnVlZ8YS8A", "user_id": "SdXizEWFWXCkUFNUiOv2Yg", "user_name": "joe c.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Have been going her for the last 2 years now the staff are very friendly and willing to answer any questions or help you out if u need it. They've got a lot more crash pads that look a lot newer and they change up the routes enough so you don't get bored with old routes and the addition of the board upstairs is pretty awesome too.  The crowd is younger and very friendly always easy to talk to people and get any advice an inexperienced person like myself needs.", "date": "8/12/2011"}
{"review_id": "9LP3bazxv2YeVo_l7sMeUA", "user_id": "D7wkBJr1q1InlWocTxuJwA", "user_name": "Natalie F.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I had really wanted to learn how to rock climb so my friend Joji and found a gym not to far from where we live and found Vertical Hold. When we arrived  we were welcomed with smiles and enthusiasm it seemed as though everyone that worked here was a climber and enjoyed their job . I had to take a class being my 1st time and it was  a half hour of  very informative and hands on learning. The gym is super clean, they make you wear the right shoes and there was tons of space to play and stretch. I have been going every week and can honestly say I will be doing this for the rest of my life, it's a blast~", "date": "4/28/2011"}
{"review_id": "x0EY3ccFgJrpw25S96nlZw", "user_id": "jRQe9CwLe1v7MM6M1oCLJA", "user_name": "Dan K.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Is the only rock climbing place I've been to in SD. Wide range of walls for all skill levels, frequent grip rearrangements, good ventilation with big fans and open air garage doors. Chill staff, friendly people, awesome music, and a set of rings up stairs. Apparently free yoga classes some nights too. Five stars.", "date": "8/7/2011"}
{"review_id": "EEn8p0QpBaQ9CU1FHg_jNw", "user_id": "vUd6VFK8ygzkuKBhNg6GXQ", "user_name": "Angela S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Did the beginner lesson yesterday and def. would go back. Got the sticky shoes, chalk bag, belay harness, instuction on proper knot and belaying, then set loose in a huge warehouse of walls that looked someone stuck colorful varying sizes of chewed up gum all over. It was one of the best ways to spend 3 hours on a rainy day ever. Be sure to stretch out before you start-hubby is sore as hell:\"my fingernails even hurt!\" Was warned that wet weather makes for a busy day, so we got there right when they opened at 10. The staff was nice and got us the waivers and shoes, but the intital feel was totally frazzled as someone didn't make their shift that morning.  Took about 40 minutes for them to get the day started and we were getting kinda steamed since we were just waiting and watching the front desk sinking ship, then we started climbing the boulder while waiting. Then a staff member who wasn't even supposed to start until 1pm saved the day. Got us the remaining equipment, took us through the lesson and totally redeemed the gym in my eyes. Don't remember his name, but he had a cool 'stache and a nice laid-back vibe. By this time, the front desk had gained their cool and all was well. If the front desk goes down, do what we did and climb the boulder until the chaos dies down.All around, a really fun workout and cool place, just be aware that you can occupy yourself on the boulder if you have to wait for anything.", "date": "2/20/2011"}
{"review_id": "limxeWFSXcPWDUuay_t0wA", "user_id": "F6nhbKjk94_4MwRB_mm0fA", "user_name": "Paul A.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Just went to this spot for the first time and it was awesome. Will be going back quite a bit. They have a lunch pass that is only $15 for shoes and chalk bag from 11:30-3 m-f. Plenty of walls and bouldering upstairs and downstairs. I'm not an avid rock climber, just occasional so my review is from that stand point. They have a DJ on monday nights and all kinds of deals like college night, of ladies night, etc... Friendly staff and free technique clinics to help beginners like me. Awesome work out that you could never get in a gym, definitely worth it.", "date": "5/20/2011"}
{"review_id": "N4pVvHzBCQHuocf1STu9VQ", "user_id": "KwITe6VpGr7XTrgAX6qAdg", "user_name": "jw h.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 0, "cool": 0, "text": "I'm new to climbing and have only been to this gym. That said, they are friendly to newbies like myself and did a great intro class. I took a friend that has been climbing for years and she indicated that the rock walls are not super high. However, I'm told that this gym is known more for their bouldering than their top roping. All in all, a fun place.", "date": "6/20/2012"}
{"review_id": "54nAFO_ZHkJYwoP9tFdCUA", "user_id": "cnOdgdxWmMTiWKQ8W63-CA", "user_name": "Preston W.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "I love this place!!!  I am new to rock climbing, but it was such a workout.  The next day my arms were just dead weight.  It was a fun experience and a good workout.  What more could you ask for?  It is too bad that you have to a partner  to climb or else I would go every day.  I guess I could just bolder.  This is a great place.  I can wait until my kids are older and I'll bring them here.  I do see some kids here already, but they are older them, so I'll just wait.  Plus, I only get the kids half the time.", "date": "3/26/2011"}
{"review_id": "SkAxVGls4nEoxEdKugreuQ", "user_id": "_KagP2TOMVlWeubxqkS3FA", "user_name": "Judy P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Woooot! I can already feel the muscles building in my forearms, shoulders, and back after 4 consecutive days of climbing. Soo much better than going to an actual gym!So I bought a groupon for a friend and myself in Jan of 2011 and we finally got around to using it. 7 days of rock climbing, all gears included, for just $30. What a freakin' steal right?! It was our first time rock climbing in 7 years so we were a little intimidated, but the instructor who taught us how to belay was awesome. The gym is huge compared to Solid Rock and the many walls that provide a wide range of difficulty levels leaves little to be desired for beginners like us. We even tried bouldering, which I found to be even more exciting than climbing with ropes. The climbers here are ridiculous!! I only hope to be half as amazing as they are, but for now I am happy with the progress I've made in the few days that I've been climbing (: It's currently day 5 and we only have 2 days left til our Groupon is over... I can already feel the withdrawal coming on. That's how I know I have been converted. If only it wasn't so expensive for a membership...", "date": "1/12/2012"}
{"review_id": "1PG5Put-ahow61iwsjd-jw", "user_id": "EyfgG8D0ItMbQkRf7lvugA", "user_name": "Susan L.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This is an awesome indoor rock climbing gym. They change the climbing routes every now and then so you always get challenged when you visit this place. The people are extremely nice also.", "date": "6/9/2010"}
{"review_id": "aexw43yHs9arqNn1WAbmTg", "user_id": "dSS5gT5Ajmv-NKoxna4e4w", "user_name": "Grace C.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 2, "text": "My 2nd time here, it was packed with kids;  I went  with my cousin to climb,  we had a great workout for 2 hours. Lots of routes compared to Solid Rock.  Military discount on Sundays's for $8 was a good deal.  Very friendly staff.", "date": "11/16/2008"}
{"review_id": "jThSiLoDDrU4FX3zOyOiUg", "user_id": "qkwu_OnEqAsmSAlx26kLOQ", "user_name": "Paul P.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 1, "funny": 2, "cool": 2, "text": "it's not easy being the biggest guy in a ginormous rock climbing facility. apparently, the equation goes something like this: (portly fellow + weak fingers) x gravity = humbling failureand, despite that, vertical hold is really, really fun. the instructor was really laid back and friendly, willing to help me with the simplest of knots. seriously, I think I suffer from knot-tying performance anxiety. he was comprehensive and patient in his instruction, and I felt pretty confident in my ability to avoid death for the rest of the night.there are some serious climbers here, especially in the evening time it seems. I know they could care less about my comical attempts, but I really wanted to wear a \"First-time Climber - Don't Judge Me!\" shirt.all equipment can be rented, and it seems to be kept in real good condition. prices for various frequencies of facility use seem reasonable enough, as do the rental prices.I don't know much about climbing, climbing gyms, or gyms in general, but I do know that this was really fun. if you want to try something different, this is definitely a good place to start.", "date": "4/30/2008"}
{"review_id": "7Opzts_x5S4UrmI6uJwiCg", "user_id": "EkQj_aOoPmfBIsuUBVA0Jw", "user_name": "Stacy S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 2, "funny": 0, "cool": 1, "text": "A great time; very friendly and helpful staff. Reasonable price and discounts for military. I had never been before so I have nothing to compare it to, but it was a good size gym with lots of options for climbing. Spent $25 and 2 hours for a great time and hell of a challenge for 1st timer : )", "date": "8/23/2008"}
{"review_id": "zWbSE6u5SIwM6y-gOmd5DA", "user_id": "-pkmlXDsydNd0WgU_o4dKA", "user_name": "Ronnie G.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 2, "funny": 0, "cool": 1, "text": "I go mostly for over-nighters with my church.  It's a great deal if you can get together enough people and are in shape enough to climb for a decent amount of time.The walls aren't very tall but there are plenty of them.  There are tons of features for all types of climbs.  The routes can be strange at times, but they change them up enough that you won't be without a decent wall.  The walls also vary enough in difficulty for little kids and more experienced climbers.The staff is very friendly and helpful, also very knowledgeable.  The only issue I had was with their head manager, Michael.  He was a real jerk the last time I went and apparently that is the consensus around the gym.  I would have given it five stars if he wasn't the head manager.  He totally ruined my experience the last time I went and I doubt I'll go back there any time soon.", "date": "11/19/2007"}
{"review_id": "Q93r8bNcfz0yQ2xylyTmzQ", "user_id": "FgG4Ob_AY2GGuh7F7tpTvQ", "user_name": "jennifer t.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "i love this place. the people are always so nice and friendly, and the walls are a constant challenge. they change it up frequently, which is really good. i've always had a great experience here.", "date": "7/1/2011"}
{"review_id": "f7POZRiu1eXoQj1H8V5CLQ", "user_id": "P3-gSi53CFv8x2XIJGQUow", "user_name": "Dana M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Fun place for all! My son loves climbing for hours and this def the place to make that happen safely.", "date": "11/11/2011"}
{"review_id": "iMj90hv2sdLwAwT9xHO9pA", "user_id": "dUAchoRUN8A1O013ip37Ag", "user_name": "Marek M.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 3, "useful": 1, "funny": 0, "cool": 0, "text": "This place has great routes and good top rope routes but the size of the facility leaves to be desired. The way the top ropes are set you have to tie in and tie out for every route which takes a little bit longer than if they just had carabiners set up. This is the only reason i gave this place 3 stars. The walls are not very tall and spending a few minutes tying in and tying out seems redundant(although you could say it is good practice for the real deal). The walls aren't that tall either. They have deals for day passes on certain days so i would check their website out and see if you could save a couple bucks. If you dont have gear they rent it for a small fee. First timers must go through a course which costs money and i think makes it rather expensive for people who don't know how to climb. Wide variety of routes with different emphasis on techniques (like dyno, static, reachy, technical, and long moves ect...) Really fun place to climb all together.", "date": "4/28/2013"}
{"review_id": "sw3ijgBFJ4aK8CuU9f6ZmA", "user_id": "kUg7Gn6w3HlV5Iwr7sVqAA", "user_name": "June S.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Good sized gym with a lot of discount days (student discount monday, ladies' night Wednesday, etc.) Lots of good routes and fairly well maintained.", "date": "4/17/2011"}
{"review_id": "chtCo6OqVcqZ6urJkEuBwQ", "user_id": "1bQCfnRXKqyA-KFUlVg3LA", "user_name": "Kathy Y.", "business_id": "eN5TCnsjeynW773GkWSU_g", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My favorite of the SD climbing gyms.  Very well marked routes, large TR wall and lead cave as well as bouldering areas.  Rates are very reasonable and the gym has great discounts for students, military and other groups.  Stays open late so it is great for an after-work climb.", "date": "7/29/2009"}
