{"review_id": "oS6CX81rBp3qmrkXb9lg-w", "user_id": "TdDxMS27vu0fXXxIvz16bQ", "user_name": "Bobby D.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "I'm 6 feet 3 inches and weigh 215lbs.  I consider myself an athletic dude and work out at least 3 times per week.  I'm close to half a century, but I've stayed relatively fit having played basketball since the 8th Grade, played competitive volleyball, and have consistently lifted weights throughout my adulthood.  When one of my best buddies broached the subject of rock wall climbing at Vertical Hold, I thought to myself I can do that and I'd like to change up my fitness routine.  Yeah, I was over confident and my fitness experience did not translate to rock wall climbing.  Despite this, I had a blast monkeying around with two of my best buddies.Although this review falls under the Poway Vertical Hold location, please consider my review applicable to both Poway and the Hancock Street locations in the sense that the basics are similar, but each is different.  My first rock wall climbing excursion was at the Hancock Street location and my second was at Poway.  I recommend that you purchase the one week trial at either location for $40, which includes the harness and a pair of shoes each time you visit during that one week period.  With regards to the climbing shoes, I suggest that you request shoes that are two sizes higher than what you normally wear.  For example, I wear size 13 in regular shoes, but in climbing shoes I wear size 15.  When I visited the Hancock St. location, I was told by the young lady behind the desk that your big and second toes were going to be bunched up due to needing your big toe to pivot on rocks and grips.  She's definitely correct about needing to pivot, but she recommended I wear a size 14, which made my first rock wall climbing experience an uncomfortable one.  When I wore size 15 at the Poway location, my feet were so thankful and my second visit was so much better due to being more comfortable.  The friendly and accommodating staff will also provide you with instruction on wearing your harness, how to operate the ropes, and most importantly, how to belay.  Both locations have lockers where you can place your valuables and the restrooms were clean and sanitary.As for the monkeying around, I had so much fun and I loved that I wasn't as fit as I thought I was at least for climbing and descending 20 feet rock wall faces.  It's definitely a total body workout where every part of your body gets worked.  After both visits, my arm muscles ached, my hands were sore, my legs pulsated, and my cardio was improved as I sweated throughout each session.  I'm sure you might be questioning my assessment of rock wall climbing being fun because it sounds painful.  There are many facets of why I considered it fun.  It was fun because it was different.  Rock wall climbing is not an everyday activity.  It was fun because it was challenging.  For each climb, there are different paths you can ascend.  For each path, there are placards with numbers or numbers with letters.  The higher the number after the decimal means the path to the top is very difficult.  Difficult because there isn't much to grip on or minimal space to put your foot on.  Finally, it was fun because you felt a sense of accomplishment after completing a path and reaching the top even when you didn't think you could scale a 20 or 30 foot climb.  Once you touched the top, you swell with pride as you fast rappel down the rock wall face.I thoroughly enjoyed my two experiences at Vertical Hold.  I'm thankful to my buddy for infusing some variety into my workout routine.  I also have a better understanding and appreciation for mountain climbers and monkeys.  Good times!", "date": "1/23/2019"}
{"review_id": "4EI6e1LX6jhfsy4-DVfsYg", "user_id": "H6xc2A2Dj_Z7O0TcDPJGKQ", "user_name": "Jennifer W.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Such a great experience!!  We had my daughter's 10th birthday here just yesterday and everyone left with huge smiles on their faces.  We had 9 climbers (Mostly ages 9-10, and a couple of 7yr olds).  The staff took the time to explain all of the safety items, and taught the adults how to belay with the harnesses.  Meanwhile, the kids were getting prepared, and even had a chance to walk the tightrope.  I was pleasantly surprised that every child was able to climb SO high, and they were so proud of their accomplishments.  The party room felt a little dark and dingy at first, but with a few decorations and food, it became a great place for the kids/parents to take a drink break, and ultimately was perfect for cake eating.  Tip- make sure to bring plenty of decorations to liven up the place!Can't thank Vertical Hold enough for the amazing service.  Such a great memory for my daughter and her friends!  I'm thinking of signing me and my daughter up for a membership.  This is something we can do together!", "date": "12/2/2018"}
{"review_id": "r-8jDeRDwWffBlZg3WbSIA", "user_id": "YUykm09ozpEYvW3ytB-IHg", "user_name": "Blaine H.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 2, "funny": 1, "cool": 1, "text": "Couple things to cover here, first the two outstanding staff members that make it memorable, Ryen and Alex. Really, customer service is not dead Ryen and Alex are there to prove it. The facility it self.  Went here recently with a friend, had a blast! What a great way to workout and have fun. We were treated so nicely by Ryen, she took the time to really explain how to properly belay and top rope with my partner, which we are both complete noobs, even going up herself and I was her partner on the ground so that I could gain the confidence of how it felt. Ryen then explained all the different levels of climbs around the gym. Which helped, because its huge with climbs of all variance all over. She had our best interest at the top, sharing a passion for climbing and spreading the joy thereof into the customers.  Basically we weren't just given some 5min explanation and sent out to fiddle fumble. I enjoyed it so much I returned with my children a few days later and signed up a membership with Alex. Talk about above and beyond. Alex took the time to explain the basics of the membership and perks at all three locations. While I was climbing with my kids, he would come around and offer guidance to all patrons including my daughter. I'm sure he could tell she was a bit timid at 5yrs old. He had a great way of being relatable with her and helping her enjoy herself more. Alex then took the time to give me my Top Rope certification and tutorial. He made sure I was versed in the figure 8 and ATC usage. Enough to were I confidently tied in my daughter and sent her up. At the end both Alex and Ryen were there and they both gave me an opportunity to top rope as they were my belayers (not sure if a word) while my children watched daddy go high!All in all, Alex and Ryan have made and continue to make my visits memorable and personal. If I haven't already said it, they are the definition of taking care of your clients. On belay, belay on. Climbing, climb on!", "date": "11/18/2018"}
{"review_id": "ZAlgxAi6XVYXqz2XFo905w", "user_id": "z57wXuYlFS50sFhbZg5WDA", "user_name": "Lisa G.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 4, "useful": 6, "funny": 4, "cool": 5, "text": "Am a fan! Came here with a girlfriend who recently got the membership with another one of her friends and got to get a free belay lesson along with rental gear. The belay lesson was v helpful. Learning the basics of belaying - how to strap yourself correctly and see that your partner does the same if you have one. We were there for about 2 hours.I got the thrill of climbing up...but the hardest part for me was trusting in the other person in coming down. It's just hard to let go. I managed to successfully do it, but it is still a fear of mine to let go.For beginners, the easiest would be the 5.5. As the numbers go up, it gets harder. And there aren't many easy ones to train on besides two walls which you could use any shape to climb up, the 5.5 and the 5.6 (the auto-belay) in the front.Lots of parking, not too bad of a drive if you live in Poway, plus its a few blocks away from In-n-Out too! My girlfriend E said that this location definitely was bigger than the other Vertical Hold locations.Bouldering is also available but a bit scarier as you don't have a rope securing you. But they have cushions around to break your fall. Overall, had a good experience, and I hope to go more often next year as this year, all my weekends are booked", "date": "10/4/2018"}
{"review_id": "oJBY3EEnBA4dchjbczb1yg", "user_id": "XjWj4jmDdnuJKpxBZTPdSw", "user_name": "Emerald N.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 3, "useful": 1, "funny": 1, "cool": 1, "text": "I went here for the first time in a long time tonight to use the restroom due to jogging/running around the area and the door to open the restroom was stuck & super difficult to open. I then went back to the front desk and told the team member and was able to use the Women's membership locker restroom thankfully considering I was full of H2O after exercising outdoors from this location. I have Rock Climbed here in the past and my experience was a positive one. It was when they offered $10 rock climbing nights or some type of deal on Fridays.", "date": "9/13/2018"}
{"review_id": "RtLhQ1_9Zw_Dn51tcICd2A", "user_id": "5bJt_H_ouq-1OZlgMUk5Nw", "user_name": "Anthony B.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "We had our son's 6th birthday party at Vertical Hold. The kids had a great time and Kenny was an awesome host!", "date": "1/22/2019"}
{"review_id": "4dQG1LAW4uaxUFHpVXOeyw", "user_id": "ppKU05_bS2gR7QXPu83Udg", "user_name": "Audra B.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 1, "funny": 0, "cool": 1, "text": "First- just got to say- Climbing is an excellent FULL BODY work out! And it's fun!  This place is an older climbing gym, but it has everything you need and Super Friendly counter help willing to answer any climbing questions you may have and help you get going.  Prices totally reasonable and there are Groupon deals, so if you think you want to climb but aren't positive, get the Groupon, it's worth it or just get the membership, it's totally reasonable. My whole family climbed here- 4 boys and the hubby on Mother's Day.  We love it!  Kids have birthday parties here, but I'm thinking about having my next b-day party here. Parking is plentiful- some hours of the day are a little too busy for me, but there are plenty of off peak hours.  There is a ping pong table, old school work out equipment, a couple of treadmills, and Yoga on Monday and Tuesday. So, all in all- great place for a great, alternative and fun workout! Climb On-!", "date": "5/28/2018"}
{"review_id": "nEBkvCUnR2AxIldPvFthDQ", "user_id": "PuU6ew5y4S70KXmn0caCxA", "user_name": "Michelle N.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 2, "funny": 0, "cool": 3, "text": "I recently came here after purchasing a Groupon for myself and my boyfriend which included a day pass for climbing, rental gear [harness, shoes, chalk bag], and an introductory belay lesson. Overall, definitely worth the money.It had been a while since I rock climbed, and my boyfriend had never done top rope, so the lesson was much needed! Aria[?] helped us with this and she was very friendly and made sure we understood the process. It seems like there is only 2 staff members at any given time, or at least when we went. This was not an issue for us since we went on our own to climb after the lesson, but once families came in, I noticed children were freely running around whose parents may not have been able to keep an eye on them 24/7. That might be dangerous, but nothing went wrong during our time here.The facility had a good amount of climbing routes, as well as two bouldering areas - one had routes that could go up and over the top! They also have 2 auto-belay ropes I believe. They also have a small gym area with equipment for basic exercises, a slack line, some rock climbing/finger holds to practice on, and a ping pong table too! Overall the routes we were able to go on were very fun and just challenging enough - we will definitely come back to try other ones!", "date": "3/5/2018"}
{"review_id": "E-RgHSt0tJ711n9pcKXTFg", "user_id": "LKQungYFGvuSDpyyiNWlyA", "user_name": "Jaylene R.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 4, "useful": 2, "funny": 1, "cool": 1, "text": "Came here for the first time with some friends who have been rock climbing several times before. Vertical Hold is definitely beginner friendly, offering bouldering, several different difficulty levels of rock climbing walls, and upstairs they also have a couple of neat things including a nylon rope which they call slack lining. Once we got all of our gear, we weren't offered any assistance although asked if it was any of our first times, so I was definitely lucky to be with friends who have gone before. I did notice another beginner who came in and asked for some help as it was her first time. No biggie, just ask for some help if you need it. It was about $24 for shoe/gear rental and for rock climbing. I'd say definitely worth it! They do have year passes and they also hold yoga and a mini gym! As it is a huge work out center, it is extremely dirty so make sure you wash your hands 5 times after.Overall an awesome experience and I will definitely be back.", "date": "1/19/2018"}
{"review_id": "-reWuFVI7kEe88VLGIu04w", "user_id": "RWkPCmwYrEmj37dGr7HLAg", "user_name": "Amparo L.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "My 12 year old has been here before with family members, but it was my first time. Staff was very friendly, polite, professional and helpful. The gym area was large and clean with lots of natural light. Had to take off a star for the dirty bathroom. We'll definitely be back when we visit family in Poway.", "date": "9/2/2018"}
{"review_id": "u9dGEhkuDEwEJxvJ-PeMYw", "user_id": "SOQYTkm3tndJ2I4P6wLbXw", "user_name": "Gloria Y.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "First time rock climbing and this place was perfect. The instructors patiently showed us how to handle the rope properly and safely, answered all of our questions, and great physical activity. Great for family day, parties and dates.", "date": "7/9/2018"}
{"review_id": "0EWGRbgwhjaXai2XoQSFpw", "user_id": "9e-sK-YJ2lvXPiCpZsx1kA", "user_name": "Michael R.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Joined a few months back thinking I might not like the vibe, however I was very wrong. I was a semi-experience rock climber prior, but the staff there is very friendly and eager to help you with refresher lessons if needed (Alana, Kenny & Josh in particular). It is also cool to see the all the kids learning this cool activity/sport, although they can sometimes be in the way. If you avoid the class times though (MW, 4-6) you will have plenty of top rope routes to explore and a boulder with problems for all levels. The gym equipment is a little old, but you can pretty much do any exercise you'd like, unless you're looking for specialized machines. For strengthening your skills on the wall though, there is more than enough.", "date": "5/30/2018"}
{"review_id": "s3zWoI-22toBx0baFhG13Q", "user_id": "_KagP2TOMVlWeubxqkS3FA", "user_name": "Judy P.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This climbing gym is a bit small compared to one's I've been to in the past, but there's still plenty of routes for you to try. The staff is awesome as well.", "date": "1/14/2019"}
{"review_id": "_SI4SczJVCgJsAdQv22cMQ", "user_id": "9RjplXwi4cUFrovuq9kXtA", "user_name": "Joanna R.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 3, "funny": 0, "cool": 1, "text": "This place used to be \"Solid Rock\" and its the same exact layout. The only thing that really changed was the name, and every thing else stayed the same. If you go climbing a lot, I suggest bringing your own climbing shoes. But for those who don't climb, like myself, would have to rent some. They aren't the most comfortable, but you'll just have to deal with them, since it is a requirement to wear them. The staff is super friendly, and are there if you need help with anything. It honestly fun watching people that are super good, climbing. Lol. They'll teach you the basics that you'll need to know, which is awesome! The facility itself is clean and very welcoming. They have a locker room for you, if you are/ become a member. The bathroom in there is a lot nicer and probably cleaner, than the coed one they have for the general public. Other than that, it's a pretty great activity for all to enjoy, while getting a serious workout in!", "date": "12/1/2017"}
{"review_id": "alBMKjUn0L4ccBYzG330FA", "user_id": "5ndIXiUiBdAt8tfys4c69Q", "user_name": "Megan H.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Today Josh and Ryen taught me and my friend how to belay and it was so informative. We felt so safe after their through instructions. Also their music playlist here is on fire. 10/10 would recommend this place :)", "date": "6/6/2018"}
{"review_id": "7Tib8whHXapJfupxu3c6VQ", "user_id": "gecKc0Vtcc4ggn2JwFJTQQ", "user_name": "Anna J.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "My daughters loved the gym! Friendly staff! Will help you with whatever it takes to teach you climb! Very pleasant!", "date": "2/5/2018"}
{"review_id": "SqjGhI8bEPrStJMDxEZAMQ", "user_id": "KBiVhzoaTSfLnsSSyW71hw", "user_name": "Scott S.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I decided to go try climbing and brought my family! We had a blast! My wife who is not into doing things like this had so much fun. My 15 yr old daughter and my 6yr old son had a blast climbing up really difficult heights. Kenny and Adrian were wonderful hosts to us because we were complete beginners. Kenny even show me how to do some advanced stuff even belaying for me. I would highly recommend this place for some family fun or just a great full body work out.", "date": "11/25/2017"}
{"review_id": "jcMxB48dPyDH9uCY4WZG9A", "user_id": "hh9MSR2xRRcxOxxb_IKVxQ", "user_name": "Chris P.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 1, "funny": 0, "cool": 0, "text": "Vertical Hold used to be Solid Rock. From what I've heard they have changed management awhile ago. I used to go to Solid Rock during my high school years but now I want to get back into rock climbing again, so here I am!Since it's a different management, the reviews are cleared, my advice is not to base this place heavily on just reviews (even mine, haha!) and try it out yourself! But as always I'll give you my personal experience with Vertical Hold.Perks: Parking is great. As it is in a quiet business district so there is NO noise whatsoever. It's close to the private gym I go to so I can just drive 2 minutes down the road to climb so it's very convenient for me. But, this place has a gym which you can use if you have a membership I believe. The gym has a variety of machines to make all kinds of gains but I just prefer the gym I go to now! They have two really good bouldering sections and plenty, plenty of top roping areas for your enjoyment, with difficulties up to 5.10(+) and for bouldering V10(+); a range from beginners to the 'elites'. There are empty rooms around the building for party hosting and events! The last time I went there was a party and all the boys were running around trying to climb anything they can. It's not as busy when I usually go (9 am, 2-5 pm). At night when I was passing by it definitely looks more crowded so if you don't like forcing social interactions definitely go during 'work' hours!Customer Service: In my opinion it's pretty good. For my schedule I usually come and climb early, early as in when it JUST opens, 9 am! Lucilo was there to help and got me registered for my membership. He was really nice and I finished the procedure quickly and got my free Vertical Hold shirt and free rentals for a month!  He also gave me a free complementary belay lesson so I can relearn everything I thought I forgot years ago. I've been going when I can with my busy schedule and he's always there to help me. The other staff I haven't talked to, as I just get occasional stares. I'm not going to assume they have an attitude or anything as I would love to have conversations with all of the staff which will probably happen eventually! But Lucilo would always greet me and say hello whenever he notices I'm there, so a shout out for him for sure! :)For the many times I have been there, I've personally had a great experience. Even though they changed new management, this place is still as great as it was before for me. If you are looking for somewhere to climb that's around Poway, definitely check this place out.", "date": "5/22/2017"}
{"review_id": "DWBrYn1sMysd6ajgXBAiDg", "user_id": "OL2lDQMRt3BAaV--DASpUQ", "user_name": "Jonathan C.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "I'm a member again. This place is super chill and doesn't get super crowded! I love that about this.  Fun times.  Great part about it is there is multiple locations.", "date": "8/16/2017"}
{"review_id": "bccZ7v4pk5Yg_jqBZzfQ-w", "user_id": "R3E34RCSY3bd-41UB9Wxsg", "user_name": "Tessy M.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 1, "useful": 2, "funny": 0, "cool": 0, "text": "We think that Rock Climbing is WONDERFUL exercise! My teenage son has Asperger's and has poor coordination and weakness particularly in his upper body. We wanted to try this to build his strength and confidence. The equipment looked fairly safe ...My biggest gripe is that it was EXTREMELY understaffed! There was one young woman running the whole place. She was signing people up, running the register, fitting the gear, teaching new climbers and belay-ing inexperienced beginners as kids ran around screaming and climbing unsupervised...NOT SAFE! My son's aunt had bought a lesson for my son for Christmas which was NEVER completed! This poor woman was running around trying to help everyone and couldn't give my disabled child her undivided attention .It was not her fault. Who ever runs or owns this place needs to have more than one employee running the place. Quit trying to save money! This is truly a safety concern! We don't plan on coming back here. I do hope we can find another place that cares about their customers and employees!", "date": "12/30/2017"}
{"review_id": "jUbkSny0KgcFfS0V_qcCjg", "user_id": "LkkzGpeMdv4EHvL28j8_7A", "user_name": "Drew L.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "This gym is dope. The staff are awesome and the sendage is high. YEWWWW", "date": "2/27/2018"}
{"review_id": "ExeevHkXfCDtHERVYLsBiA", "user_id": "hqv5KMlUo9DytqwcD2YAGg", "user_name": "Abigail S.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 4, "useful": 0, "funny": 0, "cool": 0, "text": "Came here a few weeks ago and it was about 17 for the day with a student discount for climbing for the day along with all the equipment necessary. Employees were fun and nice but we're a little too side tracked to pay attention to what was going on around but besides that they were helpful while I was waiting for my party to arrive and helped me remember how to climb and assist correctly. Will probably come back soon!", "date": "6/8/2017"}
{"review_id": "UbR_AGoR5z4w42UucKZmsg", "user_id": "zjyiwudEywRYAWlnbjqJ2Q", "user_name": "Vanessa H.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 2, "useful": 3, "funny": 1, "cool": 1, "text": "When I walked in I didn't know Solid Rock had been bought out and the new customer service was horrible and they seemed annoyed by our questions. They were not easy to deal with and rude so we ended up leaving. Definitely felt turned off by their attitude.", "date": "2/21/2017"}
{"review_id": "PEBkb94wAHEPws7WAR-19A", "user_id": "97K292kLLh-s4BhsBoQyoA", "user_name": "Kelly O.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "Such a great experience for all of our girls! They accommodate each climber as needed. Thank you so much!", "date": "5/18/2017"}
{"review_id": "aNhgNnokosfYO-JexkC7iQ", "user_id": "xzmmCotX2yiI7F3GDbj3oQ", "user_name": "Allison G.", "business_id": "aMoKeCMN-fauvWA8obVa1A", "stars": 5, "useful": 0, "funny": 0, "cool": 0, "text": "came here with 2 of my friends for the first time and it was great! justin was very helpful and patient teaching us how to work the ropes. very chill guy. definitely coming back again :-)", "date": "10/23/2017"}
